; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ArgDesc = type { i8*, i32, i8*, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%class.GlobalParams = type { %class.NameToCharCode*, %class.NameToCharCode*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooList*, i8, %class.GooHash*, %class.GooList*, %class.GooHash*, %class.SysFontList*, %class.GooString*, i8, i8, i8, i32, %class.GooHash*, %class.GooList*, %class.GooList*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, double, i8, %class.GooString*, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, double, double, double, double, i8, i8, i8, i8, i8, i8, double, %class.CharCodeToUnicodeCache*, %class.CharCodeToUnicodeCache*, %class.UnicodeMapCache*, %class.CMapCache*, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, i8* }
%class.NameToCharCode = type opaque
%class.SysFontList = type opaque
%class.GooHash = type opaque
%class.GooList = type <{ i8**, i32, i32, i32, [4 x i8] }>
%class.GooString = type { [24 x i8], i32, i8* }
%class.CharCodeToUnicodeCache = type opaque

!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 38b4a62b0634ac2bc4b67addab5698d2f1a5c23e)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1345, globals: !1349, imports: !1401, nameTableKind: None)
!3 = !DIFile(filename: "pdftotext.cc", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!4 = !{!5, !24, !30, !1184, !1251, !1017, !1291, !1297, !1308, !1327, !1333}
!5 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjType", file: !6, line: 75, baseType: !7, size: 32, elements: !8, identifier: "_ZTS7ObjType")
!6 = !DIFile(filename: "../poppler/Object.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!9 = !DIEnumerator(name: "objBool", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "objInt", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "objReal", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "objString", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "objName", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "objNull", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "objArray", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "objDict", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "objStream", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "objRef", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "objCmd", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "objError", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "objEOF", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "objNone", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "objUint", value: 14, isUnsigned: true)
!24 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "CryptAlgorithm", file: !25, line: 74, baseType: !7, size: 32, elements: !26, identifier: "_ZTS14CryptAlgorithm")
!25 = !DIFile(filename: "../poppler/Stream.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "cryptRC4", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "cryptAES", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "cryptAES256", value: 2, isUnsigned: true)
!30 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "PageMode", scope: !32, file: !31, line: 169, baseType: !7, size: 32, elements: !1283, identifier: "_ZTSN7Catalog8PageModeE")
!31 = !DIFile(filename: "../poppler/Catalog.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!32 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Catalog", file: !31, line: 94, size: 2176, flags: DIFlagTypePassByReference, elements: !33, identifier: "_ZTS7Catalog")
!33 = !{!34, !1109, !1110, !1111, !1112, !1113, !1116, !1119, !1122, !1123, !1124, !1127, !1128, !1129, !1130, !1131, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1182, !1183, !1194, !1198, !1201, !1204, !1207, !1210, !1213, !1216, !1217, !1220, !1223, !1226, !1227, !1228, !1233, !1234, !1237, !1240, !1243, !1244, !1245, !1248, !1256, !1259, !1262, !1265, !1268, !1271, !1274, !1277, !1278, !1281, !1282}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !32, file: !31, line: 198, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFDoc", file: !37, line: 69, size: 896, flags: DIFlagTypePassByReference, elements: !38, identifier: "_ZTS6PDFDoc")
!37 = !DIFile(filename: "../poppler/PDFDoc.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!38 = !{!39, !198, !204, !207, !208, !209, !210, !213, !671, !674, !676, !679, !682, !902, !903, !904, !905, !906, !910, !913, !916, !919, !922, !925, !926, !929, !932, !935, !938, !944, !947, !950, !951, !952, !953, !956, !957, !958, !961, !964, !967, !970, !973, !976, !979, !984, !987, !990, !991, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1005, !1006, !1007, !1008, !1011, !1014, !1022, !1025, !1028, !1031, !1034, !1037, !1040, !1043, !1046, !1049, !1053, !1056, !1059, !1060, !1063, !1066, !1069, !1072, !1075, !1078, !1081, !1082, !1085, !1088, !1091, !1092, !1093, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1105, !1106}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !36, file: !37, line: 303, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GooString", file: !42, line: 40, size: 320, flags: DIFlagTypePassByReference, elements: !43, identifier: "_ZTS9GooString")
!42 = !DIFile(filename: "../goo/GooString.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!43 = !{!44, !47, !48, !53, !54, !56, !60, !65, !68, !71, !74, !79, !83, !86, !89, !92, !103, !104, !107, !110, !113, !116, !119, !122, !125, !128, !131, !134, !137, !140, !143, !146, !147, !148, !151, !154, !157, !160, !166, !169, !173, !177, !180, !183, !189, !193, !197}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "STR_STATIC_SIZE", scope: !41, file: !42, line: 159, baseType: !45, flags: DIFlagStaticMember, extraData: i32 24)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "CALC_STRING_LEN", scope: !41, file: !42, line: 162, baseType: !45, flags: DIFlagStaticMember, extraData: i32 -1)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sStatic", scope: !41, file: !42, line: 166, baseType: !49, size: 192)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, elements: !51)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !{!52}
!52 = !DISubrange(count: 24)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !41, file: !42, line: 167, baseType: !46, size: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !41, file: !42, line: 168, baseType: !55, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!56 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 44, type: !57, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 47, type: !61, scopeLine: 47, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !59, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!65 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 51, type: !66, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !59, !63, !46}
!68 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 54, type: !69, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !59, !40, !46, !46}
!71 = !DISubprogram(name: "Set", linkageName: "_ZN9GooString3SetEPKciS1_i", scope: !41, file: !42, line: 60, type: !72, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!72 = !DISubroutineType(types: !73)
!73 = !{!40, !59, !63, !46, !63, !46}
!74 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 63, type: !75, scopeLine: 63, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !59, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!79 = !DISubprogram(name: "copy", linkageName: "_ZNK9GooString4copyEv", scope: !41, file: !42, line: 64, type: !80, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!80 = !DISubroutineType(types: !81)
!81 = !{!40, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!83 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 67, type: !84, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !59, !40, !40}
!86 = !DISubprogram(name: "fromInt", linkageName: "_ZN9GooString7fromIntEi", scope: !41, file: !42, line: 70, type: !87, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!87 = !DISubroutineType(types: !88)
!88 = !{!40, !46}
!89 = !DISubprogram(name: "format", linkageName: "_ZN9GooString6formatEPKcz", scope: !41, file: !42, line: 95, type: !90, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!90 = !DISubroutineType(types: !91)
!91 = !{!40, !63, null}
!92 = !DISubprogram(name: "formatv", linkageName: "_ZN9GooString7formatvEPKcP13__va_list_tag", scope: !41, file: !42, line: 96, type: !93, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !63, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !97, identifier: "_ZTS13__va_list_tag")
!97 = !{!98, !99, !100, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !96, file: !3, baseType: !7, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !96, file: !3, baseType: !7, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !96, file: !3, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !96, file: !3, baseType: !101, size: 64, offset: 128)
!103 = !DISubprogram(name: "~GooString", scope: !41, file: !42, line: 99, type: !57, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!104 = !DISubprogram(name: "getLength", linkageName: "_ZN9GooString9getLengthEv", scope: !41, file: !42, line: 102, type: !105, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!105 = !DISubroutineType(types: !106)
!106 = !{!46, !59}
!107 = !DISubprogram(name: "getCString", linkageName: "_ZNK9GooString10getCStringEv", scope: !41, file: !42, line: 105, type: !108, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!108 = !DISubroutineType(types: !109)
!109 = !{!55, !82}
!110 = !DISubprogram(name: "getChar", linkageName: "_ZN9GooString7getCharEi", scope: !41, file: !42, line: 108, type: !111, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!111 = !DISubroutineType(types: !112)
!112 = !{!50, !59, !46}
!113 = !DISubprogram(name: "setChar", linkageName: "_ZN9GooString7setCharEic", scope: !41, file: !42, line: 111, type: !114, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !59, !46, !50}
!116 = !DISubprogram(name: "clear", linkageName: "_ZN9GooString5clearEv", scope: !41, file: !42, line: 114, type: !117, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!117 = !DISubroutineType(types: !118)
!118 = !{!40, !59}
!119 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEc", scope: !41, file: !42, line: 117, type: !120, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!120 = !DISubroutineType(types: !121)
!121 = !{!40, !59, !50}
!122 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPS_", scope: !41, file: !42, line: 118, type: !123, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!123 = !DISubroutineType(types: !124)
!124 = !{!40, !59, !40}
!125 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPKci", scope: !41, file: !42, line: 119, type: !126, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!126 = !DISubroutineType(types: !127)
!127 = !{!40, !59, !63, !46}
!128 = !DISubprogram(name: "appendf", linkageName: "_ZN9GooString7appendfEPKcz", scope: !41, file: !42, line: 122, type: !129, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{!40, !59, !63, null}
!131 = !DISubprogram(name: "appendfv", linkageName: "_ZN9GooString8appendfvEPKcP13__va_list_tag", scope: !41, file: !42, line: 123, type: !132, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!132 = !DISubroutineType(types: !133)
!133 = !{!40, !59, !63, !95}
!134 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEic", scope: !41, file: !42, line: 126, type: !135, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!135 = !DISubroutineType(types: !136)
!136 = !{!40, !59, !46, !50}
!137 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPS_", scope: !41, file: !42, line: 127, type: !138, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!138 = !DISubroutineType(types: !139)
!139 = !{!40, !59, !46, !40}
!140 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPKci", scope: !41, file: !42, line: 128, type: !141, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!141 = !DISubroutineType(types: !142)
!142 = !{!40, !59, !46, !63, !46}
!143 = !DISubprogram(name: "del", linkageName: "_ZN9GooString3delEii", scope: !41, file: !42, line: 131, type: !144, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!144 = !DISubroutineType(types: !145)
!145 = !{!40, !59, !46, !46}
!146 = !DISubprogram(name: "upperCase", linkageName: "_ZN9GooString9upperCaseEv", scope: !41, file: !42, line: 134, type: !117, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!147 = !DISubprogram(name: "lowerCase", linkageName: "_ZN9GooString9lowerCaseEv", scope: !41, file: !42, line: 135, type: !117, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!148 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPS_", scope: !41, file: !42, line: 138, type: !149, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!149 = !DISubroutineType(types: !150)
!150 = !{!46, !82, !40}
!151 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPS_i", scope: !41, file: !42, line: 139, type: !152, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!152 = !DISubroutineType(types: !153)
!153 = !{!46, !82, !40, !46}
!154 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPKc", scope: !41, file: !42, line: 140, type: !155, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!155 = !DISubroutineType(types: !156)
!156 = !{!46, !82, !63}
!157 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPKci", scope: !41, file: !42, line: 141, type: !158, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!158 = !DISubroutineType(types: !159)
!159 = !{!46, !82, !63, !46}
!160 = !DISubprogram(name: "hasUnicodeMarker", linkageName: "_ZN9GooString16hasUnicodeMarkerEv", scope: !41, file: !42, line: 143, type: !161, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !59}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GBool", file: !164, line: 31, baseType: !165)
!164 = !DIFile(filename: "../goo/gtypes.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!165 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!166 = !DISubprogram(name: "sanitizedName", linkageName: "_ZN9GooString13sanitizedNameEb", scope: !41, file: !42, line: 149, type: !167, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!167 = !DISubroutineType(types: !168)
!168 = !{!40, !59, !163}
!169 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 152, type: !170, scopeLine: 152, flags: DIFlagPrototyped, spFlags: 0)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !59, !172}
!172 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !78, size: 64)
!173 = !DISubprogram(name: "operator=", linkageName: "_ZN9GooStringaSERKS_", scope: !41, file: !42, line: 153, type: !174, scopeLine: 153, flags: DIFlagPrototyped, spFlags: 0)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !59, !172}
!176 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !41, size: 64)
!177 = !DISubprogram(name: "roundedSize", linkageName: "_ZN9GooString11roundedSizeEi", scope: !41, file: !42, line: 164, type: !178, scopeLine: 164, flags: DIFlagPrototyped, spFlags: 0)
!178 = !DISubroutineType(types: !179)
!179 = !{!46, !59, !46}
!180 = !DISubprogram(name: "resize", linkageName: "_ZN9GooString6resizeEi", scope: !41, file: !42, line: 170, type: !181, scopeLine: 170, flags: DIFlagPrototyped, spFlags: 0)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !59, !46}
!183 = !DISubprogram(name: "formatInt", linkageName: "_ZN9GooString9formatIntExPcibiiPS0_Pib", scope: !41, file: !42, line: 172, type: !184, scopeLine: 172, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !186, !55, !46, !163, !46, !46, !187, !188, !163}
!186 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!189 = !DISubprogram(name: "formatUInt", linkageName: "_ZN9GooString10formatUIntEyPcibiiPS0_Pib", scope: !41, file: !42, line: 181, type: !190, scopeLine: 181, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !192, !55, !46, !163, !46, !46, !187, !188, !163}
!192 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!193 = !DISubprogram(name: "formatDouble", linkageName: "_ZN9GooString12formatDoubleEdPciibPS0_Pi", scope: !41, file: !42, line: 189, type: !194, scopeLine: 189, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196, !55, !46, !46, !163, !187, !188}
!196 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!197 = !DISubprogram(name: "formatDoubleSmallAware", linkageName: "_ZN9GooString22formatDoubleSmallAwareEdPciibPS0_Pi", scope: !41, file: !42, line: 191, type: !194, scopeLine: 191, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !36, file: !37, line: 307, baseType: !199, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !201, line: 48, baseType: !202)
!201 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !203, line: 241, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!203 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !36, file: !37, line: 308, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseStream", file: !25, line: 297, flags: DIFlagFwdDecl, identifier: "_ZTS10BaseStream")
!207 = !DIDerivedType(tag: DW_TAG_member, name: "guiData", scope: !36, file: !37, line: 309, baseType: !101, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMajorVersion", scope: !36, file: !37, line: 310, baseType: !46, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMinorVersion", scope: !36, file: !37, line: 311, baseType: !46, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "linearization", scope: !36, file: !37, line: 312, baseType: !211, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Linearization", file: !37, line: 55, flags: DIFlagFwdDecl, identifier: "_ZTS13Linearization")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !36, file: !37, line: 313, baseType: !214, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRef", file: !216, line: 90, size: 1344, flags: DIFlagTypePassByReference, elements: !217, identifier: "_ZTS4XRef")
!216 = !DIFile(filename: "../poppler/XRef.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!217 = !{!218, !219, !221, !224, !225, !226, !227, !228, !229, !230, !525, !527, !528, !531, !532, !533, !534, !535, !536, !537, !541, !542, !543, !544, !545, !546, !547, !551, !554, !558, !559, !562, !563, !566, !569, !570, !575, !576, !579, !580, !581, !582, !583, !584, !585, !586, !587, !590, !593, !594, !595, !596, !597, !598, !601, !604, !605, !608, !611, !614, !617, !620, !623, !628, !631, !632, !635, !636, !645, !650, !653, !656, !659, !662, !665, !666}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !215, file: !216, line: 185, baseType: !205, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !215, file: !216, line: 186, baseType: !220, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guint", file: !164, line: 45, baseType: !7)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !215, file: !216, line: 188, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XRefEntry", file: !216, line: 59, flags: DIFlagFwdDecl, identifier: "_ZTS9XRefEntry")
!224 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !215, file: !216, line: 189, baseType: !46, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !216, line: 190, baseType: !46, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "rootNum", scope: !215, file: !216, line: 191, baseType: !46, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rootGen", scope: !215, file: !216, line: 191, baseType: !46, size: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !215, file: !216, line: 192, baseType: !163, size: 8, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "errCode", scope: !215, file: !216, line: 193, baseType: !46, size: 32, offset: 352)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "trailerDict", scope: !215, file: !216, line: 194, baseType: !231, size: 128, offset: 384)
!231 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Object", file: !6, line: 112, size: 128, flags: DIFlagTypePassByValue, elements: !232, identifier: "_ZTS6Object")
!232 = !{!233, !234, !352, !356, !357, !360, !363, !366, !369, !372, !375, !378, !379, !382, !385, !388, !391, !392, !393, !396, !399, !400, !403, !404, !407, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !428, !429, !432, !433, !434, !437, !440, !441, !444, !447, !450, !453, !456, !459, !460, !461, !462, !465, !466, !469, !472, !475, !476, !477, !480, !483, !484, !487, !490, !493, !494, !495, !496, !497, !498, !499, !505, !506, !509, !512, !515, !516, !519, !522}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !6, line: 245, baseType: !5, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, scope: !231, file: !6, line: 246, baseType: !235, size: 64, offset: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !6, line: 246, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !236, identifier: "_ZTSN6ObjectUt_E")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !279, !343, !346, !351}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "booln", scope: !235, file: !6, line: 247, baseType: !163, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intg", scope: !235, file: !6, line: 248, baseType: !46, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "uintg", scope: !235, file: !6, line: 249, baseType: !7, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !235, file: !6, line: 250, baseType: !196, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !235, file: !6, line: 251, baseType: !40, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !6, line: 252, baseType: !55, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !235, file: !6, line: 253, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Array", file: !246, line: 39, size: 256, flags: DIFlagTypePassByReference, elements: !247, identifier: "_ZTS5Array")
!246 = !DIFile(filename: "../poppler/Array.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!247 = !{!248, !249, !251, !252, !253, !254, !258, !261, !264, !265, !266, !269, !272, !275, !276}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !245, file: !246, line: 68, baseType: !214, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !245, file: !246, line: 69, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !245, file: !246, line: 70, baseType: !46, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !245, file: !246, line: 71, baseType: !46, size: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !245, file: !246, line: 72, baseType: !46, size: 32, offset: 192)
!254 = !DISubprogram(name: "Array", scope: !245, file: !246, line: 43, type: !255, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !257, !214}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!258 = !DISubprogram(name: "~Array", scope: !245, file: !246, line: 46, type: !259, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !257}
!261 = !DISubprogram(name: "incRef", linkageName: "_ZN5Array6incRefEv", scope: !245, file: !246, line: 49, type: !262, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!262 = !DISubroutineType(types: !263)
!263 = !{!46, !257}
!264 = !DISubprogram(name: "decRef", linkageName: "_ZN5Array6decRefEv", scope: !245, file: !246, line: 50, type: !262, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!265 = !DISubprogram(name: "getLength", linkageName: "_ZN5Array9getLengthEv", scope: !245, file: !246, line: 53, type: !262, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!266 = !DISubprogram(name: "add", linkageName: "_ZN5Array3addEP6Object", scope: !245, file: !246, line: 56, type: !267, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !257, !250}
!269 = !DISubprogram(name: "remove", linkageName: "_ZN5Array6removeEi", scope: !245, file: !246, line: 59, type: !270, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !257, !46}
!272 = !DISubprogram(name: "get", linkageName: "_ZN5Array3getEiP6Object", scope: !245, file: !246, line: 62, type: !273, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!273 = !DISubroutineType(types: !274)
!274 = !{!250, !257, !46, !250}
!275 = !DISubprogram(name: "getNF", linkageName: "_ZN5Array5getNFEiP6Object", scope: !245, file: !246, line: 63, type: !273, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!276 = !DISubprogram(name: "getString", linkageName: "_ZN5Array9getStringEiP9GooString", scope: !245, file: !246, line: 64, type: !277, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!277 = !DISubroutineType(types: !278)
!278 = !{!163, !257, !46, !40}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !235, file: !6, line: 254, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Dict", file: !282, line: 45, size: 320, flags: DIFlagTypePassByReference, elements: !283, identifier: "_ZTS4Dict")
!282 = !DIFile(filename: "../poppler/Dict.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!283 = !{!284, !285, !286, !289, !290, !291, !292, !296, !299, !302, !305, !306, !307, !310, !313, !316, !319, !322, !325, !328, !331, !334, !335, !336, !339, !340}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !281, file: !282, line: 95, baseType: !163, size: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !281, file: !282, line: 96, baseType: !214, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !281, file: !282, line: 97, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DictEntry", file: !282, line: 40, flags: DIFlagFwdDecl, identifier: "_ZTS9DictEntry")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !281, file: !282, line: 98, baseType: !46, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !281, file: !282, line: 99, baseType: !46, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !281, file: !282, line: 100, baseType: !46, size: 32, offset: 256)
!292 = !DISubprogram(name: "Dict", scope: !281, file: !282, line: 49, type: !293, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !295, !214}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!296 = !DISubprogram(name: "Dict", scope: !281, file: !282, line: 50, type: !297, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !295, !280}
!299 = !DISubprogram(name: "~Dict", scope: !281, file: !282, line: 53, type: !300, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !295}
!302 = !DISubprogram(name: "incRef", linkageName: "_ZN4Dict6incRefEv", scope: !281, file: !282, line: 56, type: !303, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!303 = !DISubroutineType(types: !304)
!304 = !{!46, !295}
!305 = !DISubprogram(name: "decRef", linkageName: "_ZN4Dict6decRefEv", scope: !281, file: !282, line: 57, type: !303, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!306 = !DISubprogram(name: "getLength", linkageName: "_ZN4Dict9getLengthEv", scope: !281, file: !282, line: 60, type: !303, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!307 = !DISubprogram(name: "add", linkageName: "_ZN4Dict3addEPcP6Object", scope: !281, file: !282, line: 63, type: !308, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !295, !55, !250}
!310 = !DISubprogram(name: "set", linkageName: "_ZN4Dict3setEPKcP6Object", scope: !281, file: !282, line: 66, type: !311, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !295, !63, !250}
!313 = !DISubprogram(name: "remove", linkageName: "_ZN4Dict6removeEPKc", scope: !281, file: !282, line: 68, type: !314, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !295, !63}
!316 = !DISubprogram(name: "is", linkageName: "_ZN4Dict2isEPKc", scope: !281, file: !282, line: 71, type: !317, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!317 = !DISubroutineType(types: !318)
!318 = !{!163, !295, !63}
!319 = !DISubprogram(name: "lookup", linkageName: "_ZN4Dict6lookupEPKcP6Objecti", scope: !281, file: !282, line: 75, type: !320, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!320 = !DISubroutineType(types: !321)
!321 = !{!250, !295, !63, !250, !46}
!322 = !DISubprogram(name: "lookupNF", linkageName: "_ZN4Dict8lookupNFEPKcP6Object", scope: !281, file: !282, line: 76, type: !323, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!323 = !DISubroutineType(types: !324)
!324 = !{!250, !295, !63, !250}
!325 = !DISubprogram(name: "lookupInt", linkageName: "_ZN4Dict9lookupIntEPKcS1_Pi", scope: !281, file: !282, line: 77, type: !326, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!326 = !DISubroutineType(types: !327)
!327 = !{!163, !295, !63, !63, !188}
!328 = !DISubprogram(name: "getKey", linkageName: "_ZN4Dict6getKeyEi", scope: !281, file: !282, line: 80, type: !329, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!329 = !DISubroutineType(types: !330)
!330 = !{!55, !295, !46}
!331 = !DISubprogram(name: "getVal", linkageName: "_ZN4Dict6getValEiP6Object", scope: !281, file: !282, line: 81, type: !332, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!332 = !DISubroutineType(types: !333)
!333 = !{!250, !295, !46, !250}
!334 = !DISubprogram(name: "getValNF", linkageName: "_ZN4Dict8getValNFEiP6Object", scope: !281, file: !282, line: 82, type: !332, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!335 = !DISubprogram(name: "setXRef", linkageName: "_ZN4Dict7setXRefEP4XRef", scope: !281, file: !282, line: 87, type: !293, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!336 = !DISubprogram(name: "getXRef", linkageName: "_ZN4Dict7getXRefEv", scope: !281, file: !282, line: 89, type: !337, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!337 = !DISubroutineType(types: !338)
!338 = !{!214, !295}
!339 = !DISubprogram(name: "hasKey", linkageName: "_ZN4Dict6hasKeyEPKc", scope: !281, file: !282, line: 91, type: !317, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!340 = !DISubprogram(name: "find", linkageName: "_ZN4Dict4findEPKc", scope: !281, file: !282, line: 102, type: !341, scopeLine: 102, flags: DIFlagPrototyped, spFlags: 0)
!341 = !DISubroutineType(types: !342)
!342 = !{!287, !295, !63}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !235, file: !6, line: 255, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stream", file: !25, line: 91, flags: DIFlagFwdDecl, identifier: "_ZTS6Stream")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !235, file: !6, line: 256, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ref", file: !6, line: 66, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !348, identifier: "_ZTS3Ref")
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !347, file: !6, line: 67, baseType: !46, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "gen", scope: !347, file: !6, line: 68, baseType: !46, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !235, file: !6, line: 257, baseType: !55, size: 64)
!352 = !DISubprogram(name: "zeroUnion", linkageName: "_ZN6Object9zeroUnionEv", scope: !231, file: !6, line: 115, type: !353, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!356 = !DISubprogram(name: "Object", scope: !231, file: !6, line: 118, type: !353, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!357 = !DISubprogram(name: "initBool", linkageName: "_ZN6Object8initBoolEb", scope: !231, file: !6, line: 122, type: !358, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!358 = !DISubroutineType(types: !359)
!359 = !{!250, !355, !163}
!360 = !DISubprogram(name: "initInt", linkageName: "_ZN6Object7initIntEi", scope: !231, file: !6, line: 124, type: !361, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!361 = !DISubroutineType(types: !362)
!362 = !{!250, !355, !46}
!363 = !DISubprogram(name: "initReal", linkageName: "_ZN6Object8initRealEd", scope: !231, file: !6, line: 126, type: !364, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!364 = !DISubroutineType(types: !365)
!365 = !{!250, !355, !196}
!366 = !DISubprogram(name: "initString", linkageName: "_ZN6Object10initStringEP9GooString", scope: !231, file: !6, line: 128, type: !367, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!250, !355, !40}
!369 = !DISubprogram(name: "initName", linkageName: "_ZN6Object8initNameEPKc", scope: !231, file: !6, line: 130, type: !370, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{!250, !355, !63}
!372 = !DISubprogram(name: "initNull", linkageName: "_ZN6Object8initNullEv", scope: !231, file: !6, line: 132, type: !373, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!373 = !DISubroutineType(types: !374)
!374 = !{!250, !355}
!375 = !DISubprogram(name: "initArray", linkageName: "_ZN6Object9initArrayEP4XRef", scope: !231, file: !6, line: 134, type: !376, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!376 = !DISubroutineType(types: !377)
!377 = !{!250, !355, !214}
!378 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4XRef", scope: !231, file: !6, line: 135, type: !376, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!379 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4Dict", scope: !231, file: !6, line: 136, type: !380, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!380 = !DISubroutineType(types: !381)
!381 = !{!250, !355, !280}
!382 = !DISubprogram(name: "initStream", linkageName: "_ZN6Object10initStreamEP6Stream", scope: !231, file: !6, line: 137, type: !383, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!383 = !DISubroutineType(types: !384)
!384 = !{!250, !355, !344}
!385 = !DISubprogram(name: "initRef", linkageName: "_ZN6Object7initRefEii", scope: !231, file: !6, line: 138, type: !386, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!386 = !DISubroutineType(types: !387)
!387 = !{!250, !355, !46, !46}
!388 = !DISubprogram(name: "initCmd", linkageName: "_ZN6Object7initCmdEPc", scope: !231, file: !6, line: 140, type: !389, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!389 = !DISubroutineType(types: !390)
!390 = !{!250, !355, !55}
!391 = !DISubprogram(name: "initError", linkageName: "_ZN6Object9initErrorEv", scope: !231, file: !6, line: 142, type: !373, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!392 = !DISubprogram(name: "initEOF", linkageName: "_ZN6Object7initEOFEv", scope: !231, file: !6, line: 144, type: !373, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!393 = !DISubprogram(name: "initUint", linkageName: "_ZN6Object8initUintEj", scope: !231, file: !6, line: 146, type: !394, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{!250, !355, !7}
!396 = !DISubprogram(name: "copy", linkageName: "_ZN6Object4copyEPS_", scope: !231, file: !6, line: 150, type: !397, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{!250, !355, !250}
!399 = !DISubprogram(name: "shallowCopy", linkageName: "_ZN6Object11shallowCopyEPS_", scope: !231, file: !6, line: 151, type: !397, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!400 = !DISubprogram(name: "fetch", linkageName: "_ZN6Object5fetchEP4XRefPS_i", scope: !231, file: !6, line: 158, type: !401, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!401 = !DISubroutineType(types: !402)
!402 = !{!250, !355, !214, !250, !46}
!403 = !DISubprogram(name: "free", linkageName: "_ZN6Object4freeEv", scope: !231, file: !6, line: 161, type: !353, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!404 = !DISubprogram(name: "getType", linkageName: "_ZN6Object7getTypeEv", scope: !231, file: !6, line: 164, type: !405, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!405 = !DISubroutineType(types: !406)
!406 = !{!5, !355}
!407 = !DISubprogram(name: "isBool", linkageName: "_ZN6Object6isBoolEv", scope: !231, file: !6, line: 165, type: !408, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{!163, !355}
!410 = !DISubprogram(name: "isInt", linkageName: "_ZN6Object5isIntEv", scope: !231, file: !6, line: 166, type: !408, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!411 = !DISubprogram(name: "isReal", linkageName: "_ZN6Object6isRealEv", scope: !231, file: !6, line: 167, type: !408, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!412 = !DISubprogram(name: "isNum", linkageName: "_ZN6Object5isNumEv", scope: !231, file: !6, line: 168, type: !408, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!413 = !DISubprogram(name: "isString", linkageName: "_ZN6Object8isStringEv", scope: !231, file: !6, line: 169, type: !408, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!414 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEv", scope: !231, file: !6, line: 170, type: !408, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!415 = !DISubprogram(name: "isNull", linkageName: "_ZN6Object6isNullEv", scope: !231, file: !6, line: 171, type: !408, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!416 = !DISubprogram(name: "isArray", linkageName: "_ZN6Object7isArrayEv", scope: !231, file: !6, line: 172, type: !408, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!417 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEv", scope: !231, file: !6, line: 173, type: !408, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!418 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEv", scope: !231, file: !6, line: 174, type: !408, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!419 = !DISubprogram(name: "isRef", linkageName: "_ZN6Object5isRefEv", scope: !231, file: !6, line: 175, type: !408, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!420 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEv", scope: !231, file: !6, line: 176, type: !408, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!421 = !DISubprogram(name: "isError", linkageName: "_ZN6Object7isErrorEv", scope: !231, file: !6, line: 177, type: !408, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!422 = !DISubprogram(name: "isEOF", linkageName: "_ZN6Object5isEOFEv", scope: !231, file: !6, line: 178, type: !408, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!423 = !DISubprogram(name: "isNone", linkageName: "_ZN6Object6isNoneEv", scope: !231, file: !6, line: 179, type: !408, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!424 = !DISubprogram(name: "isUint", linkageName: "_ZN6Object6isUintEv", scope: !231, file: !6, line: 180, type: !408, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!425 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEPKc", scope: !231, file: !6, line: 183, type: !426, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{!163, !355, !63}
!428 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEPKc", scope: !231, file: !6, line: 185, type: !426, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!429 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEPc", scope: !231, file: !6, line: 186, type: !430, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!430 = !DISubroutineType(types: !431)
!431 = !{!163, !355, !55}
!432 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEPKc", scope: !231, file: !6, line: 187, type: !426, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!433 = !DISubprogram(name: "getBool", linkageName: "_ZN6Object7getBoolEv", scope: !231, file: !6, line: 191, type: !408, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!434 = !DISubprogram(name: "getInt", linkageName: "_ZN6Object6getIntEv", scope: !231, file: !6, line: 192, type: !435, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!46, !355}
!437 = !DISubprogram(name: "getReal", linkageName: "_ZN6Object7getRealEv", scope: !231, file: !6, line: 193, type: !438, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!438 = !DISubroutineType(types: !439)
!439 = !{!196, !355}
!440 = !DISubprogram(name: "getNum", linkageName: "_ZN6Object6getNumEv", scope: !231, file: !6, line: 194, type: !438, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!441 = !DISubprogram(name: "getString", linkageName: "_ZN6Object9getStringEv", scope: !231, file: !6, line: 195, type: !442, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!442 = !DISubroutineType(types: !443)
!443 = !{!40, !355}
!444 = !DISubprogram(name: "getName", linkageName: "_ZN6Object7getNameEv", scope: !231, file: !6, line: 196, type: !445, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!445 = !DISubroutineType(types: !446)
!446 = !{!55, !355}
!447 = !DISubprogram(name: "getArray", linkageName: "_ZN6Object8getArrayEv", scope: !231, file: !6, line: 197, type: !448, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!448 = !DISubroutineType(types: !449)
!449 = !{!244, !355}
!450 = !DISubprogram(name: "getDict", linkageName: "_ZN6Object7getDictEv", scope: !231, file: !6, line: 198, type: !451, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!280, !355}
!453 = !DISubprogram(name: "getStream", linkageName: "_ZN6Object9getStreamEv", scope: !231, file: !6, line: 199, type: !454, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!454 = !DISubroutineType(types: !455)
!455 = !{!344, !355}
!456 = !DISubprogram(name: "getRef", linkageName: "_ZN6Object6getRefEv", scope: !231, file: !6, line: 200, type: !457, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!457 = !DISubroutineType(types: !458)
!458 = !{!347, !355}
!459 = !DISubprogram(name: "getRefNum", linkageName: "_ZN6Object9getRefNumEv", scope: !231, file: !6, line: 201, type: !435, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!460 = !DISubprogram(name: "getRefGen", linkageName: "_ZN6Object9getRefGenEv", scope: !231, file: !6, line: 202, type: !435, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!461 = !DISubprogram(name: "getCmd", linkageName: "_ZN6Object6getCmdEv", scope: !231, file: !6, line: 203, type: !445, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!462 = !DISubprogram(name: "getUint", linkageName: "_ZN6Object7getUintEv", scope: !231, file: !6, line: 204, type: !463, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!463 = !DISubroutineType(types: !464)
!464 = !{!7, !355}
!465 = !DISubprogram(name: "arrayGetLength", linkageName: "_ZN6Object14arrayGetLengthEv", scope: !231, file: !6, line: 207, type: !435, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!466 = !DISubprogram(name: "arrayAdd", linkageName: "_ZN6Object8arrayAddEPS_", scope: !231, file: !6, line: 208, type: !467, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !355, !250}
!469 = !DISubprogram(name: "arrayRemove", linkageName: "_ZN6Object11arrayRemoveEi", scope: !231, file: !6, line: 209, type: !470, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !355, !46}
!472 = !DISubprogram(name: "arrayGet", linkageName: "_ZN6Object8arrayGetEiPS_", scope: !231, file: !6, line: 210, type: !473, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!250, !355, !46, !250}
!475 = !DISubprogram(name: "arrayGetNF", linkageName: "_ZN6Object10arrayGetNFEiPS_", scope: !231, file: !6, line: 211, type: !473, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!476 = !DISubprogram(name: "dictGetLength", linkageName: "_ZN6Object13dictGetLengthEv", scope: !231, file: !6, line: 214, type: !435, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!477 = !DISubprogram(name: "dictAdd", linkageName: "_ZN6Object7dictAddEPcPS_", scope: !231, file: !6, line: 215, type: !478, scopeLine: 215, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !355, !55, !250}
!480 = !DISubprogram(name: "dictSet", linkageName: "_ZN6Object7dictSetEPKcPS_", scope: !231, file: !6, line: 216, type: !481, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !355, !63, !250}
!483 = !DISubprogram(name: "dictIs", linkageName: "_ZN6Object6dictIsEPKc", scope: !231, file: !6, line: 217, type: !426, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!484 = !DISubprogram(name: "dictLookup", linkageName: "_ZN6Object10dictLookupEPKcPS_i", scope: !231, file: !6, line: 218, type: !485, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{!250, !355, !63, !250, !46}
!487 = !DISubprogram(name: "dictLookupNF", linkageName: "_ZN6Object12dictLookupNFEPKcPS_", scope: !231, file: !6, line: 219, type: !488, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{!250, !355, !63, !250}
!490 = !DISubprogram(name: "dictGetKey", linkageName: "_ZN6Object10dictGetKeyEi", scope: !231, file: !6, line: 220, type: !491, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!55, !355, !46}
!493 = !DISubprogram(name: "dictGetVal", linkageName: "_ZN6Object10dictGetValEiPS_", scope: !231, file: !6, line: 221, type: !473, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!494 = !DISubprogram(name: "dictGetValNF", linkageName: "_ZN6Object12dictGetValNFEiPS_", scope: !231, file: !6, line: 222, type: !473, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!495 = !DISubprogram(name: "streamIs", linkageName: "_ZN6Object8streamIsEPc", scope: !231, file: !6, line: 225, type: !430, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!496 = !DISubprogram(name: "streamReset", linkageName: "_ZN6Object11streamResetEv", scope: !231, file: !6, line: 226, type: !353, scopeLine: 226, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!497 = !DISubprogram(name: "streamClose", linkageName: "_ZN6Object11streamCloseEv", scope: !231, file: !6, line: 227, type: !353, scopeLine: 227, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!498 = !DISubprogram(name: "streamGetChar", linkageName: "_ZN6Object13streamGetCharEv", scope: !231, file: !6, line: 228, type: !435, scopeLine: 228, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!499 = !DISubprogram(name: "streamGetChars", linkageName: "_ZN6Object14streamGetCharsEiPh", scope: !231, file: !6, line: 229, type: !500, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!500 = !DISubroutineType(types: !501)
!501 = !{!46, !355, !46, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guchar", file: !164, line: 43, baseType: !504)
!504 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!505 = !DISubprogram(name: "streamLookChar", linkageName: "_ZN6Object14streamLookCharEv", scope: !231, file: !6, line: 230, type: !435, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!506 = !DISubprogram(name: "streamGetLine", linkageName: "_ZN6Object13streamGetLineEPci", scope: !231, file: !6, line: 231, type: !507, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!507 = !DISubroutineType(types: !508)
!508 = !{!55, !355, !55, !46}
!509 = !DISubprogram(name: "streamGetPos", linkageName: "_ZN6Object12streamGetPosEv", scope: !231, file: !6, line: 232, type: !510, scopeLine: 232, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!220, !355}
!512 = !DISubprogram(name: "streamSetPos", linkageName: "_ZN6Object12streamSetPosEji", scope: !231, file: !6, line: 233, type: !513, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !355, !220, !46}
!515 = !DISubprogram(name: "streamGetDict", linkageName: "_ZN6Object13streamGetDictEv", scope: !231, file: !6, line: 234, type: !451, scopeLine: 234, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!516 = !DISubprogram(name: "getTypeName", linkageName: "_ZN6Object11getTypeNameEv", scope: !231, file: !6, line: 237, type: !517, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!517 = !DISubroutineType(types: !518)
!518 = !{!63, !355}
!519 = !DISubprogram(name: "print", linkageName: "_ZN6Object5printEP8_IO_FILE", scope: !231, file: !6, line: 238, type: !520, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !355, !199}
!522 = !DISubprogram(name: "memCheck", linkageName: "_ZN6Object8memCheckEP8_IO_FILE", scope: !231, file: !6, line: 241, type: !523, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !199}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "streamEnds", scope: !215, file: !216, line: 195, baseType: !526, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "streamEndsLen", scope: !215, file: !216, line: 197, baseType: !46, size: 32, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "objStrs", scope: !215, file: !216, line: 198, baseType: !529, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PopplerCache", file: !216, line: 46, flags: DIFlagFwdDecl, identifier: "_ZTS12PopplerCache")
!531 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !215, file: !216, line: 199, baseType: !163, size: 8, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "encRevision", scope: !215, file: !216, line: 200, baseType: !46, size: 32, offset: 736)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "encVersion", scope: !215, file: !216, line: 201, baseType: !46, size: 32, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "encAlgorithm", scope: !215, file: !216, line: 202, baseType: !24, size: 32, offset: 800)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "keyLength", scope: !215, file: !216, line: 203, baseType: !46, size: 32, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "permFlags", scope: !215, file: !216, line: 204, baseType: !46, size: 32, offset: 864)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fileKey", scope: !215, file: !216, line: 205, baseType: !538, size: 256, offset: 896)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 256, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPasswordOk", scope: !215, file: !216, line: 206, baseType: !163, size: 8, offset: 1152)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prevXRefOffset", scope: !215, file: !216, line: 207, baseType: !220, size: 32, offset: 1184)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefEntriesOffset", scope: !215, file: !216, line: 208, baseType: !220, size: 32, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "xRefStream", scope: !215, file: !216, line: 209, baseType: !163, size: 8, offset: 1248)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefOffset", scope: !215, file: !216, line: 210, baseType: !220, size: 32, offset: 1280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "scannedSpecialFlags", scope: !215, file: !216, line: 211, baseType: !163, size: 8, offset: 1312)
!547 = !DISubprogram(name: "XRef", scope: !215, file: !216, line: 94, type: !548, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!551 = !DISubprogram(name: "XRef", scope: !215, file: !216, line: 96, type: !552, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !550, !250}
!554 = !DISubprogram(name: "XRef", scope: !215, file: !216, line: 98, type: !555, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !550, !205, !220, !220, !557, !163}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!558 = !DISubprogram(name: "~XRef", scope: !215, file: !216, line: 101, type: !548, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!559 = !DISubprogram(name: "isOk", linkageName: "_ZN4XRef4isOkEv", scope: !215, file: !216, line: 104, type: !560, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!560 = !DISubroutineType(types: !561)
!561 = !{!163, !550}
!562 = !DISubprogram(name: "isXRefStream", linkageName: "_ZN4XRef12isXRefStreamEv", scope: !215, file: !216, line: 107, type: !560, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!563 = !DISubprogram(name: "getErrorCode", linkageName: "_ZN4XRef12getErrorCodeEv", scope: !215, file: !216, line: 110, type: !564, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!564 = !DISubroutineType(types: !565)
!565 = !{!46, !550}
!566 = !DISubprogram(name: "setEncryption", linkageName: "_ZN4XRef13setEncryptionEibPhiii14CryptAlgorithm", scope: !215, file: !216, line: 113, type: !567, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !550, !46, !163, !502, !46, !46, !46, !24}
!569 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEv", scope: !215, file: !216, line: 118, type: !548, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!570 = !DISubprogram(name: "getEncryptionParameters", linkageName: "_ZN4XRef23getEncryptionParametersEPPhP14CryptAlgorithmPi", scope: !215, file: !216, line: 120, type: !571, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !550, !573, !574, !188}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!575 = !DISubprogram(name: "isEncrypted", linkageName: "_ZN4XRef11isEncryptedEv", scope: !215, file: !216, line: 123, type: !560, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!576 = !DISubprogram(name: "okToPrint", linkageName: "_ZN4XRef9okToPrintEb", scope: !215, file: !216, line: 126, type: !577, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!577 = !DISubroutineType(types: !578)
!578 = !{!163, !550, !163}
!579 = !DISubprogram(name: "okToPrintHighRes", linkageName: "_ZN4XRef16okToPrintHighResEb", scope: !215, file: !216, line: 127, type: !577, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!580 = !DISubprogram(name: "okToChange", linkageName: "_ZN4XRef10okToChangeEb", scope: !215, file: !216, line: 128, type: !577, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!581 = !DISubprogram(name: "okToCopy", linkageName: "_ZN4XRef8okToCopyEb", scope: !215, file: !216, line: 129, type: !577, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!582 = !DISubprogram(name: "okToAddNotes", linkageName: "_ZN4XRef12okToAddNotesEb", scope: !215, file: !216, line: 130, type: !577, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!583 = !DISubprogram(name: "okToFillForm", linkageName: "_ZN4XRef12okToFillFormEb", scope: !215, file: !216, line: 131, type: !577, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!584 = !DISubprogram(name: "okToAccessibility", linkageName: "_ZN4XRef17okToAccessibilityEb", scope: !215, file: !216, line: 132, type: !577, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!585 = !DISubprogram(name: "okToAssemble", linkageName: "_ZN4XRef12okToAssembleEb", scope: !215, file: !216, line: 133, type: !577, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!586 = !DISubprogram(name: "getPermFlags", linkageName: "_ZN4XRef12getPermFlagsEv", scope: !215, file: !216, line: 134, type: !564, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!587 = !DISubprogram(name: "getCatalog", linkageName: "_ZN4XRef10getCatalogEP6Object", scope: !215, file: !216, line: 137, type: !588, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!588 = !DISubroutineType(types: !589)
!589 = !{!250, !550, !250}
!590 = !DISubprogram(name: "fetch", linkageName: "_ZN4XRef5fetchEiiP6Objecti", scope: !215, file: !216, line: 140, type: !591, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!591 = !DISubroutineType(types: !592)
!592 = !{!250, !550, !46, !46, !250, !46}
!593 = !DISubprogram(name: "getDocInfo", linkageName: "_ZN4XRef10getDocInfoEP6Object", scope: !215, file: !216, line: 143, type: !588, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!594 = !DISubprogram(name: "getDocInfoNF", linkageName: "_ZN4XRef12getDocInfoNFEP6Object", scope: !215, file: !216, line: 144, type: !588, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!595 = !DISubprogram(name: "getNumObjects", linkageName: "_ZN4XRef13getNumObjectsEv", scope: !215, file: !216, line: 147, type: !564, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!596 = !DISubprogram(name: "getRootNum", linkageName: "_ZN4XRef10getRootNumEv", scope: !215, file: !216, line: 150, type: !564, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!597 = !DISubprogram(name: "getRootGen", linkageName: "_ZN4XRef10getRootGenEv", scope: !215, file: !216, line: 151, type: !564, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!598 = !DISubprogram(name: "getStreamEnd", linkageName: "_ZN4XRef12getStreamEndEjPj", scope: !215, file: !216, line: 155, type: !599, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!599 = !DISubroutineType(types: !600)
!600 = !{!163, !550, !220, !526}
!601 = !DISubprogram(name: "getNumEntry", linkageName: "_ZN4XRef11getNumEntryEj", scope: !215, file: !216, line: 158, type: !602, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!602 = !DISubroutineType(types: !603)
!603 = !{!46, !550, !220}
!604 = !DISubprogram(name: "scanSpecialFlags", linkageName: "_ZN4XRef16scanSpecialFlagsEv", scope: !215, file: !216, line: 166, type: !548, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!605 = !DISubprogram(name: "getEntry", linkageName: "_ZN4XRef8getEntryEib", scope: !215, file: !216, line: 169, type: !606, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!606 = !DISubroutineType(types: !607)
!607 = !{!222, !550, !46, !163}
!608 = !DISubprogram(name: "getTrailerDict", linkageName: "_ZN4XRef14getTrailerDictEv", scope: !215, file: !216, line: 170, type: !609, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!609 = !DISubroutineType(types: !610)
!610 = !{!250, !550}
!611 = !DISubprogram(name: "setModifiedObject", linkageName: "_ZN4XRef17setModifiedObjectEP6Object3Ref", scope: !215, file: !216, line: 173, type: !612, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !550, !250, !347}
!614 = !DISubprogram(name: "addIndirectObject", linkageName: "_ZN4XRef17addIndirectObjectEP6Object", scope: !215, file: !216, line: 174, type: !615, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!347, !550, !250}
!617 = !DISubprogram(name: "removeIndirectObject", linkageName: "_ZN4XRef20removeIndirectObjectE3Ref", scope: !215, file: !216, line: 175, type: !618, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !550, !347}
!620 = !DISubprogram(name: "add", linkageName: "_ZN4XRef3addEiijb", scope: !215, file: !216, line: 176, type: !621, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !550, !46, !46, !220, !163}
!623 = !DISubprogram(name: "writeTableToFile", linkageName: "_ZN4XRef16writeTableToFileEP9OutStreamb", scope: !215, file: !216, line: 179, type: !624, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !550, !626, !163}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OutStream", file: !25, line: 238, flags: DIFlagFwdDecl, identifier: "_ZTS9OutStream")
!628 = !DISubprogram(name: "writeStreamToBuffer", linkageName: "_ZN4XRef19writeStreamToBufferEP9GooStringP4DictPS_", scope: !215, file: !216, line: 181, type: !629, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !550, !40, !280, !214}
!631 = !DISubprogram(name: "init", linkageName: "_ZN4XRef4initEv", scope: !215, file: !216, line: 213, type: !548, scopeLine: 213, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DISubprogram(name: "reserve", linkageName: "_ZN4XRef7reserveEi", scope: !215, file: !216, line: 214, type: !633, scopeLine: 214, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{!46, !550, !46}
!635 = !DISubprogram(name: "resize", linkageName: "_ZN4XRef6resizeEi", scope: !215, file: !216, line: 215, type: !633, scopeLine: 215, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DISubprogram(name: "readXRef", linkageName: "_ZN4XRef8readXRefEPjPSt6vectorIjSaIjEEPS1_IiSaIiEE", scope: !215, file: !216, line: 216, type: !637, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DISubroutineType(types: !638)
!638 = !{!163, !550, !526, !639, !643}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, std::allocator<unsigned int> >", scope: !642, file: !641, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIjSaIjEE")
!641 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/6.3.0/../../../../include/c++/6.3.0/bits/stl_vector.h", directory: "")
!642 = !DINamespace(name: "std", scope: null)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, std::allocator<int> >", scope: !642, file: !641, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIiSaIiEE")
!645 = !DISubprogram(name: "readXRefTable", linkageName: "_ZN4XRef13readXRefTableEP6ParserPjPSt6vectorIjSaIjEEPS3_IiSaIiEE", scope: !215, file: !216, line: 217, type: !646, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DISubroutineType(types: !647)
!647 = !{!163, !550, !648, !526, !639, !643}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Parser", file: !216, line: 45, flags: DIFlagFwdDecl, identifier: "_ZTS6Parser")
!650 = !DISubprogram(name: "readXRefStreamSection", linkageName: "_ZN4XRef21readXRefStreamSectionEP6StreamPiii", scope: !215, file: !216, line: 218, type: !651, scopeLine: 218, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{!163, !550, !344, !188, !46, !46}
!653 = !DISubprogram(name: "readXRefStream", linkageName: "_ZN4XRef14readXRefStreamEP6StreamPj", scope: !215, file: !216, line: 219, type: !654, scopeLine: 219, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DISubroutineType(types: !655)
!655 = !{!163, !550, !344, !526}
!656 = !DISubprogram(name: "constructXRef", linkageName: "_ZN4XRef13constructXRefEPbb", scope: !215, file: !216, line: 220, type: !657, scopeLine: 220, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DISubroutineType(types: !658)
!658 = !{!163, !550, !557, !163}
!659 = !DISubprogram(name: "parseEntry", linkageName: "_ZN4XRef10parseEntryEjP9XRefEntry", scope: !215, file: !216, line: 221, type: !660, scopeLine: 221, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{!163, !550, !220, !222}
!662 = !DISubprogram(name: "readXRefUntil", linkageName: "_ZN4XRef13readXRefUntilEiPSt6vectorIiSaIiEE", scope: !215, file: !216, line: 222, type: !663, scopeLine: 222, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !550, !46, !643}
!665 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEP6Object", scope: !215, file: !216, line: 223, type: !552, scopeLine: 223, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DISubprogram(name: "writeXRef", linkageName: "_ZN4XRef9writeXRefEPNS_10XRefWriterEb", scope: !215, file: !216, line: 251, type: !667, scopeLine: 251, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !550, !669, !163}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRefWriter", scope: !215, file: !216, line: 225, flags: DIFlagFwdDecl, identifier: "_ZTSN4XRef10XRefWriterE")
!671 = !DIDerivedType(tag: DW_TAG_member, name: "secHdlr", scope: !36, file: !37, line: 314, baseType: !672, size: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SecurityHandler", file: !37, line: 56, flags: DIFlagFwdDecl, identifier: "_ZTS15SecurityHandler")
!674 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !36, file: !37, line: 315, baseType: !675, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hints", scope: !36, file: !37, line: 316, baseType: !677, size: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Hints", file: !37, line: 57, flags: DIFlagFwdDecl, identifier: "_ZTS5Hints")
!679 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !36, file: !37, line: 318, baseType: !680, size: 64, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Outline", file: !37, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTS7Outline")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pageCache", scope: !36, file: !37, line: 320, baseType: !683, size: 64, offset: 704)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Page", file: !686, line: 133, size: 1280, flags: DIFlagTypePassByReference, elements: !687, identifier: "_ZTS4Page")
!686 = !DIFile(filename: "../poppler/Page.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!687 = !{!688, !689, !690, !691, !692, !693, !777, !781, !782, !783, !784, !785, !786, !787, !788, !794, !797, !800, !803, !806, !807, !808, !811, !812, !813, !814, !815, !816, !817, !818, !821, !824, !825, !828, !829, !830, !833, !836, !837, !840, !845, !846, !851, !854, !855, !856, !861, !862, !867, !868, !869, !880, !886, !889, !892, !895, !898}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !685, file: !686, line: 249, baseType: !35, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !685, file: !686, line: 250, baseType: !214, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pageObj", scope: !685, file: !686, line: 251, baseType: !231, size: 128, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pageRef", scope: !685, file: !686, line: 252, baseType: !347, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !685, file: !686, line: 253, baseType: !46, size: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !685, file: !686, line: 254, baseType: !694, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PageAttrs", file: !686, line: 70, size: 2304, flags: DIFlagTypePassByReference, elements: !696, identifier: "_ZTS9PageAttrs")
!696 = !{!697, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !744, !747, !750, !751, !754, !755, !756, !757, !760, !763, !766, !767, !770, !771, !772, !773, !774}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mediaBox", scope: !695, file: !686, line: 113, baseType: !698, size: 256)
!698 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFRectangle", file: !686, line: 52, size: 256, flags: DIFlagTypePassByValue, elements: !699, identifier: "_ZTS12PDFRectangle")
!699 = !{!700, !701, !702, !703, !704, !708, !711, !714, !717, !721}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !698, file: !686, line: 54, baseType: !196, size: 64, flags: DIFlagPublic)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !698, file: !686, line: 54, baseType: !196, size: 64, offset: 64, flags: DIFlagPublic)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !698, file: !686, line: 54, baseType: !196, size: 64, offset: 128, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !698, file: !686, line: 54, baseType: !196, size: 64, offset: 192, flags: DIFlagPublic)
!704 = !DISubprogram(name: "PDFRectangle", scope: !698, file: !686, line: 56, type: !705, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!708 = !DISubprogram(name: "PDFRectangle", scope: !698, file: !686, line: 57, type: !709, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !707, !196, !196, !196, !196}
!711 = !DISubprogram(name: "isValid", linkageName: "_ZN12PDFRectangle7isValidEv", scope: !698, file: !686, line: 59, type: !712, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!712 = !DISubroutineType(types: !713)
!713 = !{!163, !707}
!714 = !DISubprogram(name: "contains", linkageName: "_ZN12PDFRectangle8containsEdd", scope: !698, file: !686, line: 60, type: !715, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!163, !707, !196, !196}
!717 = !DISubprogram(name: "clipTo", linkageName: "_ZN12PDFRectangle6clipToEPS_", scope: !698, file: !686, line: 61, type: !718, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !707, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!721 = !DISubprogram(name: "operator==", linkageName: "_ZNK12PDFRectangleeqERKS_", scope: !698, file: !686, line: 63, type: !722, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!722 = !DISubroutineType(types: !723)
!723 = !{!165, !724, !726}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!726 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !725, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cropBox", scope: !695, file: !686, line: 114, baseType: !698, size: 256, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "haveCropBox", scope: !695, file: !686, line: 115, baseType: !163, size: 8, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bleedBox", scope: !695, file: !686, line: 116, baseType: !698, size: 256, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "trimBox", scope: !695, file: !686, line: 117, baseType: !698, size: 256, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "artBox", scope: !695, file: !686, line: 118, baseType: !698, size: 256, offset: 1088)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !695, file: !686, line: 119, baseType: !46, size: 32, offset: 1344)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lastModified", scope: !695, file: !686, line: 120, baseType: !231, size: 128, offset: 1408)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "boxColorInfo", scope: !695, file: !686, line: 121, baseType: !231, size: 128, offset: 1536)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !695, file: !686, line: 122, baseType: !231, size: 128, offset: 1664)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !695, file: !686, line: 123, baseType: !231, size: 128, offset: 1792)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pieceInfo", scope: !695, file: !686, line: 124, baseType: !231, size: 128, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "separationInfo", scope: !695, file: !686, line: 125, baseType: !231, size: 128, offset: 2048)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !695, file: !686, line: 126, baseType: !231, size: 128, offset: 2176)
!740 = !DISubprogram(name: "PageAttrs", scope: !695, file: !686, line: 76, type: !741, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !743, !694, !280}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!744 = !DISubprogram(name: "~PageAttrs", scope: !695, file: !686, line: 79, type: !745, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !743}
!747 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN9PageAttrs11getMediaBoxEv", scope: !695, file: !686, line: 82, type: !748, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!720, !743}
!750 = !DISubprogram(name: "getCropBox", linkageName: "_ZN9PageAttrs10getCropBoxEv", scope: !695, file: !686, line: 83, type: !748, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!751 = !DISubprogram(name: "isCropped", linkageName: "_ZN9PageAttrs9isCroppedEv", scope: !695, file: !686, line: 84, type: !752, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!752 = !DISubroutineType(types: !753)
!753 = !{!163, !743}
!754 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN9PageAttrs11getBleedBoxEv", scope: !695, file: !686, line: 85, type: !748, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!755 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN9PageAttrs10getTrimBoxEv", scope: !695, file: !686, line: 86, type: !748, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!756 = !DISubprogram(name: "getArtBox", linkageName: "_ZN9PageAttrs9getArtBoxEv", scope: !695, file: !686, line: 87, type: !748, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!757 = !DISubprogram(name: "getRotate", linkageName: "_ZN9PageAttrs9getRotateEv", scope: !695, file: !686, line: 88, type: !758, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!46, !743}
!760 = !DISubprogram(name: "getLastModified", linkageName: "_ZN9PageAttrs15getLastModifiedEv", scope: !695, file: !686, line: 89, type: !761, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!40, !743}
!763 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN9PageAttrs15getBoxColorInfoEv", scope: !695, file: !686, line: 92, type: !764, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!764 = !DISubroutineType(types: !765)
!765 = !{!280, !743}
!766 = !DISubprogram(name: "getGroup", linkageName: "_ZN9PageAttrs8getGroupEv", scope: !695, file: !686, line: 94, type: !764, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!767 = !DISubprogram(name: "getMetadata", linkageName: "_ZN9PageAttrs11getMetadataEv", scope: !695, file: !686, line: 96, type: !768, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!768 = !DISubroutineType(types: !769)
!769 = !{!344, !743}
!770 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN9PageAttrs12getPieceInfoEv", scope: !695, file: !686, line: 98, type: !764, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!771 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN9PageAttrs17getSeparationInfoEv", scope: !695, file: !686, line: 100, type: !764, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!772 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN9PageAttrs15getResourceDictEv", scope: !695, file: !686, line: 103, type: !764, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!773 = !DISubprogram(name: "clipBoxes", linkageName: "_ZN9PageAttrs9clipBoxesEv", scope: !695, file: !686, line: 107, type: !745, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!774 = !DISubprogram(name: "readBox", linkageName: "_ZN9PageAttrs7readBoxEP4DictPKcP12PDFRectangle", scope: !695, file: !686, line: 111, type: !775, scopeLine: 111, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DISubroutineType(types: !776)
!776 = !{!163, !743, !280, !63, !720}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "annots", scope: !685, file: !686, line: 255, baseType: !778, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Annots", file: !780, line: 1389, flags: DIFlagFwdDecl, identifier: "_ZTS6Annots")
!780 = !DIFile(filename: "../poppler/Annot.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!781 = !DIDerivedType(tag: DW_TAG_member, name: "annotsObj", scope: !685, file: !686, line: 256, baseType: !231, size: 128, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !685, file: !686, line: 257, baseType: !231, size: 128, offset: 640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "thumb", scope: !685, file: !686, line: 258, baseType: !231, size: 128, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !685, file: !686, line: 259, baseType: !231, size: 128, offset: 896)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !685, file: !686, line: 260, baseType: !231, size: 128, offset: 1024)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !685, file: !686, line: 261, baseType: !196, size: 64, offset: 1152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !685, file: !686, line: 262, baseType: !163, size: 8, offset: 1216)
!788 = !DISubprogram(name: "Page", scope: !685, file: !686, line: 137, type: !789, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !791, !35, !46, !280, !347, !694, !792}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Form", file: !31, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS4Form")
!794 = !DISubprogram(name: "~Page", scope: !685, file: !686, line: 140, type: !795, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !791}
!797 = !DISubprogram(name: "isOk", linkageName: "_ZN4Page4isOkEv", scope: !685, file: !686, line: 143, type: !798, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!163, !791}
!800 = !DISubprogram(name: "getNum", linkageName: "_ZN4Page6getNumEv", scope: !685, file: !686, line: 146, type: !801, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!801 = !DISubroutineType(types: !802)
!802 = !{!46, !791}
!803 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN4Page11getMediaBoxEv", scope: !685, file: !686, line: 147, type: !804, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!720, !791}
!806 = !DISubprogram(name: "getCropBox", linkageName: "_ZN4Page10getCropBoxEv", scope: !685, file: !686, line: 148, type: !804, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!807 = !DISubprogram(name: "isCropped", linkageName: "_ZN4Page9isCroppedEv", scope: !685, file: !686, line: 149, type: !798, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!808 = !DISubprogram(name: "getMediaWidth", linkageName: "_ZN4Page13getMediaWidthEv", scope: !685, file: !686, line: 150, type: !809, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!809 = !DISubroutineType(types: !810)
!810 = !{!196, !791}
!811 = !DISubprogram(name: "getMediaHeight", linkageName: "_ZN4Page14getMediaHeightEv", scope: !685, file: !686, line: 152, type: !809, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!812 = !DISubprogram(name: "getCropWidth", linkageName: "_ZN4Page12getCropWidthEv", scope: !685, file: !686, line: 154, type: !809, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!813 = !DISubprogram(name: "getCropHeight", linkageName: "_ZN4Page13getCropHeightEv", scope: !685, file: !686, line: 156, type: !809, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!814 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN4Page11getBleedBoxEv", scope: !685, file: !686, line: 158, type: !804, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!815 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN4Page10getTrimBoxEv", scope: !685, file: !686, line: 159, type: !804, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!816 = !DISubprogram(name: "getArtBox", linkageName: "_ZN4Page9getArtBoxEv", scope: !685, file: !686, line: 160, type: !804, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!817 = !DISubprogram(name: "getRotate", linkageName: "_ZN4Page9getRotateEv", scope: !685, file: !686, line: 161, type: !801, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!818 = !DISubprogram(name: "getLastModified", linkageName: "_ZN4Page15getLastModifiedEv", scope: !685, file: !686, line: 162, type: !819, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!40, !791}
!821 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN4Page15getBoxColorInfoEv", scope: !685, file: !686, line: 163, type: !822, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!822 = !DISubroutineType(types: !823)
!823 = !{!280, !791}
!824 = !DISubprogram(name: "getGroup", linkageName: "_ZN4Page8getGroupEv", scope: !685, file: !686, line: 164, type: !822, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!825 = !DISubprogram(name: "getMetadata", linkageName: "_ZN4Page11getMetadataEv", scope: !685, file: !686, line: 165, type: !826, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!826 = !DISubroutineType(types: !827)
!827 = !{!344, !791}
!828 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN4Page12getPieceInfoEv", scope: !685, file: !686, line: 166, type: !822, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!829 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN4Page17getSeparationInfoEv", scope: !685, file: !686, line: 167, type: !822, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!830 = !DISubprogram(name: "getDoc", linkageName: "_ZN4Page6getDocEv", scope: !685, file: !686, line: 168, type: !831, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!35, !791}
!833 = !DISubprogram(name: "getRef", linkageName: "_ZN4Page6getRefEv", scope: !685, file: !686, line: 169, type: !834, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!834 = !DISubroutineType(types: !835)
!835 = !{!347, !791}
!836 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN4Page15getResourceDictEv", scope: !685, file: !686, line: 172, type: !822, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!837 = !DISubprogram(name: "getAnnots", linkageName: "_ZN4Page9getAnnotsEP6Object", scope: !685, file: !686, line: 175, type: !838, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!838 = !DISubroutineType(types: !839)
!839 = !{!250, !791, !250}
!840 = !DISubprogram(name: "addAnnot", linkageName: "_ZN4Page8addAnnotEP5Annot", scope: !685, file: !686, line: 177, type: !841, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !791, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Annot", file: !780, line: 475, flags: DIFlagFwdDecl, identifier: "_ZTS5Annot")
!845 = !DISubprogram(name: "removeAnnot", linkageName: "_ZN4Page11removeAnnotEP5Annot", scope: !685, file: !686, line: 179, type: !841, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!846 = !DISubprogram(name: "getLinks", linkageName: "_ZN4Page8getLinksEv", scope: !685, file: !686, line: 182, type: !847, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !791}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Links", file: !686, line: 43, flags: DIFlagFwdDecl, identifier: "_ZTS5Links")
!851 = !DISubprogram(name: "getAnnots", linkageName: "_ZN4Page9getAnnotsEv", scope: !685, file: !686, line: 185, type: !852, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!852 = !DISubroutineType(types: !853)
!853 = !{!778, !791}
!854 = !DISubprogram(name: "getContents", linkageName: "_ZN4Page11getContentsEP6Object", scope: !685, file: !686, line: 188, type: !838, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!855 = !DISubprogram(name: "getThumb", linkageName: "_ZN4Page8getThumbEP6Object", scope: !685, file: !686, line: 191, type: !838, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!856 = !DISubprogram(name: "loadThumb", linkageName: "_ZN4Page9loadThumbEPPhPiS2_S2_", scope: !685, file: !686, line: 192, type: !857, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{!163, !791, !859, !188, !188, !188}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!861 = !DISubprogram(name: "getTrans", linkageName: "_ZN4Page8getTransEP6Object", scope: !685, file: !686, line: 195, type: !838, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!862 = !DISubprogram(name: "getFormWidgets", linkageName: "_ZN4Page14getFormWidgetsEv", scope: !685, file: !686, line: 198, type: !863, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!863 = !DISubroutineType(types: !864)
!864 = !{!865, !791}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FormPageWidgets", file: !686, line: 47, flags: DIFlagFwdDecl, identifier: "_ZTS15FormPageWidgets")
!867 = !DISubprogram(name: "getDuration", linkageName: "_ZN4Page11getDurationEv", scope: !685, file: !686, line: 203, type: !809, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!868 = !DISubprogram(name: "getActions", linkageName: "_ZN4Page10getActionsEP6Object", scope: !685, file: !686, line: 206, type: !838, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!869 = !DISubprogram(name: "createGfx", linkageName: "_ZN4Page9createGfxEP9OutputDevddibbiiiibPFbPvES2_", scope: !685, file: !686, line: 208, type: !870, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!870 = !DISubroutineType(types: !871)
!871 = !{!872, !791, !874, !196, !196, !46, !163, !163, !46, !46, !46, !46, !163, !877, !101}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Gfx", file: !686, line: 46, flags: DIFlagFwdDecl, identifier: "_ZTS3Gfx")
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OutputDev", file: !876, line: 71, flags: DIFlagFwdDecl, identifier: "_ZTS9OutputDev")
!876 = !DIFile(filename: "../poppler/OutputDev.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!163, !101}
!880 = !DISubprogram(name: "display", linkageName: "_ZN4Page7displayEP9OutputDevddibbbPFbPvES2_PFbP5AnnotS2_ES2_", scope: !685, file: !686, line: 216, type: !881, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !791, !874, !196, !196, !46, !163, !163, !163, !877, !101, !883, !101}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!163, !843, !101}
!886 = !DISubprogram(name: "displaySlice", linkageName: "_ZN4Page12displaySliceEP9OutputDevddibbiiiibPFbPvES2_PFbP5AnnotS2_ES2_", scope: !685, file: !686, line: 225, type: !887, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !791, !874, !196, !196, !46, !163, !163, !46, !46, !46, !46, !163, !877, !101, !883, !101}
!889 = !DISubprogram(name: "display", linkageName: "_ZN4Page7displayEP3Gfx", scope: !685, file: !686, line: 234, type: !890, scopeLine: 234, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !791, !872}
!892 = !DISubprogram(name: "makeBox", linkageName: "_ZN4Page7makeBoxEddibbddddP12PDFRectanglePb", scope: !685, file: !686, line: 236, type: !893, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !791, !196, !196, !46, !163, !163, !196, !196, !196, !196, !720, !557}
!895 = !DISubprogram(name: "processLinks", linkageName: "_ZN4Page12processLinksEP9OutputDev", scope: !685, file: !686, line: 241, type: !896, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !791, !874}
!898 = !DISubprogram(name: "getDefaultCTM", linkageName: "_ZN4Page13getDefaultCTMEPdddibb", scope: !685, file: !686, line: 244, type: !899, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !791, !901, !196, !196, !46, !163, !163}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !36, file: !37, line: 322, baseType: !163, size: 8, offset: 768)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "errCode", scope: !36, file: !37, line: 323, baseType: !46, size: 32, offset: 800)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fopenErrno", scope: !36, file: !37, line: 326, baseType: !46, size: 32, offset: 832)
