; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%class.GooString = type { [24 x i8], i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._cairo_surface = type opaque
%struct.ArgDesc = type { i8*, i32, i8*, i32, i8* }
%class.GlobalParams = type { %class.NameToCharCode*, %class.NameToCharCode*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooList*, i8, %class.GooHash*, %class.GooList*, %class.GooHash*, %class.SysFontList*, %class.GooString*, i8, i8, i8, i32, %class.GooHash*, %class.GooList*, %class.GooList*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, double, i8, %class.GooString*, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, double, double, double, double, i8, i8, i8, i8, i8, i8, double, %class.CharCodeToUnicodeCache*, %class.CharCodeToUnicodeCache*, %class.UnicodeMapCache*, %class.CMapCache*, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, i8* }
%class.NameToCharCode = type opaque
%class.SysFontList = type opaque
%class.GooHash = type opaque
%class.GooList = type opaque
%class.CharCodeToUnicodeCache = type opaque

!14 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "Format", scope: !16, file: !15, line: 36, baseType: !8, size: 32, elements: !17, identifier: "_ZTSN10JpegWriter6FormatE")
!15 = !DIFile(filename: "../goo/JpegWriter.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!16 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "JpegWriter", file: !15, line: 29, flags: DIFlagFwdDecl, identifier: "_ZTS10JpegWriter")
!17 = !{!10, !18, !19}
!18 = !DIEnumerator(name: "GRAY", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "CMYK", value: 2, isUnsigned: true)
!20 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjType", file: !21, line: 75, baseType: !8, size: 32, elements: !22, identifier: "_ZTS7ObjType")
!21 = !DIFile(filename: "../poppler/Object.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!23 = !DIEnumerator(name: "objBool", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "objInt", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "objReal", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "objString", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "objName", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "objNull", value: 5, isUnsigned: true)
!29 = !DIEnumerator(name: "objArray", value: 6, isUnsigned: true)
!30 = !DIEnumerator(name: "objDict", value: 7, isUnsigned: true)
!31 = !DIEnumerator(name: "objStream", value: 8, isUnsigned: true)
!32 = !DIEnumerator(name: "objRef", value: 9, isUnsigned: true)
!33 = !DIEnumerator(name: "objCmd", value: 10, isUnsigned: true)
!34 = !DIEnumerator(name: "objError", value: 11, isUnsigned: true)
!35 = !DIEnumerator(name: "objEOF", value: 12, isUnsigned: true)
!36 = !DIEnumerator(name: "objNone", value: 13, isUnsigned: true)
!37 = !DIEnumerator(name: "objUint", value: 14, isUnsigned: true)
!38 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "CryptAlgorithm", file: !39, line: 74, baseType: !8, size: 32, elements: !40, identifier: "_ZTS14CryptAlgorithm")
!39 = !DIFile(filename: "../poppler/Stream.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "cryptRC4", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "cryptAES", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "cryptAES256", value: 2, isUnsigned: true)
!44 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "PageMode", scope: !46, file: !45, line: 169, baseType: !8, size: 32, elements: !1292, identifier: "_ZTSN7Catalog8PageModeE")
!45 = !DIFile(filename: "../poppler/Catalog.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!46 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Catalog", file: !45, line: 94, size: 2176, flags: DIFlagTypePassByReference, elements: !47, identifier: "_ZTS7Catalog")
!47 = !{!48, !1118, !1119, !1120, !1121, !1122, !1125, !1128, !1131, !1132, !1133, !1136, !1137, !1138, !1139, !1140, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1191, !1192, !1203, !1207, !1210, !1213, !1216, !1219, !1222, !1225, !1226, !1229, !1232, !1235, !1236, !1237, !1242, !1243, !1246, !1249, !1252, !1253, !1254, !1257, !1265, !1268, !1271, !1274, !1277, !1280, !1283, !1286, !1287, !1290, !1291}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !46, file: !45, line: 198, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFDoc", file: !51, line: 69, size: 896, flags: DIFlagTypePassByReference, elements: !52, identifier: "_ZTS6PDFDoc")
!51 = !DIFile(filename: "../poppler/PDFDoc.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!52 = !{!53, !206, !212, !215, !217, !218, !219, !222, !680, !683, !685, !688, !691, !911, !912, !913, !914, !915, !919, !922, !925, !928, !931, !934, !935, !938, !941, !944, !947, !953, !956, !959, !960, !961, !962, !965, !966, !967, !970, !973, !976, !979, !982, !985, !988, !993, !996, !999, !1000, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1014, !1015, !1016, !1017, !1020, !1023, !1031, !1034, !1037, !1040, !1043, !1046, !1049, !1052, !1055, !1058, !1062, !1065, !1068, !1069, !1072, !1075, !1078, !1081, !1084, !1087, !1090, !1091, !1094, !1097, !1100, !1101, !1102, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1114, !1115}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !50, file: !51, line: 303, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GooString", file: !56, line: 40, size: 320, flags: DIFlagTypePassByReference, elements: !57, identifier: "_ZTS9GooString")
!56 = !DIFile(filename: "../goo/GooString.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!57 = !{!58, !61, !62, !67, !68, !70, !74, !79, !82, !85, !88, !93, !97, !100, !103, !106, !111, !112, !115, !118, !121, !124, !127, !130, !133, !136, !139, !142, !145, !148, !151, !154, !155, !156, !159, !162, !165, !168, !174, !177, !181, !185, !188, !191, !197, !201, !205}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "STR_STATIC_SIZE", scope: !55, file: !56, line: 159, baseType: !59, flags: DIFlagStaticMember, extraData: i32 24)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "CALC_STRING_LEN", scope: !55, file: !56, line: 162, baseType: !59, flags: DIFlagStaticMember, extraData: i32 -1)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sStatic", scope: !55, file: !56, line: 166, baseType: !63, size: 192)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !65)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !{!66}
!66 = !DISubrange(count: 24)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !55, file: !56, line: 167, baseType: !60, size: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !55, file: !56, line: 168, baseType: !69, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!70 = !DISubprogram(name: "GooString", scope: !55, file: !56, line: 44, type: !71, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!74 = !DISubprogram(name: "GooString", scope: !55, file: !56, line: 47, type: !75, scopeLine: 47, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !73, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!79 = !DISubprogram(name: "GooString", scope: !55, file: !56, line: 51, type: !80, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !73, !77, !60}
!82 = !DISubprogram(name: "GooString", scope: !55, file: !56, line: 54, type: !83, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !73, !54, !60, !60}
!85 = !DISubprogram(name: "Set", linkageName: "_ZN9GooString3SetEPKciS1_i", scope: !55, file: !56, line: 60, type: !86, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!86 = !DISubroutineType(types: !87)
!87 = !{!54, !73, !77, !60, !77, !60}
!88 = !DISubprogram(name: "GooString", scope: !55, file: !56, line: 63, type: !89, scopeLine: 63, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !73, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!93 = !DISubprogram(name: "copy", linkageName: "_ZNK9GooString4copyEv", scope: !55, file: !56, line: 64, type: !94, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!94 = !DISubroutineType(types: !95)
!95 = !{!54, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "GooString", scope: !55, file: !56, line: 67, type: !98, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !73, !54, !54}
!100 = !DISubprogram(name: "fromInt", linkageName: "_ZN9GooString7fromIntEi", scope: !55, file: !56, line: 70, type: !101, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!101 = !DISubroutineType(types: !102)
!102 = !{!54, !60}
!103 = !DISubprogram(name: "format", linkageName: "_ZN9GooString6formatEPKcz", scope: !55, file: !56, line: 95, type: !104, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!104 = !DISubroutineType(types: !105)
!105 = !{!54, !77, null}
!106 = !DISubprogram(name: "formatv", linkageName: "_ZN9GooString7formatvEPKcP13__va_list_tag", scope: !55, file: !56, line: 96, type: !107, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!107 = !DISubroutineType(types: !108)
!108 = !{!54, !77, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 101, flags: DIFlagFwdDecl, identifier: "_ZTS13__va_list_tag")
!111 = !DISubprogram(name: "~GooString", scope: !55, file: !56, line: 99, type: !71, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!112 = !DISubprogram(name: "getLength", linkageName: "_ZN9GooString9getLengthEv", scope: !55, file: !56, line: 102, type: !113, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!113 = !DISubroutineType(types: !114)
!114 = !{!60, !73}
!115 = !DISubprogram(name: "getCString", linkageName: "_ZNK9GooString10getCStringEv", scope: !55, file: !56, line: 105, type: !116, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!116 = !DISubroutineType(types: !117)
!117 = !{!69, !96}
!118 = !DISubprogram(name: "getChar", linkageName: "_ZN9GooString7getCharEi", scope: !55, file: !56, line: 108, type: !119, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!119 = !DISubroutineType(types: !120)
!120 = !{!64, !73, !60}
!121 = !DISubprogram(name: "setChar", linkageName: "_ZN9GooString7setCharEic", scope: !55, file: !56, line: 111, type: !122, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !73, !60, !64}
!124 = !DISubprogram(name: "clear", linkageName: "_ZN9GooString5clearEv", scope: !55, file: !56, line: 114, type: !125, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!125 = !DISubroutineType(types: !126)
!126 = !{!54, !73}
!127 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEc", scope: !55, file: !56, line: 117, type: !128, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!128 = !DISubroutineType(types: !129)
!129 = !{!54, !73, !64}
!130 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPS_", scope: !55, file: !56, line: 118, type: !131, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!131 = !DISubroutineType(types: !132)
!132 = !{!54, !73, !54}
!133 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPKci", scope: !55, file: !56, line: 119, type: !134, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!134 = !DISubroutineType(types: !135)
!135 = !{!54, !73, !77, !60}
!136 = !DISubprogram(name: "appendf", linkageName: "_ZN9GooString7appendfEPKcz", scope: !55, file: !56, line: 122, type: !137, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!137 = !DISubroutineType(types: !138)
!138 = !{!54, !73, !77, null}
!139 = !DISubprogram(name: "appendfv", linkageName: "_ZN9GooString8appendfvEPKcP13__va_list_tag", scope: !55, file: !56, line: 123, type: !140, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!140 = !DISubroutineType(types: !141)
!141 = !{!54, !73, !77, !109}
!142 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEic", scope: !55, file: !56, line: 126, type: !143, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!143 = !DISubroutineType(types: !144)
!144 = !{!54, !73, !60, !64}
!145 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPS_", scope: !55, file: !56, line: 127, type: !146, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!146 = !DISubroutineType(types: !147)
!147 = !{!54, !73, !60, !54}
!148 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPKci", scope: !55, file: !56, line: 128, type: !149, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!149 = !DISubroutineType(types: !150)
!150 = !{!54, !73, !60, !77, !60}
!151 = !DISubprogram(name: "del", linkageName: "_ZN9GooString3delEii", scope: !55, file: !56, line: 131, type: !152, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!152 = !DISubroutineType(types: !153)
!153 = !{!54, !73, !60, !60}
!154 = !DISubprogram(name: "upperCase", linkageName: "_ZN9GooString9upperCaseEv", scope: !55, file: !56, line: 134, type: !125, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!155 = !DISubprogram(name: "lowerCase", linkageName: "_ZN9GooString9lowerCaseEv", scope: !55, file: !56, line: 135, type: !125, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!156 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPS_", scope: !55, file: !56, line: 138, type: !157, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!157 = !DISubroutineType(types: !158)
!158 = !{!60, !96, !54}
!159 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPS_i", scope: !55, file: !56, line: 139, type: !160, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!160 = !DISubroutineType(types: !161)
!161 = !{!60, !96, !54, !60}
!162 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPKc", scope: !55, file: !56, line: 140, type: !163, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!163 = !DISubroutineType(types: !164)
!164 = !{!60, !96, !77}
!165 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPKci", scope: !55, file: !56, line: 141, type: !166, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!166 = !DISubroutineType(types: !167)
!167 = !{!60, !96, !77, !60}
!168 = !DISubprogram(name: "hasUnicodeMarker", linkageName: "_ZN9GooString16hasUnicodeMarkerEv", scope: !55, file: !56, line: 143, type: !169, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !73}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GBool", file: !172, line: 31, baseType: !173)
!172 = !DIFile(filename: "../goo/gtypes.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!173 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!174 = !DISubprogram(name: "sanitizedName", linkageName: "_ZN9GooString13sanitizedNameEb", scope: !55, file: !56, line: 149, type: !175, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!175 = !DISubroutineType(types: !176)
!176 = !{!54, !73, !171}
!177 = !DISubprogram(name: "GooString", scope: !55, file: !56, line: 152, type: !178, scopeLine: 152, flags: DIFlagPrototyped, spFlags: 0)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !73, !180}
!180 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !92, size: 64)
!181 = !DISubprogram(name: "operator=", linkageName: "_ZN9GooStringaSERKS_", scope: !55, file: !56, line: 153, type: !182, scopeLine: 153, flags: DIFlagPrototyped, spFlags: 0)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !73, !180}
!184 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !55, size: 64)
!185 = !DISubprogram(name: "roundedSize", linkageName: "_ZN9GooString11roundedSizeEi", scope: !55, file: !56, line: 164, type: !186, scopeLine: 164, flags: DIFlagPrototyped, spFlags: 0)
!186 = !DISubroutineType(types: !187)
!187 = !{!60, !73, !60}
!188 = !DISubprogram(name: "resize", linkageName: "_ZN9GooString6resizeEi", scope: !55, file: !56, line: 170, type: !189, scopeLine: 170, flags: DIFlagPrototyped, spFlags: 0)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !73, !60}
!191 = !DISubprogram(name: "formatInt", linkageName: "_ZN9GooString9formatIntExPcibiiPS0_Pib", scope: !55, file: !56, line: 172, type: !192, scopeLine: 172, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !69, !60, !171, !60, !60, !195, !196, !171}
!194 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!197 = !DISubprogram(name: "formatUInt", linkageName: "_ZN9GooString10formatUIntEyPcibiiPS0_Pib", scope: !55, file: !56, line: 181, type: !198, scopeLine: 181, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !200, !69, !60, !171, !60, !60, !195, !196, !171}
!200 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!201 = !DISubprogram(name: "formatDouble", linkageName: "_ZN9GooString12formatDoubleEdPciibPS0_Pi", scope: !55, file: !56, line: 189, type: !202, scopeLine: 189, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !204, !69, !60, !60, !171, !195, !196}
!204 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!205 = !DISubprogram(name: "formatDoubleSmallAware", linkageName: "_ZN9GooString22formatDoubleSmallAwareEdPciibPS0_Pi", scope: !55, file: !56, line: 191, type: !202, scopeLine: 191, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !50, file: !51, line: 307, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !209, line: 48, baseType: !210)
!209 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !211, line: 241, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!211 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !50, file: !51, line: 308, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseStream", file: !39, line: 297, flags: DIFlagFwdDecl, identifier: "_ZTS10BaseStream")
!215 = !DIDerivedType(tag: DW_TAG_member, name: "guiData", scope: !50, file: !51, line: 309, baseType: !216, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMajorVersion", scope: !50, file: !51, line: 310, baseType: !60, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMinorVersion", scope: !50, file: !51, line: 311, baseType: !60, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "linearization", scope: !50, file: !51, line: 312, baseType: !220, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Linearization", file: !51, line: 55, flags: DIFlagFwdDecl, identifier: "_ZTS13Linearization")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !50, file: !51, line: 313, baseType: !223, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRef", file: !225, line: 90, size: 1344, flags: DIFlagTypePassByReference, elements: !226, identifier: "_ZTS4XRef")
!225 = !DIFile(filename: "../poppler/XRef.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!226 = !{!227, !228, !230, !233, !234, !235, !236, !237, !238, !239, !534, !536, !537, !540, !541, !542, !543, !544, !545, !546, !550, !551, !552, !553, !554, !555, !556, !560, !563, !567, !568, !571, !572, !575, !578, !579, !584, !585, !588, !589, !590, !591, !592, !593, !594, !595, !596, !599, !602, !603, !604, !605, !606, !607, !610, !613, !614, !617, !620, !623, !626, !629, !632, !637, !640, !641, !644, !645, !654, !659, !662, !665, !668, !671, !674, !675}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !224, file: !225, line: 185, baseType: !213, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !224, file: !225, line: 186, baseType: !229, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guint", file: !172, line: 45, baseType: !8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !224, file: !225, line: 188, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XRefEntry", file: !225, line: 59, flags: DIFlagFwdDecl, identifier: "_ZTS9XRefEntry")
!233 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !224, file: !225, line: 189, baseType: !60, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !224, file: !225, line: 190, baseType: !60, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "rootNum", scope: !224, file: !225, line: 191, baseType: !60, size: 32, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rootGen", scope: !224, file: !225, line: 191, baseType: !60, size: 32, offset: 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !224, file: !225, line: 192, baseType: !171, size: 8, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "errCode", scope: !224, file: !225, line: 193, baseType: !60, size: 32, offset: 352)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "trailerDict", scope: !224, file: !225, line: 194, baseType: !240, size: 128, offset: 384)
!240 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Object", file: !21, line: 112, size: 128, flags: DIFlagTypePassByValue, elements: !241, identifier: "_ZTS6Object")
!241 = !{!242, !243, !361, !365, !366, !369, !372, !375, !378, !381, !384, !387, !388, !391, !394, !397, !400, !401, !402, !405, !408, !409, !412, !413, !416, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !437, !438, !441, !442, !443, !446, !449, !450, !453, !456, !459, !462, !465, !468, !469, !470, !471, !474, !475, !478, !481, !484, !485, !486, !489, !492, !493, !496, !499, !502, !503, !504, !505, !506, !507, !508, !514, !515, !518, !521, !524, !525, !528, !531}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !21, line: 245, baseType: !20, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !240, file: !21, line: 246, baseType: !244, size: 64, offset: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !240, file: !21, line: 246, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !245, identifier: "_ZTSN6ObjectUt_E")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !288, !352, !355, !360}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "booln", scope: !244, file: !21, line: 247, baseType: !171, size: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intg", scope: !244, file: !21, line: 248, baseType: !60, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "uintg", scope: !244, file: !21, line: 249, baseType: !8, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !244, file: !21, line: 250, baseType: !204, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !244, file: !21, line: 251, baseType: !54, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !21, line: 252, baseType: !69, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !244, file: !21, line: 253, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Array", file: !255, line: 39, size: 256, flags: DIFlagTypePassByReference, elements: !256, identifier: "_ZTS5Array")
!255 = !DIFile(filename: "../poppler/Array.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!256 = !{!257, !258, !260, !261, !262, !263, !267, !270, !273, !274, !275, !278, !281, !284, !285}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !254, file: !255, line: 68, baseType: !223, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !254, file: !255, line: 69, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !254, file: !255, line: 70, baseType: !60, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !254, file: !255, line: 71, baseType: !60, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !254, file: !255, line: 72, baseType: !60, size: 32, offset: 192)
!263 = !DISubprogram(name: "Array", scope: !254, file: !255, line: 43, type: !264, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266, !223}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!267 = !DISubprogram(name: "~Array", scope: !254, file: !255, line: 46, type: !268, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !266}
!270 = !DISubprogram(name: "incRef", linkageName: "_ZN5Array6incRefEv", scope: !254, file: !255, line: 49, type: !271, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!271 = !DISubroutineType(types: !272)
!272 = !{!60, !266}
!273 = !DISubprogram(name: "decRef", linkageName: "_ZN5Array6decRefEv", scope: !254, file: !255, line: 50, type: !271, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!274 = !DISubprogram(name: "getLength", linkageName: "_ZN5Array9getLengthEv", scope: !254, file: !255, line: 53, type: !271, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!275 = !DISubprogram(name: "add", linkageName: "_ZN5Array3addEP6Object", scope: !254, file: !255, line: 56, type: !276, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !266, !259}
!278 = !DISubprogram(name: "remove", linkageName: "_ZN5Array6removeEi", scope: !254, file: !255, line: 59, type: !279, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !266, !60}
!281 = !DISubprogram(name: "get", linkageName: "_ZN5Array3getEiP6Object", scope: !254, file: !255, line: 62, type: !282, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!282 = !DISubroutineType(types: !283)
!283 = !{!259, !266, !60, !259}
!284 = !DISubprogram(name: "getNF", linkageName: "_ZN5Array5getNFEiP6Object", scope: !254, file: !255, line: 63, type: !282, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!285 = !DISubprogram(name: "getString", linkageName: "_ZN5Array9getStringEiP9GooString", scope: !254, file: !255, line: 64, type: !286, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{!171, !266, !60, !54}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !244, file: !21, line: 254, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Dict", file: !291, line: 45, size: 320, flags: DIFlagTypePassByReference, elements: !292, identifier: "_ZTS4Dict")
!291 = !DIFile(filename: "../poppler/Dict.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!292 = !{!293, !294, !295, !298, !299, !300, !301, !305, !308, !311, !314, !315, !316, !319, !322, !325, !328, !331, !334, !337, !340, !343, !344, !345, !348, !349}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !290, file: !291, line: 95, baseType: !171, size: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !290, file: !291, line: 96, baseType: !223, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !290, file: !291, line: 97, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DictEntry", file: !291, line: 40, flags: DIFlagFwdDecl, identifier: "_ZTS9DictEntry")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !290, file: !291, line: 98, baseType: !60, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !290, file: !291, line: 99, baseType: !60, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !290, file: !291, line: 100, baseType: !60, size: 32, offset: 256)
!301 = !DISubprogram(name: "Dict", scope: !290, file: !291, line: 49, type: !302, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304, !223}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!305 = !DISubprogram(name: "Dict", scope: !290, file: !291, line: 50, type: !306, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !304, !289}
!308 = !DISubprogram(name: "~Dict", scope: !290, file: !291, line: 53, type: !309, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !304}
!311 = !DISubprogram(name: "incRef", linkageName: "_ZN4Dict6incRefEv", scope: !290, file: !291, line: 56, type: !312, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!312 = !DISubroutineType(types: !313)
!313 = !{!60, !304}
!314 = !DISubprogram(name: "decRef", linkageName: "_ZN4Dict6decRefEv", scope: !290, file: !291, line: 57, type: !312, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!315 = !DISubprogram(name: "getLength", linkageName: "_ZN4Dict9getLengthEv", scope: !290, file: !291, line: 60, type: !312, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!316 = !DISubprogram(name: "add", linkageName: "_ZN4Dict3addEPcP6Object", scope: !290, file: !291, line: 63, type: !317, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !304, !69, !259}
!319 = !DISubprogram(name: "set", linkageName: "_ZN4Dict3setEPKcP6Object", scope: !290, file: !291, line: 66, type: !320, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !304, !77, !259}
!322 = !DISubprogram(name: "remove", linkageName: "_ZN4Dict6removeEPKc", scope: !290, file: !291, line: 68, type: !323, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !304, !77}
!325 = !DISubprogram(name: "is", linkageName: "_ZN4Dict2isEPKc", scope: !290, file: !291, line: 71, type: !326, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!326 = !DISubroutineType(types: !327)
!327 = !{!171, !304, !77}
!328 = !DISubprogram(name: "lookup", linkageName: "_ZN4Dict6lookupEPKcP6Objecti", scope: !290, file: !291, line: 75, type: !329, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!329 = !DISubroutineType(types: !330)
!330 = !{!259, !304, !77, !259, !60}
!331 = !DISubprogram(name: "lookupNF", linkageName: "_ZN4Dict8lookupNFEPKcP6Object", scope: !290, file: !291, line: 76, type: !332, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!332 = !DISubroutineType(types: !333)
!333 = !{!259, !304, !77, !259}
!334 = !DISubprogram(name: "lookupInt", linkageName: "_ZN4Dict9lookupIntEPKcS1_Pi", scope: !290, file: !291, line: 77, type: !335, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!335 = !DISubroutineType(types: !336)
!336 = !{!171, !304, !77, !77, !196}
!337 = !DISubprogram(name: "getKey", linkageName: "_ZN4Dict6getKeyEi", scope: !290, file: !291, line: 80, type: !338, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!338 = !DISubroutineType(types: !339)
!339 = !{!69, !304, !60}
!340 = !DISubprogram(name: "getVal", linkageName: "_ZN4Dict6getValEiP6Object", scope: !290, file: !291, line: 81, type: !341, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!341 = !DISubroutineType(types: !342)
!342 = !{!259, !304, !60, !259}
!343 = !DISubprogram(name: "getValNF", linkageName: "_ZN4Dict8getValNFEiP6Object", scope: !290, file: !291, line: 82, type: !341, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!344 = !DISubprogram(name: "setXRef", linkageName: "_ZN4Dict7setXRefEP4XRef", scope: !290, file: !291, line: 87, type: !302, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!345 = !DISubprogram(name: "getXRef", linkageName: "_ZN4Dict7getXRefEv", scope: !290, file: !291, line: 89, type: !346, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!346 = !DISubroutineType(types: !347)
!347 = !{!223, !304}
!348 = !DISubprogram(name: "hasKey", linkageName: "_ZN4Dict6hasKeyEPKc", scope: !290, file: !291, line: 91, type: !326, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!349 = !DISubprogram(name: "find", linkageName: "_ZN4Dict4findEPKc", scope: !290, file: !291, line: 102, type: !350, scopeLine: 102, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DISubroutineType(types: !351)
!351 = !{!296, !304, !77}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !244, file: !21, line: 255, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stream", file: !39, line: 91, flags: DIFlagFwdDecl, identifier: "_ZTS6Stream")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !244, file: !21, line: 256, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ref", file: !21, line: 66, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !357, identifier: "_ZTS3Ref")
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !356, file: !21, line: 67, baseType: !60, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gen", scope: !356, file: !21, line: 68, baseType: !60, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !244, file: !21, line: 257, baseType: !69, size: 64)
!361 = !DISubprogram(name: "zeroUnion", linkageName: "_ZN6Object9zeroUnionEv", scope: !240, file: !21, line: 115, type: !362, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!365 = !DISubprogram(name: "Object", scope: !240, file: !21, line: 118, type: !362, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!366 = !DISubprogram(name: "initBool", linkageName: "_ZN6Object8initBoolEb", scope: !240, file: !21, line: 122, type: !367, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!259, !364, !171}
!369 = !DISubprogram(name: "initInt", linkageName: "_ZN6Object7initIntEi", scope: !240, file: !21, line: 124, type: !370, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{!259, !364, !60}
!372 = !DISubprogram(name: "initReal", linkageName: "_ZN6Object8initRealEd", scope: !240, file: !21, line: 126, type: !373, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!373 = !DISubroutineType(types: !374)
!374 = !{!259, !364, !204}
!375 = !DISubprogram(name: "initString", linkageName: "_ZN6Object10initStringEP9GooString", scope: !240, file: !21, line: 128, type: !376, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!376 = !DISubroutineType(types: !377)
!377 = !{!259, !364, !54}
!378 = !DISubprogram(name: "initName", linkageName: "_ZN6Object8initNameEPKc", scope: !240, file: !21, line: 130, type: !379, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!379 = !DISubroutineType(types: !380)
!380 = !{!259, !364, !77}
!381 = !DISubprogram(name: "initNull", linkageName: "_ZN6Object8initNullEv", scope: !240, file: !21, line: 132, type: !382, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!382 = !DISubroutineType(types: !383)
!383 = !{!259, !364}
!384 = !DISubprogram(name: "initArray", linkageName: "_ZN6Object9initArrayEP4XRef", scope: !240, file: !21, line: 134, type: !385, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!385 = !DISubroutineType(types: !386)
!386 = !{!259, !364, !223}
!387 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4XRef", scope: !240, file: !21, line: 135, type: !385, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!388 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4Dict", scope: !240, file: !21, line: 136, type: !389, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!389 = !DISubroutineType(types: !390)
!390 = !{!259, !364, !289}
!391 = !DISubprogram(name: "initStream", linkageName: "_ZN6Object10initStreamEP6Stream", scope: !240, file: !21, line: 137, type: !392, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!392 = !DISubroutineType(types: !393)
!393 = !{!259, !364, !353}
!394 = !DISubprogram(name: "initRef", linkageName: "_ZN6Object7initRefEii", scope: !240, file: !21, line: 138, type: !395, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!395 = !DISubroutineType(types: !396)
!396 = !{!259, !364, !60, !60}
!397 = !DISubprogram(name: "initCmd", linkageName: "_ZN6Object7initCmdEPc", scope: !240, file: !21, line: 140, type: !398, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!259, !364, !69}
!400 = !DISubprogram(name: "initError", linkageName: "_ZN6Object9initErrorEv", scope: !240, file: !21, line: 142, type: !382, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!401 = !DISubprogram(name: "initEOF", linkageName: "_ZN6Object7initEOFEv", scope: !240, file: !21, line: 144, type: !382, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubprogram(name: "initUint", linkageName: "_ZN6Object8initUintEj", scope: !240, file: !21, line: 146, type: !403, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!403 = !DISubroutineType(types: !404)
!404 = !{!259, !364, !8}
!405 = !DISubprogram(name: "copy", linkageName: "_ZN6Object4copyEPS_", scope: !240, file: !21, line: 150, type: !406, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{!259, !364, !259}
!408 = !DISubprogram(name: "shallowCopy", linkageName: "_ZN6Object11shallowCopyEPS_", scope: !240, file: !21, line: 151, type: !406, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!409 = !DISubprogram(name: "fetch", linkageName: "_ZN6Object5fetchEP4XRefPS_i", scope: !240, file: !21, line: 158, type: !410, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!410 = !DISubroutineType(types: !411)
!411 = !{!259, !364, !223, !259, !60}
!412 = !DISubprogram(name: "free", linkageName: "_ZN6Object4freeEv", scope: !240, file: !21, line: 161, type: !362, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!413 = !DISubprogram(name: "getType", linkageName: "_ZN6Object7getTypeEv", scope: !240, file: !21, line: 164, type: !414, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!414 = !DISubroutineType(types: !415)
!415 = !{!20, !364}
!416 = !DISubprogram(name: "isBool", linkageName: "_ZN6Object6isBoolEv", scope: !240, file: !21, line: 165, type: !417, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!417 = !DISubroutineType(types: !418)
!418 = !{!171, !364}
!419 = !DISubprogram(name: "isInt", linkageName: "_ZN6Object5isIntEv", scope: !240, file: !21, line: 166, type: !417, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!420 = !DISubprogram(name: "isReal", linkageName: "_ZN6Object6isRealEv", scope: !240, file: !21, line: 167, type: !417, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!421 = !DISubprogram(name: "isNum", linkageName: "_ZN6Object5isNumEv", scope: !240, file: !21, line: 168, type: !417, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!422 = !DISubprogram(name: "isString", linkageName: "_ZN6Object8isStringEv", scope: !240, file: !21, line: 169, type: !417, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!423 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEv", scope: !240, file: !21, line: 170, type: !417, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!424 = !DISubprogram(name: "isNull", linkageName: "_ZN6Object6isNullEv", scope: !240, file: !21, line: 171, type: !417, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!425 = !DISubprogram(name: "isArray", linkageName: "_ZN6Object7isArrayEv", scope: !240, file: !21, line: 172, type: !417, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!426 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEv", scope: !240, file: !21, line: 173, type: !417, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!427 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEv", scope: !240, file: !21, line: 174, type: !417, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!428 = !DISubprogram(name: "isRef", linkageName: "_ZN6Object5isRefEv", scope: !240, file: !21, line: 175, type: !417, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!429 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEv", scope: !240, file: !21, line: 176, type: !417, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!430 = !DISubprogram(name: "isError", linkageName: "_ZN6Object7isErrorEv", scope: !240, file: !21, line: 177, type: !417, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!431 = !DISubprogram(name: "isEOF", linkageName: "_ZN6Object5isEOFEv", scope: !240, file: !21, line: 178, type: !417, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!432 = !DISubprogram(name: "isNone", linkageName: "_ZN6Object6isNoneEv", scope: !240, file: !21, line: 179, type: !417, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!433 = !DISubprogram(name: "isUint", linkageName: "_ZN6Object6isUintEv", scope: !240, file: !21, line: 180, type: !417, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!434 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEPKc", scope: !240, file: !21, line: 183, type: !435, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!171, !364, !77}
!437 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEPKc", scope: !240, file: !21, line: 185, type: !435, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!438 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEPc", scope: !240, file: !21, line: 186, type: !439, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!171, !364, !69}
!441 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEPKc", scope: !240, file: !21, line: 187, type: !435, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!442 = !DISubprogram(name: "getBool", linkageName: "_ZN6Object7getBoolEv", scope: !240, file: !21, line: 191, type: !417, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!443 = !DISubprogram(name: "getInt", linkageName: "_ZN6Object6getIntEv", scope: !240, file: !21, line: 192, type: !444, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!444 = !DISubroutineType(types: !445)
!445 = !{!60, !364}
!446 = !DISubprogram(name: "getReal", linkageName: "_ZN6Object7getRealEv", scope: !240, file: !21, line: 193, type: !447, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!447 = !DISubroutineType(types: !448)
!448 = !{!204, !364}
!449 = !DISubprogram(name: "getNum", linkageName: "_ZN6Object6getNumEv", scope: !240, file: !21, line: 194, type: !447, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!450 = !DISubprogram(name: "getString", linkageName: "_ZN6Object9getStringEv", scope: !240, file: !21, line: 195, type: !451, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!54, !364}
!453 = !DISubprogram(name: "getName", linkageName: "_ZN6Object7getNameEv", scope: !240, file: !21, line: 196, type: !454, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!454 = !DISubroutineType(types: !455)
!455 = !{!69, !364}
!456 = !DISubprogram(name: "getArray", linkageName: "_ZN6Object8getArrayEv", scope: !240, file: !21, line: 197, type: !457, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!457 = !DISubroutineType(types: !458)
!458 = !{!253, !364}
!459 = !DISubprogram(name: "getDict", linkageName: "_ZN6Object7getDictEv", scope: !240, file: !21, line: 198, type: !460, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{!289, !364}
!462 = !DISubprogram(name: "getStream", linkageName: "_ZN6Object9getStreamEv", scope: !240, file: !21, line: 199, type: !463, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!463 = !DISubroutineType(types: !464)
!464 = !{!353, !364}
!465 = !DISubprogram(name: "getRef", linkageName: "_ZN6Object6getRefEv", scope: !240, file: !21, line: 200, type: !466, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!466 = !DISubroutineType(types: !467)
!467 = !{!356, !364}
!468 = !DISubprogram(name: "getRefNum", linkageName: "_ZN6Object9getRefNumEv", scope: !240, file: !21, line: 201, type: !444, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!469 = !DISubprogram(name: "getRefGen", linkageName: "_ZN6Object9getRefGenEv", scope: !240, file: !21, line: 202, type: !444, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!470 = !DISubprogram(name: "getCmd", linkageName: "_ZN6Object6getCmdEv", scope: !240, file: !21, line: 203, type: !454, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!471 = !DISubprogram(name: "getUint", linkageName: "_ZN6Object7getUintEv", scope: !240, file: !21, line: 204, type: !472, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!472 = !DISubroutineType(types: !473)
!473 = !{!8, !364}
!474 = !DISubprogram(name: "arrayGetLength", linkageName: "_ZN6Object14arrayGetLengthEv", scope: !240, file: !21, line: 207, type: !444, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!475 = !DISubprogram(name: "arrayAdd", linkageName: "_ZN6Object8arrayAddEPS_", scope: !240, file: !21, line: 208, type: !476, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !364, !259}
!478 = !DISubprogram(name: "arrayRemove", linkageName: "_ZN6Object11arrayRemoveEi", scope: !240, file: !21, line: 209, type: !479, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !364, !60}
!481 = !DISubprogram(name: "arrayGet", linkageName: "_ZN6Object8arrayGetEiPS_", scope: !240, file: !21, line: 210, type: !482, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!482 = !DISubroutineType(types: !483)
!483 = !{!259, !364, !60, !259}
!484 = !DISubprogram(name: "arrayGetNF", linkageName: "_ZN6Object10arrayGetNFEiPS_", scope: !240, file: !21, line: 211, type: !482, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!485 = !DISubprogram(name: "dictGetLength", linkageName: "_ZN6Object13dictGetLengthEv", scope: !240, file: !21, line: 214, type: !444, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!486 = !DISubprogram(name: "dictAdd", linkageName: "_ZN6Object7dictAddEPcPS_", scope: !240, file: !21, line: 215, type: !487, scopeLine: 215, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !364, !69, !259}
!489 = !DISubprogram(name: "dictSet", linkageName: "_ZN6Object7dictSetEPKcPS_", scope: !240, file: !21, line: 216, type: !490, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !364, !77, !259}
!492 = !DISubprogram(name: "dictIs", linkageName: "_ZN6Object6dictIsEPKc", scope: !240, file: !21, line: 217, type: !435, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!493 = !DISubprogram(name: "dictLookup", linkageName: "_ZN6Object10dictLookupEPKcPS_i", scope: !240, file: !21, line: 218, type: !494, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!494 = !DISubroutineType(types: !495)
!495 = !{!259, !364, !77, !259, !60}
!496 = !DISubprogram(name: "dictLookupNF", linkageName: "_ZN6Object12dictLookupNFEPKcPS_", scope: !240, file: !21, line: 219, type: !497, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{!259, !364, !77, !259}
!499 = !DISubprogram(name: "dictGetKey", linkageName: "_ZN6Object10dictGetKeyEi", scope: !240, file: !21, line: 220, type: !500, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!500 = !DISubroutineType(types: !501)
!501 = !{!69, !364, !60}
!502 = !DISubprogram(name: "dictGetVal", linkageName: "_ZN6Object10dictGetValEiPS_", scope: !240, file: !21, line: 221, type: !482, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!503 = !DISubprogram(name: "dictGetValNF", linkageName: "_ZN6Object12dictGetValNFEiPS_", scope: !240, file: !21, line: 222, type: !482, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!504 = !DISubprogram(name: "streamIs", linkageName: "_ZN6Object8streamIsEPc", scope: !240, file: !21, line: 225, type: !439, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!505 = !DISubprogram(name: "streamReset", linkageName: "_ZN6Object11streamResetEv", scope: !240, file: !21, line: 226, type: !362, scopeLine: 226, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!506 = !DISubprogram(name: "streamClose", linkageName: "_ZN6Object11streamCloseEv", scope: !240, file: !21, line: 227, type: !362, scopeLine: 227, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!507 = !DISubprogram(name: "streamGetChar", linkageName: "_ZN6Object13streamGetCharEv", scope: !240, file: !21, line: 228, type: !444, scopeLine: 228, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!508 = !DISubprogram(name: "streamGetChars", linkageName: "_ZN6Object14streamGetCharsEiPh", scope: !240, file: !21, line: 229, type: !509, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!509 = !DISubroutineType(types: !510)
!510 = !{!60, !364, !60, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guchar", file: !172, line: 43, baseType: !513)
!513 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!514 = !DISubprogram(name: "streamLookChar", linkageName: "_ZN6Object14streamLookCharEv", scope: !240, file: !21, line: 230, type: !444, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!515 = !DISubprogram(name: "streamGetLine", linkageName: "_ZN6Object13streamGetLineEPci", scope: !240, file: !21, line: 231, type: !516, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!516 = !DISubroutineType(types: !517)
!517 = !{!69, !364, !69, !60}
!518 = !DISubprogram(name: "streamGetPos", linkageName: "_ZN6Object12streamGetPosEv", scope: !240, file: !21, line: 232, type: !519, scopeLine: 232, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!519 = !DISubroutineType(types: !520)
!520 = !{!229, !364}
!521 = !DISubprogram(name: "streamSetPos", linkageName: "_ZN6Object12streamSetPosEji", scope: !240, file: !21, line: 233, type: !522, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !364, !229, !60}
!524 = !DISubprogram(name: "streamGetDict", linkageName: "_ZN6Object13streamGetDictEv", scope: !240, file: !21, line: 234, type: !460, scopeLine: 234, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!525 = !DISubprogram(name: "getTypeName", linkageName: "_ZN6Object11getTypeNameEv", scope: !240, file: !21, line: 237, type: !526, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!77, !364}
!528 = !DISubprogram(name: "print", linkageName: "_ZN6Object5printEP8_IO_FILE", scope: !240, file: !21, line: 238, type: !529, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !364, !207}
!531 = !DISubprogram(name: "memCheck", linkageName: "_ZN6Object8memCheckEP8_IO_FILE", scope: !240, file: !21, line: 241, type: !532, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !207}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "streamEnds", scope: !224, file: !225, line: 195, baseType: !535, size: 64, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "streamEndsLen", scope: !224, file: !225, line: 197, baseType: !60, size: 32, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "objStrs", scope: !224, file: !225, line: 198, baseType: !538, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PopplerCache", file: !225, line: 46, flags: DIFlagFwdDecl, identifier: "_ZTS12PopplerCache")
!540 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !224, file: !225, line: 199, baseType: !171, size: 8, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "encRevision", scope: !224, file: !225, line: 200, baseType: !60, size: 32, offset: 736)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "encVersion", scope: !224, file: !225, line: 201, baseType: !60, size: 32, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "encAlgorithm", scope: !224, file: !225, line: 202, baseType: !38, size: 32, offset: 800)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "keyLength", scope: !224, file: !225, line: 203, baseType: !60, size: 32, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "permFlags", scope: !224, file: !225, line: 204, baseType: !60, size: 32, offset: 864)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fileKey", scope: !224, file: !225, line: 205, baseType: !547, size: 256, offset: 896)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 256, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPasswordOk", scope: !224, file: !225, line: 206, baseType: !171, size: 8, offset: 1152)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prevXRefOffset", scope: !224, file: !225, line: 207, baseType: !229, size: 32, offset: 1184)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefEntriesOffset", scope: !224, file: !225, line: 208, baseType: !229, size: 32, offset: 1216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "xRefStream", scope: !224, file: !225, line: 209, baseType: !171, size: 8, offset: 1248)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefOffset", scope: !224, file: !225, line: 210, baseType: !229, size: 32, offset: 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "scannedSpecialFlags", scope: !224, file: !225, line: 211, baseType: !171, size: 8, offset: 1312)
!556 = !DISubprogram(name: "XRef", scope: !224, file: !225, line: 94, type: !557, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!560 = !DISubprogram(name: "XRef", scope: !224, file: !225, line: 96, type: !561, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !559, !259}
!563 = !DISubprogram(name: "XRef", scope: !224, file: !225, line: 98, type: !564, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !559, !213, !229, !229, !566, !171}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!567 = !DISubprogram(name: "~XRef", scope: !224, file: !225, line: 101, type: !557, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!568 = !DISubprogram(name: "isOk", linkageName: "_ZN4XRef4isOkEv", scope: !224, file: !225, line: 104, type: !569, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!569 = !DISubroutineType(types: !570)
!570 = !{!171, !559}
!571 = !DISubprogram(name: "isXRefStream", linkageName: "_ZN4XRef12isXRefStreamEv", scope: !224, file: !225, line: 107, type: !569, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!572 = !DISubprogram(name: "getErrorCode", linkageName: "_ZN4XRef12getErrorCodeEv", scope: !224, file: !225, line: 110, type: !573, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!573 = !DISubroutineType(types: !574)
!574 = !{!60, !559}
!575 = !DISubprogram(name: "setEncryption", linkageName: "_ZN4XRef13setEncryptionEibPhiii14CryptAlgorithm", scope: !224, file: !225, line: 113, type: !576, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !559, !60, !171, !511, !60, !60, !60, !38}
!578 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEv", scope: !224, file: !225, line: 118, type: !557, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!579 = !DISubprogram(name: "getEncryptionParameters", linkageName: "_ZN4XRef23getEncryptionParametersEPPhP14CryptAlgorithmPi", scope: !224, file: !225, line: 120, type: !580, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !559, !582, !583, !196}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!584 = !DISubprogram(name: "isEncrypted", linkageName: "_ZN4XRef11isEncryptedEv", scope: !224, file: !225, line: 123, type: !569, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!585 = !DISubprogram(name: "okToPrint", linkageName: "_ZN4XRef9okToPrintEb", scope: !224, file: !225, line: 126, type: !586, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!171, !559, !171}
!588 = !DISubprogram(name: "okToPrintHighRes", linkageName: "_ZN4XRef16okToPrintHighResEb", scope: !224, file: !225, line: 127, type: !586, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!589 = !DISubprogram(name: "okToChange", linkageName: "_ZN4XRef10okToChangeEb", scope: !224, file: !225, line: 128, type: !586, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!590 = !DISubprogram(name: "okToCopy", linkageName: "_ZN4XRef8okToCopyEb", scope: !224, file: !225, line: 129, type: !586, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!591 = !DISubprogram(name: "okToAddNotes", linkageName: "_ZN4XRef12okToAddNotesEb", scope: !224, file: !225, line: 130, type: !586, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!592 = !DISubprogram(name: "okToFillForm", linkageName: "_ZN4XRef12okToFillFormEb", scope: !224, file: !225, line: 131, type: !586, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!593 = !DISubprogram(name: "okToAccessibility", linkageName: "_ZN4XRef17okToAccessibilityEb", scope: !224, file: !225, line: 132, type: !586, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!594 = !DISubprogram(name: "okToAssemble", linkageName: "_ZN4XRef12okToAssembleEb", scope: !224, file: !225, line: 133, type: !586, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!595 = !DISubprogram(name: "getPermFlags", linkageName: "_ZN4XRef12getPermFlagsEv", scope: !224, file: !225, line: 134, type: !573, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!596 = !DISubprogram(name: "getCatalog", linkageName: "_ZN4XRef10getCatalogEP6Object", scope: !224, file: !225, line: 137, type: !597, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!597 = !DISubroutineType(types: !598)
!598 = !{!259, !559, !259}
!599 = !DISubprogram(name: "fetch", linkageName: "_ZN4XRef5fetchEiiP6Objecti", scope: !224, file: !225, line: 140, type: !600, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!600 = !DISubroutineType(types: !601)
!601 = !{!259, !559, !60, !60, !259, !60}
!602 = !DISubprogram(name: "getDocInfo", linkageName: "_ZN4XRef10getDocInfoEP6Object", scope: !224, file: !225, line: 143, type: !597, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!603 = !DISubprogram(name: "getDocInfoNF", linkageName: "_ZN4XRef12getDocInfoNFEP6Object", scope: !224, file: !225, line: 144, type: !597, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!604 = !DISubprogram(name: "getNumObjects", linkageName: "_ZN4XRef13getNumObjectsEv", scope: !224, file: !225, line: 147, type: !573, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!605 = !DISubprogram(name: "getRootNum", linkageName: "_ZN4XRef10getRootNumEv", scope: !224, file: !225, line: 150, type: !573, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!606 = !DISubprogram(name: "getRootGen", linkageName: "_ZN4XRef10getRootGenEv", scope: !224, file: !225, line: 151, type: !573, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!607 = !DISubprogram(name: "getStreamEnd", linkageName: "_ZN4XRef12getStreamEndEjPj", scope: !224, file: !225, line: 155, type: !608, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!608 = !DISubroutineType(types: !609)
!609 = !{!171, !559, !229, !535}
!610 = !DISubprogram(name: "getNumEntry", linkageName: "_ZN4XRef11getNumEntryEj", scope: !224, file: !225, line: 158, type: !611, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!611 = !DISubroutineType(types: !612)
!612 = !{!60, !559, !229}
!613 = !DISubprogram(name: "scanSpecialFlags", linkageName: "_ZN4XRef16scanSpecialFlagsEv", scope: !224, file: !225, line: 166, type: !557, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!614 = !DISubprogram(name: "getEntry", linkageName: "_ZN4XRef8getEntryEib", scope: !224, file: !225, line: 169, type: !615, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!231, !559, !60, !171}
!617 = !DISubprogram(name: "getTrailerDict", linkageName: "_ZN4XRef14getTrailerDictEv", scope: !224, file: !225, line: 170, type: !618, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!618 = !DISubroutineType(types: !619)
!619 = !{!259, !559}
!620 = !DISubprogram(name: "setModifiedObject", linkageName: "_ZN4XRef17setModifiedObjectEP6Object3Ref", scope: !224, file: !225, line: 173, type: !621, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !559, !259, !356}
!623 = !DISubprogram(name: "addIndirectObject", linkageName: "_ZN4XRef17addIndirectObjectEP6Object", scope: !224, file: !225, line: 174, type: !624, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{!356, !559, !259}
!626 = !DISubprogram(name: "removeIndirectObject", linkageName: "_ZN4XRef20removeIndirectObjectE3Ref", scope: !224, file: !225, line: 175, type: !627, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !559, !356}
!629 = !DISubprogram(name: "add", linkageName: "_ZN4XRef3addEiijb", scope: !224, file: !225, line: 176, type: !630, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !559, !60, !60, !229, !171}
!632 = !DISubprogram(name: "writeTableToFile", linkageName: "_ZN4XRef16writeTableToFileEP9OutStreamb", scope: !224, file: !225, line: 179, type: !633, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !559, !635, !171}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OutStream", file: !39, line: 238, flags: DIFlagFwdDecl, identifier: "_ZTS9OutStream")
!637 = !DISubprogram(name: "writeStreamToBuffer", linkageName: "_ZN4XRef19writeStreamToBufferEP9GooStringP4DictPS_", scope: !224, file: !225, line: 181, type: !638, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !559, !54, !289, !223}
!640 = !DISubprogram(name: "init", linkageName: "_ZN4XRef4initEv", scope: !224, file: !225, line: 213, type: !557, scopeLine: 213, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DISubprogram(name: "reserve", linkageName: "_ZN4XRef7reserveEi", scope: !224, file: !225, line: 214, type: !642, scopeLine: 214, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DISubroutineType(types: !643)
!643 = !{!60, !559, !60}
!644 = !DISubprogram(name: "resize", linkageName: "_ZN4XRef6resizeEi", scope: !224, file: !225, line: 215, type: !642, scopeLine: 215, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DISubprogram(name: "readXRef", linkageName: "_ZN4XRef8readXRefEPjPSt6vectorIjSaIjEEPS1_IiSaIiEE", scope: !224, file: !225, line: 216, type: !646, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DISubroutineType(types: !647)
!647 = !{!171, !559, !535, !648, !652}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, std::allocator<unsigned int> >", scope: !651, file: !650, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIjSaIjEE")
!650 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/6.3.0/../../../../include/c++/6.3.0/bits/stl_vector.h", directory: "")
!651 = !DINamespace(name: "std", scope: null)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, std::allocator<int> >", scope: !651, file: !650, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIiSaIiEE")
!654 = !DISubprogram(name: "readXRefTable", linkageName: "_ZN4XRef13readXRefTableEP6ParserPjPSt6vectorIjSaIjEEPS3_IiSaIiEE", scope: !224, file: !225, line: 217, type: !655, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!171, !559, !657, !535, !648, !652}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Parser", file: !225, line: 45, flags: DIFlagFwdDecl, identifier: "_ZTS6Parser")
!659 = !DISubprogram(name: "readXRefStreamSection", linkageName: "_ZN4XRef21readXRefStreamSectionEP6StreamPiii", scope: !224, file: !225, line: 218, type: !660, scopeLine: 218, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{!171, !559, !353, !196, !60, !60}
!662 = !DISubprogram(name: "readXRefStream", linkageName: "_ZN4XRef14readXRefStreamEP6StreamPj", scope: !224, file: !225, line: 219, type: !663, scopeLine: 219, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DISubroutineType(types: !664)
!664 = !{!171, !559, !353, !535}
!665 = !DISubprogram(name: "constructXRef", linkageName: "_ZN4XRef13constructXRefEPbb", scope: !224, file: !225, line: 220, type: !666, scopeLine: 220, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DISubroutineType(types: !667)
!667 = !{!171, !559, !566, !171}
!668 = !DISubprogram(name: "parseEntry", linkageName: "_ZN4XRef10parseEntryEjP9XRefEntry", scope: !224, file: !225, line: 221, type: !669, scopeLine: 221, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!171, !559, !229, !231}
!671 = !DISubprogram(name: "readXRefUntil", linkageName: "_ZN4XRef13readXRefUntilEiPSt6vectorIiSaIiEE", scope: !224, file: !225, line: 222, type: !672, scopeLine: 222, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !559, !60, !652}
!674 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEP6Object", scope: !224, file: !225, line: 223, type: !561, scopeLine: 223, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DISubprogram(name: "writeXRef", linkageName: "_ZN4XRef9writeXRefEPNS_10XRefWriterEb", scope: !224, file: !225, line: 251, type: !676, scopeLine: 251, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !559, !678, !171}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRefWriter", scope: !224, file: !225, line: 225, flags: DIFlagFwdDecl, identifier: "_ZTSN4XRef10XRefWriterE")
!680 = !DIDerivedType(tag: DW_TAG_member, name: "secHdlr", scope: !50, file: !51, line: 314, baseType: !681, size: 64, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SecurityHandler", file: !51, line: 56, flags: DIFlagFwdDecl, identifier: "_ZTS15SecurityHandler")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !50, file: !51, line: 315, baseType: !684, size: 64, offset: 512)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "hints", scope: !50, file: !51, line: 316, baseType: !686, size: 64, offset: 576)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Hints", file: !51, line: 57, flags: DIFlagFwdDecl, identifier: "_ZTS5Hints")
!688 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !50, file: !51, line: 318, baseType: !689, size: 64, offset: 640)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Outline", file: !51, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTS7Outline")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pageCache", scope: !50, file: !51, line: 320, baseType: !692, size: 64, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Page", file: !695, line: 133, size: 1280, flags: DIFlagTypePassByReference, elements: !696, identifier: "_ZTS4Page")
!695 = !DIFile(filename: "../poppler/Page.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!696 = !{!697, !698, !699, !700, !701, !702, !786, !790, !791, !792, !793, !794, !795, !796, !797, !803, !806, !809, !812, !815, !816, !817, !820, !821, !822, !823, !824, !825, !826, !827, !830, !833, !834, !837, !838, !839, !842, !845, !846, !849, !854, !855, !860, !863, !864, !865, !870, !871, !876, !877, !878, !889, !895, !898, !901, !904, !907}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !694, file: !695, line: 249, baseType: !49, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !694, file: !695, line: 250, baseType: !223, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pageObj", scope: !694, file: !695, line: 251, baseType: !240, size: 128, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pageRef", scope: !694, file: !695, line: 252, baseType: !356, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !694, file: !695, line: 253, baseType: !60, size: 32, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !694, file: !695, line: 254, baseType: !703, size: 64, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PageAttrs", file: !695, line: 70, size: 2304, flags: DIFlagTypePassByReference, elements: !705, identifier: "_ZTS9PageAttrs")
!705 = !{!706, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !753, !756, !759, !760, !763, !764, !765, !766, !769, !772, !775, !776, !779, !780, !781, !782, !783}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mediaBox", scope: !704, file: !695, line: 113, baseType: !707, size: 256)
!707 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFRectangle", file: !695, line: 52, size: 256, flags: DIFlagTypePassByValue, elements: !708, identifier: "_ZTS12PDFRectangle")
!708 = !{!709, !710, !711, !712, !713, !717, !720, !723, !726, !730}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !707, file: !695, line: 54, baseType: !204, size: 64, flags: DIFlagPublic)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !707, file: !695, line: 54, baseType: !204, size: 64, offset: 64, flags: DIFlagPublic)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !707, file: !695, line: 54, baseType: !204, size: 64, offset: 128, flags: DIFlagPublic)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !707, file: !695, line: 54, baseType: !204, size: 64, offset: 192, flags: DIFlagPublic)
!713 = !DISubprogram(name: "PDFRectangle", scope: !707, file: !695, line: 56, type: !714, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!717 = !DISubprogram(name: "PDFRectangle", scope: !707, file: !695, line: 57, type: !718, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !716, !204, !204, !204, !204}
!720 = !DISubprogram(name: "isValid", linkageName: "_ZN12PDFRectangle7isValidEv", scope: !707, file: !695, line: 59, type: !721, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!721 = !DISubroutineType(types: !722)
!722 = !{!171, !716}
!723 = !DISubprogram(name: "contains", linkageName: "_ZN12PDFRectangle8containsEdd", scope: !707, file: !695, line: 60, type: !724, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{!171, !716, !204, !204}
!726 = !DISubprogram(name: "clipTo", linkageName: "_ZN12PDFRectangle6clipToEPS_", scope: !707, file: !695, line: 61, type: !727, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !716, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!730 = !DISubprogram(name: "operator==", linkageName: "_ZNK12PDFRectangleeqERKS_", scope: !707, file: !695, line: 63, type: !731, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!731 = !DISubroutineType(types: !732)
!732 = !{!173, !733, !735}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!735 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !734, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cropBox", scope: !704, file: !695, line: 114, baseType: !707, size: 256, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "haveCropBox", scope: !704, file: !695, line: 115, baseType: !171, size: 8, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bleedBox", scope: !704, file: !695, line: 116, baseType: !707, size: 256, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "trimBox", scope: !704, file: !695, line: 117, baseType: !707, size: 256, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "artBox", scope: !704, file: !695, line: 118, baseType: !707, size: 256, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !704, file: !695, line: 119, baseType: !60, size: 32, offset: 1344)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lastModified", scope: !704, file: !695, line: 120, baseType: !240, size: 128, offset: 1408)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "boxColorInfo", scope: !704, file: !695, line: 121, baseType: !240, size: 128, offset: 1536)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !704, file: !695, line: 122, baseType: !240, size: 128, offset: 1664)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !704, file: !695, line: 123, baseType: !240, size: 128, offset: 1792)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pieceInfo", scope: !704, file: !695, line: 124, baseType: !240, size: 128, offset: 1920)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "separationInfo", scope: !704, file: !695, line: 125, baseType: !240, size: 128, offset: 2048)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !704, file: !695, line: 126, baseType: !240, size: 128, offset: 2176)
!749 = !DISubprogram(name: "PageAttrs", scope: !704, file: !695, line: 76, type: !750, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !752, !703, !289}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!753 = !DISubprogram(name: "~PageAttrs", scope: !704, file: !695, line: 79, type: !754, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !752}
!756 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN9PageAttrs11getMediaBoxEv", scope: !704, file: !695, line: 82, type: !757, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{!729, !752}
!759 = !DISubprogram(name: "getCropBox", linkageName: "_ZN9PageAttrs10getCropBoxEv", scope: !704, file: !695, line: 83, type: !757, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!760 = !DISubprogram(name: "isCropped", linkageName: "_ZN9PageAttrs9isCroppedEv", scope: !704, file: !695, line: 84, type: !761, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!171, !752}
!763 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN9PageAttrs11getBleedBoxEv", scope: !704, file: !695, line: 85, type: !757, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!764 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN9PageAttrs10getTrimBoxEv", scope: !704, file: !695, line: 86, type: !757, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!765 = !DISubprogram(name: "getArtBox", linkageName: "_ZN9PageAttrs9getArtBoxEv", scope: !704, file: !695, line: 87, type: !757, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!766 = !DISubprogram(name: "getRotate", linkageName: "_ZN9PageAttrs9getRotateEv", scope: !704, file: !695, line: 88, type: !767, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!767 = !DISubroutineType(types: !768)
!768 = !{!60, !752}
!769 = !DISubprogram(name: "getLastModified", linkageName: "_ZN9PageAttrs15getLastModifiedEv", scope: !704, file: !695, line: 89, type: !770, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{!54, !752}
!772 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN9PageAttrs15getBoxColorInfoEv", scope: !704, file: !695, line: 92, type: !773, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{!289, !752}
!775 = !DISubprogram(name: "getGroup", linkageName: "_ZN9PageAttrs8getGroupEv", scope: !704, file: !695, line: 94, type: !773, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!776 = !DISubprogram(name: "getMetadata", linkageName: "_ZN9PageAttrs11getMetadataEv", scope: !704, file: !695, line: 96, type: !777, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{!353, !752}
!779 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN9PageAttrs12getPieceInfoEv", scope: !704, file: !695, line: 98, type: !773, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!780 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN9PageAttrs17getSeparationInfoEv", scope: !704, file: !695, line: 100, type: !773, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!781 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN9PageAttrs15getResourceDictEv", scope: !704, file: !695, line: 103, type: !773, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!782 = !DISubprogram(name: "clipBoxes", linkageName: "_ZN9PageAttrs9clipBoxesEv", scope: !704, file: !695, line: 107, type: !754, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!783 = !DISubprogram(name: "readBox", linkageName: "_ZN9PageAttrs7readBoxEP4DictPKcP12PDFRectangle", scope: !704, file: !695, line: 111, type: !784, scopeLine: 111, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{!171, !752, !289, !77, !729}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "annots", scope: !694, file: !695, line: 255, baseType: !787, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Annots", file: !789, line: 1389, flags: DIFlagFwdDecl, identifier: "_ZTS6Annots")
!789 = !DIFile(filename: "../poppler/Annot.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!790 = !DIDerivedType(tag: DW_TAG_member, name: "annotsObj", scope: !694, file: !695, line: 256, baseType: !240, size: 128, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !694, file: !695, line: 257, baseType: !240, size: 128, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "thumb", scope: !694, file: !695, line: 258, baseType: !240, size: 128, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !694, file: !695, line: 259, baseType: !240, size: 128, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !694, file: !695, line: 260, baseType: !240, size: 128, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !694, file: !695, line: 261, baseType: !204, size: 64, offset: 1152)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !694, file: !695, line: 262, baseType: !171, size: 8, offset: 1216)
!797 = !DISubprogram(name: "Page", scope: !694, file: !695, line: 137, type: !798, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !800, !49, !60, !289, !356, !703, !801}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Form", file: !45, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS4Form")
!803 = !DISubprogram(name: "~Page", scope: !694, file: !695, line: 140, type: !804, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !800}
!806 = !DISubprogram(name: "isOk", linkageName: "_ZN4Page4isOkEv", scope: !694, file: !695, line: 143, type: !807, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!807 = !DISubroutineType(types: !808)
!808 = !{!171, !800}
!809 = !DISubprogram(name: "getNum", linkageName: "_ZN4Page6getNumEv", scope: !694, file: !695, line: 146, type: !810, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!60, !800}
!812 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN4Page11getMediaBoxEv", scope: !694, file: !695, line: 147, type: !813, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!729, !800}
!815 = !DISubprogram(name: "getCropBox", linkageName: "_ZN4Page10getCropBoxEv", scope: !694, file: !695, line: 148, type: !813, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!816 = !DISubprogram(name: "isCropped", linkageName: "_ZN4Page9isCroppedEv", scope: !694, file: !695, line: 149, type: !807, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!817 = !DISubprogram(name: "getMediaWidth", linkageName: "_ZN4Page13getMediaWidthEv", scope: !694, file: !695, line: 150, type: !818, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!818 = !DISubroutineType(types: !819)
!819 = !{!204, !800}
!820 = !DISubprogram(name: "getMediaHeight", linkageName: "_ZN4Page14getMediaHeightEv", scope: !694, file: !695, line: 152, type: !818, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!821 = !DISubprogram(name: "getCropWidth", linkageName: "_ZN4Page12getCropWidthEv", scope: !694, file: !695, line: 154, type: !818, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!822 = !DISubprogram(name: "getCropHeight", linkageName: "_ZN4Page13getCropHeightEv", scope: !694, file: !695, line: 156, type: !818, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!823 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN4Page11getBleedBoxEv", scope: !694, file: !695, line: 158, type: !813, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!824 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN4Page10getTrimBoxEv", scope: !694, file: !695, line: 159, type: !813, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!825 = !DISubprogram(name: "getArtBox", linkageName: "_ZN4Page9getArtBoxEv", scope: !694, file: !695, line: 160, type: !813, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!826 = !DISubprogram(name: "getRotate", linkageName: "_ZN4Page9getRotateEv", scope: !694, file: !695, line: 161, type: !810, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!827 = !DISubprogram(name: "getLastModified", linkageName: "_ZN4Page15getLastModifiedEv", scope: !694, file: !695, line: 162, type: !828, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!828 = !DISubroutineType(types: !829)
!829 = !{!54, !800}
!830 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN4Page15getBoxColorInfoEv", scope: !694, file: !695, line: 163, type: !831, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!289, !800}
!833 = !DISubprogram(name: "getGroup", linkageName: "_ZN4Page8getGroupEv", scope: !694, file: !695, line: 164, type: !831, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!834 = !DISubprogram(name: "getMetadata", linkageName: "_ZN4Page11getMetadataEv", scope: !694, file: !695, line: 165, type: !835, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!835 = !DISubroutineType(types: !836)
!836 = !{!353, !800}
!837 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN4Page12getPieceInfoEv", scope: !694, file: !695, line: 166, type: !831, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!838 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN4Page17getSeparationInfoEv", scope: !694, file: !695, line: 167, type: !831, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!839 = !DISubprogram(name: "getDoc", linkageName: "_ZN4Page6getDocEv", scope: !694, file: !695, line: 168, type: !840, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!49, !800}
!842 = !DISubprogram(name: "getRef", linkageName: "_ZN4Page6getRefEv", scope: !694, file: !695, line: 169, type: !843, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!843 = !DISubroutineType(types: !844)
!844 = !{!356, !800}
!845 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN4Page15getResourceDictEv", scope: !694, file: !695, line: 172, type: !831, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!846 = !DISubprogram(name: "getAnnots", linkageName: "_ZN4Page9getAnnotsEP6Object", scope: !694, file: !695, line: 175, type: !847, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!847 = !DISubroutineType(types: !848)
!848 = !{!259, !800, !259}
!849 = !DISubprogram(name: "addAnnot", linkageName: "_ZN4Page8addAnnotEP5Annot", scope: !694, file: !695, line: 177, type: !850, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !800, !852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Annot", file: !789, line: 475, flags: DIFlagFwdDecl, identifier: "_ZTS5Annot")
!854 = !DISubprogram(name: "removeAnnot", linkageName: "_ZN4Page11removeAnnotEP5Annot", scope: !694, file: !695, line: 179, type: !850, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!855 = !DISubprogram(name: "getLinks", linkageName: "_ZN4Page8getLinksEv", scope: !694, file: !695, line: 182, type: !856, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!856 = !DISubroutineType(types: !857)
!857 = !{!858, !800}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Links", file: !695, line: 43, flags: DIFlagFwdDecl, identifier: "_ZTS5Links")
!860 = !DISubprogram(name: "getAnnots", linkageName: "_ZN4Page9getAnnotsEv", scope: !694, file: !695, line: 185, type: !861, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!861 = !DISubroutineType(types: !862)
!862 = !{!787, !800}
!863 = !DISubprogram(name: "getContents", linkageName: "_ZN4Page11getContentsEP6Object", scope: !694, file: !695, line: 188, type: !847, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!864 = !DISubprogram(name: "getThumb", linkageName: "_ZN4Page8getThumbEP6Object", scope: !694, file: !695, line: 191, type: !847, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!865 = !DISubprogram(name: "loadThumb", linkageName: "_ZN4Page9loadThumbEPPhPiS2_S2_", scope: !694, file: !695, line: 192, type: !866, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{!171, !800, !868, !196, !196, !196}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!870 = !DISubprogram(name: "getTrans", linkageName: "_ZN4Page8getTransEP6Object", scope: !694, file: !695, line: 195, type: !847, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!871 = !DISubprogram(name: "getFormWidgets", linkageName: "_ZN4Page14getFormWidgetsEv", scope: !694, file: !695, line: 198, type: !872, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!872 = !DISubroutineType(types: !873)
!873 = !{!874, !800}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FormPageWidgets", file: !695, line: 47, flags: DIFlagFwdDecl, identifier: "_ZTS15FormPageWidgets")
!876 = !DISubprogram(name: "getDuration", linkageName: "_ZN4Page11getDurationEv", scope: !694, file: !695, line: 203, type: !818, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!877 = !DISubprogram(name: "getActions", linkageName: "_ZN4Page10getActionsEP6Object", scope: !694, file: !695, line: 206, type: !847, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!878 = !DISubprogram(name: "createGfx", linkageName: "_ZN4Page9createGfxEP9OutputDevddibbiiiibPFbPvES2_", scope: !694, file: !695, line: 208, type: !879, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!879 = !DISubroutineType(types: !880)
!880 = !{!881, !800, !883, !204, !204, !60, !171, !171, !60, !60, !60, !60, !171, !886, !216}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Gfx", file: !695, line: 46, flags: DIFlagFwdDecl, identifier: "_ZTS3Gfx")
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OutputDev", file: !885, line: 71, flags: DIFlagFwdDecl, identifier: "_ZTS9OutputDev")
!885 = !DIFile(filename: "../poppler/OutputDev.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!171, !216}
!889 = !DISubprogram(name: "display", linkageName: "_ZN4Page7displayEP9OutputDevddibbbPFbPvES2_PFbP5AnnotS2_ES2_", scope: !694, file: !695, line: 216, type: !890, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !800, !883, !204, !204, !60, !171, !171, !171, !886, !216, !892, !216}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!171, !852, !216}
!895 = !DISubprogram(name: "displaySlice", linkageName: "_ZN4Page12displaySliceEP9OutputDevddibbiiiibPFbPvES2_PFbP5AnnotS2_ES2_", scope: !694, file: !695, line: 225, type: !896, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !800, !883, !204, !204, !60, !171, !171, !60, !60, !60, !60, !171, !886, !216, !892, !216}
!898 = !DISubprogram(name: "display", linkageName: "_ZN4Page7displayEP3Gfx", scope: !694, file: !695, line: 234, type: !899, scopeLine: 234, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !800, !881}
!901 = !DISubprogram(name: "makeBox", linkageName: "_ZN4Page7makeBoxEddibbddddP12PDFRectanglePb", scope: !694, file: !695, line: 236, type: !902, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !800, !204, !204, !60, !171, !171, !204, !204, !204, !204, !729, !566}
!904 = !DISubprogram(name: "processLinks", linkageName: "_ZN4Page12processLinksEP9OutputDev", scope: !694, file: !695, line: 241, type: !905, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !800, !883}
!907 = !DISubprogram(name: "getDefaultCTM", linkageName: "_ZN4Page13getDefaultCTMEPdddibb", scope: !694, file: !695, line: 244, type: !908, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !800, !910, !204, !204, !60, !171, !171}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !50, file: !51, line: 322, baseType: !171, size: 8, offset: 768)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "errCode", scope: !50, file: !51, line: 323, baseType: !60, size: 32, offset: 800)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fopenErrno", scope: !50, file: !51, line: 326, baseType: !60, size: 32, offset: 832)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "startXRefPos", scope: !50, file: !51, line: 328, baseType: !229, size: 32, offset: 864)
!915 = !DISubprogram(name: "PDFDoc", scope: !50, file: !51, line: 72, type: !916, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !918, !54, !54, !54, !216}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
