; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ArgDesc = type { i8*, i32, i8*, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%class.GlobalParams = type { %class.NameToCharCode*, %class.NameToCharCode*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooList*, i8, %class.GooHash*, %class.GooList*, %class.GooHash*, %class.SysFontList*, %class.GooString*, i8, i8, i8, i32, %class.GooHash*, %class.GooList*, %class.GooList*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, double, i8, %class.GooString*, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, double, double, double, double, i8, i8, i8, i8, i8, i8, double, %class.CharCodeToUnicodeCache*, %class.CharCodeToUnicodeCache*, %class.UnicodeMapCache*, %class.CMapCache*, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, i8* }
%class.NameToCharCode = type opaque
%class.SysFontList = type opaque
%class.GooHash = type opaque
%class.GooList = type <{ i8**, i32, i32, i32, [4 x i8] }>
%class.GooString = type { [24 x i8], i32, i8* }
%class.CharCodeToUnicodeCache = type opaque

!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 38b4a62b0634ac2bc4b67addab5698d2f1a5c23e)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1509, globals: !1510, imports: !1568, nameTableKind: None)
!3 = !DIFile(filename: "pdftohtml.cc", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!4 = !{!5, !24, !30, !1346, !1088, !1413, !1179, !1453, !1464, !1471, !1478, !1490}
!5 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjType", file: !6, line: 75, baseType: !7, size: 32, elements: !8, identifier: "_ZTS7ObjType")
!6 = !DIFile(filename: "../poppler/Object.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!9 = !DIEnumerator(name: "objBool", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "objInt", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "objReal", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "objString", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "objName", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "objNull", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "objArray", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "objDict", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "objStream", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "objRef", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "objCmd", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "objError", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "objEOF", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "objNone", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "objUint", value: 14, isUnsigned: true)
!24 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "CryptAlgorithm", file: !25, line: 74, baseType: !7, size: 32, elements: !26, identifier: "_ZTS14CryptAlgorithm")
!25 = !DIFile(filename: "../poppler/Stream.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "cryptRC4", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "cryptAES", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "cryptAES256", value: 2, isUnsigned: true)
!30 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "PageMode", scope: !32, file: !31, line: 169, baseType: !7, size: 32, elements: !1445, identifier: "_ZTSN7Catalog8PageModeE")
!31 = !DIFile(filename: "../poppler/Catalog.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!32 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Catalog", file: !31, line: 94, size: 2176, flags: DIFlagTypePassByReference, elements: !33, identifier: "_ZTS7Catalog")
!33 = !{!34, !1271, !1272, !1273, !1274, !1275, !1278, !1281, !1284, !1285, !1286, !1289, !1290, !1291, !1292, !1293, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1344, !1345, !1356, !1360, !1363, !1366, !1369, !1372, !1375, !1378, !1379, !1382, !1385, !1388, !1389, !1390, !1395, !1396, !1399, !1402, !1405, !1406, !1407, !1410, !1418, !1421, !1424, !1427, !1430, !1433, !1436, !1439, !1440, !1443, !1444}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !32, file: !31, line: 198, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFDoc", file: !37, line: 69, size: 896, flags: DIFlagTypePassByReference, elements: !38, identifier: "_ZTS6PDFDoc")
!37 = !DIFile(filename: "../poppler/PDFDoc.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!38 = !{!39, !199, !205, !208, !209, !210, !211, !214, !672, !675, !677, !680, !754, !1004, !1005, !1006, !1007, !1008, !1012, !1015, !1018, !1021, !1024, !1027, !1028, !1031, !1034, !1037, !1040, !1046, !1049, !1052, !1053, !1054, !1055, !1058, !1059, !1060, !1063, !1066, !1069, !1072, !1075, !1078, !1081, !1146, !1149, !1152, !1153, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1167, !1168, !1169, !1170, !1173, !1176, !1184, !1187, !1190, !1193, !1196, !1199, !1202, !1205, !1208, !1211, !1215, !1218, !1221, !1222, !1225, !1228, !1231, !1234, !1237, !1240, !1243, !1244, !1247, !1250, !1253, !1254, !1255, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1267, !1268}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !36, file: !37, line: 303, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GooString", file: !42, line: 40, size: 320, flags: DIFlagTypePassByReference, elements: !43, identifier: "_ZTS9GooString")
!42 = !DIFile(filename: "../goo/GooString.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!43 = !{!44, !47, !48, !53, !54, !56, !60, !65, !68, !71, !74, !79, !83, !86, !89, !92, !104, !105, !108, !111, !114, !117, !120, !123, !126, !129, !132, !135, !138, !141, !144, !147, !148, !149, !152, !155, !158, !161, !167, !170, !174, !178, !181, !184, !190, !194, !198}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "STR_STATIC_SIZE", scope: !41, file: !42, line: 159, baseType: !45, flags: DIFlagStaticMember, extraData: i32 24)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "CALC_STRING_LEN", scope: !41, file: !42, line: 162, baseType: !45, flags: DIFlagStaticMember, extraData: i32 -1)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sStatic", scope: !41, file: !42, line: 166, baseType: !49, size: 192)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, elements: !51)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !{!52}
!52 = !DISubrange(count: 24)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !41, file: !42, line: 167, baseType: !46, size: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !41, file: !42, line: 168, baseType: !55, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!56 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 44, type: !57, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 47, type: !61, scopeLine: 47, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !59, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!65 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 51, type: !66, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !59, !63, !46}
!68 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 54, type: !69, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !59, !40, !46, !46}
!71 = !DISubprogram(name: "Set", linkageName: "_ZN9GooString3SetEPKciS1_i", scope: !41, file: !42, line: 60, type: !72, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!72 = !DISubroutineType(types: !73)
!73 = !{!40, !59, !63, !46, !63, !46}
!74 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 63, type: !75, scopeLine: 63, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !59, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!79 = !DISubprogram(name: "copy", linkageName: "_ZNK9GooString4copyEv", scope: !41, file: !42, line: 64, type: !80, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!80 = !DISubroutineType(types: !81)
!81 = !{!40, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!83 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 67, type: !84, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !59, !40, !40}
!86 = !DISubprogram(name: "fromInt", linkageName: "_ZN9GooString7fromIntEi", scope: !41, file: !42, line: 70, type: !87, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!87 = !DISubroutineType(types: !88)
!88 = !{!40, !46}
!89 = !DISubprogram(name: "format", linkageName: "_ZN9GooString6formatEPKcz", scope: !41, file: !42, line: 95, type: !90, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!90 = !DISubroutineType(types: !91)
!91 = !{!40, !63, null}
!92 = !DISubprogram(name: "formatv", linkageName: "_ZN9GooString7formatvEPKcP13__va_list_tag", scope: !41, file: !42, line: 96, type: !93, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !63, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !97, size: 192, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !98, identifier: "_ZTS13__va_list_tag")
!97 = !DIFile(filename: "HtmlOutputDev.cc", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!98 = !{!99, !100, !101, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !96, file: !97, baseType: !7, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !96, file: !97, baseType: !7, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !96, file: !97, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !96, file: !97, baseType: !102, size: 64, offset: 128)
!104 = !DISubprogram(name: "~GooString", scope: !41, file: !42, line: 99, type: !57, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!105 = !DISubprogram(name: "getLength", linkageName: "_ZN9GooString9getLengthEv", scope: !41, file: !42, line: 102, type: !106, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!106 = !DISubroutineType(types: !107)
!107 = !{!46, !59}
!108 = !DISubprogram(name: "getCString", linkageName: "_ZNK9GooString10getCStringEv", scope: !41, file: !42, line: 105, type: !109, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!109 = !DISubroutineType(types: !110)
!110 = !{!55, !82}
!111 = !DISubprogram(name: "getChar", linkageName: "_ZN9GooString7getCharEi", scope: !41, file: !42, line: 108, type: !112, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!112 = !DISubroutineType(types: !113)
!113 = !{!50, !59, !46}
!114 = !DISubprogram(name: "setChar", linkageName: "_ZN9GooString7setCharEic", scope: !41, file: !42, line: 111, type: !115, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !59, !46, !50}
!117 = !DISubprogram(name: "clear", linkageName: "_ZN9GooString5clearEv", scope: !41, file: !42, line: 114, type: !118, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!118 = !DISubroutineType(types: !119)
!119 = !{!40, !59}
!120 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEc", scope: !41, file: !42, line: 117, type: !121, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!121 = !DISubroutineType(types: !122)
!122 = !{!40, !59, !50}
!123 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPS_", scope: !41, file: !42, line: 118, type: !124, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!124 = !DISubroutineType(types: !125)
!125 = !{!40, !59, !40}
!126 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPKci", scope: !41, file: !42, line: 119, type: !127, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!127 = !DISubroutineType(types: !128)
!128 = !{!40, !59, !63, !46}
!129 = !DISubprogram(name: "appendf", linkageName: "_ZN9GooString7appendfEPKcz", scope: !41, file: !42, line: 122, type: !130, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!130 = !DISubroutineType(types: !131)
!131 = !{!40, !59, !63, null}
!132 = !DISubprogram(name: "appendfv", linkageName: "_ZN9GooString8appendfvEPKcP13__va_list_tag", scope: !41, file: !42, line: 123, type: !133, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{!40, !59, !63, !95}
!135 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEic", scope: !41, file: !42, line: 126, type: !136, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!136 = !DISubroutineType(types: !137)
!137 = !{!40, !59, !46, !50}
!138 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPS_", scope: !41, file: !42, line: 127, type: !139, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!139 = !DISubroutineType(types: !140)
!140 = !{!40, !59, !46, !40}
!141 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPKci", scope: !41, file: !42, line: 128, type: !142, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!142 = !DISubroutineType(types: !143)
!143 = !{!40, !59, !46, !63, !46}
!144 = !DISubprogram(name: "del", linkageName: "_ZN9GooString3delEii", scope: !41, file: !42, line: 131, type: !145, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!145 = !DISubroutineType(types: !146)
!146 = !{!40, !59, !46, !46}
!147 = !DISubprogram(name: "upperCase", linkageName: "_ZN9GooString9upperCaseEv", scope: !41, file: !42, line: 134, type: !118, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!148 = !DISubprogram(name: "lowerCase", linkageName: "_ZN9GooString9lowerCaseEv", scope: !41, file: !42, line: 135, type: !118, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!149 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPS_", scope: !41, file: !42, line: 138, type: !150, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!150 = !DISubroutineType(types: !151)
!151 = !{!46, !82, !40}
!152 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPS_i", scope: !41, file: !42, line: 139, type: !153, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!153 = !DISubroutineType(types: !154)
!154 = !{!46, !82, !40, !46}
!155 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPKc", scope: !41, file: !42, line: 140, type: !156, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!156 = !DISubroutineType(types: !157)
!157 = !{!46, !82, !63}
!158 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPKci", scope: !41, file: !42, line: 141, type: !159, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!159 = !DISubroutineType(types: !160)
!160 = !{!46, !82, !63, !46}
!161 = !DISubprogram(name: "hasUnicodeMarker", linkageName: "_ZN9GooString16hasUnicodeMarkerEv", scope: !41, file: !42, line: 143, type: !162, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !59}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GBool", file: !165, line: 31, baseType: !166)
!165 = !DIFile(filename: "../goo/gtypes.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!166 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!167 = !DISubprogram(name: "sanitizedName", linkageName: "_ZN9GooString13sanitizedNameEb", scope: !41, file: !42, line: 149, type: !168, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!168 = !DISubroutineType(types: !169)
!169 = !{!40, !59, !164}
!170 = !DISubprogram(name: "GooString", scope: !41, file: !42, line: 152, type: !171, scopeLine: 152, flags: DIFlagPrototyped, spFlags: 0)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !59, !173}
!173 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !78, size: 64)
!174 = !DISubprogram(name: "operator=", linkageName: "_ZN9GooStringaSERKS_", scope: !41, file: !42, line: 153, type: !175, scopeLine: 153, flags: DIFlagPrototyped, spFlags: 0)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !59, !173}
!177 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !41, size: 64)
!178 = !DISubprogram(name: "roundedSize", linkageName: "_ZN9GooString11roundedSizeEi", scope: !41, file: !42, line: 164, type: !179, scopeLine: 164, flags: DIFlagPrototyped, spFlags: 0)
!179 = !DISubroutineType(types: !180)
!180 = !{!46, !59, !46}
!181 = !DISubprogram(name: "resize", linkageName: "_ZN9GooString6resizeEi", scope: !41, file: !42, line: 170, type: !182, scopeLine: 170, flags: DIFlagPrototyped, spFlags: 0)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !59, !46}
!184 = !DISubprogram(name: "formatInt", linkageName: "_ZN9GooString9formatIntExPcibiiPS0_Pib", scope: !41, file: !42, line: 172, type: !185, scopeLine: 172, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !187, !55, !46, !164, !46, !46, !188, !189, !164}
!187 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!190 = !DISubprogram(name: "formatUInt", linkageName: "_ZN9GooString10formatUIntEyPcibiiPS0_Pib", scope: !41, file: !42, line: 181, type: !191, scopeLine: 181, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193, !55, !46, !164, !46, !46, !188, !189, !164}
!193 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!194 = !DISubprogram(name: "formatDouble", linkageName: "_ZN9GooString12formatDoubleEdPciibPS0_Pi", scope: !41, file: !42, line: 189, type: !195, scopeLine: 189, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197, !55, !46, !46, !164, !188, !189}
!197 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!198 = !DISubprogram(name: "formatDoubleSmallAware", linkageName: "_ZN9GooString22formatDoubleSmallAwareEdPciibPS0_Pi", scope: !41, file: !42, line: 191, type: !195, scopeLine: 191, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !36, file: !37, line: 307, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !202, line: 48, baseType: !203)
!202 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !204, line: 241, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!204 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !36, file: !37, line: 308, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseStream", file: !25, line: 297, flags: DIFlagFwdDecl, identifier: "_ZTS10BaseStream")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "guiData", scope: !36, file: !37, line: 309, baseType: !102, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMajorVersion", scope: !36, file: !37, line: 310, baseType: !46, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMinorVersion", scope: !36, file: !37, line: 311, baseType: !46, size: 32, offset: 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "linearization", scope: !36, file: !37, line: 312, baseType: !212, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Linearization", file: !37, line: 55, flags: DIFlagFwdDecl, identifier: "_ZTS13Linearization")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !36, file: !37, line: 313, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRef", file: !217, line: 90, size: 1344, flags: DIFlagTypePassByReference, elements: !218, identifier: "_ZTS4XRef")
!217 = !DIFile(filename: "../poppler/XRef.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!218 = !{!219, !220, !222, !225, !226, !227, !228, !229, !230, !231, !526, !528, !529, !532, !533, !534, !535, !536, !537, !538, !542, !543, !544, !545, !546, !547, !548, !552, !555, !559, !560, !563, !564, !567, !570, !571, !576, !577, !580, !581, !582, !583, !584, !585, !586, !587, !588, !591, !594, !595, !596, !597, !598, !599, !602, !605, !606, !609, !612, !615, !618, !621, !624, !629, !632, !633, !636, !637, !646, !651, !654, !657, !660, !663, !666, !667}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !216, file: !217, line: 185, baseType: !206, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !216, file: !217, line: 186, baseType: !221, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guint", file: !165, line: 45, baseType: !7)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !216, file: !217, line: 188, baseType: !223, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XRefEntry", file: !217, line: 59, flags: DIFlagFwdDecl, identifier: "_ZTS9XRefEntry")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !216, file: !217, line: 189, baseType: !46, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !216, file: !217, line: 190, baseType: !46, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rootNum", scope: !216, file: !217, line: 191, baseType: !46, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rootGen", scope: !216, file: !217, line: 191, baseType: !46, size: 32, offset: 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !216, file: !217, line: 192, baseType: !164, size: 8, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "errCode", scope: !216, file: !217, line: 193, baseType: !46, size: 32, offset: 352)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "trailerDict", scope: !216, file: !217, line: 194, baseType: !232, size: 128, offset: 384)
!232 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Object", file: !6, line: 112, size: 128, flags: DIFlagTypePassByValue, elements: !233, identifier: "_ZTS6Object")
!233 = !{!234, !235, !353, !357, !358, !361, !364, !367, !370, !373, !376, !379, !380, !383, !386, !389, !392, !393, !394, !397, !400, !401, !404, !405, !408, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !429, !430, !433, !434, !435, !438, !441, !442, !445, !448, !451, !454, !457, !460, !461, !462, !463, !466, !467, !470, !473, !476, !477, !478, !481, !484, !485, !488, !491, !494, !495, !496, !497, !498, !499, !500, !506, !507, !510, !513, !516, !517, !520, !523}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !6, line: 245, baseType: !5, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !232, file: !6, line: 246, baseType: !236, size: 64, offset: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !6, line: 246, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !237, identifier: "_ZTSN6ObjectUt_E")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !280, !344, !347, !352}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "booln", scope: !236, file: !6, line: 247, baseType: !164, size: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intg", scope: !236, file: !6, line: 248, baseType: !46, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "uintg", scope: !236, file: !6, line: 249, baseType: !7, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !236, file: !6, line: 250, baseType: !197, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !236, file: !6, line: 251, baseType: !40, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !6, line: 252, baseType: !55, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !236, file: !6, line: 253, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Array", file: !247, line: 39, size: 256, flags: DIFlagTypePassByReference, elements: !248, identifier: "_ZTS5Array")
!247 = !DIFile(filename: "../poppler/Array.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!248 = !{!249, !250, !252, !253, !254, !255, !259, !262, !265, !266, !267, !270, !273, !276, !277}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !246, file: !247, line: 68, baseType: !215, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !246, file: !247, line: 69, baseType: !251, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !247, line: 70, baseType: !46, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !246, file: !247, line: 71, baseType: !46, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !246, file: !247, line: 72, baseType: !46, size: 32, offset: 192)
!255 = !DISubprogram(name: "Array", scope: !246, file: !247, line: 43, type: !256, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258, !215}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!259 = !DISubprogram(name: "~Array", scope: !246, file: !247, line: 46, type: !260, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !258}
!262 = !DISubprogram(name: "incRef", linkageName: "_ZN5Array6incRefEv", scope: !246, file: !247, line: 49, type: !263, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{!46, !258}
!265 = !DISubprogram(name: "decRef", linkageName: "_ZN5Array6decRefEv", scope: !246, file: !247, line: 50, type: !263, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!266 = !DISubprogram(name: "getLength", linkageName: "_ZN5Array9getLengthEv", scope: !246, file: !247, line: 53, type: !263, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!267 = !DISubprogram(name: "add", linkageName: "_ZN5Array3addEP6Object", scope: !246, file: !247, line: 56, type: !268, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !258, !251}
!270 = !DISubprogram(name: "remove", linkageName: "_ZN5Array6removeEi", scope: !246, file: !247, line: 59, type: !271, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !258, !46}
!273 = !DISubprogram(name: "get", linkageName: "_ZN5Array3getEiP6Object", scope: !246, file: !247, line: 62, type: !274, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!274 = !DISubroutineType(types: !275)
!275 = !{!251, !258, !46, !251}
!276 = !DISubprogram(name: "getNF", linkageName: "_ZN5Array5getNFEiP6Object", scope: !246, file: !247, line: 63, type: !274, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!277 = !DISubprogram(name: "getString", linkageName: "_ZN5Array9getStringEiP9GooString", scope: !246, file: !247, line: 64, type: !278, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!278 = !DISubroutineType(types: !279)
!279 = !{!164, !258, !46, !40}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !236, file: !6, line: 254, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Dict", file: !283, line: 45, size: 320, flags: DIFlagTypePassByReference, elements: !284, identifier: "_ZTS4Dict")
!283 = !DIFile(filename: "../poppler/Dict.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!284 = !{!285, !286, !287, !290, !291, !292, !293, !297, !300, !303, !306, !307, !308, !311, !314, !317, !320, !323, !326, !329, !332, !335, !336, !337, !340, !341}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !282, file: !283, line: 95, baseType: !164, size: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !282, file: !283, line: 96, baseType: !215, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !282, file: !283, line: 97, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DictEntry", file: !283, line: 40, flags: DIFlagFwdDecl, identifier: "_ZTS9DictEntry")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !282, file: !283, line: 98, baseType: !46, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !282, file: !283, line: 99, baseType: !46, size: 32, offset: 224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !282, file: !283, line: 100, baseType: !46, size: 32, offset: 256)
!293 = !DISubprogram(name: "Dict", scope: !282, file: !283, line: 49, type: !294, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296, !215}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!297 = !DISubprogram(name: "Dict", scope: !282, file: !283, line: 50, type: !298, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !296, !281}
!300 = !DISubprogram(name: "~Dict", scope: !282, file: !283, line: 53, type: !301, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !296}
!303 = !DISubprogram(name: "incRef", linkageName: "_ZN4Dict6incRefEv", scope: !282, file: !283, line: 56, type: !304, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!304 = !DISubroutineType(types: !305)
!305 = !{!46, !296}
!306 = !DISubprogram(name: "decRef", linkageName: "_ZN4Dict6decRefEv", scope: !282, file: !283, line: 57, type: !304, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!307 = !DISubprogram(name: "getLength", linkageName: "_ZN4Dict9getLengthEv", scope: !282, file: !283, line: 60, type: !304, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!308 = !DISubprogram(name: "add", linkageName: "_ZN4Dict3addEPcP6Object", scope: !282, file: !283, line: 63, type: !309, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !296, !55, !251}
!311 = !DISubprogram(name: "set", linkageName: "_ZN4Dict3setEPKcP6Object", scope: !282, file: !283, line: 66, type: !312, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !296, !63, !251}
!314 = !DISubprogram(name: "remove", linkageName: "_ZN4Dict6removeEPKc", scope: !282, file: !283, line: 68, type: !315, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !296, !63}
!317 = !DISubprogram(name: "is", linkageName: "_ZN4Dict2isEPKc", scope: !282, file: !283, line: 71, type: !318, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!318 = !DISubroutineType(types: !319)
!319 = !{!164, !296, !63}
!320 = !DISubprogram(name: "lookup", linkageName: "_ZN4Dict6lookupEPKcP6Objecti", scope: !282, file: !283, line: 75, type: !321, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!321 = !DISubroutineType(types: !322)
!322 = !{!251, !296, !63, !251, !46}
!323 = !DISubprogram(name: "lookupNF", linkageName: "_ZN4Dict8lookupNFEPKcP6Object", scope: !282, file: !283, line: 76, type: !324, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!324 = !DISubroutineType(types: !325)
!325 = !{!251, !296, !63, !251}
!326 = !DISubprogram(name: "lookupInt", linkageName: "_ZN4Dict9lookupIntEPKcS1_Pi", scope: !282, file: !283, line: 77, type: !327, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!327 = !DISubroutineType(types: !328)
!328 = !{!164, !296, !63, !63, !189}
!329 = !DISubprogram(name: "getKey", linkageName: "_ZN4Dict6getKeyEi", scope: !282, file: !283, line: 80, type: !330, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!330 = !DISubroutineType(types: !331)
!331 = !{!55, !296, !46}
!332 = !DISubprogram(name: "getVal", linkageName: "_ZN4Dict6getValEiP6Object", scope: !282, file: !283, line: 81, type: !333, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!333 = !DISubroutineType(types: !334)
!334 = !{!251, !296, !46, !251}
!335 = !DISubprogram(name: "getValNF", linkageName: "_ZN4Dict8getValNFEiP6Object", scope: !282, file: !283, line: 82, type: !333, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!336 = !DISubprogram(name: "setXRef", linkageName: "_ZN4Dict7setXRefEP4XRef", scope: !282, file: !283, line: 87, type: !294, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!337 = !DISubprogram(name: "getXRef", linkageName: "_ZN4Dict7getXRefEv", scope: !282, file: !283, line: 89, type: !338, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!338 = !DISubroutineType(types: !339)
!339 = !{!215, !296}
!340 = !DISubprogram(name: "hasKey", linkageName: "_ZN4Dict6hasKeyEPKc", scope: !282, file: !283, line: 91, type: !318, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!341 = !DISubprogram(name: "find", linkageName: "_ZN4Dict4findEPKc", scope: !282, file: !283, line: 102, type: !342, scopeLine: 102, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DISubroutineType(types: !343)
!343 = !{!288, !296, !63}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !236, file: !6, line: 255, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stream", file: !25, line: 91, flags: DIFlagFwdDecl, identifier: "_ZTS6Stream")
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !236, file: !6, line: 256, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ref", file: !6, line: 66, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !349, identifier: "_ZTS3Ref")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !348, file: !6, line: 67, baseType: !46, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gen", scope: !348, file: !6, line: 68, baseType: !46, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !236, file: !6, line: 257, baseType: !55, size: 64)
!353 = !DISubprogram(name: "zeroUnion", linkageName: "_ZN6Object9zeroUnionEv", scope: !232, file: !6, line: 115, type: !354, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!357 = !DISubprogram(name: "Object", scope: !232, file: !6, line: 118, type: !354, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!358 = !DISubprogram(name: "initBool", linkageName: "_ZN6Object8initBoolEb", scope: !232, file: !6, line: 122, type: !359, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!359 = !DISubroutineType(types: !360)
!360 = !{!251, !356, !164}
!361 = !DISubprogram(name: "initInt", linkageName: "_ZN6Object7initIntEi", scope: !232, file: !6, line: 124, type: !362, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!362 = !DISubroutineType(types: !363)
!363 = !{!251, !356, !46}
!364 = !DISubprogram(name: "initReal", linkageName: "_ZN6Object8initRealEd", scope: !232, file: !6, line: 126, type: !365, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!365 = !DISubroutineType(types: !366)
!366 = !{!251, !356, !197}
!367 = !DISubprogram(name: "initString", linkageName: "_ZN6Object10initStringEP9GooString", scope: !232, file: !6, line: 128, type: !368, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!368 = !DISubroutineType(types: !369)
!369 = !{!251, !356, !40}
!370 = !DISubprogram(name: "initName", linkageName: "_ZN6Object8initNameEPKc", scope: !232, file: !6, line: 130, type: !371, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!371 = !DISubroutineType(types: !372)
!372 = !{!251, !356, !63}
!373 = !DISubprogram(name: "initNull", linkageName: "_ZN6Object8initNullEv", scope: !232, file: !6, line: 132, type: !374, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!374 = !DISubroutineType(types: !375)
!375 = !{!251, !356}
!376 = !DISubprogram(name: "initArray", linkageName: "_ZN6Object9initArrayEP4XRef", scope: !232, file: !6, line: 134, type: !377, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!377 = !DISubroutineType(types: !378)
!378 = !{!251, !356, !215}
!379 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4XRef", scope: !232, file: !6, line: 135, type: !377, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!380 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4Dict", scope: !232, file: !6, line: 136, type: !381, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!381 = !DISubroutineType(types: !382)
!382 = !{!251, !356, !281}
!383 = !DISubprogram(name: "initStream", linkageName: "_ZN6Object10initStreamEP6Stream", scope: !232, file: !6, line: 137, type: !384, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{!251, !356, !345}
!386 = !DISubprogram(name: "initRef", linkageName: "_ZN6Object7initRefEii", scope: !232, file: !6, line: 138, type: !387, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!387 = !DISubroutineType(types: !388)
!388 = !{!251, !356, !46, !46}
!389 = !DISubprogram(name: "initCmd", linkageName: "_ZN6Object7initCmdEPc", scope: !232, file: !6, line: 140, type: !390, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!390 = !DISubroutineType(types: !391)
!391 = !{!251, !356, !55}
!392 = !DISubprogram(name: "initError", linkageName: "_ZN6Object9initErrorEv", scope: !232, file: !6, line: 142, type: !374, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!393 = !DISubprogram(name: "initEOF", linkageName: "_ZN6Object7initEOFEv", scope: !232, file: !6, line: 144, type: !374, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!394 = !DISubprogram(name: "initUint", linkageName: "_ZN6Object8initUintEj", scope: !232, file: !6, line: 146, type: !395, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!395 = !DISubroutineType(types: !396)
!396 = !{!251, !356, !7}
!397 = !DISubprogram(name: "copy", linkageName: "_ZN6Object4copyEPS_", scope: !232, file: !6, line: 150, type: !398, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!251, !356, !251}
!400 = !DISubprogram(name: "shallowCopy", linkageName: "_ZN6Object11shallowCopyEPS_", scope: !232, file: !6, line: 151, type: !398, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!401 = !DISubprogram(name: "fetch", linkageName: "_ZN6Object5fetchEP4XRefPS_i", scope: !232, file: !6, line: 158, type: !402, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!251, !356, !215, !251, !46}
!404 = !DISubprogram(name: "free", linkageName: "_ZN6Object4freeEv", scope: !232, file: !6, line: 161, type: !354, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!405 = !DISubprogram(name: "getType", linkageName: "_ZN6Object7getTypeEv", scope: !232, file: !6, line: 164, type: !406, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{!5, !356}
!408 = !DISubprogram(name: "isBool", linkageName: "_ZN6Object6isBoolEv", scope: !232, file: !6, line: 165, type: !409, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!164, !356}
!411 = !DISubprogram(name: "isInt", linkageName: "_ZN6Object5isIntEv", scope: !232, file: !6, line: 166, type: !409, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!412 = !DISubprogram(name: "isReal", linkageName: "_ZN6Object6isRealEv", scope: !232, file: !6, line: 167, type: !409, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!413 = !DISubprogram(name: "isNum", linkageName: "_ZN6Object5isNumEv", scope: !232, file: !6, line: 168, type: !409, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!414 = !DISubprogram(name: "isString", linkageName: "_ZN6Object8isStringEv", scope: !232, file: !6, line: 169, type: !409, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!415 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEv", scope: !232, file: !6, line: 170, type: !409, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!416 = !DISubprogram(name: "isNull", linkageName: "_ZN6Object6isNullEv", scope: !232, file: !6, line: 171, type: !409, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!417 = !DISubprogram(name: "isArray", linkageName: "_ZN6Object7isArrayEv", scope: !232, file: !6, line: 172, type: !409, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!418 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEv", scope: !232, file: !6, line: 173, type: !409, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!419 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEv", scope: !232, file: !6, line: 174, type: !409, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!420 = !DISubprogram(name: "isRef", linkageName: "_ZN6Object5isRefEv", scope: !232, file: !6, line: 175, type: !409, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!421 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEv", scope: !232, file: !6, line: 176, type: !409, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!422 = !DISubprogram(name: "isError", linkageName: "_ZN6Object7isErrorEv", scope: !232, file: !6, line: 177, type: !409, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!423 = !DISubprogram(name: "isEOF", linkageName: "_ZN6Object5isEOFEv", scope: !232, file: !6, line: 178, type: !409, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!424 = !DISubprogram(name: "isNone", linkageName: "_ZN6Object6isNoneEv", scope: !232, file: !6, line: 179, type: !409, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!425 = !DISubprogram(name: "isUint", linkageName: "_ZN6Object6isUintEv", scope: !232, file: !6, line: 180, type: !409, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!426 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEPKc", scope: !232, file: !6, line: 183, type: !427, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!427 = !DISubroutineType(types: !428)
!428 = !{!164, !356, !63}
!429 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEPKc", scope: !232, file: !6, line: 185, type: !427, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!430 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEPc", scope: !232, file: !6, line: 186, type: !431, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!431 = !DISubroutineType(types: !432)
!432 = !{!164, !356, !55}
!433 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEPKc", scope: !232, file: !6, line: 187, type: !427, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!434 = !DISubprogram(name: "getBool", linkageName: "_ZN6Object7getBoolEv", scope: !232, file: !6, line: 191, type: !409, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!435 = !DISubprogram(name: "getInt", linkageName: "_ZN6Object6getIntEv", scope: !232, file: !6, line: 192, type: !436, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!436 = !DISubroutineType(types: !437)
!437 = !{!46, !356}
!438 = !DISubprogram(name: "getReal", linkageName: "_ZN6Object7getRealEv", scope: !232, file: !6, line: 193, type: !439, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!197, !356}
!441 = !DISubprogram(name: "getNum", linkageName: "_ZN6Object6getNumEv", scope: !232, file: !6, line: 194, type: !439, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!442 = !DISubprogram(name: "getString", linkageName: "_ZN6Object9getStringEv", scope: !232, file: !6, line: 195, type: !443, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{!40, !356}
!445 = !DISubprogram(name: "getName", linkageName: "_ZN6Object7getNameEv", scope: !232, file: !6, line: 196, type: !446, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!55, !356}
!448 = !DISubprogram(name: "getArray", linkageName: "_ZN6Object8getArrayEv", scope: !232, file: !6, line: 197, type: !449, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!449 = !DISubroutineType(types: !450)
!450 = !{!245, !356}
!451 = !DISubprogram(name: "getDict", linkageName: "_ZN6Object7getDictEv", scope: !232, file: !6, line: 198, type: !452, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!452 = !DISubroutineType(types: !453)
!453 = !{!281, !356}
!454 = !DISubprogram(name: "getStream", linkageName: "_ZN6Object9getStreamEv", scope: !232, file: !6, line: 199, type: !455, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!345, !356}
!457 = !DISubprogram(name: "getRef", linkageName: "_ZN6Object6getRefEv", scope: !232, file: !6, line: 200, type: !458, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!458 = !DISubroutineType(types: !459)
!459 = !{!348, !356}
!460 = !DISubprogram(name: "getRefNum", linkageName: "_ZN6Object9getRefNumEv", scope: !232, file: !6, line: 201, type: !436, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!461 = !DISubprogram(name: "getRefGen", linkageName: "_ZN6Object9getRefGenEv", scope: !232, file: !6, line: 202, type: !436, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!462 = !DISubprogram(name: "getCmd", linkageName: "_ZN6Object6getCmdEv", scope: !232, file: !6, line: 203, type: !446, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!463 = !DISubprogram(name: "getUint", linkageName: "_ZN6Object7getUintEv", scope: !232, file: !6, line: 204, type: !464, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!464 = !DISubroutineType(types: !465)
!465 = !{!7, !356}
!466 = !DISubprogram(name: "arrayGetLength", linkageName: "_ZN6Object14arrayGetLengthEv", scope: !232, file: !6, line: 207, type: !436, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!467 = !DISubprogram(name: "arrayAdd", linkageName: "_ZN6Object8arrayAddEPS_", scope: !232, file: !6, line: 208, type: !468, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !356, !251}
!470 = !DISubprogram(name: "arrayRemove", linkageName: "_ZN6Object11arrayRemoveEi", scope: !232, file: !6, line: 209, type: !471, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !356, !46}
!473 = !DISubprogram(name: "arrayGet", linkageName: "_ZN6Object8arrayGetEiPS_", scope: !232, file: !6, line: 210, type: !474, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!251, !356, !46, !251}
!476 = !DISubprogram(name: "arrayGetNF", linkageName: "_ZN6Object10arrayGetNFEiPS_", scope: !232, file: !6, line: 211, type: !474, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!477 = !DISubprogram(name: "dictGetLength", linkageName: "_ZN6Object13dictGetLengthEv", scope: !232, file: !6, line: 214, type: !436, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!478 = !DISubprogram(name: "dictAdd", linkageName: "_ZN6Object7dictAddEPcPS_", scope: !232, file: !6, line: 215, type: !479, scopeLine: 215, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !356, !55, !251}
!481 = !DISubprogram(name: "dictSet", linkageName: "_ZN6Object7dictSetEPKcPS_", scope: !232, file: !6, line: 216, type: !482, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !356, !63, !251}
!484 = !DISubprogram(name: "dictIs", linkageName: "_ZN6Object6dictIsEPKc", scope: !232, file: !6, line: 217, type: !427, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!485 = !DISubprogram(name: "dictLookup", linkageName: "_ZN6Object10dictLookupEPKcPS_i", scope: !232, file: !6, line: 218, type: !486, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!486 = !DISubroutineType(types: !487)
!487 = !{!251, !356, !63, !251, !46}
!488 = !DISubprogram(name: "dictLookupNF", linkageName: "_ZN6Object12dictLookupNFEPKcPS_", scope: !232, file: !6, line: 219, type: !489, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!489 = !DISubroutineType(types: !490)
!490 = !{!251, !356, !63, !251}
!491 = !DISubprogram(name: "dictGetKey", linkageName: "_ZN6Object10dictGetKeyEi", scope: !232, file: !6, line: 220, type: !492, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!492 = !DISubroutineType(types: !493)
!493 = !{!55, !356, !46}
!494 = !DISubprogram(name: "dictGetVal", linkageName: "_ZN6Object10dictGetValEiPS_", scope: !232, file: !6, line: 221, type: !474, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!495 = !DISubprogram(name: "dictGetValNF", linkageName: "_ZN6Object12dictGetValNFEiPS_", scope: !232, file: !6, line: 222, type: !474, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!496 = !DISubprogram(name: "streamIs", linkageName: "_ZN6Object8streamIsEPc", scope: !232, file: !6, line: 225, type: !431, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!497 = !DISubprogram(name: "streamReset", linkageName: "_ZN6Object11streamResetEv", scope: !232, file: !6, line: 226, type: !354, scopeLine: 226, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!498 = !DISubprogram(name: "streamClose", linkageName: "_ZN6Object11streamCloseEv", scope: !232, file: !6, line: 227, type: !354, scopeLine: 227, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!499 = !DISubprogram(name: "streamGetChar", linkageName: "_ZN6Object13streamGetCharEv", scope: !232, file: !6, line: 228, type: !436, scopeLine: 228, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!500 = !DISubprogram(name: "streamGetChars", linkageName: "_ZN6Object14streamGetCharsEiPh", scope: !232, file: !6, line: 229, type: !501, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!46, !356, !46, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guchar", file: !165, line: 43, baseType: !505)
!505 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!506 = !DISubprogram(name: "streamLookChar", linkageName: "_ZN6Object14streamLookCharEv", scope: !232, file: !6, line: 230, type: !436, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!507 = !DISubprogram(name: "streamGetLine", linkageName: "_ZN6Object13streamGetLineEPci", scope: !232, file: !6, line: 231, type: !508, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!508 = !DISubroutineType(types: !509)
!509 = !{!55, !356, !55, !46}
!510 = !DISubprogram(name: "streamGetPos", linkageName: "_ZN6Object12streamGetPosEv", scope: !232, file: !6, line: 232, type: !511, scopeLine: 232, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!511 = !DISubroutineType(types: !512)
!512 = !{!221, !356}
!513 = !DISubprogram(name: "streamSetPos", linkageName: "_ZN6Object12streamSetPosEji", scope: !232, file: !6, line: 233, type: !514, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !356, !221, !46}
!516 = !DISubprogram(name: "streamGetDict", linkageName: "_ZN6Object13streamGetDictEv", scope: !232, file: !6, line: 234, type: !452, scopeLine: 234, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!517 = !DISubprogram(name: "getTypeName", linkageName: "_ZN6Object11getTypeNameEv", scope: !232, file: !6, line: 237, type: !518, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!63, !356}
!520 = !DISubprogram(name: "print", linkageName: "_ZN6Object5printEP8_IO_FILE", scope: !232, file: !6, line: 238, type: !521, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !356, !200}
!523 = !DISubprogram(name: "memCheck", linkageName: "_ZN6Object8memCheckEP8_IO_FILE", scope: !232, file: !6, line: 241, type: !524, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !200}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "streamEnds", scope: !216, file: !217, line: 195, baseType: !527, size: 64, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "streamEndsLen", scope: !216, file: !217, line: 197, baseType: !46, size: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "objStrs", scope: !216, file: !217, line: 198, baseType: !530, size: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PopplerCache", file: !217, line: 46, flags: DIFlagFwdDecl, identifier: "_ZTS12PopplerCache")
!532 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !216, file: !217, line: 199, baseType: !164, size: 8, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "encRevision", scope: !216, file: !217, line: 200, baseType: !46, size: 32, offset: 736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "encVersion", scope: !216, file: !217, line: 201, baseType: !46, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "encAlgorithm", scope: !216, file: !217, line: 202, baseType: !24, size: 32, offset: 800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "keyLength", scope: !216, file: !217, line: 203, baseType: !46, size: 32, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "permFlags", scope: !216, file: !217, line: 204, baseType: !46, size: 32, offset: 864)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fileKey", scope: !216, file: !217, line: 205, baseType: !539, size: 256, offset: 896)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 256, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPasswordOk", scope: !216, file: !217, line: 206, baseType: !164, size: 8, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prevXRefOffset", scope: !216, file: !217, line: 207, baseType: !221, size: 32, offset: 1184)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefEntriesOffset", scope: !216, file: !217, line: 208, baseType: !221, size: 32, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "xRefStream", scope: !216, file: !217, line: 209, baseType: !164, size: 8, offset: 1248)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefOffset", scope: !216, file: !217, line: 210, baseType: !221, size: 32, offset: 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scannedSpecialFlags", scope: !216, file: !217, line: 211, baseType: !164, size: 8, offset: 1312)
!548 = !DISubprogram(name: "XRef", scope: !216, file: !217, line: 94, type: !549, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!552 = !DISubprogram(name: "XRef", scope: !216, file: !217, line: 96, type: !553, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !551, !251}
!555 = !DISubprogram(name: "XRef", scope: !216, file: !217, line: 98, type: !556, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !551, !206, !221, !221, !558, !164}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!559 = !DISubprogram(name: "~XRef", scope: !216, file: !217, line: 101, type: !549, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!560 = !DISubprogram(name: "isOk", linkageName: "_ZN4XRef4isOkEv", scope: !216, file: !217, line: 104, type: !561, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!164, !551}
!563 = !DISubprogram(name: "isXRefStream", linkageName: "_ZN4XRef12isXRefStreamEv", scope: !216, file: !217, line: 107, type: !561, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!564 = !DISubprogram(name: "getErrorCode", linkageName: "_ZN4XRef12getErrorCodeEv", scope: !216, file: !217, line: 110, type: !565, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!565 = !DISubroutineType(types: !566)
!566 = !{!46, !551}
!567 = !DISubprogram(name: "setEncryption", linkageName: "_ZN4XRef13setEncryptionEibPhiii14CryptAlgorithm", scope: !216, file: !217, line: 113, type: !568, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !551, !46, !164, !503, !46, !46, !46, !24}
!570 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEv", scope: !216, file: !217, line: 118, type: !549, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!571 = !DISubprogram(name: "getEncryptionParameters", linkageName: "_ZN4XRef23getEncryptionParametersEPPhP14CryptAlgorithmPi", scope: !216, file: !217, line: 120, type: !572, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !551, !574, !575, !189}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!576 = !DISubprogram(name: "isEncrypted", linkageName: "_ZN4XRef11isEncryptedEv", scope: !216, file: !217, line: 123, type: !561, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!577 = !DISubprogram(name: "okToPrint", linkageName: "_ZN4XRef9okToPrintEb", scope: !216, file: !217, line: 126, type: !578, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!578 = !DISubroutineType(types: !579)
!579 = !{!164, !551, !164}
!580 = !DISubprogram(name: "okToPrintHighRes", linkageName: "_ZN4XRef16okToPrintHighResEb", scope: !216, file: !217, line: 127, type: !578, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!581 = !DISubprogram(name: "okToChange", linkageName: "_ZN4XRef10okToChangeEb", scope: !216, file: !217, line: 128, type: !578, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!582 = !DISubprogram(name: "okToCopy", linkageName: "_ZN4XRef8okToCopyEb", scope: !216, file: !217, line: 129, type: !578, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!583 = !DISubprogram(name: "okToAddNotes", linkageName: "_ZN4XRef12okToAddNotesEb", scope: !216, file: !217, line: 130, type: !578, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!584 = !DISubprogram(name: "okToFillForm", linkageName: "_ZN4XRef12okToFillFormEb", scope: !216, file: !217, line: 131, type: !578, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!585 = !DISubprogram(name: "okToAccessibility", linkageName: "_ZN4XRef17okToAccessibilityEb", scope: !216, file: !217, line: 132, type: !578, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!586 = !DISubprogram(name: "okToAssemble", linkageName: "_ZN4XRef12okToAssembleEb", scope: !216, file: !217, line: 133, type: !578, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!587 = !DISubprogram(name: "getPermFlags", linkageName: "_ZN4XRef12getPermFlagsEv", scope: !216, file: !217, line: 134, type: !565, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!588 = !DISubprogram(name: "getCatalog", linkageName: "_ZN4XRef10getCatalogEP6Object", scope: !216, file: !217, line: 137, type: !589, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!589 = !DISubroutineType(types: !590)
!590 = !{!251, !551, !251}
!591 = !DISubprogram(name: "fetch", linkageName: "_ZN4XRef5fetchEiiP6Objecti", scope: !216, file: !217, line: 140, type: !592, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!251, !551, !46, !46, !251, !46}
!594 = !DISubprogram(name: "getDocInfo", linkageName: "_ZN4XRef10getDocInfoEP6Object", scope: !216, file: !217, line: 143, type: !589, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!595 = !DISubprogram(name: "getDocInfoNF", linkageName: "_ZN4XRef12getDocInfoNFEP6Object", scope: !216, file: !217, line: 144, type: !589, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!596 = !DISubprogram(name: "getNumObjects", linkageName: "_ZN4XRef13getNumObjectsEv", scope: !216, file: !217, line: 147, type: !565, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!597 = !DISubprogram(name: "getRootNum", linkageName: "_ZN4XRef10getRootNumEv", scope: !216, file: !217, line: 150, type: !565, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!598 = !DISubprogram(name: "getRootGen", linkageName: "_ZN4XRef10getRootGenEv", scope: !216, file: !217, line: 151, type: !565, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!599 = !DISubprogram(name: "getStreamEnd", linkageName: "_ZN4XRef12getStreamEndEjPj", scope: !216, file: !217, line: 155, type: !600, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!600 = !DISubroutineType(types: !601)
!601 = !{!164, !551, !221, !527}
!602 = !DISubprogram(name: "getNumEntry", linkageName: "_ZN4XRef11getNumEntryEj", scope: !216, file: !217, line: 158, type: !603, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{!46, !551, !221}
!605 = !DISubprogram(name: "scanSpecialFlags", linkageName: "_ZN4XRef16scanSpecialFlagsEv", scope: !216, file: !217, line: 166, type: !549, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!606 = !DISubprogram(name: "getEntry", linkageName: "_ZN4XRef8getEntryEib", scope: !216, file: !217, line: 169, type: !607, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!607 = !DISubroutineType(types: !608)
!608 = !{!223, !551, !46, !164}
!609 = !DISubprogram(name: "getTrailerDict", linkageName: "_ZN4XRef14getTrailerDictEv", scope: !216, file: !217, line: 170, type: !610, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!610 = !DISubroutineType(types: !611)
!611 = !{!251, !551}
!612 = !DISubprogram(name: "setModifiedObject", linkageName: "_ZN4XRef17setModifiedObjectEP6Object3Ref", scope: !216, file: !217, line: 173, type: !613, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !551, !251, !348}
!615 = !DISubprogram(name: "addIndirectObject", linkageName: "_ZN4XRef17addIndirectObjectEP6Object", scope: !216, file: !217, line: 174, type: !616, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{!348, !551, !251}
!618 = !DISubprogram(name: "removeIndirectObject", linkageName: "_ZN4XRef20removeIndirectObjectE3Ref", scope: !216, file: !217, line: 175, type: !619, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !551, !348}
!621 = !DISubprogram(name: "add", linkageName: "_ZN4XRef3addEiijb", scope: !216, file: !217, line: 176, type: !622, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !551, !46, !46, !221, !164}
!624 = !DISubprogram(name: "writeTableToFile", linkageName: "_ZN4XRef16writeTableToFileEP9OutStreamb", scope: !216, file: !217, line: 179, type: !625, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !551, !627, !164}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OutStream", file: !25, line: 238, flags: DIFlagFwdDecl, identifier: "_ZTS9OutStream")
!629 = !DISubprogram(name: "writeStreamToBuffer", linkageName: "_ZN4XRef19writeStreamToBufferEP9GooStringP4DictPS_", scope: !216, file: !217, line: 181, type: !630, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !551, !40, !281, !215}
!632 = !DISubprogram(name: "init", linkageName: "_ZN4XRef4initEv", scope: !216, file: !217, line: 213, type: !549, scopeLine: 213, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubprogram(name: "reserve", linkageName: "_ZN4XRef7reserveEi", scope: !216, file: !217, line: 214, type: !634, scopeLine: 214, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DISubroutineType(types: !635)
!635 = !{!46, !551, !46}
!636 = !DISubprogram(name: "resize", linkageName: "_ZN4XRef6resizeEi", scope: !216, file: !217, line: 215, type: !634, scopeLine: 215, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DISubprogram(name: "readXRef", linkageName: "_ZN4XRef8readXRefEPjPSt6vectorIjSaIjEEPS1_IiSaIiEE", scope: !216, file: !217, line: 216, type: !638, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!638 = !DISubroutineType(types: !639)
!639 = !{!164, !551, !527, !640, !644}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, std::allocator<unsigned int> >", scope: !643, file: !642, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIjSaIjEE")
!642 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/6.3.0/../../../../include/c++/6.3.0/bits/stl_vector.h", directory: "")
!643 = !DINamespace(name: "std", scope: null)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, std::allocator<int> >", scope: !643, file: !642, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIiSaIiEE")
!646 = !DISubprogram(name: "readXRefTable", linkageName: "_ZN4XRef13readXRefTableEP6ParserPjPSt6vectorIjSaIjEEPS3_IiSaIiEE", scope: !216, file: !217, line: 217, type: !647, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!164, !551, !649, !527, !640, !644}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Parser", file: !217, line: 45, flags: DIFlagFwdDecl, identifier: "_ZTS6Parser")
!651 = !DISubprogram(name: "readXRefStreamSection", linkageName: "_ZN4XRef21readXRefStreamSectionEP6StreamPiii", scope: !216, file: !217, line: 218, type: !652, scopeLine: 218, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DISubroutineType(types: !653)
!653 = !{!164, !551, !345, !189, !46, !46}
!654 = !DISubprogram(name: "readXRefStream", linkageName: "_ZN4XRef14readXRefStreamEP6StreamPj", scope: !216, file: !217, line: 219, type: !655, scopeLine: 219, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!164, !551, !345, !527}
!657 = !DISubprogram(name: "constructXRef", linkageName: "_ZN4XRef13constructXRefEPbb", scope: !216, file: !217, line: 220, type: !658, scopeLine: 220, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DISubroutineType(types: !659)
!659 = !{!164, !551, !558, !164}
!660 = !DISubprogram(name: "parseEntry", linkageName: "_ZN4XRef10parseEntryEjP9XRefEntry", scope: !216, file: !217, line: 221, type: !661, scopeLine: 221, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DISubroutineType(types: !662)
!662 = !{!164, !551, !221, !223}
!663 = !DISubprogram(name: "readXRefUntil", linkageName: "_ZN4XRef13readXRefUntilEiPSt6vectorIiSaIiEE", scope: !216, file: !217, line: 222, type: !664, scopeLine: 222, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !551, !46, !644}
!666 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEP6Object", scope: !216, file: !217, line: 223, type: !553, scopeLine: 223, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DISubprogram(name: "writeXRef", linkageName: "_ZN4XRef9writeXRefEPNS_10XRefWriterEb", scope: !216, file: !217, line: 251, type: !668, scopeLine: 251, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !551, !670, !164}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRefWriter", scope: !216, file: !217, line: 225, flags: DIFlagFwdDecl, identifier: "_ZTSN4XRef10XRefWriterE")
!672 = !DIDerivedType(tag: DW_TAG_member, name: "secHdlr", scope: !36, file: !37, line: 314, baseType: !673, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SecurityHandler", file: !37, line: 56, flags: DIFlagFwdDecl, identifier: "_ZTS15SecurityHandler")
!675 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !36, file: !37, line: 315, baseType: !676, size: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "hints", scope: !36, file: !37, line: 316, baseType: !678, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Hints", file: !37, line: 57, flags: DIFlagFwdDecl, identifier: "_ZTS5Hints")
!680 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !36, file: !37, line: 318, baseType: !681, size: 64, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Outline", file: !683, line: 40, size: 64, flags: DIFlagTypePassByReference, elements: !684, identifier: "_ZTS7Outline")
!683 = !DIFile(filename: "../poppler/Outline.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!684 = !{!685, !744, !748, !751}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !682, file: !683, line: 50, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GooList", file: !688, line: 36, size: 192, flags: DIFlagTypePassByReference, elements: !689, identifier: "_ZTS7GooList")
!688 = !DIFile(filename: "../goo/GooList.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!689 = !{!690, !692, !693, !694, !695, !699, !702, !703, !706, !709, !712, !715, !718, !721, !722, !723, !731, !732, !733, !738, !742, !743}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !687, file: !688, line: 102, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !687, file: !688, line: 103, baseType: !46, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !687, file: !688, line: 104, baseType: !46, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "inc", scope: !687, file: !688, line: 105, baseType: !46, size: 32, offset: 128)
!695 = !DISubprogram(name: "GooList", scope: !687, file: !688, line: 40, type: !696, scopeLine: 40, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!699 = !DISubprogram(name: "GooList", scope: !687, file: !688, line: 43, type: !700, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !698, !46}
!702 = !DISubprogram(name: "~GooList", scope: !687, file: !688, line: 46, type: !696, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!703 = !DISubprogram(name: "getLength", linkageName: "_ZN7GooList9getLengthEv", scope: !687, file: !688, line: 51, type: !704, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!704 = !DISubroutineType(types: !705)
!705 = !{!46, !698}
!706 = !DISubprogram(name: "copy", linkageName: "_ZN7GooList4copyEv", scope: !687, file: !688, line: 54, type: !707, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!707 = !DISubroutineType(types: !708)
!708 = !{!686, !698}
!709 = !DISubprogram(name: "get", linkageName: "_ZN7GooList3getEi", scope: !687, file: !688, line: 60, type: !710, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{!102, !698, !46}
!712 = !DISubprogram(name: "put", linkageName: "_ZN7GooList3putEiPv", scope: !687, file: !688, line: 64, type: !713, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !698, !46, !102}
!715 = !DISubprogram(name: "append", linkageName: "_ZN7GooList6appendEPv", scope: !687, file: !688, line: 67, type: !716, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !698, !102}
!718 = !DISubprogram(name: "append", linkageName: "_ZN7GooList6appendEPS_", scope: !687, file: !688, line: 70, type: !719, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !698, !686}
!721 = !DISubprogram(name: "insert", linkageName: "_ZN7GooList6insertEiPv", scope: !687, file: !688, line: 74, type: !713, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!722 = !DISubprogram(name: "del", linkageName: "_ZN7GooList3delEi", scope: !687, file: !688, line: 78, type: !710, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!723 = !DISubprogram(name: "sort", linkageName: "_ZN7GooList4sortEPFiPKvS1_E", scope: !687, file: !688, line: 83, type: !724, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !698, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!46, !729, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!731 = !DISubprogram(name: "reverse", linkageName: "_ZN7GooList7reverseEv", scope: !687, file: !688, line: 86, type: !696, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!732 = !DISubprogram(name: "setAllocIncr", linkageName: "_ZN7GooList12setAllocIncrEi", scope: !687, file: !688, line: 93, type: !700, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!733 = !DISubprogram(name: "GooList", scope: !687, file: !688, line: 96, type: !734, scopeLine: 96, flags: DIFlagPrototyped, spFlags: 0)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !698, !736}
!736 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!738 = !DISubprogram(name: "operator=", linkageName: "_ZN7GooListaSERKS_", scope: !687, file: !688, line: 97, type: !739, scopeLine: 97, flags: DIFlagPrototyped, spFlags: 0)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !698, !736}
!741 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !687, size: 64)
!742 = !DISubprogram(name: "expand", linkageName: "_ZN7GooList6expandEv", scope: !687, file: !688, line: 99, type: !696, scopeLine: 99, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DISubprogram(name: "shrink", linkageName: "_ZN7GooList6shrinkEv", scope: !687, file: !688, line: 100, type: !696, scopeLine: 100, flags: DIFlagPrototyped, spFlags: 0)
!744 = !DISubprogram(name: "Outline", scope: !682, file: !683, line: 43, type: !745, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !747, !251, !215}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!748 = !DISubprogram(name: "~Outline", scope: !682, file: !683, line: 44, type: !749, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !747}
!751 = !DISubprogram(name: "getItems", linkageName: "_ZN7Outline8getItemsEv", scope: !682, file: !683, line: 46, type: !752, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!752 = !DISubroutineType(types: !753)
!753 = !{!686, !747}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pageCache", scope: !36, file: !37, line: 320, baseType: !755, size: 64, offset: 704)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Page", file: !758, line: 133, size: 1280, flags: DIFlagTypePassByReference, elements: !759, identifier: "_ZTS4Page")
!758 = !DIFile(filename: "../poppler/Page.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!759 = !{!760, !761, !762, !763, !764, !765, !849, !853, !854, !855, !856, !857, !858, !859, !860, !866, !869, !872, !875, !878, !879, !880, !883, !884, !885, !886, !887, !888, !889, !890, !893, !896, !897, !900, !901, !902, !905, !908, !909, !912, !917, !918, !953, !956, !957, !958, !963, !964, !969, !970, !971, !982, !988, !991, !994, !997, !1000}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !757, file: !758, line: 249, baseType: !35, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !757, file: !758, line: 250, baseType: !215, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pageObj", scope: !757, file: !758, line: 251, baseType: !232, size: 128, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pageRef", scope: !757, file: !758, line: 252, baseType: !348, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !757, file: !758, line: 253, baseType: !46, size: 32, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !757, file: !758, line: 254, baseType: !766, size: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PageAttrs", file: !758, line: 70, size: 2304, flags: DIFlagTypePassByReference, elements: !768, identifier: "_ZTS9PageAttrs")
!768 = !{!769, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !816, !819, !822, !823, !826, !827, !828, !829, !832, !835, !838, !839, !842, !843, !844, !845, !846}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mediaBox", scope: !767, file: !758, line: 113, baseType: !770, size: 256)
!770 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFRectangle", file: !758, line: 52, size: 256, flags: DIFlagTypePassByValue, elements: !771, identifier: "_ZTS12PDFRectangle")
!771 = !{!772, !773, !774, !775, !776, !780, !783, !786, !789, !793}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !770, file: !758, line: 54, baseType: !197, size: 64, flags: DIFlagPublic)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !770, file: !758, line: 54, baseType: !197, size: 64, offset: 64, flags: DIFlagPublic)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !770, file: !758, line: 54, baseType: !197, size: 64, offset: 128, flags: DIFlagPublic)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !770, file: !758, line: 54, baseType: !197, size: 64, offset: 192, flags: DIFlagPublic)
!776 = !DISubprogram(name: "PDFRectangle", scope: !770, file: !758, line: 56, type: !777, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!780 = !DISubprogram(name: "PDFRectangle", scope: !770, file: !758, line: 57, type: !781, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !779, !197, !197, !197, !197}
!783 = !DISubprogram(name: "isValid", linkageName: "_ZN12PDFRectangle7isValidEv", scope: !770, file: !758, line: 59, type: !784, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{!164, !779}
!786 = !DISubprogram(name: "contains", linkageName: "_ZN12PDFRectangle8containsEdd", scope: !770, file: !758, line: 60, type: !787, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!164, !779, !197, !197}
!789 = !DISubprogram(name: "clipTo", linkageName: "_ZN12PDFRectangle6clipToEPS_", scope: !770, file: !758, line: 61, type: !790, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !779, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!793 = !DISubprogram(name: "operator==", linkageName: "_ZNK12PDFRectangleeqERKS_", scope: !770, file: !758, line: 63, type: !794, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!166, !796, !798}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!798 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !797, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cropBox", scope: !767, file: !758, line: 114, baseType: !770, size: 256, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "haveCropBox", scope: !767, file: !758, line: 115, baseType: !164, size: 8, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bleedBox", scope: !767, file: !758, line: 116, baseType: !770, size: 256, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "trimBox", scope: !767, file: !758, line: 117, baseType: !770, size: 256, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "artBox", scope: !767, file: !758, line: 118, baseType: !770, size: 256, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !767, file: !758, line: 119, baseType: !46, size: 32, offset: 1344)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lastModified", scope: !767, file: !758, line: 120, baseType: !232, size: 128, offset: 1408)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "boxColorInfo", scope: !767, file: !758, line: 121, baseType: !232, size: 128, offset: 1536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !767, file: !758, line: 122, baseType: !232, size: 128, offset: 1664)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !767, file: !758, line: 123, baseType: !232, size: 128, offset: 1792)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pieceInfo", scope: !767, file: !758, line: 124, baseType: !232, size: 128, offset: 1920)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "separationInfo", scope: !767, file: !758, line: 125, baseType: !232, size: 128, offset: 2048)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !767, file: !758, line: 126, baseType: !232, size: 128, offset: 2176)
!812 = !DISubprogram(name: "PageAttrs", scope: !767, file: !758, line: 76, type: !813, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !815, !766, !281}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!816 = !DISubprogram(name: "~PageAttrs", scope: !767, file: !758, line: 79, type: !817, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !815}
!819 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN9PageAttrs11getMediaBoxEv", scope: !767, file: !758, line: 82, type: !820, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!820 = !DISubroutineType(types: !821)
!821 = !{!792, !815}
!822 = !DISubprogram(name: "getCropBox", linkageName: "_ZN9PageAttrs10getCropBoxEv", scope: !767, file: !758, line: 83, type: !820, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!823 = !DISubprogram(name: "isCropped", linkageName: "_ZN9PageAttrs9isCroppedEv", scope: !767, file: !758, line: 84, type: !824, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{!164, !815}
!826 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN9PageAttrs11getBleedBoxEv", scope: !767, file: !758, line: 85, type: !820, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!827 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN9PageAttrs10getTrimBoxEv", scope: !767, file: !758, line: 86, type: !820, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!828 = !DISubprogram(name: "getArtBox", linkageName: "_ZN9PageAttrs9getArtBoxEv", scope: !767, file: !758, line: 87, type: !820, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!829 = !DISubprogram(name: "getRotate", linkageName: "_ZN9PageAttrs9getRotateEv", scope: !767, file: !758, line: 88, type: !830, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!830 = !DISubroutineType(types: !831)
!831 = !{!46, !815}
!832 = !DISubprogram(name: "getLastModified", linkageName: "_ZN9PageAttrs15getLastModifiedEv", scope: !767, file: !758, line: 89, type: !833, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!40, !815}
!835 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN9PageAttrs15getBoxColorInfoEv", scope: !767, file: !758, line: 92, type: !836, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!836 = !DISubroutineType(types: !837)
!837 = !{!281, !815}
!838 = !DISubprogram(name: "getGroup", linkageName: "_ZN9PageAttrs8getGroupEv", scope: !767, file: !758, line: 94, type: !836, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!839 = !DISubprogram(name: "getMetadata", linkageName: "_ZN9PageAttrs11getMetadataEv", scope: !767, file: !758, line: 96, type: !840, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!345, !815}
!842 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN9PageAttrs12getPieceInfoEv", scope: !767, file: !758, line: 98, type: !836, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!843 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN9PageAttrs17getSeparationInfoEv", scope: !767, file: !758, line: 100, type: !836, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!844 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN9PageAttrs15getResourceDictEv", scope: !767, file: !758, line: 103, type: !836, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!845 = !DISubprogram(name: "clipBoxes", linkageName: "_ZN9PageAttrs9clipBoxesEv", scope: !767, file: !758, line: 107, type: !817, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!846 = !DISubprogram(name: "readBox", linkageName: "_ZN9PageAttrs7readBoxEP4DictPKcP12PDFRectangle", scope: !767, file: !758, line: 111, type: !847, scopeLine: 111, flags: DIFlagPrototyped, spFlags: 0)
!847 = !DISubroutineType(types: !848)
!848 = !{!164, !815, !281, !63, !792}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "annots", scope: !757, file: !758, line: 255, baseType: !850, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Annots", file: !852, line: 1389, flags: DIFlagFwdDecl, identifier: "_ZTS6Annots")
!852 = !DIFile(filename: "../poppler/Annot.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!853 = !DIDerivedType(tag: DW_TAG_member, name: "annotsObj", scope: !757, file: !758, line: 256, baseType: !232, size: 128, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !757, file: !758, line: 257, baseType: !232, size: 128, offset: 640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "thumb", scope: !757, file: !758, line: 258, baseType: !232, size: 128, offset: 768)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !757, file: !758, line: 259, baseType: !232, size: 128, offset: 896)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !757, file: !758, line: 260, baseType: !232, size: 128, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !757, file: !758, line: 261, baseType: !197, size: 64, offset: 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !757, file: !758, line: 262, baseType: !164, size: 8, offset: 1216)
!860 = !DISubprogram(name: "Page", scope: !757, file: !758, line: 137, type: !861, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !863, !35, !46, !281, !348, !766, !864}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Form", file: !31, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS4Form")
!866 = !DISubprogram(name: "~Page", scope: !757, file: !758, line: 140, type: !867, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !863}
!869 = !DISubprogram(name: "isOk", linkageName: "_ZN4Page4isOkEv", scope: !757, file: !758, line: 143, type: !870, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!870 = !DISubroutineType(types: !871)
!871 = !{!164, !863}
!872 = !DISubprogram(name: "getNum", linkageName: "_ZN4Page6getNumEv", scope: !757, file: !758, line: 146, type: !873, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{!46, !863}
!875 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN4Page11getMediaBoxEv", scope: !757, file: !758, line: 147, type: !876, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!876 = !DISubroutineType(types: !877)
!877 = !{!792, !863}
!878 = !DISubprogram(name: "getCropBox", linkageName: "_ZN4Page10getCropBoxEv", scope: !757, file: !758, line: 148, type: !876, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!879 = !DISubprogram(name: "isCropped", linkageName: "_ZN4Page9isCroppedEv", scope: !757, file: !758, line: 149, type: !870, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!880 = !DISubprogram(name: "getMediaWidth", linkageName: "_ZN4Page13getMediaWidthEv", scope: !757, file: !758, line: 150, type: !881, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{!197, !863}
!883 = !DISubprogram(name: "getMediaHeight", linkageName: "_ZN4Page14getMediaHeightEv", scope: !757, file: !758, line: 152, type: !881, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!884 = !DISubprogram(name: "getCropWidth", linkageName: "_ZN4Page12getCropWidthEv", scope: !757, file: !758, line: 154, type: !881, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!885 = !DISubprogram(name: "getCropHeight", linkageName: "_ZN4Page13getCropHeightEv", scope: !757, file: !758, line: 156, type: !881, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!886 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN4Page11getBleedBoxEv", scope: !757, file: !758, line: 158, type: !876, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!887 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN4Page10getTrimBoxEv", scope: !757, file: !758, line: 159, type: !876, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!888 = !DISubprogram(name: "getArtBox", linkageName: "_ZN4Page9getArtBoxEv", scope: !757, file: !758, line: 160, type: !876, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!889 = !DISubprogram(name: "getRotate", linkageName: "_ZN4Page9getRotateEv", scope: !757, file: !758, line: 161, type: !873, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!890 = !DISubprogram(name: "getLastModified", linkageName: "_ZN4Page15getLastModifiedEv", scope: !757, file: !758, line: 162, type: !891, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!891 = !DISubroutineType(types: !892)
!892 = !{!40, !863}
!893 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN4Page15getBoxColorInfoEv", scope: !757, file: !758, line: 163, type: !894, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!894 = !DISubroutineType(types: !895)
!895 = !{!281, !863}
!896 = !DISubprogram(name: "getGroup", linkageName: "_ZN4Page8getGroupEv", scope: !757, file: !758, line: 164, type: !894, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!897 = !DISubprogram(name: "getMetadata", linkageName: "_ZN4Page11getMetadataEv", scope: !757, file: !758, line: 165, type: !898, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{!345, !863}
!900 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN4Page12getPieceInfoEv", scope: !757, file: !758, line: 166, type: !894, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!901 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN4Page17getSeparationInfoEv", scope: !757, file: !758, line: 167, type: !894, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!902 = !DISubprogram(name: "getDoc", linkageName: "_ZN4Page6getDocEv", scope: !757, file: !758, line: 168, type: !903, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!903 = !DISubroutineType(types: !904)
!904 = !{!35, !863}
!905 = !DISubprogram(name: "getRef", linkageName: "_ZN4Page6getRefEv", scope: !757, file: !758, line: 169, type: !906, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!906 = !DISubroutineType(types: !907)
!907 = !{!348, !863}
!908 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN4Page15getResourceDictEv", scope: !757, file: !758, line: 172, type: !894, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!909 = !DISubprogram(name: "getAnnots", linkageName: "_ZN4Page9getAnnotsEP6Object", scope: !757, file: !758, line: 175, type: !910, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!910 = !DISubroutineType(types: !911)
!911 = !{!251, !863, !251}
