; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ArgDesc = type { i8*, i32, i8*, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%class.GlobalParams = type { %class.NameToCharCode*, %class.NameToCharCode*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooHash*, %class.GooList*, i8, %class.GooHash*, %class.GooList*, %class.GooHash*, %class.SysFontList*, %class.GooString*, i8, i8, i8, i32, %class.GooHash*, %class.GooList*, %class.GooList*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, double, i8, %class.GooString*, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, double, double, double, double, i8, i8, i8, i8, i8, i8, double, %class.CharCodeToUnicodeCache*, %class.CharCodeToUnicodeCache*, %class.UnicodeMapCache*, %class.CMapCache*, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, i8* }
%class.NameToCharCode = type opaque
%class.SysFontList = type opaque
%class.GooHash = type opaque
%class.GooList = type <{ i8**, i32, i32, i32, [4 x i8] }>
%class.GooString = type { [24 x i8], i32, i8* }
%class.CharCodeToUnicodeCache = type opaque

!5 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "UnicodeMapKind", file: !6, line: 30, baseType: !7, size: 32, elements: !8, identifier: "_ZTS14UnicodeMapKind")
!6 = !DIFile(filename: "../poppler/UnicodeMap.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "unicodeMapUser", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "unicodeMapResident", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "unicodeMapFunc", value: 2, isUnsigned: true)
!12 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjType", file: !13, line: 75, baseType: !7, size: 32, elements: !14, identifier: "_ZTS7ObjType")
!13 = !DIFile(filename: "../poppler/Object.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!15 = !DIEnumerator(name: "objBool", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "objInt", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "objReal", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "objString", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "objName", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "objNull", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "objArray", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "objDict", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "objStream", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "objRef", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "objCmd", value: 10, isUnsigned: true)
!26 = !DIEnumerator(name: "objError", value: 11, isUnsigned: true)
!27 = !DIEnumerator(name: "objEOF", value: 12, isUnsigned: true)
!28 = !DIEnumerator(name: "objNone", value: 13, isUnsigned: true)
!29 = !DIEnumerator(name: "objUint", value: 14, isUnsigned: true)
!30 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "CryptAlgorithm", file: !31, line: 74, baseType: !7, size: 32, elements: !32, identifier: "_ZTS14CryptAlgorithm")
!31 = !DIFile(filename: "../poppler/Stream.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "cryptRC4", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "cryptAES", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "cryptAES256", value: 2, isUnsigned: true)
!36 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "PageMode", scope: !38, file: !37, line: 169, baseType: !7, size: 32, elements: !1382, identifier: "_ZTSN7Catalog8PageModeE")
!37 = !DIFile(filename: "../poppler/Catalog.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!38 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Catalog", file: !37, line: 94, size: 2176, flags: DIFlagTypePassByReference, elements: !39, identifier: "_ZTS7Catalog")
!39 = !{!40, !1140, !1141, !1142, !1143, !1144, !1147, !1150, !1153, !1154, !1155, !1158, !1159, !1160, !1161, !1162, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1213, !1214, !1225, !1229, !1232, !1235, !1238, !1241, !1244, !1247, !1248, !1251, !1254, !1257, !1258, !1259, !1332, !1333, !1336, !1339, !1342, !1343, !1344, !1347, !1355, !1358, !1361, !1364, !1367, !1370, !1373, !1376, !1377, !1380, !1381}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !38, file: !37, line: 198, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFDoc", file: !43, line: 69, size: 896, flags: DIFlagTypePassByReference, elements: !44, identifier: "_ZTS6PDFDoc")
!43 = !DIFile(filename: "../poppler/PDFDoc.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!44 = !{!45, !198, !204, !207, !209, !210, !211, !214, !672, !675, !677, !680, !683, !934, !935, !936, !937, !938, !942, !945, !948, !951, !954, !957, !958, !961, !964, !967, !970, !976, !979, !982, !983, !984, !985, !988, !989, !990, !993, !996, !999, !1002, !1005, !1008, !1011, !1016, !1019, !1022, !1023, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1037, !1038, !1039, !1040, !1043, !1046, !1054, !1057, !1060, !1063, !1066, !1069, !1072, !1075, !1078, !1081, !1084, !1087, !1090, !1091, !1094, !1097, !1100, !1103, !1106, !1109, !1112, !1113, !1116, !1119, !1122, !1123, !1124, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1136, !1137}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !42, file: !43, line: 303, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GooString", file: !48, line: 40, size: 320, flags: DIFlagTypePassByReference, elements: !49, identifier: "_ZTS9GooString")
!48 = !DIFile(filename: "../goo/GooString.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!49 = !{!50, !53, !54, !59, !60, !62, !66, !71, !74, !77, !80, !85, !89, !92, !95, !98, !103, !104, !107, !110, !113, !116, !119, !122, !125, !128, !131, !134, !137, !140, !143, !146, !147, !148, !151, !154, !157, !160, !166, !169, !173, !177, !180, !183, !189, !193, !197}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "STR_STATIC_SIZE", scope: !47, file: !48, line: 159, baseType: !51, flags: DIFlagStaticMember, extraData: i32 24)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "CALC_STRING_LEN", scope: !47, file: !48, line: 162, baseType: !51, flags: DIFlagStaticMember, extraData: i32 -1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sStatic", scope: !47, file: !48, line: 166, baseType: !55, size: 192)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 192, elements: !57)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !{!58}
!58 = !DISubrange(count: 24)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !47, file: !48, line: 167, baseType: !52, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !47, file: !48, line: 168, baseType: !61, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!62 = !DISubprogram(name: "GooString", scope: !47, file: !48, line: 44, type: !63, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!66 = !DISubprogram(name: "GooString", scope: !47, file: !48, line: 47, type: !67, scopeLine: 47, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !65, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!71 = !DISubprogram(name: "GooString", scope: !47, file: !48, line: 51, type: !72, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !65, !69, !52}
!74 = !DISubprogram(name: "GooString", scope: !47, file: !48, line: 54, type: !75, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !65, !46, !52, !52}
!77 = !DISubprogram(name: "Set", linkageName: "_ZN9GooString3SetEPKciS1_i", scope: !47, file: !48, line: 60, type: !78, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!78 = !DISubroutineType(types: !79)
!79 = !{!46, !65, !69, !52, !69, !52}
!80 = !DISubprogram(name: "GooString", scope: !47, file: !48, line: 63, type: !81, scopeLine: 63, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !65, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!85 = !DISubprogram(name: "copy", linkageName: "_ZNK9GooString4copyEv", scope: !47, file: !48, line: 64, type: !86, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!86 = !DISubroutineType(types: !87)
!87 = !{!46, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!89 = !DISubprogram(name: "GooString", scope: !47, file: !48, line: 67, type: !90, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !65, !46, !46}
!92 = !DISubprogram(name: "fromInt", linkageName: "_ZN9GooString7fromIntEi", scope: !47, file: !48, line: 70, type: !93, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!93 = !DISubroutineType(types: !94)
!94 = !{!46, !52}
!95 = !DISubprogram(name: "format", linkageName: "_ZN9GooString6formatEPKcz", scope: !47, file: !48, line: 95, type: !96, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!96 = !DISubroutineType(types: !97)
!97 = !{!46, !69, null}
!98 = !DISubprogram(name: "formatv", linkageName: "_ZN9GooString7formatvEPKcP13__va_list_tag", scope: !47, file: !48, line: 96, type: !99, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!99 = !DISubroutineType(types: !100)
!100 = !{!46, !69, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 84, flags: DIFlagFwdDecl, identifier: "_ZTS13__va_list_tag")
!103 = !DISubprogram(name: "~GooString", scope: !47, file: !48, line: 99, type: !63, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!104 = !DISubprogram(name: "getLength", linkageName: "_ZN9GooString9getLengthEv", scope: !47, file: !48, line: 102, type: !105, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!105 = !DISubroutineType(types: !106)
!106 = !{!52, !65}
!107 = !DISubprogram(name: "getCString", linkageName: "_ZNK9GooString10getCStringEv", scope: !47, file: !48, line: 105, type: !108, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!108 = !DISubroutineType(types: !109)
!109 = !{!61, !88}
!110 = !DISubprogram(name: "getChar", linkageName: "_ZN9GooString7getCharEi", scope: !47, file: !48, line: 108, type: !111, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!111 = !DISubroutineType(types: !112)
!112 = !{!56, !65, !52}
!113 = !DISubprogram(name: "setChar", linkageName: "_ZN9GooString7setCharEic", scope: !47, file: !48, line: 111, type: !114, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !65, !52, !56}
!116 = !DISubprogram(name: "clear", linkageName: "_ZN9GooString5clearEv", scope: !47, file: !48, line: 114, type: !117, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!117 = !DISubroutineType(types: !118)
!118 = !{!46, !65}
!119 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEc", scope: !47, file: !48, line: 117, type: !120, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!120 = !DISubroutineType(types: !121)
!121 = !{!46, !65, !56}
!122 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPS_", scope: !47, file: !48, line: 118, type: !123, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!123 = !DISubroutineType(types: !124)
!124 = !{!46, !65, !46}
!125 = !DISubprogram(name: "append", linkageName: "_ZN9GooString6appendEPKci", scope: !47, file: !48, line: 119, type: !126, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!126 = !DISubroutineType(types: !127)
!127 = !{!46, !65, !69, !52}
!128 = !DISubprogram(name: "appendf", linkageName: "_ZN9GooString7appendfEPKcz", scope: !47, file: !48, line: 122, type: !129, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{!46, !65, !69, null}
!131 = !DISubprogram(name: "appendfv", linkageName: "_ZN9GooString8appendfvEPKcP13__va_list_tag", scope: !47, file: !48, line: 123, type: !132, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!132 = !DISubroutineType(types: !133)
!133 = !{!46, !65, !69, !101}
!134 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEic", scope: !47, file: !48, line: 126, type: !135, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!135 = !DISubroutineType(types: !136)
!136 = !{!46, !65, !52, !56}
!137 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPS_", scope: !47, file: !48, line: 127, type: !138, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!138 = !DISubroutineType(types: !139)
!139 = !{!46, !65, !52, !46}
!140 = !DISubprogram(name: "insert", linkageName: "_ZN9GooString6insertEiPKci", scope: !47, file: !48, line: 128, type: !141, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!141 = !DISubroutineType(types: !142)
!142 = !{!46, !65, !52, !69, !52}
!143 = !DISubprogram(name: "del", linkageName: "_ZN9GooString3delEii", scope: !47, file: !48, line: 131, type: !144, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!144 = !DISubroutineType(types: !145)
!145 = !{!46, !65, !52, !52}
!146 = !DISubprogram(name: "upperCase", linkageName: "_ZN9GooString9upperCaseEv", scope: !47, file: !48, line: 134, type: !117, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!147 = !DISubprogram(name: "lowerCase", linkageName: "_ZN9GooString9lowerCaseEv", scope: !47, file: !48, line: 135, type: !117, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!148 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPS_", scope: !47, file: !48, line: 138, type: !149, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!149 = !DISubroutineType(types: !150)
!150 = !{!52, !88, !46}
!151 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPS_i", scope: !47, file: !48, line: 139, type: !152, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!152 = !DISubroutineType(types: !153)
!153 = !{!52, !88, !46, !52}
!154 = !DISubprogram(name: "cmp", linkageName: "_ZNK9GooString3cmpEPKc", scope: !47, file: !48, line: 140, type: !155, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!155 = !DISubroutineType(types: !156)
!156 = !{!52, !88, !69}
!157 = !DISubprogram(name: "cmpN", linkageName: "_ZNK9GooString4cmpNEPKci", scope: !47, file: !48, line: 141, type: !158, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!158 = !DISubroutineType(types: !159)
!159 = !{!52, !88, !69, !52}
!160 = !DISubprogram(name: "hasUnicodeMarker", linkageName: "_ZN9GooString16hasUnicodeMarkerEv", scope: !47, file: !48, line: 143, type: !161, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !65}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GBool", file: !164, line: 31, baseType: !165)
!164 = !DIFile(filename: "../goo/gtypes.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!165 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!166 = !DISubprogram(name: "sanitizedName", linkageName: "_ZN9GooString13sanitizedNameEb", scope: !47, file: !48, line: 149, type: !167, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!167 = !DISubroutineType(types: !168)
!168 = !{!46, !65, !163}
!169 = !DISubprogram(name: "GooString", scope: !47, file: !48, line: 152, type: !170, scopeLine: 152, flags: DIFlagPrototyped, spFlags: 0)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !65, !172}
!172 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !84, size: 64)
!173 = !DISubprogram(name: "operator=", linkageName: "_ZN9GooStringaSERKS_", scope: !47, file: !48, line: 153, type: !174, scopeLine: 153, flags: DIFlagPrototyped, spFlags: 0)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !65, !172}
!176 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !47, size: 64)
!177 = !DISubprogram(name: "roundedSize", linkageName: "_ZN9GooString11roundedSizeEi", scope: !47, file: !48, line: 164, type: !178, scopeLine: 164, flags: DIFlagPrototyped, spFlags: 0)
!178 = !DISubroutineType(types: !179)
!179 = !{!52, !65, !52}
!180 = !DISubprogram(name: "resize", linkageName: "_ZN9GooString6resizeEi", scope: !47, file: !48, line: 170, type: !181, scopeLine: 170, flags: DIFlagPrototyped, spFlags: 0)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !65, !52}
!183 = !DISubprogram(name: "formatInt", linkageName: "_ZN9GooString9formatIntExPcibiiPS0_Pib", scope: !47, file: !48, line: 172, type: !184, scopeLine: 172, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !186, !61, !52, !163, !52, !52, !187, !188, !163}
!186 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!189 = !DISubprogram(name: "formatUInt", linkageName: "_ZN9GooString10formatUIntEyPcibiiPS0_Pib", scope: !47, file: !48, line: 181, type: !190, scopeLine: 181, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !192, !61, !52, !163, !52, !52, !187, !188, !163}
!192 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!193 = !DISubprogram(name: "formatDouble", linkageName: "_ZN9GooString12formatDoubleEdPciibPS0_Pi", scope: !47, file: !48, line: 189, type: !194, scopeLine: 189, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196, !61, !52, !52, !163, !187, !188}
!196 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!197 = !DISubprogram(name: "formatDoubleSmallAware", linkageName: "_ZN9GooString22formatDoubleSmallAwareEdPciibPS0_Pi", scope: !47, file: !48, line: 191, type: !194, scopeLine: 191, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !42, file: !43, line: 307, baseType: !199, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !201, line: 48, baseType: !202)
!201 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !203, line: 241, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!203 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !42, file: !43, line: 308, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseStream", file: !31, line: 297, flags: DIFlagFwdDecl, identifier: "_ZTS10BaseStream")
!207 = !DIDerivedType(tag: DW_TAG_member, name: "guiData", scope: !42, file: !43, line: 309, baseType: !208, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMajorVersion", scope: !42, file: !43, line: 310, baseType: !52, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pdfMinorVersion", scope: !42, file: !43, line: 311, baseType: !52, size: 32, offset: 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "linearization", scope: !42, file: !43, line: 312, baseType: !212, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Linearization", file: !43, line: 55, flags: DIFlagFwdDecl, identifier: "_ZTS13Linearization")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !42, file: !43, line: 313, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRef", file: !217, line: 90, size: 1344, flags: DIFlagTypePassByReference, elements: !218, identifier: "_ZTS4XRef")
!217 = !DIFile(filename: "../poppler/XRef.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!218 = !{!219, !220, !222, !225, !226, !227, !228, !229, !230, !231, !526, !528, !529, !532, !533, !534, !535, !536, !537, !538, !542, !543, !544, !545, !546, !547, !548, !552, !555, !559, !560, !563, !564, !567, !570, !571, !576, !577, !580, !581, !582, !583, !584, !585, !586, !587, !588, !591, !594, !595, !596, !597, !598, !599, !602, !605, !606, !609, !612, !615, !618, !621, !624, !629, !632, !633, !636, !637, !646, !651, !654, !657, !660, !663, !666, !667}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !216, file: !217, line: 185, baseType: !205, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !216, file: !217, line: 186, baseType: !221, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guint", file: !164, line: 45, baseType: !7)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !216, file: !217, line: 188, baseType: !223, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XRefEntry", file: !217, line: 59, flags: DIFlagFwdDecl, identifier: "_ZTS9XRefEntry")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !216, file: !217, line: 189, baseType: !52, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !216, file: !217, line: 190, baseType: !52, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rootNum", scope: !216, file: !217, line: 191, baseType: !52, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rootGen", scope: !216, file: !217, line: 191, baseType: !52, size: 32, offset: 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !216, file: !217, line: 192, baseType: !163, size: 8, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "errCode", scope: !216, file: !217, line: 193, baseType: !52, size: 32, offset: 352)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "trailerDict", scope: !216, file: !217, line: 194, baseType: !232, size: 128, offset: 384)
!232 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Object", file: !13, line: 112, size: 128, flags: DIFlagTypePassByValue, elements: !233, identifier: "_ZTS6Object")
!233 = !{!234, !235, !353, !357, !358, !361, !364, !367, !370, !373, !376, !379, !380, !383, !386, !389, !392, !393, !394, !397, !400, !401, !404, !405, !408, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !429, !430, !433, !434, !435, !438, !441, !442, !445, !448, !451, !454, !457, !460, !461, !462, !463, !466, !467, !470, !473, !476, !477, !478, !481, !484, !485, !488, !491, !494, !495, !496, !497, !498, !499, !500, !506, !507, !510, !513, !516, !517, !520, !523}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !13, line: 245, baseType: !12, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !232, file: !13, line: 246, baseType: !236, size: 64, offset: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !13, line: 246, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !237, identifier: "_ZTSN6ObjectUt_E")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !280, !344, !347, !352}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "booln", scope: !236, file: !13, line: 247, baseType: !163, size: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intg", scope: !236, file: !13, line: 248, baseType: !52, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "uintg", scope: !236, file: !13, line: 249, baseType: !7, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !236, file: !13, line: 250, baseType: !196, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !236, file: !13, line: 251, baseType: !46, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !13, line: 252, baseType: !61, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !236, file: !13, line: 253, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Array", file: !247, line: 39, size: 256, flags: DIFlagTypePassByReference, elements: !248, identifier: "_ZTS5Array")
!247 = !DIFile(filename: "../poppler/Array.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!248 = !{!249, !250, !252, !253, !254, !255, !259, !262, !265, !266, !267, !270, !273, !276, !277}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !246, file: !247, line: 68, baseType: !215, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !246, file: !247, line: 69, baseType: !251, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !247, line: 70, baseType: !52, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !246, file: !247, line: 71, baseType: !52, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !246, file: !247, line: 72, baseType: !52, size: 32, offset: 192)
!255 = !DISubprogram(name: "Array", scope: !246, file: !247, line: 43, type: !256, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258, !215}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!259 = !DISubprogram(name: "~Array", scope: !246, file: !247, line: 46, type: !260, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !258}
!262 = !DISubprogram(name: "incRef", linkageName: "_ZN5Array6incRefEv", scope: !246, file: !247, line: 49, type: !263, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{!52, !258}
!265 = !DISubprogram(name: "decRef", linkageName: "_ZN5Array6decRefEv", scope: !246, file: !247, line: 50, type: !263, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!266 = !DISubprogram(name: "getLength", linkageName: "_ZN5Array9getLengthEv", scope: !246, file: !247, line: 53, type: !263, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!267 = !DISubprogram(name: "add", linkageName: "_ZN5Array3addEP6Object", scope: !246, file: !247, line: 56, type: !268, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !258, !251}
!270 = !DISubprogram(name: "remove", linkageName: "_ZN5Array6removeEi", scope: !246, file: !247, line: 59, type: !271, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !258, !52}
!273 = !DISubprogram(name: "get", linkageName: "_ZN5Array3getEiP6Object", scope: !246, file: !247, line: 62, type: !274, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!274 = !DISubroutineType(types: !275)
!275 = !{!251, !258, !52, !251}
!276 = !DISubprogram(name: "getNF", linkageName: "_ZN5Array5getNFEiP6Object", scope: !246, file: !247, line: 63, type: !274, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!277 = !DISubprogram(name: "getString", linkageName: "_ZN5Array9getStringEiP9GooString", scope: !246, file: !247, line: 64, type: !278, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!278 = !DISubroutineType(types: !279)
!279 = !{!163, !258, !52, !46}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !236, file: !13, line: 254, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Dict", file: !283, line: 45, size: 320, flags: DIFlagTypePassByReference, elements: !284, identifier: "_ZTS4Dict")
!283 = !DIFile(filename: "../poppler/Dict.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!284 = !{!285, !286, !287, !290, !291, !292, !293, !297, !300, !303, !306, !307, !308, !311, !314, !317, !320, !323, !326, !329, !332, !335, !336, !337, !340, !341}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !282, file: !283, line: 95, baseType: !163, size: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !282, file: !283, line: 96, baseType: !215, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !282, file: !283, line: 97, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DictEntry", file: !283, line: 40, flags: DIFlagFwdDecl, identifier: "_ZTS9DictEntry")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !282, file: !283, line: 98, baseType: !52, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !282, file: !283, line: 99, baseType: !52, size: 32, offset: 224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !282, file: !283, line: 100, baseType: !52, size: 32, offset: 256)
!293 = !DISubprogram(name: "Dict", scope: !282, file: !283, line: 49, type: !294, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296, !215}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!297 = !DISubprogram(name: "Dict", scope: !282, file: !283, line: 50, type: !298, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !296, !281}
!300 = !DISubprogram(name: "~Dict", scope: !282, file: !283, line: 53, type: !301, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !296}
!303 = !DISubprogram(name: "incRef", linkageName: "_ZN4Dict6incRefEv", scope: !282, file: !283, line: 56, type: !304, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!304 = !DISubroutineType(types: !305)
!305 = !{!52, !296}
!306 = !DISubprogram(name: "decRef", linkageName: "_ZN4Dict6decRefEv", scope: !282, file: !283, line: 57, type: !304, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!307 = !DISubprogram(name: "getLength", linkageName: "_ZN4Dict9getLengthEv", scope: !282, file: !283, line: 60, type: !304, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!308 = !DISubprogram(name: "add", linkageName: "_ZN4Dict3addEPcP6Object", scope: !282, file: !283, line: 63, type: !309, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !296, !61, !251}
!311 = !DISubprogram(name: "set", linkageName: "_ZN4Dict3setEPKcP6Object", scope: !282, file: !283, line: 66, type: !312, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !296, !69, !251}
!314 = !DISubprogram(name: "remove", linkageName: "_ZN4Dict6removeEPKc", scope: !282, file: !283, line: 68, type: !315, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !296, !69}
!317 = !DISubprogram(name: "is", linkageName: "_ZN4Dict2isEPKc", scope: !282, file: !283, line: 71, type: !318, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!318 = !DISubroutineType(types: !319)
!319 = !{!163, !296, !69}
!320 = !DISubprogram(name: "lookup", linkageName: "_ZN4Dict6lookupEPKcP6Objecti", scope: !282, file: !283, line: 75, type: !321, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!321 = !DISubroutineType(types: !322)
!322 = !{!251, !296, !69, !251, !52}
!323 = !DISubprogram(name: "lookupNF", linkageName: "_ZN4Dict8lookupNFEPKcP6Object", scope: !282, file: !283, line: 76, type: !324, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!324 = !DISubroutineType(types: !325)
!325 = !{!251, !296, !69, !251}
!326 = !DISubprogram(name: "lookupInt", linkageName: "_ZN4Dict9lookupIntEPKcS1_Pi", scope: !282, file: !283, line: 77, type: !327, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!327 = !DISubroutineType(types: !328)
!328 = !{!163, !296, !69, !69, !188}
!329 = !DISubprogram(name: "getKey", linkageName: "_ZN4Dict6getKeyEi", scope: !282, file: !283, line: 80, type: !330, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!330 = !DISubroutineType(types: !331)
!331 = !{!61, !296, !52}
!332 = !DISubprogram(name: "getVal", linkageName: "_ZN4Dict6getValEiP6Object", scope: !282, file: !283, line: 81, type: !333, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!333 = !DISubroutineType(types: !334)
!334 = !{!251, !296, !52, !251}
!335 = !DISubprogram(name: "getValNF", linkageName: "_ZN4Dict8getValNFEiP6Object", scope: !282, file: !283, line: 82, type: !333, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!336 = !DISubprogram(name: "setXRef", linkageName: "_ZN4Dict7setXRefEP4XRef", scope: !282, file: !283, line: 87, type: !294, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!337 = !DISubprogram(name: "getXRef", linkageName: "_ZN4Dict7getXRefEv", scope: !282, file: !283, line: 89, type: !338, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!338 = !DISubroutineType(types: !339)
!339 = !{!215, !296}
!340 = !DISubprogram(name: "hasKey", linkageName: "_ZN4Dict6hasKeyEPKc", scope: !282, file: !283, line: 91, type: !318, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!341 = !DISubprogram(name: "find", linkageName: "_ZN4Dict4findEPKc", scope: !282, file: !283, line: 102, type: !342, scopeLine: 102, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DISubroutineType(types: !343)
!343 = !{!288, !296, !69}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !236, file: !13, line: 255, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stream", file: !31, line: 91, flags: DIFlagFwdDecl, identifier: "_ZTS6Stream")
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !236, file: !13, line: 256, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ref", file: !13, line: 66, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !349, identifier: "_ZTS3Ref")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !348, file: !13, line: 67, baseType: !52, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gen", scope: !348, file: !13, line: 68, baseType: !52, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !236, file: !13, line: 257, baseType: !61, size: 64)
!353 = !DISubprogram(name: "zeroUnion", linkageName: "_ZN6Object9zeroUnionEv", scope: !232, file: !13, line: 115, type: !354, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!357 = !DISubprogram(name: "Object", scope: !232, file: !13, line: 118, type: !354, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!358 = !DISubprogram(name: "initBool", linkageName: "_ZN6Object8initBoolEb", scope: !232, file: !13, line: 122, type: !359, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!359 = !DISubroutineType(types: !360)
!360 = !{!251, !356, !163}
!361 = !DISubprogram(name: "initInt", linkageName: "_ZN6Object7initIntEi", scope: !232, file: !13, line: 124, type: !362, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!362 = !DISubroutineType(types: !363)
!363 = !{!251, !356, !52}
!364 = !DISubprogram(name: "initReal", linkageName: "_ZN6Object8initRealEd", scope: !232, file: !13, line: 126, type: !365, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!365 = !DISubroutineType(types: !366)
!366 = !{!251, !356, !196}
!367 = !DISubprogram(name: "initString", linkageName: "_ZN6Object10initStringEP9GooString", scope: !232, file: !13, line: 128, type: !368, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!368 = !DISubroutineType(types: !369)
!369 = !{!251, !356, !46}
!370 = !DISubprogram(name: "initName", linkageName: "_ZN6Object8initNameEPKc", scope: !232, file: !13, line: 130, type: !371, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!371 = !DISubroutineType(types: !372)
!372 = !{!251, !356, !69}
!373 = !DISubprogram(name: "initNull", linkageName: "_ZN6Object8initNullEv", scope: !232, file: !13, line: 132, type: !374, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!374 = !DISubroutineType(types: !375)
!375 = !{!251, !356}
!376 = !DISubprogram(name: "initArray", linkageName: "_ZN6Object9initArrayEP4XRef", scope: !232, file: !13, line: 134, type: !377, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!377 = !DISubroutineType(types: !378)
!378 = !{!251, !356, !215}
!379 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4XRef", scope: !232, file: !13, line: 135, type: !377, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!380 = !DISubprogram(name: "initDict", linkageName: "_ZN6Object8initDictEP4Dict", scope: !232, file: !13, line: 136, type: !381, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!381 = !DISubroutineType(types: !382)
!382 = !{!251, !356, !281}
!383 = !DISubprogram(name: "initStream", linkageName: "_ZN6Object10initStreamEP6Stream", scope: !232, file: !13, line: 137, type: !384, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{!251, !356, !345}
!386 = !DISubprogram(name: "initRef", linkageName: "_ZN6Object7initRefEii", scope: !232, file: !13, line: 138, type: !387, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!387 = !DISubroutineType(types: !388)
!388 = !{!251, !356, !52, !52}
!389 = !DISubprogram(name: "initCmd", linkageName: "_ZN6Object7initCmdEPc", scope: !232, file: !13, line: 140, type: !390, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!390 = !DISubroutineType(types: !391)
!391 = !{!251, !356, !61}
!392 = !DISubprogram(name: "initError", linkageName: "_ZN6Object9initErrorEv", scope: !232, file: !13, line: 142, type: !374, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!393 = !DISubprogram(name: "initEOF", linkageName: "_ZN6Object7initEOFEv", scope: !232, file: !13, line: 144, type: !374, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!394 = !DISubprogram(name: "initUint", linkageName: "_ZN6Object8initUintEj", scope: !232, file: !13, line: 146, type: !395, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!395 = !DISubroutineType(types: !396)
!396 = !{!251, !356, !7}
!397 = !DISubprogram(name: "copy", linkageName: "_ZN6Object4copyEPS_", scope: !232, file: !13, line: 150, type: !398, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!251, !356, !251}
!400 = !DISubprogram(name: "shallowCopy", linkageName: "_ZN6Object11shallowCopyEPS_", scope: !232, file: !13, line: 151, type: !398, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!401 = !DISubprogram(name: "fetch", linkageName: "_ZN6Object5fetchEP4XRefPS_i", scope: !232, file: !13, line: 158, type: !402, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!251, !356, !215, !251, !52}
!404 = !DISubprogram(name: "free", linkageName: "_ZN6Object4freeEv", scope: !232, file: !13, line: 161, type: !354, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!405 = !DISubprogram(name: "getType", linkageName: "_ZN6Object7getTypeEv", scope: !232, file: !13, line: 164, type: !406, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{!12, !356}
!408 = !DISubprogram(name: "isBool", linkageName: "_ZN6Object6isBoolEv", scope: !232, file: !13, line: 165, type: !409, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!163, !356}
!411 = !DISubprogram(name: "isInt", linkageName: "_ZN6Object5isIntEv", scope: !232, file: !13, line: 166, type: !409, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!412 = !DISubprogram(name: "isReal", linkageName: "_ZN6Object6isRealEv", scope: !232, file: !13, line: 167, type: !409, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!413 = !DISubprogram(name: "isNum", linkageName: "_ZN6Object5isNumEv", scope: !232, file: !13, line: 168, type: !409, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!414 = !DISubprogram(name: "isString", linkageName: "_ZN6Object8isStringEv", scope: !232, file: !13, line: 169, type: !409, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!415 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEv", scope: !232, file: !13, line: 170, type: !409, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!416 = !DISubprogram(name: "isNull", linkageName: "_ZN6Object6isNullEv", scope: !232, file: !13, line: 171, type: !409, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!417 = !DISubprogram(name: "isArray", linkageName: "_ZN6Object7isArrayEv", scope: !232, file: !13, line: 172, type: !409, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!418 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEv", scope: !232, file: !13, line: 173, type: !409, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!419 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEv", scope: !232, file: !13, line: 174, type: !409, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!420 = !DISubprogram(name: "isRef", linkageName: "_ZN6Object5isRefEv", scope: !232, file: !13, line: 175, type: !409, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!421 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEv", scope: !232, file: !13, line: 176, type: !409, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!422 = !DISubprogram(name: "isError", linkageName: "_ZN6Object7isErrorEv", scope: !232, file: !13, line: 177, type: !409, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!423 = !DISubprogram(name: "isEOF", linkageName: "_ZN6Object5isEOFEv", scope: !232, file: !13, line: 178, type: !409, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!424 = !DISubprogram(name: "isNone", linkageName: "_ZN6Object6isNoneEv", scope: !232, file: !13, line: 179, type: !409, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!425 = !DISubprogram(name: "isUint", linkageName: "_ZN6Object6isUintEv", scope: !232, file: !13, line: 180, type: !409, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!426 = !DISubprogram(name: "isName", linkageName: "_ZN6Object6isNameEPKc", scope: !232, file: !13, line: 183, type: !427, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!427 = !DISubroutineType(types: !428)
!428 = !{!163, !356, !69}
!429 = !DISubprogram(name: "isDict", linkageName: "_ZN6Object6isDictEPKc", scope: !232, file: !13, line: 185, type: !427, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!430 = !DISubprogram(name: "isStream", linkageName: "_ZN6Object8isStreamEPc", scope: !232, file: !13, line: 186, type: !431, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!431 = !DISubroutineType(types: !432)
!432 = !{!163, !356, !61}
!433 = !DISubprogram(name: "isCmd", linkageName: "_ZN6Object5isCmdEPKc", scope: !232, file: !13, line: 187, type: !427, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!434 = !DISubprogram(name: "getBool", linkageName: "_ZN6Object7getBoolEv", scope: !232, file: !13, line: 191, type: !409, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!435 = !DISubprogram(name: "getInt", linkageName: "_ZN6Object6getIntEv", scope: !232, file: !13, line: 192, type: !436, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!436 = !DISubroutineType(types: !437)
!437 = !{!52, !356}
!438 = !DISubprogram(name: "getReal", linkageName: "_ZN6Object7getRealEv", scope: !232, file: !13, line: 193, type: !439, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!196, !356}
!441 = !DISubprogram(name: "getNum", linkageName: "_ZN6Object6getNumEv", scope: !232, file: !13, line: 194, type: !439, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!442 = !DISubprogram(name: "getString", linkageName: "_ZN6Object9getStringEv", scope: !232, file: !13, line: 195, type: !443, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{!46, !356}
!445 = !DISubprogram(name: "getName", linkageName: "_ZN6Object7getNameEv", scope: !232, file: !13, line: 196, type: !446, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!61, !356}
!448 = !DISubprogram(name: "getArray", linkageName: "_ZN6Object8getArrayEv", scope: !232, file: !13, line: 197, type: !449, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!449 = !DISubroutineType(types: !450)
!450 = !{!245, !356}
!451 = !DISubprogram(name: "getDict", linkageName: "_ZN6Object7getDictEv", scope: !232, file: !13, line: 198, type: !452, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!452 = !DISubroutineType(types: !453)
!453 = !{!281, !356}
!454 = !DISubprogram(name: "getStream", linkageName: "_ZN6Object9getStreamEv", scope: !232, file: !13, line: 199, type: !455, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!345, !356}
!457 = !DISubprogram(name: "getRef", linkageName: "_ZN6Object6getRefEv", scope: !232, file: !13, line: 200, type: !458, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!458 = !DISubroutineType(types: !459)
!459 = !{!348, !356}
!460 = !DISubprogram(name: "getRefNum", linkageName: "_ZN6Object9getRefNumEv", scope: !232, file: !13, line: 201, type: !436, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!461 = !DISubprogram(name: "getRefGen", linkageName: "_ZN6Object9getRefGenEv", scope: !232, file: !13, line: 202, type: !436, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!462 = !DISubprogram(name: "getCmd", linkageName: "_ZN6Object6getCmdEv", scope: !232, file: !13, line: 203, type: !446, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!463 = !DISubprogram(name: "getUint", linkageName: "_ZN6Object7getUintEv", scope: !232, file: !13, line: 204, type: !464, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!464 = !DISubroutineType(types: !465)
!465 = !{!7, !356}
!466 = !DISubprogram(name: "arrayGetLength", linkageName: "_ZN6Object14arrayGetLengthEv", scope: !232, file: !13, line: 207, type: !436, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!467 = !DISubprogram(name: "arrayAdd", linkageName: "_ZN6Object8arrayAddEPS_", scope: !232, file: !13, line: 208, type: !468, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !356, !251}
!470 = !DISubprogram(name: "arrayRemove", linkageName: "_ZN6Object11arrayRemoveEi", scope: !232, file: !13, line: 209, type: !471, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !356, !52}
!473 = !DISubprogram(name: "arrayGet", linkageName: "_ZN6Object8arrayGetEiPS_", scope: !232, file: !13, line: 210, type: !474, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!251, !356, !52, !251}
!476 = !DISubprogram(name: "arrayGetNF", linkageName: "_ZN6Object10arrayGetNFEiPS_", scope: !232, file: !13, line: 211, type: !474, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!477 = !DISubprogram(name: "dictGetLength", linkageName: "_ZN6Object13dictGetLengthEv", scope: !232, file: !13, line: 214, type: !436, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!478 = !DISubprogram(name: "dictAdd", linkageName: "_ZN6Object7dictAddEPcPS_", scope: !232, file: !13, line: 215, type: !479, scopeLine: 215, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !356, !61, !251}
!481 = !DISubprogram(name: "dictSet", linkageName: "_ZN6Object7dictSetEPKcPS_", scope: !232, file: !13, line: 216, type: !482, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !356, !69, !251}
!484 = !DISubprogram(name: "dictIs", linkageName: "_ZN6Object6dictIsEPKc", scope: !232, file: !13, line: 217, type: !427, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!485 = !DISubprogram(name: "dictLookup", linkageName: "_ZN6Object10dictLookupEPKcPS_i", scope: !232, file: !13, line: 218, type: !486, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!486 = !DISubroutineType(types: !487)
!487 = !{!251, !356, !69, !251, !52}
!488 = !DISubprogram(name: "dictLookupNF", linkageName: "_ZN6Object12dictLookupNFEPKcPS_", scope: !232, file: !13, line: 219, type: !489, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!489 = !DISubroutineType(types: !490)
!490 = !{!251, !356, !69, !251}
!491 = !DISubprogram(name: "dictGetKey", linkageName: "_ZN6Object10dictGetKeyEi", scope: !232, file: !13, line: 220, type: !492, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!492 = !DISubroutineType(types: !493)
!493 = !{!61, !356, !52}
!494 = !DISubprogram(name: "dictGetVal", linkageName: "_ZN6Object10dictGetValEiPS_", scope: !232, file: !13, line: 221, type: !474, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!495 = !DISubprogram(name: "dictGetValNF", linkageName: "_ZN6Object12dictGetValNFEiPS_", scope: !232, file: !13, line: 222, type: !474, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!496 = !DISubprogram(name: "streamIs", linkageName: "_ZN6Object8streamIsEPc", scope: !232, file: !13, line: 225, type: !431, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!497 = !DISubprogram(name: "streamReset", linkageName: "_ZN6Object11streamResetEv", scope: !232, file: !13, line: 226, type: !354, scopeLine: 226, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!498 = !DISubprogram(name: "streamClose", linkageName: "_ZN6Object11streamCloseEv", scope: !232, file: !13, line: 227, type: !354, scopeLine: 227, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!499 = !DISubprogram(name: "streamGetChar", linkageName: "_ZN6Object13streamGetCharEv", scope: !232, file: !13, line: 228, type: !436, scopeLine: 228, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!500 = !DISubprogram(name: "streamGetChars", linkageName: "_ZN6Object14streamGetCharsEiPh", scope: !232, file: !13, line: 229, type: !501, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!52, !356, !52, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "Guchar", file: !164, line: 43, baseType: !505)
!505 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!506 = !DISubprogram(name: "streamLookChar", linkageName: "_ZN6Object14streamLookCharEv", scope: !232, file: !13, line: 230, type: !436, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!507 = !DISubprogram(name: "streamGetLine", linkageName: "_ZN6Object13streamGetLineEPci", scope: !232, file: !13, line: 231, type: !508, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!508 = !DISubroutineType(types: !509)
!509 = !{!61, !356, !61, !52}
!510 = !DISubprogram(name: "streamGetPos", linkageName: "_ZN6Object12streamGetPosEv", scope: !232, file: !13, line: 232, type: !511, scopeLine: 232, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!511 = !DISubroutineType(types: !512)
!512 = !{!221, !356}
!513 = !DISubprogram(name: "streamSetPos", linkageName: "_ZN6Object12streamSetPosEji", scope: !232, file: !13, line: 233, type: !514, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !356, !221, !52}
!516 = !DISubprogram(name: "streamGetDict", linkageName: "_ZN6Object13streamGetDictEv", scope: !232, file: !13, line: 234, type: !452, scopeLine: 234, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!517 = !DISubprogram(name: "getTypeName", linkageName: "_ZN6Object11getTypeNameEv", scope: !232, file: !13, line: 237, type: !518, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!69, !356}
!520 = !DISubprogram(name: "print", linkageName: "_ZN6Object5printEP8_IO_FILE", scope: !232, file: !13, line: 238, type: !521, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !356, !199}
!523 = !DISubprogram(name: "memCheck", linkageName: "_ZN6Object8memCheckEP8_IO_FILE", scope: !232, file: !13, line: 241, type: !524, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !199}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "streamEnds", scope: !216, file: !217, line: 195, baseType: !527, size: 64, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "streamEndsLen", scope: !216, file: !217, line: 197, baseType: !52, size: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "objStrs", scope: !216, file: !217, line: 198, baseType: !530, size: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PopplerCache", file: !217, line: 46, flags: DIFlagFwdDecl, identifier: "_ZTS12PopplerCache")
!532 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !216, file: !217, line: 199, baseType: !163, size: 8, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "encRevision", scope: !216, file: !217, line: 200, baseType: !52, size: 32, offset: 736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "encVersion", scope: !216, file: !217, line: 201, baseType: !52, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "encAlgorithm", scope: !216, file: !217, line: 202, baseType: !30, size: 32, offset: 800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "keyLength", scope: !216, file: !217, line: 203, baseType: !52, size: 32, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "permFlags", scope: !216, file: !217, line: 204, baseType: !52, size: 32, offset: 864)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fileKey", scope: !216, file: !217, line: 205, baseType: !539, size: 256, offset: 896)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 256, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPasswordOk", scope: !216, file: !217, line: 206, baseType: !163, size: 8, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prevXRefOffset", scope: !216, file: !217, line: 207, baseType: !221, size: 32, offset: 1184)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefEntriesOffset", scope: !216, file: !217, line: 208, baseType: !221, size: 32, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "xRefStream", scope: !216, file: !217, line: 209, baseType: !163, size: 8, offset: 1248)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mainXRefOffset", scope: !216, file: !217, line: 210, baseType: !221, size: 32, offset: 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scannedSpecialFlags", scope: !216, file: !217, line: 211, baseType: !163, size: 8, offset: 1312)
!548 = !DISubprogram(name: "XRef", scope: !216, file: !217, line: 94, type: !549, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!552 = !DISubprogram(name: "XRef", scope: !216, file: !217, line: 96, type: !553, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !551, !251}
!555 = !DISubprogram(name: "XRef", scope: !216, file: !217, line: 98, type: !556, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !551, !205, !221, !221, !558, !163}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!559 = !DISubprogram(name: "~XRef", scope: !216, file: !217, line: 101, type: !549, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!560 = !DISubprogram(name: "isOk", linkageName: "_ZN4XRef4isOkEv", scope: !216, file: !217, line: 104, type: !561, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!163, !551}
!563 = !DISubprogram(name: "isXRefStream", linkageName: "_ZN4XRef12isXRefStreamEv", scope: !216, file: !217, line: 107, type: !561, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!564 = !DISubprogram(name: "getErrorCode", linkageName: "_ZN4XRef12getErrorCodeEv", scope: !216, file: !217, line: 110, type: !565, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!565 = !DISubroutineType(types: !566)
!566 = !{!52, !551}
!567 = !DISubprogram(name: "setEncryption", linkageName: "_ZN4XRef13setEncryptionEibPhiii14CryptAlgorithm", scope: !216, file: !217, line: 113, type: !568, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !551, !52, !163, !503, !52, !52, !52, !30}
!570 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEv", scope: !216, file: !217, line: 118, type: !549, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!571 = !DISubprogram(name: "getEncryptionParameters", linkageName: "_ZN4XRef23getEncryptionParametersEPPhP14CryptAlgorithmPi", scope: !216, file: !217, line: 120, type: !572, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !551, !574, !575, !188}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!576 = !DISubprogram(name: "isEncrypted", linkageName: "_ZN4XRef11isEncryptedEv", scope: !216, file: !217, line: 123, type: !561, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!577 = !DISubprogram(name: "okToPrint", linkageName: "_ZN4XRef9okToPrintEb", scope: !216, file: !217, line: 126, type: !578, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!578 = !DISubroutineType(types: !579)
!579 = !{!163, !551, !163}
!580 = !DISubprogram(name: "okToPrintHighRes", linkageName: "_ZN4XRef16okToPrintHighResEb", scope: !216, file: !217, line: 127, type: !578, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!581 = !DISubprogram(name: "okToChange", linkageName: "_ZN4XRef10okToChangeEb", scope: !216, file: !217, line: 128, type: !578, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!582 = !DISubprogram(name: "okToCopy", linkageName: "_ZN4XRef8okToCopyEb", scope: !216, file: !217, line: 129, type: !578, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!583 = !DISubprogram(name: "okToAddNotes", linkageName: "_ZN4XRef12okToAddNotesEb", scope: !216, file: !217, line: 130, type: !578, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!584 = !DISubprogram(name: "okToFillForm", linkageName: "_ZN4XRef12okToFillFormEb", scope: !216, file: !217, line: 131, type: !578, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!585 = !DISubprogram(name: "okToAccessibility", linkageName: "_ZN4XRef17okToAccessibilityEb", scope: !216, file: !217, line: 132, type: !578, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!586 = !DISubprogram(name: "okToAssemble", linkageName: "_ZN4XRef12okToAssembleEb", scope: !216, file: !217, line: 133, type: !578, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!587 = !DISubprogram(name: "getPermFlags", linkageName: "_ZN4XRef12getPermFlagsEv", scope: !216, file: !217, line: 134, type: !565, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!588 = !DISubprogram(name: "getCatalog", linkageName: "_ZN4XRef10getCatalogEP6Object", scope: !216, file: !217, line: 137, type: !589, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!589 = !DISubroutineType(types: !590)
!590 = !{!251, !551, !251}
!591 = !DISubprogram(name: "fetch", linkageName: "_ZN4XRef5fetchEiiP6Objecti", scope: !216, file: !217, line: 140, type: !592, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!251, !551, !52, !52, !251, !52}
!594 = !DISubprogram(name: "getDocInfo", linkageName: "_ZN4XRef10getDocInfoEP6Object", scope: !216, file: !217, line: 143, type: !589, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!595 = !DISubprogram(name: "getDocInfoNF", linkageName: "_ZN4XRef12getDocInfoNFEP6Object", scope: !216, file: !217, line: 144, type: !589, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!596 = !DISubprogram(name: "getNumObjects", linkageName: "_ZN4XRef13getNumObjectsEv", scope: !216, file: !217, line: 147, type: !565, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!597 = !DISubprogram(name: "getRootNum", linkageName: "_ZN4XRef10getRootNumEv", scope: !216, file: !217, line: 150, type: !565, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!598 = !DISubprogram(name: "getRootGen", linkageName: "_ZN4XRef10getRootGenEv", scope: !216, file: !217, line: 151, type: !565, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!599 = !DISubprogram(name: "getStreamEnd", linkageName: "_ZN4XRef12getStreamEndEjPj", scope: !216, file: !217, line: 155, type: !600, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!600 = !DISubroutineType(types: !601)
!601 = !{!163, !551, !221, !527}
!602 = !DISubprogram(name: "getNumEntry", linkageName: "_ZN4XRef11getNumEntryEj", scope: !216, file: !217, line: 158, type: !603, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{!52, !551, !221}
!605 = !DISubprogram(name: "scanSpecialFlags", linkageName: "_ZN4XRef16scanSpecialFlagsEv", scope: !216, file: !217, line: 166, type: !549, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!606 = !DISubprogram(name: "getEntry", linkageName: "_ZN4XRef8getEntryEib", scope: !216, file: !217, line: 169, type: !607, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!607 = !DISubroutineType(types: !608)
!608 = !{!223, !551, !52, !163}
!609 = !DISubprogram(name: "getTrailerDict", linkageName: "_ZN4XRef14getTrailerDictEv", scope: !216, file: !217, line: 170, type: !610, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!610 = !DISubroutineType(types: !611)
!611 = !{!251, !551}
!612 = !DISubprogram(name: "setModifiedObject", linkageName: "_ZN4XRef17setModifiedObjectEP6Object3Ref", scope: !216, file: !217, line: 173, type: !613, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !551, !251, !348}
!615 = !DISubprogram(name: "addIndirectObject", linkageName: "_ZN4XRef17addIndirectObjectEP6Object", scope: !216, file: !217, line: 174, type: !616, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{!348, !551, !251}
!618 = !DISubprogram(name: "removeIndirectObject", linkageName: "_ZN4XRef20removeIndirectObjectE3Ref", scope: !216, file: !217, line: 175, type: !619, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !551, !348}
!621 = !DISubprogram(name: "add", linkageName: "_ZN4XRef3addEiijb", scope: !216, file: !217, line: 176, type: !622, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !551, !52, !52, !221, !163}
!624 = !DISubprogram(name: "writeTableToFile", linkageName: "_ZN4XRef16writeTableToFileEP9OutStreamb", scope: !216, file: !217, line: 179, type: !625, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !551, !627, !163}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OutStream", file: !31, line: 238, flags: DIFlagFwdDecl, identifier: "_ZTS9OutStream")
!629 = !DISubprogram(name: "writeStreamToBuffer", linkageName: "_ZN4XRef19writeStreamToBufferEP9GooStringP4DictPS_", scope: !216, file: !217, line: 181, type: !630, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !551, !46, !281, !215}
!632 = !DISubprogram(name: "init", linkageName: "_ZN4XRef4initEv", scope: !216, file: !217, line: 213, type: !549, scopeLine: 213, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubprogram(name: "reserve", linkageName: "_ZN4XRef7reserveEi", scope: !216, file: !217, line: 214, type: !634, scopeLine: 214, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DISubroutineType(types: !635)
!635 = !{!52, !551, !52}
!636 = !DISubprogram(name: "resize", linkageName: "_ZN4XRef6resizeEi", scope: !216, file: !217, line: 215, type: !634, scopeLine: 215, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DISubprogram(name: "readXRef", linkageName: "_ZN4XRef8readXRefEPjPSt6vectorIjSaIjEEPS1_IiSaIiEE", scope: !216, file: !217, line: 216, type: !638, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!638 = !DISubroutineType(types: !639)
!639 = !{!163, !551, !527, !640, !644}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, std::allocator<unsigned int> >", scope: !643, file: !642, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIjSaIjEE")
!642 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/6.3.0/../../../../include/c++/6.3.0/bits/stl_vector.h", directory: "")
!643 = !DINamespace(name: "std", scope: null)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, std::allocator<int> >", scope: !643, file: !642, line: 214, flags: DIFlagFwdDecl, identifier: "_ZTSSt6vectorIiSaIiEE")
!646 = !DISubprogram(name: "readXRefTable", linkageName: "_ZN4XRef13readXRefTableEP6ParserPjPSt6vectorIjSaIjEEPS3_IiSaIiEE", scope: !216, file: !217, line: 217, type: !647, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!163, !551, !649, !527, !640, !644}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Parser", file: !217, line: 45, flags: DIFlagFwdDecl, identifier: "_ZTS6Parser")
!651 = !DISubprogram(name: "readXRefStreamSection", linkageName: "_ZN4XRef21readXRefStreamSectionEP6StreamPiii", scope: !216, file: !217, line: 218, type: !652, scopeLine: 218, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DISubroutineType(types: !653)
!653 = !{!163, !551, !345, !188, !52, !52}
!654 = !DISubprogram(name: "readXRefStream", linkageName: "_ZN4XRef14readXRefStreamEP6StreamPj", scope: !216, file: !217, line: 219, type: !655, scopeLine: 219, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!163, !551, !345, !527}
!657 = !DISubprogram(name: "constructXRef", linkageName: "_ZN4XRef13constructXRefEPbb", scope: !216, file: !217, line: 220, type: !658, scopeLine: 220, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DISubroutineType(types: !659)
!659 = !{!163, !551, !558, !163}
!660 = !DISubprogram(name: "parseEntry", linkageName: "_ZN4XRef10parseEntryEjP9XRefEntry", scope: !216, file: !217, line: 221, type: !661, scopeLine: 221, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DISubroutineType(types: !662)
!662 = !{!163, !551, !221, !223}
!663 = !DISubprogram(name: "readXRefUntil", linkageName: "_ZN4XRef13readXRefUntilEiPSt6vectorIiSaIiEE", scope: !216, file: !217, line: 222, type: !664, scopeLine: 222, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !551, !52, !644}
!666 = !DISubprogram(name: "markUnencrypted", linkageName: "_ZN4XRef15markUnencryptedEP6Object", scope: !216, file: !217, line: 223, type: !553, scopeLine: 223, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DISubprogram(name: "writeXRef", linkageName: "_ZN4XRef9writeXRefEPNS_10XRefWriterEb", scope: !216, file: !217, line: 251, type: !668, scopeLine: 251, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !551, !670, !163}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XRefWriter", scope: !216, file: !217, line: 225, flags: DIFlagFwdDecl, identifier: "_ZTSN4XRef10XRefWriterE")
!672 = !DIDerivedType(tag: DW_TAG_member, name: "secHdlr", scope: !42, file: !43, line: 314, baseType: !673, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SecurityHandler", file: !43, line: 56, flags: DIFlagFwdDecl, identifier: "_ZTS15SecurityHandler")
!675 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !42, file: !43, line: 315, baseType: !676, size: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "hints", scope: !42, file: !43, line: 316, baseType: !678, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Hints", file: !43, line: 57, flags: DIFlagFwdDecl, identifier: "_ZTS5Hints")
!680 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !42, file: !43, line: 318, baseType: !681, size: 64, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Outline", file: !43, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTS7Outline")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pageCache", scope: !42, file: !43, line: 320, baseType: !684, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Page", file: !687, line: 133, size: 1280, flags: DIFlagTypePassByReference, elements: !688, identifier: "_ZTS4Page")
!687 = !DIFile(filename: "../poppler/Page.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!688 = !{!689, !690, !691, !692, !693, !694, !778, !816, !817, !818, !819, !820, !821, !822, !823, !829, !832, !835, !838, !841, !842, !843, !846, !847, !848, !849, !850, !851, !852, !853, !856, !859, !860, !863, !864, !865, !868, !871, !872, !875, !878, !879, !884, !887, !888, !889, !894, !895, !900, !901, !902, !912, !918, !921, !924, !927, !930}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !686, file: !687, line: 249, baseType: !41, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !686, file: !687, line: 250, baseType: !215, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pageObj", scope: !686, file: !687, line: 251, baseType: !232, size: 128, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pageRef", scope: !686, file: !687, line: 252, baseType: !348, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !686, file: !687, line: 253, baseType: !52, size: 32, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !686, file: !687, line: 254, baseType: !695, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PageAttrs", file: !687, line: 70, size: 2304, flags: DIFlagTypePassByReference, elements: !697, identifier: "_ZTS9PageAttrs")
!697 = !{!698, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !745, !748, !751, !752, !755, !756, !757, !758, !761, !764, !767, !768, !771, !772, !773, !774, !775}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mediaBox", scope: !696, file: !687, line: 113, baseType: !699, size: 256)
!699 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PDFRectangle", file: !687, line: 52, size: 256, flags: DIFlagTypePassByValue, elements: !700, identifier: "_ZTS12PDFRectangle")
!700 = !{!701, !702, !703, !704, !705, !709, !712, !715, !718, !722}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !699, file: !687, line: 54, baseType: !196, size: 64, flags: DIFlagPublic)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !699, file: !687, line: 54, baseType: !196, size: 64, offset: 64, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !699, file: !687, line: 54, baseType: !196, size: 64, offset: 128, flags: DIFlagPublic)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !699, file: !687, line: 54, baseType: !196, size: 64, offset: 192, flags: DIFlagPublic)
!705 = !DISubprogram(name: "PDFRectangle", scope: !699, file: !687, line: 56, type: !706, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!709 = !DISubprogram(name: "PDFRectangle", scope: !699, file: !687, line: 57, type: !710, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !708, !196, !196, !196, !196}
!712 = !DISubprogram(name: "isValid", linkageName: "_ZN12PDFRectangle7isValidEv", scope: !699, file: !687, line: 59, type: !713, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{!163, !708}
!715 = !DISubprogram(name: "contains", linkageName: "_ZN12PDFRectangle8containsEdd", scope: !699, file: !687, line: 60, type: !716, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!716 = !DISubroutineType(types: !717)
!717 = !{!163, !708, !196, !196}
!718 = !DISubprogram(name: "clipTo", linkageName: "_ZN12PDFRectangle6clipToEPS_", scope: !699, file: !687, line: 61, type: !719, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !708, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!722 = !DISubprogram(name: "operator==", linkageName: "_ZNK12PDFRectangleeqERKS_", scope: !699, file: !687, line: 63, type: !723, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!165, !725, !727}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!727 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !726, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cropBox", scope: !696, file: !687, line: 114, baseType: !699, size: 256, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "haveCropBox", scope: !696, file: !687, line: 115, baseType: !163, size: 8, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bleedBox", scope: !696, file: !687, line: 116, baseType: !699, size: 256, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "trimBox", scope: !696, file: !687, line: 117, baseType: !699, size: 256, offset: 832)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "artBox", scope: !696, file: !687, line: 118, baseType: !699, size: 256, offset: 1088)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !696, file: !687, line: 119, baseType: !52, size: 32, offset: 1344)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lastModified", scope: !696, file: !687, line: 120, baseType: !232, size: 128, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "boxColorInfo", scope: !696, file: !687, line: 121, baseType: !232, size: 128, offset: 1536)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !696, file: !687, line: 122, baseType: !232, size: 128, offset: 1664)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !696, file: !687, line: 123, baseType: !232, size: 128, offset: 1792)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pieceInfo", scope: !696, file: !687, line: 124, baseType: !232, size: 128, offset: 1920)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "separationInfo", scope: !696, file: !687, line: 125, baseType: !232, size: 128, offset: 2048)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !696, file: !687, line: 126, baseType: !232, size: 128, offset: 2176)
!741 = !DISubprogram(name: "PageAttrs", scope: !696, file: !687, line: 76, type: !742, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !744, !695, !281}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!745 = !DISubprogram(name: "~PageAttrs", scope: !696, file: !687, line: 79, type: !746, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !744}
!748 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN9PageAttrs11getMediaBoxEv", scope: !696, file: !687, line: 82, type: !749, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{!721, !744}
!751 = !DISubprogram(name: "getCropBox", linkageName: "_ZN9PageAttrs10getCropBoxEv", scope: !696, file: !687, line: 83, type: !749, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!752 = !DISubprogram(name: "isCropped", linkageName: "_ZN9PageAttrs9isCroppedEv", scope: !696, file: !687, line: 84, type: !753, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!753 = !DISubroutineType(types: !754)
!754 = !{!163, !744}
!755 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN9PageAttrs11getBleedBoxEv", scope: !696, file: !687, line: 85, type: !749, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!756 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN9PageAttrs10getTrimBoxEv", scope: !696, file: !687, line: 86, type: !749, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!757 = !DISubprogram(name: "getArtBox", linkageName: "_ZN9PageAttrs9getArtBoxEv", scope: !696, file: !687, line: 87, type: !749, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!758 = !DISubprogram(name: "getRotate", linkageName: "_ZN9PageAttrs9getRotateEv", scope: !696, file: !687, line: 88, type: !759, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!759 = !DISubroutineType(types: !760)
!760 = !{!52, !744}
!761 = !DISubprogram(name: "getLastModified", linkageName: "_ZN9PageAttrs15getLastModifiedEv", scope: !696, file: !687, line: 89, type: !762, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!762 = !DISubroutineType(types: !763)
!763 = !{!46, !744}
!764 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN9PageAttrs15getBoxColorInfoEv", scope: !696, file: !687, line: 92, type: !765, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!281, !744}
!767 = !DISubprogram(name: "getGroup", linkageName: "_ZN9PageAttrs8getGroupEv", scope: !696, file: !687, line: 94, type: !765, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!768 = !DISubprogram(name: "getMetadata", linkageName: "_ZN9PageAttrs11getMetadataEv", scope: !696, file: !687, line: 96, type: !769, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!769 = !DISubroutineType(types: !770)
!770 = !{!345, !744}
!771 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN9PageAttrs12getPieceInfoEv", scope: !696, file: !687, line: 98, type: !765, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!772 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN9PageAttrs17getSeparationInfoEv", scope: !696, file: !687, line: 100, type: !765, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!773 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN9PageAttrs15getResourceDictEv", scope: !696, file: !687, line: 103, type: !765, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!774 = !DISubprogram(name: "clipBoxes", linkageName: "_ZN9PageAttrs9clipBoxesEv", scope: !696, file: !687, line: 107, type: !746, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!775 = !DISubprogram(name: "readBox", linkageName: "_ZN9PageAttrs7readBoxEP4DictPKcP12PDFRectangle", scope: !696, file: !687, line: 111, type: !776, scopeLine: 111, flags: DIFlagPrototyped, spFlags: 0)
!776 = !DISubroutineType(types: !777)
!777 = !{!163, !744, !281, !69, !721}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "annots", scope: !686, file: !687, line: 255, baseType: !779, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Annots", file: !781, line: 1389, size: 192, flags: DIFlagTypePassByReference, elements: !782, identifier: "_ZTS6Annots")
!781 = !DIFile(filename: "../poppler/Annot.h", directory: "/root/llvm/codesample/39apps/poppler-0.22.0/utils")
!782 = !{!783, !784, !788, !789, !790, !794, !797, !800, !803, !806, !809, !812}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !780, file: !781, line: 1407, baseType: !41, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "annots", scope: !780, file: !781, line: 1408, baseType: !785, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Annot", file: !781, line: 475, flags: DIFlagFwdDecl, identifier: "_ZTS5Annot")
!788 = !DIDerivedType(tag: DW_TAG_member, name: "nAnnots", scope: !780, file: !781, line: 1409, baseType: !52, size: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !780, file: !781, line: 1410, baseType: !52, size: 32, offset: 160)
!790 = !DISubprogram(name: "Annots", scope: !780, file: !781, line: 1393, type: !791, scopeLine: 1393, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !793, !41, !52, !251}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!794 = !DISubprogram(name: "~Annots", scope: !780, file: !781, line: 1395, type: !795, scopeLine: 1395, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !793}
!797 = !DISubprogram(name: "getNumAnnots", linkageName: "_ZN6Annots12getNumAnnotsEv", scope: !780, file: !781, line: 1398, type: !798, scopeLine: 1398, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!52, !793}
!800 = !DISubprogram(name: "getAnnot", linkageName: "_ZN6Annots8getAnnotEi", scope: !780, file: !781, line: 1399, type: !801, scopeLine: 1399, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!801 = !DISubroutineType(types: !802)
!802 = !{!786, !793, !52}
!803 = !DISubprogram(name: "appendAnnot", linkageName: "_ZN6Annots11appendAnnotEP5Annot", scope: !780, file: !781, line: 1400, type: !804, scopeLine: 1400, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !793, !786}
!806 = !DISubprogram(name: "removeAnnot", linkageName: "_ZN6Annots11removeAnnotEP5Annot", scope: !780, file: !781, line: 1401, type: !807, scopeLine: 1401, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!807 = !DISubroutineType(types: !808)
!808 = !{!163, !793, !786}
!809 = !DISubprogram(name: "createAnnot", linkageName: "_ZN6Annots11createAnnotEP4DictP6Object", scope: !780, file: !781, line: 1404, type: !810, scopeLine: 1404, flags: DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!786, !793, !281, !251}
!812 = !DISubprogram(name: "findAnnot", linkageName: "_ZN6Annots9findAnnotEP3Ref", scope: !780, file: !781, line: 1405, type: !813, scopeLine: 1405, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!786, !793, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "annotsObj", scope: !686, file: !687, line: 256, baseType: !232, size: 128, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !686, file: !687, line: 257, baseType: !232, size: 128, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "thumb", scope: !686, file: !687, line: 258, baseType: !232, size: 128, offset: 768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !686, file: !687, line: 259, baseType: !232, size: 128, offset: 896)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !686, file: !687, line: 260, baseType: !232, size: 128, offset: 1024)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !686, file: !687, line: 261, baseType: !196, size: 64, offset: 1152)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !686, file: !687, line: 262, baseType: !163, size: 8, offset: 1216)
!823 = !DISubprogram(name: "Page", scope: !686, file: !687, line: 137, type: !824, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !826, !41, !52, !281, !348, !695, !827}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Form", file: !781, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS4Form")
!829 = !DISubprogram(name: "~Page", scope: !686, file: !687, line: 140, type: !830, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !826}
!832 = !DISubprogram(name: "isOk", linkageName: "_ZN4Page4isOkEv", scope: !686, file: !687, line: 143, type: !833, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!163, !826}
!835 = !DISubprogram(name: "getNum", linkageName: "_ZN4Page6getNumEv", scope: !686, file: !687, line: 146, type: !836, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!836 = !DISubroutineType(types: !837)
!837 = !{!52, !826}
!838 = !DISubprogram(name: "getMediaBox", linkageName: "_ZN4Page11getMediaBoxEv", scope: !686, file: !687, line: 147, type: !839, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!839 = !DISubroutineType(types: !840)
!840 = !{!721, !826}
!841 = !DISubprogram(name: "getCropBox", linkageName: "_ZN4Page10getCropBoxEv", scope: !686, file: !687, line: 148, type: !839, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!842 = !DISubprogram(name: "isCropped", linkageName: "_ZN4Page9isCroppedEv", scope: !686, file: !687, line: 149, type: !833, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!843 = !DISubprogram(name: "getMediaWidth", linkageName: "_ZN4Page13getMediaWidthEv", scope: !686, file: !687, line: 150, type: !844, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!844 = !DISubroutineType(types: !845)
!845 = !{!196, !826}
!846 = !DISubprogram(name: "getMediaHeight", linkageName: "_ZN4Page14getMediaHeightEv", scope: !686, file: !687, line: 152, type: !844, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!847 = !DISubprogram(name: "getCropWidth", linkageName: "_ZN4Page12getCropWidthEv", scope: !686, file: !687, line: 154, type: !844, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!848 = !DISubprogram(name: "getCropHeight", linkageName: "_ZN4Page13getCropHeightEv", scope: !686, file: !687, line: 156, type: !844, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!849 = !DISubprogram(name: "getBleedBox", linkageName: "_ZN4Page11getBleedBoxEv", scope: !686, file: !687, line: 158, type: !839, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!850 = !DISubprogram(name: "getTrimBox", linkageName: "_ZN4Page10getTrimBoxEv", scope: !686, file: !687, line: 159, type: !839, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!851 = !DISubprogram(name: "getArtBox", linkageName: "_ZN4Page9getArtBoxEv", scope: !686, file: !687, line: 160, type: !839, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!852 = !DISubprogram(name: "getRotate", linkageName: "_ZN4Page9getRotateEv", scope: !686, file: !687, line: 161, type: !836, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!853 = !DISubprogram(name: "getLastModified", linkageName: "_ZN4Page15getLastModifiedEv", scope: !686, file: !687, line: 162, type: !854, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!854 = !DISubroutineType(types: !855)
!855 = !{!46, !826}
!856 = !DISubprogram(name: "getBoxColorInfo", linkageName: "_ZN4Page15getBoxColorInfoEv", scope: !686, file: !687, line: 163, type: !857, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{!281, !826}
!859 = !DISubprogram(name: "getGroup", linkageName: "_ZN4Page8getGroupEv", scope: !686, file: !687, line: 164, type: !857, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!860 = !DISubprogram(name: "getMetadata", linkageName: "_ZN4Page11getMetadataEv", scope: !686, file: !687, line: 165, type: !861, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!861 = !DISubroutineType(types: !862)
!862 = !{!345, !826}
!863 = !DISubprogram(name: "getPieceInfo", linkageName: "_ZN4Page12getPieceInfoEv", scope: !686, file: !687, line: 166, type: !857, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!864 = !DISubprogram(name: "getSeparationInfo", linkageName: "_ZN4Page17getSeparationInfoEv", scope: !686, file: !687, line: 167, type: !857, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!865 = !DISubprogram(name: "getDoc", linkageName: "_ZN4Page6getDocEv", scope: !686, file: !687, line: 168, type: !866, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{!41, !826}
!868 = !DISubprogram(name: "getRef", linkageName: "_ZN4Page6getRefEv", scope: !686, file: !687, line: 169, type: !869, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!348, !826}
!871 = !DISubprogram(name: "getResourceDict", linkageName: "_ZN4Page15getResourceDictEv", scope: !686, file: !687, line: 172, type: !857, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!872 = !DISubprogram(name: "getAnnots", linkageName: "_ZN4Page9getAnnotsEP6Object", scope: !686, file: !687, line: 175, type: !873, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{!251, !826, !251}
!875 = !DISubprogram(name: "addAnnot", linkageName: "_ZN4Page8addAnnotEP5Annot", scope: !686, file: !687, line: 177, type: !876, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !826, !786}
!878 = !DISubprogram(name: "removeAnnot", linkageName: "_ZN4Page11removeAnnotEP5Annot", scope: !686, file: !687, line: 179, type: !876, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!879 = !DISubprogram(name: "getLinks", linkageName: "_ZN4Page8getLinksEv", scope: !686, file: !687, line: 182, type: !880, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !826}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Links", file: !687, line: 43, flags: DIFlagFwdDecl, identifier: "_ZTS5Links")
!884 = !DISubprogram(name: "getAnnots", linkageName: "_ZN4Page9getAnnotsEv", scope: !686, file: !687, line: 185, type: !885, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!885 = !DISubroutineType(types: !886)
!886 = !{!779, !826}
!887 = !DISubprogram(name: "getContents", linkageName: "_ZN4Page11getContentsEP6Object", scope: !686, file: !687, line: 188, type: !873, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!888 = !DISubprogram(name: "getThumb", linkageName: "_ZN4Page8getThumbEP6Object", scope: !686, file: !687, line: 191, type: !873, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!889 = !DISubprogram(name: "loadThumb", linkageName: "_ZN4Page9loadThumbEPPhPiS2_S2_", scope: !686, file: !687, line: 192, type: !890, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{!163, !826, !892, !188, !188, !188}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!894 = !DISubprogram(name: "getTrans", linkageName: "_ZN4Page8getTransEP6Object", scope: !686, file: !687, line: 195, type: !873, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!895 = !DISubprogram(name: "getFormWidgets", linkageName: "_ZN4Page14getFormWidgetsEv", scope: !686, file: !687, line: 198, type: !896, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!896 = !DISubroutineType(types: !897)
!897 = !{!898, !826}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FormPageWidgets", file: !687, line: 47, flags: DIFlagFwdDecl, identifier: "_ZTS15FormPageWidgets")
!900 = !DISubprogram(name: "getDuration", linkageName: "_ZN4Page11getDurationEv", scope: !686, file: !687, line: 203, type: !844, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!901 = !DISubprogram(name: "getActions", linkageName: "_ZN4Page10getActionsEP6Object", scope: !686, file: !687, line: 206, type: !873, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!902 = !DISubprogram(name: "createGfx", linkageName: "_ZN4Page9createGfxEP9OutputDevddibbiiiibPFbPvES2_", scope: !686, file: !687, line: 208, type: !903, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!903 = !DISubroutineType(types: !904)
!904 = !{!905, !826, !907, !196, !196, !52, !163, !163, !52, !52, !52, !52, !163, !909, !208}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Gfx", file: !781, line: 43, flags: DIFlagFwdDecl, identifier: "_ZTS3Gfx")
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OutputDev", file: !687, line: 42, flags: DIFlagFwdDecl, identifier: "_ZTS9OutputDev")
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!163, !208}
!912 = !DISubprogram(name: "display", linkageName: "_ZN4Page7displayEP9OutputDevddibbbPFbPvES2_PFbP5AnnotS2_ES2_", scope: !686, file: !687, line: 216, type: !913, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!913 = !DISubroutineType(types: !914)
