; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SANMVideoContext = type { i32, i32, [256 x i32], [768 x i16], i32, i32, i32, i32, i32, i32, i16*, i16*, i16*, i8*, i32, i32, i32, i32, i8*, i32, i32, i64, i64, [256 x i16], [4 x i16] }

@max_alloc_size = internal global i64 2147483647, align 8, !dbg !0
@specialMalloc = external thread_local global i8, align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i8* @av_malloc(i64) #0 !dbg !17 {
  %2 = alloca i8*, align 8
  %3 = alloca i64, align 8
  %4 = alloca i8*, align 8
  store i64 %0, i64* %3, align 8
  call void @llvm.dbg.declare(metadata i64* %3, metadata !20, metadata !DIExpression()), !dbg !21
  call void @llvm.dbg.declare(metadata i8** %4, metadata !22, metadata !DIExpression()), !dbg !23
  store i8* null, i8** %4, align 8, !dbg !23
  %5 = load i64, i64* %3, align 8, !dbg !24
  %6 = load i64, i64* @max_alloc_size, align 8, !dbg !26
  %7 = sub i64 %6, 32, !dbg !27
  %8 = icmp ugt i64 %5, %7, !dbg !28
  br i1 %8, label %9, label %10, !dbg !29

; <label>:9:                                      ; preds = %1
  store i8* null, i8** %2, align 8, !dbg !30
  br label %22, !dbg !30

; <label>:10:                                     ; preds = %1
  %11 = load i64, i64* %3, align 8, !dbg !31
  %12 = call noalias i8* @malloc(i64 %11) #5, !dbg !32
  store i8* %12, i8** %4, align 8, !dbg !33

!50 = !DILocalVariable(name: "ptr", scope: !47, file: !3, line: 82, type: !6)
!51 = !DILocation(line: 82, column: 10, scope: !47)
!52 = !DILocation(line: 82, column: 26, scope: !47)
!53 = !DILocation(line: 82, column: 16, scope: !47)
!54 = !DILocation(line: 83, column: 8, scope: !55)
!55 = distinct !DILexicalBlock(scope: !47, file: !3, line: 83, column: 8)
!56 = !DILocation(line: 83, column: 8, scope: !47)
!57 = !DILocation(line: 84, column: 15, scope: !55)
!58 = !DILocation(line: 84, column: 23, scope: !55)
!59 = !DILocation(line: 84, column: 8, scope: !55)
!60 = !DILocation(line: 85, column: 11, scope: !47)
!61 = !DILocation(line: 85, column: 4, scope: !47)
!62 = distinct !DISubprogram(name: "av_free", scope: !3, file: !3, line: 89, type: !63, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !6}
!65 = !DILocalVariable(name: "ptr", arg: 1, scope: !62, file: !3, line: 89, type: !6)
!66 = !DILocation(line: 89, column: 20, scope: !62)
!67 = !DILocation(line: 97, column: 10, scope: !62)
!68 = !DILocation(line: 97, column: 5, scope: !62)
!69 = !DILocation(line: 99, column: 1, scope: !62)
!70 = distinct !DISubprogram(name: "av_fast_malloc", scope: !3, file: !3, line: 118, type: !71, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !6, !73, !8}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!75 = !DILocalVariable(name: "ptr", arg: 1, scope: !70, file: !3, line: 118, type: !6)
!76 = !DILocation(line: 118, column: 27, scope: !70)
!77 = !DILocalVariable(name: "size", arg: 2, scope: !70, file: !3, line: 118, type: !73)
!78 = !DILocation(line: 118, column: 46, scope: !70)
!79 = !DILocalVariable(name: "min_size", arg: 3, scope: !70, file: !3, line: 118, type: !8)
!80 = !DILocation(line: 118, column: 59, scope: !70)
!81 = !DILocation(line: 120, column: 20, scope: !70)
!82 = !DILocation(line: 120, column: 25, scope: !70)
!83 = !DILocation(line: 120, column: 31, scope: !70)
!84 = !DILocation(line: 120, column: 5, scope: !70)
!85 = !DILocation(line: 121, column: 1, scope: !70)
!86 = distinct !DISubprogram(name: "ff_fast_malloc", scope: !3, file: !3, line: 103, type: !87, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !6, !73, !8, !89}
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DILocalVariable(name: "ptr", arg: 1, scope: !86, file: !3, line: 103, type: !6)
!91 = !DILocation(line: 103, column: 40, scope: !86)
!92 = !DILocalVariable(name: "size", arg: 2, scope: !86, file: !3, line: 103, type: !73)
!93 = !DILocation(line: 103, column: 59, scope: !86)
!94 = !DILocalVariable(name: "min_size", arg: 3, scope: !86, file: !3, line: 103, type: !8)
!95 = !DILocation(line: 103, column: 72, scope: !86)
!96 = !DILocalVariable(name: "zero_realloc", arg: 4, scope: !86, file: !3, line: 103, type: !89)
!97 = !DILocation(line: 103, column: 86, scope: !86)
!98 = !DILocalVariable(name: "p", scope: !86, file: !3, line: 105, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!100 = !DILocation(line: 105, column: 11, scope: !86)
!101 = !DILocation(line: 105, column: 15, scope: !86)
!102 = !DILocation(line: 106, column: 8, scope: !103)
!103 = distinct !DILexicalBlock(scope: !86, file: !3, line: 106, column: 8)
!104 = !DILocation(line: 106, column: 20, scope: !103)
!105 = !DILocation(line: 106, column: 19, scope: !103)
!106 = !DILocation(line: 106, column: 17, scope: !103)
!107 = !DILocation(line: 106, column: 8, scope: !86)
!108 = !DILocation(line: 107, column: 8, scope: !103)
!109 = !DILocation(line: 108, column: 15, scope: !86)
!110 = !DILocation(line: 108, column: 13, scope: !86)
!111 = !DILocation(line: 109, column: 13, scope: !86)
!112 = !DILocation(line: 109, column: 12, scope: !86)
!113 = !DILocation(line: 109, column: 4, scope: !86)
!114 = !DILocation(line: 110, column: 9, scope: !86)
!115 = !DILocation(line: 110, column: 35, scope: !86)
!116 = !DILocation(line: 110, column: 24, scope: !86)
!117 = !DILocation(line: 110, column: 57, scope: !86)
!118 = !DILocation(line: 110, column: 47, scope: !86)
!119 = !DILocation(line: 110, column: 5, scope: !86)
!120 = !DILocation(line: 110, column: 7, scope: !86)
!121 = !DILocation(line: 111, column: 10, scope: !122)
!122 = distinct !DILexicalBlock(scope: !86, file: !3, line: 111, column: 8)
!123 = !DILocation(line: 111, column: 9, scope: !122)
!124 = !DILocation(line: 111, column: 8, scope: !86)
!125 = !DILocation(line: 112, column: 17, scope: !122)
!126 = !DILocation(line: 112, column: 8, scope: !122)
!127 = !DILocation(line: 113, column: 12, scope: !86)
!128 = !DILocation(line: 113, column: 5, scope: !86)
!129 = !DILocation(line: 113, column: 10, scope: !86)
!130 = !DILocation(line: 114, column: 4, scope: !86)
!131 = !DILocation(line: 115, column: 1, scope: !86)
!132 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 157, type: !133, scopeLine: 157, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!133 = !DISubroutineType(types: !134)
!134 = !{!89}
!135 = !DILocalVariable(name: "ctx", scope: !132, file: !3, line: 159, type: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "SANMVideoContext", file: !3, line: 155, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 124, size: 25536, elements: !139)
!139 = !{!140, !141, !142, !148, !154, !155, !156, !157, !158, !159, !160, !164, !165, !166, !170, !171, !172, !173, !174, !175, !176, !177, !179, !180, !182}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !138, file: !3, line: 128, baseType: !89, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "subversion", scope: !138, file: !3, line: 128, baseType: !89, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pal", scope: !138, file: !3, line: 129, baseType: !143, size: 8192, offset: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8192, elements: !146)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !145, line: 51, baseType: !74)
!145 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!146 = !{!147}
!147 = !DISubrange(count: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pal", scope: !138, file: !3, line: 130, baseType: !149, size: 12288, offset: 8256)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 12288, elements: !152)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !145, line: 37, baseType: !151)
!151 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!152 = !{!153}
!153 = !DISubrange(count: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !138, file: !3, line: 132, baseType: !89, size: 32, offset: 20544)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !138, file: !3, line: 133, baseType: !89, size: 32, offset: 20576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !138, file: !3, line: 133, baseType: !89, size: 32, offset: 20608)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "aligned_width", scope: !138, file: !3, line: 134, baseType: !89, size: 32, offset: 20640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "aligned_height", scope: !138, file: !3, line: 134, baseType: !89, size: 32, offset: 20672)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !138, file: !3, line: 135, baseType: !89, size: 32, offset: 20704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "frm0", scope: !138, file: !3, line: 138, baseType: !161, size: 64, offset: 20736)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !145, line: 49, baseType: !163)
!163 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "frm1", scope: !138, file: !3, line: 138, baseType: !161, size: 64, offset: 20800)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "frm2", scope: !138, file: !3, line: 138, baseType: !161, size: 64, offset: 20864)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stored_frame", scope: !138, file: !3, line: 139, baseType: !167, size: 64, offset: 20928)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !145, line: 48, baseType: !169)
!169 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "frm0_size", scope: !138, file: !3, line: 140, baseType: !144, size: 32, offset: 20992)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "frm1_size", scope: !138, file: !3, line: 140, baseType: !144, size: 32, offset: 21024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "frm2_size", scope: !138, file: !3, line: 140, baseType: !144, size: 32, offset: 21056)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "stored_frame_size", scope: !138, file: !3, line: 141, baseType: !144, size: 32, offset: 21088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "rle_buf", scope: !138, file: !3, line: 143, baseType: !167, size: 64, offset: 21120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rle_buf_size", scope: !138, file: !3, line: 144, baseType: !74, size: 32, offset: 21184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "rotate_code", scope: !138, file: !3, line: 146, baseType: !89, size: 32, offset: 21216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "npixels", scope: !138, file: !3, line: 148, baseType: !178, size: 64, offset: 21248)
!178 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !138, file: !3, line: 148, baseType: !178, size: 64, offset: 21312)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "codebook", scope: !138, file: !3, line: 150, baseType: !181, size: 4096, offset: 21376)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 4096, elements: !146)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "small_codebook", scope: !138, file: !3, line: 151, baseType: !183, size: 64, offset: 25472)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 64, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 4)
!186 = !DILocation(line: 159, column: 23, scope: !132)
!187 = !DILocalVariable(name: "pdest", scope: !132, file: !3, line: 160, type: !161)
!188 = !DILocation(line: 160, column: 15, scope: !132)
!189 = !DILocation(line: 160, column: 23, scope: !132)
!190 = !DILocation(line: 160, column: 28, scope: !132)
!191 = !DILocalVariable(name: "rsrc", scope: !132, file: !3, line: 161, type: !167)
!192 = !DILocation(line: 161, column: 14, scope: !132)
!193 = !DILocalVariable(name: "npixels", scope: !132, file: !3, line: 162, type: !178)
!194 = !DILocation(line: 162, column: 10, scope: !132)
!195 = !DILocation(line: 162, column: 20, scope: !132)
!196 = !DILocation(line: 162, column: 25, scope: !132)
!197 = !DILocation(line: 165, column: 21, scope: !132)
!198 = !DILocation(line: 165, column: 26, scope: !132)
!199 = !DILocation(line: 165, column: 20, scope: !132)
!200 = !DILocation(line: 165, column: 36, scope: !132)
!201 = !DILocation(line: 165, column: 41, scope: !132)
!202 = !DILocation(line: 165, column: 55, scope: !132)
!203 = !DILocation(line: 165, column: 5, scope: !132)
!204 = !DILocation(line: 170, column: 12, scope: !132)
!205 = !DILocation(line: 170, column: 17, scope: !132)
!206 = !DILocation(line: 170, column: 10, scope: !132)
!207 = !DILocation(line: 172, column: 20, scope: !208)
!208 = distinct !DILexicalBlock(scope: !132, file: !3, line: 172, column: 9)
!209 = !DILocation(line: 172, column: 25, scope: !208)
!210 = !DILocation(line: 172, column: 31, scope: !208)
!211 = !DILocation(line: 172, column: 9, scope: !208)
!212 = !DILocation(line: 172, column: 9, scope: !132)
!213 = !DILocation(line: 173, column: 10, scope: !214)
!214 = distinct !DILexicalBlock(scope: !208, file: !3, line: 173, column: 9)
!215 = !DILocation(line: 175, column: 5, scope: !132)
!216 = !DILocation(line: 175, column: 19, scope: !132)
!217 = !DILocation(line: 176, column: 20, scope: !132)
!218 = !DILocation(line: 176, column: 25, scope: !132)
!219 = !DILocation(line: 176, column: 39, scope: !132)
!220 = !DILocation(line: 176, column: 34, scope: !132)
!221 = !DILocation(line: 176, column: 15, scope: !132)
!222 = !DILocation(line: 176, column: 18, scope: !132)
!223 = distinct !{!223, !215, !224}
!224 = !DILocation(line: 176, column: 41, scope: !132)
!225 = !DILocation(line: 178, column: 2, scope: !132)
