; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [28 x i8] c"%s: input_file output_file\0A\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"%s: cannot open %s for input.\0A\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.4 = private unnamed_addr constant [32 x i8] c"%s: cannot open %s for output.\0A\00", align 1
@.str.5 = private unnamed_addr constant [77 x i8] c"/* Created by rdps.c. Do not edit! */\0A\0A#include <stdio.h>\0A\0A#include \22ps.h\22\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [40 x i8] c"% ---- wireshark preamble start ---- %\0A\00", align 1
@.str.7 = private unnamed_addr constant [9 x i8] c"preamble\00", align 1
@.str.8 = private unnamed_addr constant [38 x i8] c"% ---- wireshark finale start ---- %\0A\00", align 1
@.str.9 = private unnamed_addr constant [7 x i8] c"finale\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, nameTableKind: None)
!1 = !DIFile(filename: "rdps.c", directory: "/root/llvm/codesample/39apps/wireshark-1.0.16")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ps_state", file: !4, line: 48, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./rdps.c", directory: "/root/llvm/codesample/39apps/wireshark-1.0.16")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "null", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "preamble", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "finale", value: 2, isUnsigned: true)
!10 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)"}
!11 = !{i32 2, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 1, !"wchar_size", i32 4}
!14 = !{i32 1, !"ThinLTO", i32 0}
!15 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!16 = distinct !DISubprogram(name: "main", scope: !4, file: !4, line: 50, type: !17, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !23)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !19, !20}
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{}
!24 = !DILocalVariable(name: "argc", arg: 1, scope: !16, file: !4, line: 50, type: !19)
!25 = !DILocation(line: 50, column: 14, scope: !16)
!26 = !DILocalVariable(name: "argv", arg: 2, scope: !16, file: !4, line: 50, type: !20)
!27 = !DILocation(line: 50, column: 27, scope: !16)
!28 = !DILocalVariable(name: "input", scope: !16, file: !4, line: 52, type: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !31, line: 48, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !33, line: 241, size: 1728, elements: !34)
!33 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !55, !56, !57, !58, !62, !64, !66, !70, !73, !75, !77, !78, !79, !80, !84, !85}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !33, line: 242, baseType: !19, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !32, file: !33, line: 247, baseType: !21, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !32, file: !33, line: 248, baseType: !21, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !32, file: !33, line: 249, baseType: !21, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !32, file: !33, line: 250, baseType: !21, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !32, file: !33, line: 251, baseType: !21, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !32, file: !33, line: 252, baseType: !21, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !32, file: !33, line: 253, baseType: !21, size: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !32, file: !33, line: 254, baseType: !21, size: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !32, file: !33, line: 256, baseType: !21, size: 64, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !32, file: !33, line: 257, baseType: !21, size: 64, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !32, file: !33, line: 258, baseType: !21, size: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !32, file: !33, line: 260, baseType: !48, size: 64, offset: 768)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !33, line: 156, size: 192, elements: !50)
!50 = !{!51, !52, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !49, file: !33, line: 157, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !49, file: !33, line: 158, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !49, file: !33, line: 162, baseType: !19, size: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !32, file: !33, line: 262, baseType: !53, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !32, file: !33, line: 264, baseType: !19, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !33, line: 268, baseType: !19, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !32, file: !33, line: 270, baseType: !59, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 131, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !32, file: !33, line: 274, baseType: !63, size: 16, offset: 1024)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !32, file: !33, line: 275, baseType: !65, size: 8, offset: 1040)
!65 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !32, file: !33, line: 276, baseType: !67, size: 8, offset: 1048)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !33, line: 280, baseType: !71, size: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !33, line: 150, baseType: null)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !33, line: 289, baseType: !74, size: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 132, baseType: !61)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !32, file: !33, line: 297, baseType: !76, size: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !32, file: !33, line: 298, baseType: !76, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !32, file: !33, line: 299, baseType: !76, size: 64, offset: 1344)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !32, file: !33, line: 300, baseType: !76, size: 64, offset: 1408)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !32, file: !33, line: 302, baseType: !81, size: 64, offset: 1472)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !82, line: 62, baseType: !83)
!82 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!83 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !32, file: !33, line: 303, baseType: !19, size: 32, offset: 1536)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !32, file: !33, line: 305, baseType: !86, size: 160, offset: 1568)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 20)
!89 = !DILocation(line: 52, column: 8, scope: !16)
!90 = !DILocalVariable(name: "output", scope: !16, file: !4, line: 53, type: !29)
!91 = !DILocation(line: 53, column: 8, scope: !16)
!92 = !DILocalVariable(name: "buf", scope: !16, file: !4, line: 54, type: !93)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8192, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1024)
!96 = !DILocation(line: 54, column: 7, scope: !16)
!97 = !DILocalVariable(name: "state", scope: !16, file: !4, line: 55, type: !3)
!98 = !DILocation(line: 55, column: 16, scope: !16)
!99 = !DILocation(line: 57, column: 6, scope: !100)
!100 = distinct !DILexicalBlock(scope: !16, file: !4, line: 57, column: 6)
!101 = !DILocation(line: 57, column: 11, scope: !100)
!102 = !DILocation(line: 57, column: 6, scope: !16)
!103 = !DILocation(line: 58, column: 11, scope: !104)
!104 = distinct !DILexicalBlock(scope: !100, file: !4, line: 57, column: 17)
!105 = !DILocation(line: 58, column: 51, scope: !104)
!106 = !DILocation(line: 58, column: 3, scope: !104)
!107 = !DILocation(line: 59, column: 3, scope: !104)
!108 = !DILocation(line: 62, column: 22, scope: !109)
!109 = distinct !DILexicalBlock(scope: !16, file: !4, line: 62, column: 6)
!110 = !DILocation(line: 62, column: 16, scope: !109)
!111 = !DILocation(line: 62, column: 14, scope: !109)
!112 = !DILocation(line: 62, column: 6, scope: !16)
!113 = !DILocation(line: 63, column: 11, scope: !114)
!114 = distinct !DILexicalBlock(scope: !109, file: !4, line: 62, column: 38)
!115 = !DILocation(line: 63, column: 54, scope: !114)
!116 = !DILocation(line: 63, column: 63, scope: !114)
!117 = !DILocation(line: 63, column: 3, scope: !114)
!118 = !DILocation(line: 64, column: 3, scope: !114)
!119 = !DILocation(line: 67, column: 23, scope: !120)
!120 = distinct !DILexicalBlock(scope: !16, file: !4, line: 67, column: 6)
!121 = !DILocation(line: 67, column: 17, scope: !120)
!122 = !DILocation(line: 67, column: 15, scope: !120)
!123 = !DILocation(line: 67, column: 6, scope: !16)
!124 = !DILocation(line: 68, column: 11, scope: !125)
!125 = distinct !DILexicalBlock(scope: !120, file: !4, line: 67, column: 39)
!126 = !DILocation(line: 68, column: 55, scope: !125)
!127 = !DILocation(line: 68, column: 64, scope: !125)
!128 = !DILocation(line: 68, column: 3, scope: !125)
!129 = !DILocation(line: 69, column: 3, scope: !125)
!130 = !DILocation(line: 72, column: 10, scope: !16)
!131 = !DILocation(line: 72, column: 2, scope: !16)
!132 = !DILocation(line: 76, column: 2, scope: !16)
!133 = !DILocation(line: 76, column: 15, scope: !16)
!134 = !DILocation(line: 76, column: 37, scope: !16)
!135 = !DILocation(line: 76, column: 9, scope: !16)
!136 = !DILocation(line: 78, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !4, line: 78, column: 7)
!138 = distinct !DILexicalBlock(scope: !16, file: !4, line: 76, column: 45)
!139 = !DILocation(line: 78, column: 13, scope: !137)
!140 = !DILocation(line: 78, column: 7, scope: !138)
!141 = !DILocation(line: 79, column: 15, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !4, line: 79, column: 8)
!143 = distinct !DILexicalBlock(scope: !137, file: !4, line: 78, column: 22)
!144 = !DILocation(line: 79, column: 8, scope: !142)
!145 = !DILocation(line: 79, column: 64, scope: !142)
!146 = !DILocation(line: 79, column: 8, scope: !143)
!147 = !DILocation(line: 80, column: 11, scope: !148)
!148 = distinct !DILexicalBlock(scope: !142, file: !4, line: 79, column: 70)
!149 = !DILocation(line: 81, column: 16, scope: !148)
!150 = !DILocation(line: 81, column: 5, scope: !148)
!151 = !DILocation(line: 82, column: 5, scope: !148)
!152 = distinct !{!152, !132, !153}
!153 = !DILocation(line: 114, column: 2, scope: !16)
