; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.config_s = type { i32, i8*, i8*, %struct.string_list_s, %struct.string_list_s, %struct.string_list_s, %union.ru_, %struct.string_pattern_s, %struct.string_pattern_s, %struct.string_pattern_s }
%struct.string_list_s = type { i8*, i32, i32, i32, %struct.string_item_s* }
%struct.string_item_s = type { i8*, i32, i32 }
%union.ru_ = type { %struct.nu_ }
%struct.nu_ = type { %struct.string_list_s, %struct.string_list_s, %struct.string_list_s, %struct.string_list_s, %struct.string_list_s, %struct.string_list_s, %struct.string_list_s, %struct.string_list_s, %struct.string_list_s }
%struct.string_pattern_s = type { i32, i32, [61 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "init_config", scope: !2, file: !3, line: 302, type: !62, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !46, nameTableKind: None)
!3 = !DIFile(filename: "./base/genconf.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.70")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 247, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "uniq_all", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "uniq_first", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "uniq_last", value: 4, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 46, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!18 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!21 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!26 = !{!27, !30, !40, !29, !41, !42, !43, !44}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !28, line: 288, baseType: !29)
!28 = !DIFile(filename: "./base/stdpre.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.70")
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "string_item_t", file: !3, line: 244, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "string_item_s", file: !3, line: 240, size: 128, elements: !33)
!33 = !{!34, !38, !39}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !32, file: !3, line: 241, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "file_index", scope: !32, file: !3, line: 242, baseType: !29, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !32, file: !3, line: 243, baseType: !29, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !28, line: 250, baseType: !6)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!46 = !{!0, !47}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "init_config_lists", scope: !2, file: !3, line: 310, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2304, elements: !60)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "string_list_t", file: !3, line: 260, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "string_list_s", file: !3, line: 252, size: 256, elements: !53)
!53 = !{!54, !55, !56, !58, !59}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "list_name", scope: !52, file: !3, line: 254, baseType: !35, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !52, file: !3, line: 255, baseType: !29, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !52, file: !3, line: 256, baseType: !57, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uniq_mode_t", file: !3, line: 251, baseType: !5)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !52, file: !3, line: 258, baseType: !29, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !52, file: !3, line: 259, baseType: !30, size: 64, offset: 192)
!60 = !{!61}
!61 = !DISubrange(count: 9)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_t", file: !3, line: 296, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_s", file: !3, line: 268, size: 4992, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !89, !99, !100}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !64, file: !3, line: 269, baseType: !29, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name_prefix", scope: !64, file: !3, line: 270, baseType: !35, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "file_prefix", scope: !64, file: !3, line: 271, baseType: !35, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "file_names", scope: !64, file: !3, line: 273, baseType: !51, size: 256, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "file_contents", scope: !64, file: !3, line: 274, baseType: !51, size: 256, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "replaces", scope: !64, file: !3, line: 275, baseType: !51, size: 256, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !64, file: !3, line: 292, baseType: !73, size: 2304, offset: 960)
!73 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ru_", file: !3, line: 277, size: 2304, elements: !74)
!74 = !{!75, !87}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !73, file: !3, line: 289, baseType: !76, size: 2304)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nu_", file: !3, line: 278, size: 2304, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_resources", scope: !76, file: !3, line: 280, baseType: !51, size: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !76, file: !3, line: 281, baseType: !51, size: 256, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "devs", scope: !76, file: !3, line: 282, baseType: !51, size: 256, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "compositors", scope: !76, file: !3, line: 283, baseType: !51, size: 256, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fonts", scope: !76, file: !3, line: 284, baseType: !51, size: 256, offset: 1024)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "libs", scope: !76, file: !3, line: 285, baseType: !51, size: 256, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "libpaths", scope: !76, file: !3, line: 286, baseType: !51, size: 256, offset: 1536)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !76, file: !3, line: 287, baseType: !51, size: 256, offset: 1792)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !76, file: !3, line: 288, baseType: !51, size: 256, offset: 2048)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "indexed", scope: !73, file: !3, line: 291, baseType: !88, size: 2304)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2304, elements: !60)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "lib_p", scope: !64, file: !3, line: 293, baseType: !90, size: 576, offset: 3264)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "string_pattern_t", file: !3, line: 267, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "string_pattern_s", file: !3, line: 263, size: 576, elements: !92)
!92 = !{!93, !94, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "upper_case", scope: !91, file: !3, line: 264, baseType: !27, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "drop_extn", scope: !91, file: !3, line: 265, baseType: !27, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !91, file: !3, line: 266, baseType: !96, size: 488, offset: 64)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 488, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 61)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "libpath_p", scope: !64, file: !3, line: 294, baseType: !90, size: 576, offset: 3840)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "obj_p", scope: !64, file: !3, line: 295, baseType: !90, size: 576, offset: 4416)
!101 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!102 = !{i32 2, !"Dwarf Version", i32 4}
!103 = !{i32 2, !"Debug Info Version", i32 3}
!104 = !{i32 1, !"wchar_size", i32 4}
!105 = !{i32 1, !"ThinLTO", i32 0}
!106 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!107 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 339, type: !108, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !111)
!108 = !DISubroutineType(types: !109)
!109 = !{!29, !29, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!111 = !{}
!112 = !DILocalVariable(name: "argc", arg: 1, scope: !107, file: !3, line: 339, type: !29)
!113 = !DILocation(line: 339, column: 10, scope: !107)
!114 = !DILocalVariable(name: "argv", arg: 2, scope: !107, file: !3, line: 339, type: !110)
!115 = !DILocation(line: 339, column: 22, scope: !107)
!116 = !DILocalVariable(name: "conf", scope: !107, file: !3, line: 341, type: !63)
!117 = !DILocation(line: 341, column: 14, scope: !107)
!118 = !DILocalVariable(name: "escape", scope: !107, file: !3, line: 342, type: !37)
!119 = !DILocation(line: 342, column: 10, scope: !107)
!120 = !DILocalVariable(name: "i", scope: !107, file: !3, line: 343, type: !29)
!121 = !DILocation(line: 343, column: 9, scope: !107)
!122 = !DILocation(line: 346, column: 12, scope: !107)
!123 = !DILocation(line: 347, column: 17, scope: !107)
!124 = !DILocation(line: 347, column: 23, scope: !107)
!125 = !DILocation(line: 347, column: 12, scope: !107)
!126 = !DILocation(line: 347, column: 5, scope: !107)
!127 = !DILocation(line: 349, column: 22, scope: !107)
!128 = !DILocation(line: 349, column: 5, scope: !107)
!129 = !DILocation(line: 350, column: 22, scope: !107)
!130 = !DILocation(line: 350, column: 5, scope: !107)
!131 = !DILocation(line: 351, column: 22, scope: !107)
!132 = !DILocation(line: 351, column: 5, scope: !107)
!133 = !DILocation(line: 352, column: 12, scope: !134)
!134 = distinct !DILexicalBlock(scope: !107, file: !3, line: 352, column: 5)
!135 = !DILocation(line: 352, column: 10, scope: !134)
!136 = !DILocation(line: 352, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !134, file: !3, line: 352, column: 5)
!138 = !DILocation(line: 352, column: 19, scope: !137)
!139 = !DILocation(line: 352, column: 5, scope: !134)
!140 = !DILocation(line: 353, column: 19, scope: !137)
!141 = !DILocation(line: 353, column: 25, scope: !137)
!142 = !DILocation(line: 353, column: 33, scope: !137)
!143 = !DILocation(line: 353, column: 14, scope: !137)
!144 = !DILocation(line: 353, column: 2, scope: !137)
!145 = !DILocation(line: 352, column: 41, scope: !137)
!146 = !DILocation(line: 352, column: 5, scope: !137)
!147 = distinct !{!147, !139, !148}
!148 = !DILocation(line: 353, column: 35, scope: !134)
!149 = !DILocation(line: 356, column: 10, scope: !107)
!150 = !DILocation(line: 356, column: 16, scope: !107)
!151 = !DILocation(line: 356, column: 27, scope: !107)
!152 = !DILocation(line: 357, column: 10, scope: !107)
!153 = !DILocation(line: 357, column: 16, scope: !107)
!154 = !DILocation(line: 357, column: 26, scope: !107)
!155 = !DILocation(line: 358, column: 17, scope: !107)
!156 = !DILocation(line: 358, column: 23, scope: !107)
!157 = !DILocation(line: 358, column: 12, scope: !107)
!158 = !DILocation(line: 358, column: 5, scope: !107)
!159 = !DILocation(line: 359, column: 10, scope: !107)
!160 = !DILocation(line: 359, column: 27, scope: !107)
!161 = !DILocation(line: 360, column: 10, scope: !107)
!162 = !DILocation(line: 360, column: 23, scope: !107)
!163 = !DILocation(line: 363, column: 12, scope: !164)
!164 = distinct !DILexicalBlock(scope: !107, file: !3, line: 363, column: 5)
!165 = !DILocation(line: 363, column: 10, scope: !164)
!166 = !DILocation(line: 363, column: 17, scope: !167)
!167 = distinct !DILexicalBlock(scope: !164, file: !3, line: 363, column: 5)
!168 = !DILocation(line: 363, column: 21, scope: !167)
!169 = !DILocation(line: 363, column: 19, scope: !167)
!170 = !DILocation(line: 363, column: 5, scope: !164)
!171 = !DILocalVariable(name: "arg", scope: !172, file: !3, line: 364, type: !35)
!172 = distinct !DILexicalBlock(scope: !167, file: !3, line: 363, column: 32)
!173 = !DILocation(line: 364, column: 14, scope: !172)
!174 = !DILocation(line: 364, column: 20, scope: !172)
!175 = !DILocation(line: 364, column: 25, scope: !172)
!176 = !DILocalVariable(name: "out", scope: !172, file: !3, line: 365, type: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !179, line: 48, baseType: !180)
!179 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !181, line: 241, size: 1728, elements: !182)
!181 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !203, !204, !205, !206, !210, !211, !213, !217, !220, !222, !223, !224, !225, !226, !230, !231}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !180, file: !181, line: 242, baseType: !29, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !180, file: !181, line: 247, baseType: !43, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !180, file: !181, line: 248, baseType: !43, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !180, file: !181, line: 249, baseType: !43, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !180, file: !181, line: 250, baseType: !43, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !180, file: !181, line: 251, baseType: !43, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !180, file: !181, line: 252, baseType: !43, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !180, file: !181, line: 253, baseType: !43, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !180, file: !181, line: 254, baseType: !43, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !180, file: !181, line: 256, baseType: !43, size: 64, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !180, file: !181, line: 257, baseType: !43, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !180, file: !181, line: 258, baseType: !43, size: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !180, file: !181, line: 260, baseType: !196, size: 64, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !181, line: 156, size: 192, elements: !198)
!198 = !{!199, !200, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !197, file: !181, line: 157, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !197, file: !181, line: 158, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !197, file: !181, line: 162, baseType: !29, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !180, file: !181, line: 262, baseType: !201, size: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !180, file: !181, line: 264, baseType: !29, size: 32, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !180, file: !181, line: 268, baseType: !29, size: 32, offset: 928)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !180, file: !181, line: 270, baseType: !207, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !208, line: 131, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!209 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !180, file: !181, line: 274, baseType: !41, size: 16, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !180, file: !181, line: 275, baseType: !212, size: 8, offset: 1040)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !180, file: !181, line: 276, baseType: !214, size: 8, offset: 1048)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 1)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !180, file: !181, line: 280, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !181, line: 150, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !180, file: !181, line: 289, baseType: !221, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !208, line: 132, baseType: !209)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !180, file: !181, line: 297, baseType: !40, size: 64, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !180, file: !181, line: 298, baseType: !40, size: 64, offset: 1280)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !180, file: !181, line: 299, baseType: !40, size: 64, offset: 1344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !180, file: !181, line: 300, baseType: !40, size: 64, offset: 1408)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !180, file: !181, line: 302, baseType: !227, size: 64, offset: 1472)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !228, line: 62, baseType: !229)
!228 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!229 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !180, file: !181, line: 303, baseType: !29, size: 32, offset: 1536)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !180, file: !181, line: 305, baseType: !232, size: 160, offset: 1568)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 20)
!235 = !DILocation(line: 365, column: 8, scope: !172)
!236 = !DILocalVariable(name: "lib", scope: !172, file: !3, line: 366, type: !29)
!237 = !DILocation(line: 366, column: 6, scope: !172)
!238 = !DILocalVariable(name: "obj", scope: !172, file: !3, line: 366, type: !29)
!239 = !DILocation(line: 366, column: 15, scope: !172)
!240 = !DILocation(line: 368, column: 7, scope: !241)
!241 = distinct !DILexicalBlock(scope: !172, file: !3, line: 368, column: 6)
!242 = !DILocation(line: 368, column: 6, scope: !241)
!243 = !DILocation(line: 368, column: 11, scope: !241)
!244 = !DILocation(line: 368, column: 6, scope: !172)
!245 = !DILocation(line: 369, column: 22, scope: !246)
!246 = distinct !DILexicalBlock(scope: !241, file: !3, line: 368, column: 19)
!247 = !DILocation(line: 369, column: 6, scope: !246)
!248 = !DILocation(line: 370, column: 6, scope: !246)
!249 = !DILocation(line: 372, column: 6, scope: !250)
!250 = distinct !DILexicalBlock(scope: !172, file: !3, line: 372, column: 6)
!251 = !DILocation(line: 372, column: 11, scope: !250)
!252 = !DILocation(line: 372, column: 16, scope: !250)
!253 = !DILocation(line: 372, column: 8, scope: !250)
!254 = !DILocation(line: 372, column: 6, scope: !172)
!255 = !DILocation(line: 373, column: 14, scope: !256)
!256 = distinct !DILexicalBlock(scope: !250, file: !3, line: 372, column: 21)
!257 = !DILocation(line: 374, column: 7, scope: !256)
!258 = !DILocation(line: 373, column: 6, scope: !256)
!259 = !DILocation(line: 375, column: 6, scope: !256)
!260 = !DILocation(line: 377, column: 10, scope: !172)
!261 = !DILocation(line: 377, column: 2, scope: !172)
!262 = !DILocation(line: 380, column: 8, scope: !263)
!263 = distinct !DILexicalBlock(scope: !172, file: !3, line: 377, column: 18)
!264 = !DILocation(line: 380, column: 13, scope: !263)
!265 = !DILocation(line: 380, column: 15, scope: !263)
!266 = !DILocation(line: 380, column: 23, scope: !263)
!267 = !DILocation(line: 380, column: 37, scope: !263)
!268 = !DILocation(line: 380, column: 42, scope: !263)
!269 = !DILocation(line: 380, column: 44, scope: !263)
!270 = !DILocation(line: 379, column: 8, scope: !263)
!271 = !DILocation(line: 379, column: 20, scope: !263)
!272 = !DILocation(line: 381, column: 3, scope: !263)
!273 = !DILocation(line: 382, column: 3, scope: !263)
!274 = !DILocation(line: 384, column: 12, scope: !263)
!275 = !DILocation(line: 384, column: 17, scope: !263)
!276 = !DILocation(line: 384, column: 19, scope: !263)
!277 = !DILocation(line: 384, column: 10, scope: !263)
!278 = !DILocation(line: 385, column: 3, scope: !263)
!279 = !DILocation(line: 386, column: 3, scope: !263)
!280 = !DILocation(line: 389, column: 8, scope: !263)
!281 = !DILocation(line: 389, column: 13, scope: !263)
!282 = !DILocation(line: 389, column: 15, scope: !263)
!283 = !DILocation(line: 389, column: 23, scope: !263)
!284 = !DILocation(line: 389, column: 37, scope: !263)
!285 = !DILocation(line: 389, column: 42, scope: !263)
!286 = !DILocation(line: 389, column: 44, scope: !263)
!287 = !DILocation(line: 388, column: 8, scope: !263)
!288 = !DILocation(line: 388, column: 20, scope: !263)
!289 = !DILocation(line: 390, column: 3, scope: !263)
!290 = !DILocation(line: 391, column: 3, scope: !263)
!291 = !DILocalVariable(name: "pat", scope: !292, file: !3, line: 394, type: !293)
!292 = distinct !DILexicalBlock(scope: !263, file: !3, line: 393, column: 3)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!294 = !DILocation(line: 394, column: 25, scope: !292)
!295 = !DILocation(line: 396, column: 21, scope: !292)
!296 = !DILocation(line: 396, column: 15, scope: !292)
!297 = !DILocation(line: 396, column: 7, scope: !292)
!298 = !DILocation(line: 398, column: 20, scope: !299)
