; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.msghdr = type { i8*, i32, %struct.iovec*, i64, i8*, i64, i32 }
%struct.iovec = type { i8*, i64 }
%struct.cmsghdr = type { i64, i32, i32, [0 x i8] }

@.str = private unnamed_addr constant [5 x i8] c"pipe\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"socketpair\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"fork\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"test\00", align 1
@.str.7 = private unnamed_addr constant [8 x i8] c"sendmsg\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"recvmsg failed!\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.5 = private unnamed_addr constant [26 x i8] c"control message truncated\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"test data not received correctly!\00", align 1
@specialMalloc = external thread_local global i8, align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main() #0 !dbg !66 {
  %1 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 38b4a62b0634ac2bc4b67addab5698d2f1a5c23e)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42, nameTableKind: None)
!1 = !DIFile(filename: "conftest.c", directory: "/root/llvm/codesample/39apps/clamav-0.96.2")
!2 = !{!3, !16, !39}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !4, line: 24, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!13 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!14 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!15 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 192, baseType: !5, size: 32, elements: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!19 = !DIEnumerator(name: "MSG_OOB", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "MSG_PEEK", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "MSG_CTRUNC", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "MSG_PROXY", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "MSG_TRUNC", value: 32, isUnsigned: true)
!25 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64, isUnsigned: true)
!26 = !DIEnumerator(name: "MSG_EOR", value: 128, isUnsigned: true)
!27 = !DIEnumerator(name: "MSG_WAITALL", value: 256, isUnsigned: true)
!28 = !DIEnumerator(name: "MSG_FIN", value: 512, isUnsigned: true)
!29 = !DIEnumerator(name: "MSG_SYN", value: 1024, isUnsigned: true)
!30 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048, isUnsigned: true)
!31 = !DIEnumerator(name: "MSG_RST", value: 4096, isUnsigned: true)
!32 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192, isUnsigned: true)
!33 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384, isUnsigned: true)
!34 = !DIEnumerator(name: "MSG_MORE", value: 32768, isUnsigned: true)
!35 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536, isUnsigned: true)
!36 = !DIEnumerator(name: "MSG_BATCH", value: 262144, isUnsigned: true)
!37 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912, isUnsigned: true)
!38 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 322, baseType: !5, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "SCM_RIGHTS", value: 1, isUnsigned: true)
!42 = !{!43, !46, !58, !59}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 62, baseType: !45)
!44 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!45 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !17, line: 265, size: 128, elements: !48)
!48 = !{!49, !50, !52, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !47, file: !17, line: 267, baseType: !43, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !47, file: !17, line: 272, baseType: !51, size: 32, offset: 64)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !47, file: !17, line: 273, baseType: !51, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !47, file: !17, line: 275, baseType: !54, offset: 128)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, elements: !56)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !{!57}
!57 = !DISubrange(count: -1)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!60 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 38b4a62b0634ac2bc4b67addab5698d2f1a5c23e)"}
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{i32 1, !"wchar_size", i32 4}
!64 = !{i32 1, !"ThinLTO", i32 0}
!65 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!66 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 241, type: !67, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !69)
!67 = !DISubroutineType(types: !68)
!68 = !{!51}
!69 = !{}
!70 = !DILocalVariable(name: "fd", scope: !66, file: !1, line: 243, type: !71)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 2)
!74 = !DILocation(line: 243, column: 9, scope: !66)
!75 = !DILocalVariable(name: "pip", scope: !66, file: !1, line: 244, type: !71)
!76 = !DILocation(line: 244, column: 9, scope: !66)
!77 = !DILocalVariable(name: "pid", scope: !66, file: !1, line: 245, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !79, line: 98, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !81, line: 133, baseType: !51)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!82 = !DILocation(line: 245, column: 11, scope: !66)
!83 = !DILocalVariable(name: "status", scope: !66, file: !1, line: 246, type: !51)
!84 = !DILocation(line: 246, column: 9, scope: !66)
!85 = !DILocation(line: 248, column: 13, scope: !86)
!86 = distinct !DILexicalBlock(scope: !66, file: !1, line: 248, column: 8)
!87 = !DILocation(line: 248, column: 8, scope: !86)
!88 = !DILocation(line: 248, column: 8, scope: !66)
!89 = !DILocation(line: 249, column: 9, scope: !90)
!90 = distinct !DILexicalBlock(scope: !86, file: !1, line: 248, column: 19)
!91 = !DILocation(line: 250, column: 9, scope: !90)
!92 = !DILocation(line: 253, column: 44, scope: !93)
!93 = distinct !DILexicalBlock(scope: !66, file: !1, line: 253, column: 8)
!94 = !DILocation(line: 253, column: 8, scope: !93)
!95 = !DILocation(line: 253, column: 8, scope: !66)
!96 = !DILocation(line: 254, column: 9, scope: !97)
!97 = distinct !DILexicalBlock(scope: !93, file: !1, line: 253, column: 49)
!98 = !DILocation(line: 255, column: 9, scope: !97)
!99 = !DILocation(line: 258, column: 13, scope: !100)
!100 = distinct !DILexicalBlock(scope: !66, file: !1, line: 258, column: 8)
!101 = !DILocation(line: 258, column: 12, scope: !100)
!102 = !DILocation(line: 258, column: 21, scope: !100)
!103 = !DILocation(line: 258, column: 8, scope: !66)
!104 = !DILocation(line: 259, column: 9, scope: !105)
!105 = distinct !DILexicalBlock(scope: !100, file: !1, line: 258, column: 26)
!106 = !DILocation(line: 260, column: 5, scope: !105)
!107 = !DILocation(line: 260, column: 17, scope: !108)
!108 = distinct !DILexicalBlock(scope: !100, file: !1, line: 260, column: 16)
!109 = !DILocation(line: 260, column: 16, scope: !100)
!110 = !DILocation(line: 261, column: 23, scope: !111)
!111 = distinct !DILexicalBlock(scope: !108, file: !1, line: 260, column: 22)
!112 = !DILocation(line: 261, column: 15, scope: !111)
!113 = !DILocation(line: 261, column: 9, scope: !111)
!114 = !DILocation(line: 264, column: 20, scope: !115)
!115 = distinct !DILexicalBlock(scope: !116, file: !1, line: 264, column: 12)
!116 = distinct !DILexicalBlock(scope: !108, file: !1, line: 262, column: 12)
!117 = !DILocation(line: 264, column: 27, scope: !115)
!118 = !DILocation(line: 264, column: 12, scope: !115)
!119 = !DILocation(line: 264, column: 35, scope: !115)
!120 = !DILocation(line: 264, column: 12, scope: !116)
!121 = !DILocation(line: 265, column: 18, scope: !122)
!122 = distinct !DILexicalBlock(scope: !115, file: !1, line: 264, column: 42)
!123 = !DILocation(line: 265, column: 13, scope: !122)
!124 = !DILocation(line: 266, column: 21, scope: !122)
!125 = !DILocation(line: 266, column: 13, scope: !122)
!126 = !DILocation(line: 267, column: 13, scope: !122)
!127 = !DILocation(line: 269, column: 18, scope: !128)
!128 = distinct !DILexicalBlock(scope: !116, file: !1, line: 269, column: 12)
!129 = !DILocation(line: 269, column: 12, scope: !128)
!130 = !DILocation(line: 269, column: 46, scope: !128)
!131 = !DILocation(line: 269, column: 12, scope: !116)
!132 = !DILocation(line: 270, column: 9, scope: !133)
!133 = distinct !DILexicalBlock(scope: !128, file: !1, line: 269, column: 63)
!134 = !DILocation(line: 270, column: 3, scope: !133)
!135 = !DILocation(line: 271, column: 3, scope: !133)
!136 = !DILocation(line: 273, column: 15, scope: !116)
!137 = !DILocation(line: 273, column: 9, scope: !116)
!138 = !DILocation(line: 274, column: 17, scope: !116)
!139 = !DILocation(line: 274, column: 9, scope: !116)
!140 = !DILocation(line: 276, column: 12, scope: !66)
!141 = !DILocation(line: 276, column: 5, scope: !66)
!142 = !DILocation(line: 277, column: 1, scope: !66)
!143 = distinct !DISubprogram(name: "recv_fd", scope: !1, file: !1, line: 203, type: !144, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !69)
!144 = !DISubroutineType(types: !145)
!145 = !{!51, !51}
!146 = !DILocalVariable(name: "desc", arg: 1, scope: !143, file: !1, line: 203, type: !51)
!147 = !DILocation(line: 203, column: 24, scope: !143)
!148 = !DILocalVariable(name: "buf", scope: !143, file: !1, line: 205, type: !149)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 192, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 24)
!152 = !DILocation(line: 205, column: 19, scope: !143)
!153 = !DILocalVariable(name: "msg", scope: !143, file: !1, line: 206, type: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !17, line: 247, size: 448, elements: !155)
!155 = !{!156, !157, !161, !168, !169, !170, !171}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !154, file: !17, line: 249, baseType: !58, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !154, file: !17, line: 250, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !159, line: 277, baseType: !160)
!159 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !81, line: 189, baseType: !5)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !154, file: !17, line: 252, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !164, line: 43, size: 128, elements: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "")
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !163, file: !164, line: 45, baseType: !58, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !163, file: !164, line: 46, baseType: !43, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !154, file: !17, line: 253, baseType: !43, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !154, file: !17, line: 255, baseType: !58, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !154, file: !17, line: 256, baseType: !43, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !154, file: !17, line: 261, baseType: !51, size: 32, offset: 384)
!172 = !DILocation(line: 206, column: 19, scope: !143)
!173 = !DILocalVariable(name: "cmsg", scope: !143, file: !1, line: 207, type: !46)
!174 = !DILocation(line: 207, column: 21, scope: !143)
!175 = !DILocalVariable(name: "iov", scope: !143, file: !1, line: 208, type: !176)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 1)
!179 = !DILocation(line: 208, column: 18, scope: !143)
!180 = !DILocalVariable(name: "dummy", scope: !143, file: !1, line: 209, type: !181)
!181 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!182 = !DILocation(line: 209, column: 10, scope: !143)
!183 = !DILocalVariable(name: "ret", scope: !143, file: !1, line: 210, type: !51)
!184 = !DILocation(line: 210, column: 9, scope: !143)
!185 = !DILocation(line: 212, column: 5, scope: !143)
!186 = !DILocation(line: 213, column: 5, scope: !143)
!187 = !DILocation(line: 213, column: 12, scope: !143)
!188 = !DILocation(line: 213, column: 21, scope: !143)
!189 = !DILocation(line: 214, column: 5, scope: !143)
!190 = !DILocation(line: 214, column: 12, scope: !143)
!191 = !DILocation(line: 214, column: 20, scope: !143)
!192 = !DILocation(line: 215, column: 19, scope: !143)
!193 = !DILocation(line: 215, column: 9, scope: !143)
!194 = !DILocation(line: 215, column: 17, scope: !143)
!195 = !DILocation(line: 216, column: 9, scope: !143)
!196 = !DILocation(line: 216, column: 20, scope: !143)
!197 = !DILocation(line: 217, column: 23, scope: !143)
!198 = !DILocation(line: 217, column: 9, scope: !143)
!199 = !DILocation(line: 217, column: 21, scope: !143)
!200 = !DILocation(line: 218, column: 9, scope: !143)
!201 = !DILocation(line: 218, column: 24, scope: !143)
!202 = !DILocation(line: 220, column: 17, scope: !203)
!203 = distinct !DILexicalBlock(scope: !143, file: !1, line: 220, column: 9)
!204 = !DILocation(line: 220, column: 9, scope: !203)
!205 = !DILocation(line: 220, column: 32, scope: !203)
!206 = !DILocation(line: 220, column: 9, scope: !143)
!207 = !DILocation(line: 221, column: 9, scope: !208)
!208 = distinct !DILexicalBlock(scope: !203, file: !1, line: 220, column: 39)
!209 = !DILocation(line: 222, column: 9, scope: !208)
!210 = !DILocation(line: 224, column: 14, scope: !211)
!211 = distinct !DILexicalBlock(scope: !143, file: !1, line: 224, column: 9)
!212 = !DILocation(line: 224, column: 24, scope: !211)
!213 = !DILocation(line: 224, column: 37, scope: !211)
!214 = !DILocation(line: 224, column: 45, scope: !211)
!215 = !DILocation(line: 224, column: 55, scope: !211)
!216 = !DILocation(line: 224, column: 9, scope: !143)
!217 = !DILocation(line: 225, column: 17, scope: !218)
!218 = distinct !DILexicalBlock(scope: !211, file: !1, line: 224, column: 70)
!219 = !DILocation(line: 225, column: 9, scope: !218)
!220 = !DILocation(line: 226, column: 9, scope: !218)
!221 = !DILocation(line: 228, column: 17, scope: !222)
!222 = distinct !DILexicalBlock(scope: !143, file: !1, line: 228, column: 5)
!223 = !DILocation(line: 228, column: 15, scope: !222)
!224 = !DILocation(line: 228, column: 10, scope: !222)
!225 = !DILocation(line: 228, column: 38, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !1, line: 228, column: 5)
!227 = !DILocation(line: 228, column: 43, scope: !226)
!228 = !DILocation(line: 228, column: 5, scope: !222)
!229 = !DILocation(line: 230, column: 13, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !1, line: 230, column: 13)
!231 = distinct !DILexicalBlock(scope: !226, file: !1, line: 229, column: 41)
!232 = !DILocation(line: 230, column: 19, scope: !230)
!233 = !DILocation(line: 230, column: 28, scope: !230)
!234 = !DILocation(line: 230, column: 53, scope: !230)
!235 = !DILocation(line: 231, column: 13, scope: !230)
!236 = !DILocation(line: 231, column: 19, scope: !230)
