; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FT_StreamRec_ = type { i8*, i64, i64, %struct.FT_MemoryRec_*, i8*, i8* }
%struct.FT_MemoryRec_ = type { i8*, i8* (%struct.FT_MemoryRec_*, i64)*, void (%struct.FT_MemoryRec_*, i8*)*, i8* (%struct.FT_MemoryRec_*, i64, i64, i8*)* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [16 x i8] c"FT_Stream_Open:\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"FT_Stream_Open: file is too big\0A\00", align 1
@.str.3 = private unnamed_addr constant [34 x i8] c"FT_Stream_Open: zero-length file\0A\00", align 1
@.str.5 = private unnamed_addr constant [27 x i8] c" could not `alloc' memory\0A\00", align 1
@.str.8 = private unnamed_addr constant [16 x i8] c"./inputfile.txt\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @FT_Stream_Open(%struct.FT_StreamRec_*, i8*) #0 !dbg !15 {
  %3 = alloca i32, align 4
  %4 = alloca %struct.FT_StreamRec_*, align 8
  %5 = alloca i8*, align 8
  %6 = alloca i32, align 4
  %7 = alloca %struct.stat, align 8
  %8 = alloca i64, align 8
  %9 = alloca i64, align 8
  store %struct.FT_StreamRec_* %0, %struct.FT_StreamRec_** %4, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "main.c", directory: "/root/llvm/codesample/39apps/freetype-2.4.8-sample/30-33-sample")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!5 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)"}
!10 = !{i32 2, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{i32 1, !"wchar_size", i32 4}
!13 = !{i32 1, !"ThinLTO", i32 0}
!14 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!15 = distinct !DISubprogram(name: "FT_Stream_Open", scope: !1, file: !1, line: 106, type: !16, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !20, !50}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Error", file: !1, line: 71, baseType: !19)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream", file: !1, line: 92, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_StreamRec_", file: !1, line: 74, size: 384, elements: !23)
!23 = !{!24, !25, !26, !27, !48, !49}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !22, file: !1, line: 76, baseType: !7, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !1, line: 77, baseType: !4, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !22, file: !1, line: 78, baseType: !4, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !22, file: !1, line: 85, baseType: !28, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Memory", file: !1, line: 30, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_MemoryRec_", file: !1, line: 49, size: 256, elements: !31)
!31 = !{!32, !33, !38, !43}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !30, file: !1, line: 51, baseType: !6, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !30, file: !1, line: 52, baseType: !34, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Alloc_Func", file: !1, line: 34, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!6, !28, !5}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !30, file: !1, line: 53, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Free_Func", file: !1, line: 38, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !28, !6}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !30, file: !1, line: 54, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Realloc_Func", file: !1, line: 43, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!6, !28, !5, !5, !6}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !22, file: !1, line: 86, baseType: !7, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !22, file: !1, line: 87, baseType: !7, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DILocalVariable(name: "stream", arg: 1, scope: !15, file: !1, line: 106, type: !20)
!54 = !DILocation(line: 106, column: 32, scope: !15)
!55 = !DILocalVariable(name: "filepathname", arg: 2, scope: !15, file: !1, line: 107, type: !50)
!56 = !DILocation(line: 107, column: 32, scope: !15)
!57 = !DILocalVariable(name: "file", scope: !15, file: !1, line: 109, type: !19)
!58 = !DILocation(line: 109, column: 18, scope: !15)
!59 = !DILocalVariable(name: "stat_buf", scope: !15, file: !1, line: 110, type: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !61, line: 46, size: 1152, elements: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!62 = !{!63, !66, !68, !70, !73, !75, !77, !78, !79, !81, !83, !85, !93, !94, !95}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !60, file: !61, line: 48, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !65, line: 124, baseType: !4)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !60, file: !61, line: 53, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !65, line: 127, baseType: !4)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !60, file: !61, line: 61, baseType: !69, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !65, line: 130, baseType: !4)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !60, file: !61, line: 62, baseType: !71, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !65, line: 129, baseType: !72)
!72 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !60, file: !61, line: 64, baseType: !74, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !65, line: 125, baseType: !72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !60, file: !61, line: 65, baseType: !76, size: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !65, line: 126, baseType: !72)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !60, file: !61, line: 67, baseType: !19, size: 32, offset: 288)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !60, file: !61, line: 69, baseType: !64, size: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !60, file: !61, line: 74, baseType: !80, size: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 131, baseType: !5)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !60, file: !61, line: 78, baseType: !82, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !65, line: 153, baseType: !5)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !60, file: !61, line: 80, baseType: !84, size: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !65, line: 158, baseType: !5)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !60, file: !61, line: 91, baseType: !86, size: 128, offset: 576)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !87, line: 120, size: 128, elements: !88)
!87 = !DIFile(filename: "/usr/include/time.h", directory: "")
!88 = !{!89, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !86, file: !87, line: 122, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !65, line: 139, baseType: !5)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !86, file: !87, line: 123, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !65, line: 175, baseType: !5)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !60, file: !61, line: 92, baseType: !86, size: 128, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !60, file: !61, line: 93, baseType: !86, size: 128, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !60, file: !61, line: 106, baseType: !96, size: 192, offset: 960)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 192, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 3)
!99 = !DILocation(line: 110, column: 18, scope: !15)
!100 = !DILocation(line: 113, column: 11, scope: !101)
!101 = distinct !DILexicalBlock(scope: !15, file: !1, line: 113, column: 10)
!102 = !DILocation(line: 113, column: 10, scope: !15)
!103 = !DILocation(line: 114, column: 8, scope: !104)
!104 = distinct !DILexicalBlock(scope: !101, file: !1, line: 114, column: 7)
!105 = !DILocation(line: 117, column: 18, scope: !15)
!106 = !DILocation(line: 117, column: 12, scope: !15)
!107 = !DILocation(line: 117, column: 10, scope: !15)
!108 = !DILocation(line: 118, column: 10, scope: !109)
!109 = distinct !DILexicalBlock(scope: !15, file: !1, line: 118, column: 10)
!110 = !DILocation(line: 118, column: 15, scope: !109)
!111 = !DILocation(line: 118, column: 10, scope: !15)
!112 = !DILocation(line: 120, column: 7, scope: !113)
!113 = distinct !DILexicalBlock(scope: !109, file: !1, line: 119, column: 5)
!114 = !DILocation(line: 121, column: 44, scope: !113)
!115 = !DILocation(line: 121, column: 7, scope: !113)
!116 = !DILocation(line: 123, column: 5, scope: !113)
!117 = !DILocation(line: 132, column: 18, scope: !15)
!118 = !DILocation(line: 132, column: 11, scope: !15)
!119 = !DILocation(line: 154, column: 19, scope: !120)
!120 = distinct !DILexicalBlock(scope: !15, file: !1, line: 154, column: 10)
!121 = !DILocation(line: 154, column: 27, scope: !120)
!122 = !DILocation(line: 154, column: 10, scope: !15)
!123 = !DILocation(line: 156, column: 7, scope: !124)
!124 = distinct !DILexicalBlock(scope: !120, file: !1, line: 155, column: 5)
!125 = !DILocation(line: 157, column: 7, scope: !124)
!126 = !DILocation(line: 159, column: 24, scope: !127)
!127 = distinct !DILexicalBlock(scope: !120, file: !1, line: 159, column: 15)
!128 = !DILocation(line: 159, column: 32, scope: !127)
!129 = !DILocation(line: 159, column: 15, scope: !120)
!130 = !DILocation(line: 161, column: 7, scope: !131)
!131 = distinct !DILexicalBlock(scope: !127, file: !1, line: 160, column: 5)
!132 = !DILocation(line: 162, column: 7, scope: !131)
!133 = !DILocation(line: 166, column: 44, scope: !15)
!134 = !DILocation(line: 166, column: 5, scope: !15)
!135 = !DILocation(line: 166, column: 13, scope: !15)
!136 = !DILocation(line: 166, column: 18, scope: !15)
!137 = !DILocation(line: 167, column: 5, scope: !15)
!138 = !DILocation(line: 167, column: 13, scope: !15)
!139 = !DILocation(line: 167, column: 18, scope: !15)
!140 = !DILocation(line: 176, column: 16, scope: !141)
!141 = distinct !DILexicalBlock(scope: !15, file: !1, line: 176, column: 10)
!142 = !DILocation(line: 176, column: 24, scope: !141)
!143 = !DILocation(line: 176, column: 10, scope: !141)
!144 = !DILocation(line: 176, column: 29, scope: !141)
!145 = !DILocation(line: 176, column: 35, scope: !141)
!146 = !DILocation(line: 176, column: 38, scope: !141)
!147 = !DILocation(line: 176, column: 46, scope: !141)
!148 = !DILocation(line: 176, column: 51, scope: !141)
!149 = !DILocation(line: 176, column: 10, scope: !15)
!150 = !DILocalVariable(name: "total_read_count", scope: !151, file: !1, line: 180, type: !152)
!151 = distinct !DILexicalBlock(scope: !141, file: !1, line: 179, column: 5)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !153, line: 104, baseType: !154)
!153 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !65, line: 172, baseType: !5)
!155 = !DILocation(line: 180, column: 16, scope: !151)
!156 = !DILocation(line: 183, column: 7, scope: !151)
!157 = !DILocation(line: 184, column: 51, scope: !151)
!158 = !DILocation(line: 184, column: 7, scope: !151)
!159 = !DILocation(line: 186, column: 54, scope: !151)
!160 = !DILocation(line: 186, column: 62, scope: !151)
