; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rrdesc.11 = type { i32, i8*, i8, %struct.rrdesc.11* }
%struct.keyInstance = type { i8, i32, [65 x i8], i32, [60 x i32], [60 x i32] }
%struct.cipherInstance = type { i8, [16 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.q_header = type { i16, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16 }
%struct.q_question = type { %struct.js_string*, i16, i16 }
%struct.js_string = type { i8*, i32, i32, i32, i32, i32 }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.q_rr = type { %struct.js_string*, i16, i16, i32, i16, %struct.js_string* }
%struct.rr_soa = type { %struct.js_string*, %struct.js_string*, i32, i32, i32, i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@verbose_mode = internal global i32 0, align 4, !dbg !0
@.str.4 = private unnamed_addr constant [3 x i8] c"# \00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "verbose_mode", scope: !2, file: !3, line: 60, type: !40, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !49, nameTableKind: None)
!3 = !DIFile(filename: "askmara.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tools")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !6, line: 24, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!16 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!17 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!18 = !{!19, !21, !22, !26, !37, !40, !41, !46, !47, !48}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !23, line: 30, baseType: !24)
!23 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 51, baseType: !7)
!25 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !28, line: 170, size: 128, elements: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!29 = !{!30, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !27, file: !28, line: 172, baseType: !31, size: 16)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !32, line: 28, baseType: !21)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !27, file: !28, line: 173, baseType: !34, size: 112, offset: 16)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 14)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !38, line: 56, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "")
!39 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !43, line: 277, baseType: !44)
!43 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !45, line: 189, baseType: !7)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !{!0, !50, !52}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "timeout", scope: !2, file: !3, line: 62, type: !40, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "dns_port", scope: !2, file: !3, line: 64, type: !21, isLocal: false, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "dlog_level", scope: !56, file: !57, line: 34, type: !40, isLocal: false, isDefinition: true)
!56 = distinct !DICompileUnit(language: DW_LANG_C99, file: !57, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, globals: !59, nameTableKind: None)
!57 = !DIFile(filename: "Decompress.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!58 = !{}
!59 = !{!60, !54, !66}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "rr_descs", scope: !56, file: !62, line: 40, type: !63, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: "./Compress_rrdescs.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1088, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 17)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "rr_formats", scope: !56, file: !57, line: 31, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "rrdesc", file: !71, line: 25, baseType: !72)
!71 = !DIFile(filename: "./Compress_rrs.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rrdesc", file: !71, line: 20, size: 256, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rr_num", scope: !72, file: !71, line: 21, baseType: !40, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !72, file: !71, line: 22, baseType: !19, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tocompress", scope: !72, file: !71, line: 23, baseType: !20, size: 8, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !71, line: 24, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "timestamp_type", scope: !81, file: !82, line: 29, type: !40, isLocal: false, isDefinition: true)
!81 = distinct !DICompileUnit(language: DW_LANG_C99, file: !82, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !83, globals: !84, nameTableKind: None)
!82 = !DIFile(filename: "timestamp.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!83 = !{!40}
!84 = !{!79}
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "Te4", scope: !87, file: !119, line: 267, type: !120, isLocal: true, isDefinition: true)
!87 = distinct !DICompileUnit(language: DW_LANG_C99, file: !88, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !89, globals: !94, nameTableKind: None)
!88 = !DIFile(filename: "rng-alg-fst.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/rng")
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !91, line: 55, baseType: !7)
!91 = !DIFile(filename: "./rng-alg-fst.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/rng")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !91, line: 53, baseType: !93)
!93 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !{!95, !100, !103, !105, !107, !109, !85, !111, !117, !121, !123, !125}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "Sc", scope: !87, file: !88, line: 63, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 256)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "STe0", scope: !87, file: !88, line: 64, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 8192, elements: !98)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "STe1", scope: !87, file: !88, line: 65, type: !102, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "STe2", scope: !87, file: !88, line: 66, type: !102, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "STe3", scope: !87, file: !88, line: 67, type: !102, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "STe4", scope: !87, file: !88, line: 68, type: !102, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "rcon", scope: !87, file: !88, line: 53, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 320, elements: !115)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!115 = !{!116}
!116 = !DISubrange(count: 10)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "Te0", scope: !87, file: !119, line: 3, type: !120, isLocal: true, isDefinition: true)
!119 = !DIFile(filename: "./rng-32bit-tables.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/rng")
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 8192, elements: !98)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "Te1", scope: !87, file: !119, line: 69, type: !120, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "Te2", scope: !87, file: !119, line: 135, type: !120, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "Te3", scope: !87, file: !119, line: 201, type: !120, isLocal: true, isDefinition: true)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !128, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !129, nameTableKind: None)
!128 = !DIFile(filename: "JsStr.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!129 = !{!48, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !132, line: 28, baseType: !133)
!132 = !DIFile(filename: "./JsStr.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 19, size: 256, elements: !134)
!134 = !{!135, !137, !138, !139, !140, !141}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !133, file: !132, line: 20, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !133, file: !132, line: 21, baseType: !7, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !133, file: !132, line: 22, baseType: !7, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !133, file: !132, line: 23, baseType: !7, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !133, file: !132, line: 25, baseType: !40, size: 32, offset: 160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !133, file: !132, line: 26, baseType: !40, size: 32, offset: 192)
!142 = distinct !DICompileUnit(language: DW_LANG_C99, file: !143, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !144, nameTableKind: None)
!143 = !DIFile(filename: "JsStrOS.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!144 = !{!48}
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, nameTableKind: None)
!146 = !DIFile(filename: "JsStrCP.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !149, globals: !150, nameTableKind: None)
!148 = !DIFile(filename: "MaraHash.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!149 = !{!7}
!150 = !{!151}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "mhash_mask", scope: !147, file: !148, line: 38, type: !153, isLocal: false, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 992, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 31)
!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !157, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, nameTableKind: None)
!157 = !DIFile(filename: "Queries.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!158 = distinct !DICompileUnit(language: DW_LANG_C99, file: !159, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, nameTableKind: None)
!159 = !DIFile(filename: "Compress.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, nameTableKind: None)
!161 = !DIFile(filename: "bobbit.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !164, nameTableKind: None)
!163 = !DIFile(filename: "rng-api-fst.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/rng")
!164 = !{!48, !92}
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, nameTableKind: None)
!166 = !DIFile(filename: "ParseCsv1.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !169, globals: !184, nameTableKind: None)
!168 = !DIFile(filename: "ParseMaraRc.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!169 = !{!170, !173}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 62, baseType: !172)
!171 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!172 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !175, line: 28, baseType: !176)
!175 = !DIFile(filename: "./../libs/JsStr.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !175, line: 19, size: 256, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !176, file: !175, line: 20, baseType: !136, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !176, file: !175, line: 21, baseType: !7, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !176, file: !175, line: 22, baseType: !7, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !176, file: !175, line: 23, baseType: !7, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !176, file: !175, line: 25, baseType: !40, size: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !176, file: !175, line: 26, baseType: !40, size: 32, offset: 192)
!184 = !{!185, !190, !195, !233, !235, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !284, !286, !288, !290, !292, !303, !306}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "keywords", scope: !167, file: !168, line: 36, type: !187, isLocal: false, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 3520, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 55)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "dkeywords", scope: !167, file: !168, line: 342, type: !192, isLocal: false, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 384, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 6)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "quotes", scope: !197, file: !168, line: 631, type: !173, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "parseline", scope: !168, file: !168, line: 628, type: !198, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !201)
!198 = !DISubroutineType(types: !199)
!199 = !{!40, !173, !173, !173, !173, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!202 = !DILocalVariable(name: "line", arg: 1, scope: !197, file: !168, line: 628, type: !173)
!203 = !DILocalVariable(name: "var", arg: 2, scope: !197, file: !168, line: 628, type: !173)
!204 = !DILocalVariable(name: "key", arg: 3, scope: !197, file: !168, line: 628, type: !173)
!205 = !DILocalVariable(name: "value", arg: 4, scope: !197, file: !168, line: 629, type: !173)
!206 = !DILocalVariable(name: "do_plus", arg: 5, scope: !197, file: !168, line: 629, type: !200)
!207 = !DILocalVariable(name: "quote1", scope: !197, file: !168, line: 635, type: !40)
!208 = !DILocalVariable(name: "quote2", scope: !197, file: !168, line: 635, type: !40)
!209 = !DILocalVariable(name: "quote3", scope: !197, file: !168, line: 635, type: !40)
!210 = !DILocalVariable(name: "quote4", scope: !197, file: !168, line: 635, type: !40)
!211 = !DILocalVariable(name: "varstart", scope: !197, file: !168, line: 637, type: !40)
!212 = !DILocalVariable(name: "varend", scope: !197, file: !168, line: 637, type: !40)
!213 = !DILocalVariable(name: "valstart", scope: !197, file: !168, line: 637, type: !40)
!214 = !DILocalVariable(name: "valend", scope: !197, file: !168, line: 637, type: !40)
!215 = !DILocalVariable(name: "equalp", scope: !197, file: !168, line: 640, type: !40)
!216 = !DILocalVariable(name: "hashp", scope: !197, file: !168, line: 640, type: !40)
!217 = !DILocalVariable(name: "tempp", scope: !197, file: !168, line: 641, type: !40)
!218 = !DILocalVariable(name: "ret", scope: !197, file: !168, line: 642, type: !40)
!219 = !DILocalVariable(name: "quote", scope: !197, file: !168, line: 643, type: !20)
!220 = !DILocalVariable(name: "plus", scope: !197, file: !168, line: 644, type: !20)
!221 = !DILocalVariable(name: "equal", scope: !197, file: !168, line: 645, type: !20)
!222 = !DILocalVariable(name: "hash", scope: !197, file: !168, line: 646, type: !20)
!223 = !DILocalVariable(name: "left", scope: !197, file: !168, line: 647, type: !20)
!224 = !DILocalVariable(name: "right", scope: !197, file: !168, line: 648, type: !20)
!225 = !DILocalVariable(name: "cleft", scope: !197, file: !168, line: 649, type: !20)
!226 = !DILocalVariable(name: "cright", scope: !197, file: !168, line: 650, type: !20)
!227 = !DILocalVariable(name: "bslash", scope: !197, file: !168, line: 651, type: !20)
!228 = !DILocalVariable(name: "q", scope: !229, file: !168, line: 918, type: !40)
!229 = distinct !DILexicalBlock(scope: !230, file: !168, line: 917, column: 22)
!230 = distinct !DILexicalBlock(scope: !231, file: !168, line: 917, column: 12)
!231 = distinct !DILexicalBlock(scope: !232, file: !168, line: 912, column: 38)
!232 = distinct !DILexicalBlock(scope: !197, file: !168, line: 912, column: 8)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "alphanumeric", scope: !197, file: !168, line: 631, type: !173, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "numbers", scope: !197, file: !168, line: 631, type: !173, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "equals", scope: !197, file: !168, line: 632, type: !173, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "plusq", scope: !197, file: !168, line: 632, type: !173, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "hashq", scope: !197, file: !168, line: 632, type: !173, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "bslashq", scope: !197, file: !168, line: 632, type: !173, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "allq", scope: !197, file: !168, line: 632, type: !173, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "leftq", scope: !197, file: !168, line: 633, type: !173, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "rightq", scope: !197, file: !168, line: 633, type: !173, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "cleftq", scope: !197, file: !168, line: 633, type: !173, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "crightq", scope: !197, file: !168, line: 633, type: !173, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "blankq", scope: !197, file: !168, line: 634, type: !173, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "line", scope: !259, file: !168, line: 1053, type: !173, isLocal: true, isDefinition: true)
!259 = distinct !DISubprogram(name: "read_mararc", scope: !168, file: !168, line: 1052, type: !260, scopeLine: 1052, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !262)
!260 = !DISubroutineType(types: !261)
!261 = !{!40, !173, !173, !200}
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !278}
!263 = !DILocalVariable(name: "fileloc", arg: 1, scope: !259, file: !168, line: 1052, type: !173)
!264 = !DILocalVariable(name: "errorstr", arg: 2, scope: !259, file: !168, line: 1052, type: !173)
!265 = !DILocalVariable(name: "errorret", arg: 3, scope: !259, file: !168, line: 1052, type: !200)
!266 = !DILocalVariable(name: "error", scope: !259, file: !168, line: 1059, type: !40)
!267 = !DILocalVariable(name: "linenum", scope: !259, file: !168, line: 1060, type: !40)
!268 = !DILocalVariable(name: "command", scope: !259, file: !168, line: 1060, type: !40)
!269 = !DILocalVariable(name: "tnum", scope: !259, file: !168, line: 1061, type: !40)
!270 = !DILocalVariable(name: "is_plus", scope: !259, file: !168, line: 1062, type: !40)
!271 = !DILocalVariable(name: "result", scope: !272, file: !168, line: 1150, type: !40)
!272 = distinct !DILexicalBlock(scope: !273, file: !168, line: 1149, column: 29)
!273 = distinct !DILexicalBlock(scope: !274, file: !168, line: 1149, column: 21)
!274 = distinct !DILexicalBlock(scope: !275, file: !168, line: 1138, column: 16)
!275 = distinct !DILexicalBlock(scope: !276, file: !168, line: 1130, column: 36)
!276 = distinct !DILexicalBlock(scope: !277, file: !168, line: 1130, column: 12)
!277 = distinct !DILexicalBlock(scope: !259, file: !168, line: 1119, column: 30)
!278 = !DILocalVariable(name: "result", scope: !279, file: !168, line: 1238, type: !40)
!279 = distinct !DILexicalBlock(scope: !280, file: !168, line: 1237, column: 29)
!280 = distinct !DILexicalBlock(scope: !281, file: !168, line: 1237, column: 21)
!281 = distinct !DILexicalBlock(scope: !282, file: !168, line: 1226, column: 16)
!282 = distinct !DILexicalBlock(scope: !283, file: !168, line: 1192, column: 41)
!283 = distinct !DILexicalBlock(scope: !276, file: !168, line: 1192, column: 17)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "var", scope: !259, file: !168, line: 1054, type: !173, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "key", scope: !259, file: !168, line: 1055, type: !173, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "value", scope: !259, file: !168, line: 1056, type: !173, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "tstr", scope: !259, file: !168, line: 1057, type: !173, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "file", scope: !259, file: !168, line: 1065, type: !294, isLocal: true, isDefinition: true)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_file", file: !175, line: 37, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !175, line: 30, size: 192, elements: !297)
!297 = !{!298, !299, !300, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !296, file: !175, line: 31, baseType: !40, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "file_desc", scope: !296, file: !175, line: 32, baseType: !40, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !296, file: !175, line: 34, baseType: !173, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !296, file: !175, line: 35, baseType: !40, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !296, file: !175, line: 36, baseType: !40, size: 32, offset: 160)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "kvar", scope: !167, file: !168, line: 183, type: !305, isLocal: false, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 3520, elements: !188)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "dvar", scope: !167, file: !168, line: 349, type: !308, isLocal: false, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 384, elements: !193)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash", file: !311, line: 45, baseType: !312)
!311 = !DIFile(filename: "./../libs/MaraHash.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 41, size: 192, elements: !313)
!313 = !{!314, !315, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !312, file: !311, line: 42, baseType: !40, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !312, file: !311, line: 43, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash_spot", file: !311, line: 30, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mhash_spot", file: !311, line: 25, size: 256, elements: !320)
!320 = !{!321, !322, !323, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !319, file: !311, line: 26, baseType: !173, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !319, file: !311, line: 27, baseType: !48, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !319, file: !311, line: 28, baseType: !40, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !311, line: 29, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "spots", scope: !312, file: !311, line: 44, baseType: !7, size: 32, offset: 128)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, nameTableKind: None)
!328 = !DIFile(filename: "Csv2_esc_txt.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!329 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)"}
!330 = !{i32 2, !"Dwarf Version", i32 4}
!331 = !{i32 2, !"Debug Info Version", i32 3}
!332 = !{i32 1, !"wchar_size", i32 4}
!333 = !{i32 1, !"ThinLTO", i32 0}
!334 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!335 = distinct !DISubprogram(name: "gen_id", scope: !3, file: !3, line: 94, type: !336, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !339)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !19}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 49, baseType: !21)
!339 = !{!340, !341, !345, !346, !347, !365, !374, !378, !379, !380, !381}
!340 = !DILocalVariable(name: "hostname", arg: 1, scope: !335, file: !3, line: 94, type: !19)
!341 = !DILocalVariable(name: "r_inBlock", scope: !335, file: !3, line: 97, type: !342)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 136, elements: !64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "MARA_BYTE", file: !344, line: 91, baseType: !93)
!344 = !DIFile(filename: "./../rng/rng-api-fst.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tools")
!345 = !DILocalVariable(name: "r_outBlock", scope: !335, file: !3, line: 97, type: !342)
!346 = !DILocalVariable(name: "r_binKey", scope: !335, file: !3, line: 97, type: !342)
!347 = !DILocalVariable(name: "r_keyInst", scope: !335, file: !3, line: 98, type: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "keyInstance", file: !344, line: 101, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 94, size: 4480, elements: !350)
!350 = !{!351, !352, !353, !357, !358, !364}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !349, file: !344, line: 95, baseType: !343, size: 8)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "keyLen", scope: !349, file: !344, line: 96, baseType: !40, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "keyMaterial", scope: !349, file: !344, line: 97, baseType: !354, size: 520, offset: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 520, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 65)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !349, file: !344, line: 98, baseType: !40, size: 32, offset: 608)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rk", scope: !349, file: !344, line: 99, baseType: !359, size: 1920, offset: 640)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 1920, elements: !362)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !361, line: 55, baseType: !7)
!361 = !DIFile(filename: "./../rng/rng-alg-fst.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tools")
!362 = !{!363}
!363 = !DISubrange(count: 60)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ek", scope: !349, file: !344, line: 100, baseType: !359, size: 1920, offset: 2560)
!365 = !DILocalVariable(name: "r_cipherInst", scope: !335, file: !3, line: 99, type: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipherInstance", file: !344, line: 107, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 104, size: 136, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !367, file: !344, line: 105, baseType: !343, size: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "IV", scope: !367, file: !344, line: 106, baseType: !371, size: 128, offset: 8)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 128, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 16)
!374 = !DILocalVariable(name: "crypto_key", scope: !335, file: !3, line: 100, type: !375)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 272, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 34)
!378 = !DILocalVariable(name: "counter", scope: !335, file: !3, line: 101, type: !40)
!379 = !DILocalVariable(name: "mc1", scope: !335, file: !3, line: 102, type: !19)
!380 = !DILocalVariable(name: "mc2", scope: !335, file: !3, line: 102, type: !19)
!381 = !DILocalVariable(name: "ret", scope: !335, file: !3, line: 104, type: !40)
!382 = !DILocation(line: 94, column: 23, scope: !335)
!383 = !DILocation(line: 97, column: 5, scope: !335)
!384 = !DILocation(line: 97, column: 15, scope: !335)
!385 = !DILocation(line: 97, column: 29, scope: !335)
!386 = !DILocation(line: 98, column: 5, scope: !335)
!387 = !DILocation(line: 99, column: 5, scope: !335)
!388 = !DILocation(line: 100, column: 5, scope: !335)
!389 = !DILocation(line: 100, column: 19, scope: !335)
!390 = !DILocation(line: 104, column: 9, scope: !335)
!391 = !DILocation(line: 107, column: 17, scope: !392)
!392 = distinct !DILexicalBlock(scope: !335, file: !3, line: 107, column: 8)
!393 = !DILocation(line: 107, column: 8, scope: !335)
!394 = !DILocation(line: 116, column: 33, scope: !395)
!395 = distinct !DILexicalBlock(scope: !396, file: !3, line: 115, column: 47)
!396 = distinct !DILexicalBlock(scope: !397, file: !3, line: 115, column: 5)
!397 = distinct !DILexicalBlock(scope: !335, file: !3, line: 115, column: 5)
!398 = !DILocation(line: 101, column: 9, scope: !335)
!399 = !DILocation(line: 124, column: 5, scope: !335)
!400 = !DILocation(line: 128, column: 32, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 127, column: 47)
!402 = distinct !DILexicalBlock(scope: !403, file: !3, line: 127, column: 5)
!403 = distinct !DILexicalBlock(scope: !335, file: !3, line: 127, column: 5)
!404 = !DILocation(line: 136, column: 8, scope: !405)
!405 = distinct !DILexicalBlock(scope: !335, file: !3, line: 136, column: 8)
!406 = !DILocation(line: 136, column: 25, scope: !405)
!407 = !DILocation(line: 136, column: 8, scope: !335)
!408 = !DILocation(line: 137, column: 5, scope: !405)
!409 = !DILocation(line: 98, column: 17, scope: !335)
!410 = !DILocation(line: 139, column: 8, scope: !411)
!411 = distinct !DILexicalBlock(scope: !335, file: !3, line: 139, column: 8)
!412 = !DILocation(line: 139, column: 66, scope: !411)
!413 = !DILocation(line: 139, column: 8, scope: !335)
!414 = !DILocation(line: 99, column: 20, scope: !335)
!415 = !DILocation(line: 141, column: 8, scope: !416)
!416 = distinct !DILexicalBlock(scope: !335, file: !3, line: 141, column: 8)
!417 = !DILocation(line: 141, column: 50, scope: !416)
!418 = !DILocation(line: 141, column: 8, scope: !335)
!419 = !DILocation(line: 143, column: 8, scope: !420)
!420 = distinct !DILexicalBlock(scope: !335, file: !3, line: 143, column: 8)
!421 = !DILocation(line: 143, column: 72, scope: !420)
!422 = !DILocation(line: 143, column: 8, scope: !335)
!423 = !DILocation(line: 146, column: 13, scope: !335)
!424 = !{!425, !425, i64 0}
!425 = !{!"omnipotent char", !426, i64 0}
!426 = !{!"Simple C/C++ TBAA"}
!427 = !DILocation(line: 146, column: 27, scope: !335)
!428 = !DILocation(line: 146, column: 46, scope: !335)
!429 = !DILocation(line: 146, column: 43, scope: !335)
!430 = !DILocation(line: 148, column: 5, scope: !335)
!431 = !DILocation(line: 0, scope: !335)
!432 = !DILocation(line: 149, column: 5, scope: !335)
!433 = distinct !DISubprogram(name: "harderror", scope: !3, file: !3, line: 151, type: !434, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!40, !19}
!436 = !{!437}
!437 = !DILocalVariable(name: "msg", arg: 1, scope: !433, file: !3, line: 151, type: !19)
!438 = !DILocation(line: 151, column: 21, scope: !433)
!439 = !DILocation(line: 152, column: 8, scope: !440)
!440 = distinct !DILexicalBlock(scope: !433, file: !3, line: 152, column: 8)
!441 = !{!442, !442, i64 0}
!442 = !{!"int", !425, i64 0}
!443 = !DILocation(line: 152, column: 21, scope: !440)
!444 = !DILocation(line: 152, column: 8, scope: !433)
!445 = !DILocation(line: 153, column: 9, scope: !440)
!446 = !DILocation(line: 154, column: 5, scope: !433)
!447 = !DILocation(line: 155, column: 5, scope: !433)
!448 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 158, type: !449, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!40, !40, !47}
!451 = !{!452, !453, !454, !455, !469, !471, !472, !473, !485, !486, !487, !505, !512, !513, !514, !520, !521, !529, !530, !531, !532, !533, !534, !535, !537, !538, !541, !544}
!452 = !DILocalVariable(name: "argc", arg: 1, scope: !448, file: !3, line: 158, type: !40)
!453 = !DILocalVariable(name: "argv", arg: 2, scope: !448, file: !3, line: 158, type: !47)
!454 = !DILocalVariable(name: "server_address", scope: !448, file: !3, line: 159, type: !19)
!455 = !DILocalVariable(name: "dns_udp", scope: !448, file: !3, line: 160, type: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !23, line: 239, size: 128, elements: !457)
!457 = !{!458, !459, !461, !465}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !456, file: !23, line: 241, baseType: !31, size: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !456, file: !23, line: 242, baseType: !460, size: 16, offset: 16)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !23, line: 119, baseType: !338)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !456, file: !23, line: 243, baseType: !462, size: 32, offset: 32)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !23, line: 31, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !462, file: !23, line: 33, baseType: !22, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !456, file: !23, line: 246, baseType: !466, size: 64, offset: 64)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 64, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 8)
!469 = !DILocalVariable(name: "pdns_udp", scope: !448, file: !3, line: 161, type: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!471 = !DILocalVariable(name: "len_inet", scope: !448, file: !3, line: 165, type: !40)
!472 = !DILocalVariable(name: "s", scope: !448, file: !3, line: 166, type: !40)
!473 = !DILocalVariable(name: "outdata", scope: !448, file: !3, line: 167, type: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !476, line: 28, baseType: !477)
!476 = !DIFile(filename: "./../libs/JsStr.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tools")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 19, size: 256, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !477, file: !476, line: 20, baseType: !136, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !477, file: !476, line: 21, baseType: !7, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !477, file: !476, line: 22, baseType: !7, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !477, file: !476, line: 23, baseType: !7, size: 32, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !477, file: !476, line: 25, baseType: !40, size: 32, offset: 160)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !477, file: !476, line: 26, baseType: !40, size: 32, offset: 192)
!485 = !DILocalVariable(name: "indata", scope: !448, file: !3, line: 168, type: !474)
!486 = !DILocalVariable(name: "uindata", scope: !448, file: !3, line: 168, type: !474)
!487 = !DILocalVariable(name: "header", scope: !448, file: !3, line: 169, type: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "q_header", file: !489, line: 253, baseType: !490)
!489 = !DIFile(filename: "./../MaraDns.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tools")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 239, size: 352, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !489, line: 240, baseType: !338, size: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !490, file: !489, line: 241, baseType: !40, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !490, file: !489, line: 242, baseType: !40, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !490, file: !489, line: 243, baseType: !40, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !490, file: !489, line: 244, baseType: !40, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !490, file: !489, line: 245, baseType: !40, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !490, file: !489, line: 246, baseType: !40, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !490, file: !489, line: 247, baseType: !40, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !490, file: !489, line: 248, baseType: !40, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "qdcount", scope: !490, file: !489, line: 249, baseType: !338, size: 16, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ancount", scope: !490, file: !489, line: 250, baseType: !338, size: 16, offset: 304)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nscount", scope: !490, file: !489, line: 251, baseType: !338, size: 16, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "arcount", scope: !490, file: !489, line: 252, baseType: !338, size: 16, offset: 336)
!505 = !DILocalVariable(name: "question", scope: !448, file: !3, line: 170, type: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "q_question", file: !489, line: 260, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 256, size: 128, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "qname", scope: !507, file: !489, line: 257, baseType: !474, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "qtype", scope: !507, file: !489, line: 258, baseType: !338, size: 16, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "qclass", scope: !507, file: !489, line: 259, baseType: !338, size: 16, offset: 80)
!512 = !DILocalVariable(name: "place", scope: !448, file: !3, line: 171, type: !40)
!513 = !DILocalVariable(name: "count", scope: !448, file: !3, line: 171, type: !40)
!514 = !DILocalVariable(name: "rx_set", scope: !448, file: !3, line: 172, type: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !38, line: 77, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 66, size: 1024, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !516, file: !38, line: 74, baseType: !519, size: 1024)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !372)
!520 = !DILocalVariable(name: "maxd", scope: !448, file: !3, line: 173, type: !40)
!521 = !DILocalVariable(name: "tv", scope: !448, file: !3, line: 174, type: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !523, line: 30, size: 128, elements: !524)
!523 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "")
!524 = !{!525, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !522, file: !523, line: 32, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 139, baseType: !39)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !522, file: !523, line: 33, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !45, line: 141, baseType: !39)
!529 = !DILocalVariable(name: "n", scope: !448, file: !3, line: 175, type: !40)
!530 = !DILocalVariable(name: "nrd", scope: !448, file: !3, line: 176, type: !40)
!531 = !DILocalVariable(name: "id", scope: !448, file: !3, line: 178, type: !40)
!532 = !DILocalVariable(name: "attempts", scope: !448, file: !3, line: 179, type: !40)
!533 = !DILocalVariable(name: "desired_rr", scope: !448, file: !3, line: 180, type: !40)
!534 = !DILocalVariable(name: "temp", scope: !448, file: !3, line: 182, type: !19)
!535 = !DILocalVariable(name: "__v", scope: !536, file: !3, line: 253, type: !21)
!536 = distinct !DILexicalBlock(scope: !448, file: !3, line: 253, column: 24)
!537 = !DILocalVariable(name: "__x", scope: !536, file: !3, line: 253, type: !21)
!538 = !DILocalVariable(name: "td", scope: !539, file: !3, line: 308, type: !40)
!539 = distinct !DILexicalBlock(scope: !540, file: !3, line: 307, column: 38)
!540 = distinct !DILexicalBlock(scope: !448, file: !3, line: 307, column: 8)
!541 = !DILocalVariable(name: "__d0", scope: !542, file: !3, line: 359, type: !40)
!542 = distinct !DILexicalBlock(scope: !543, file: !3, line: 359, column: 9)
!543 = distinct !DILexicalBlock(scope: !448, file: !3, line: 352, column: 8)
!544 = !DILocalVariable(name: "__d1", scope: !542, file: !3, line: 359, type: !40)
!545 = !DILocation(line: 158, column: 14, scope: !448)
!546 = !DILocation(line: 158, column: 27, scope: !448)
!547 = !DILocation(line: 159, column: 11, scope: !448)
!548 = !DILocation(line: 160, column: 5, scope: !448)
!549 = !DILocation(line: 161, column: 25, scope: !448)
!550 = !DILocation(line: 165, column: 5, scope: !448)
!551 = !DILocation(line: 166, column: 9, scope: !448)
!552 = !DILocation(line: 169, column: 5, scope: !448)
!553 = !DILocation(line: 170, column: 5, scope: !448)
!554 = !DILocation(line: 172, column: 5, scope: !448)
!555 = !DILocation(line: 174, column: 5, scope: !448)
!556 = !DILocation(line: 176, column: 9, scope: !448)
!557 = !DILocation(line: 179, column: 9, scope: !448)
!558 = !DILocation(line: 180, column: 9, scope: !448)
!559 = !DILocation(line: 191, column: 18, scope: !448)
!560 = !DILocation(line: 192, column: 13, scope: !448)
!561 = !DILocation(line: 0, scope: !448)
!562 = !DILocation(line: 196, column: 16, scope: !448)
!563 = !DILocation(line: 196, column: 5, scope: !448)
!564 = !DILocation(line: 197, column: 12, scope: !565)
!565 = distinct !DILexicalBlock(scope: !566, file: !3, line: 197, column: 12)
!566 = distinct !DILexicalBlock(scope: !448, file: !3, line: 196, column: 21)
!567 = !{!568, !568, i64 0}
!568 = !{!"any pointer", !425, i64 0}
!569 = !DILocation(line: 197, column: 23, scope: !565)
!570 = !DILocation(line: 197, column: 30, scope: !565)
!571 = !DILocation(line: 197, column: 33, scope: !565)
!572 = !DILocation(line: 197, column: 12, scope: !566)
!573 = !DILocation(line: 198, column: 26, scope: !565)
!574 = !DILocation(line: 198, column: 13, scope: !565)
!575 = !DILocation(line: 202, column: 21, scope: !576)
!576 = distinct !DILexicalBlock(scope: !577, file: !3, line: 202, column: 16)
!577 = distinct !DILexicalBlock(scope: !578, file: !3, line: 201, column: 57)
!578 = distinct !DILexicalBlock(scope: !579, file: !3, line: 201, column: 17)
!579 = distinct !DILexicalBlock(scope: !565, file: !3, line: 199, column: 17)
!580 = !DILocation(line: 202, column: 16, scope: !577)
!581 = !DILocation(line: 203, column: 17, scope: !582)
!582 = distinct !DILexicalBlock(scope: !576, file: !3, line: 202, column: 26)
!583 = !DILocation(line: 205, column: 17, scope: !577)
!584 = !DILocation(line: 206, column: 17, scope: !577)
!585 = !DILocation(line: 207, column: 29, scope: !577)
!586 = !DILocalVariable(name: "__nptr", arg: 1, scope: !587, file: !588, line: 239, type: !591)
!587 = distinct !DISubprogram(name: "atoi", scope: !588, file: !588, line: 239, type: !589, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !593)
!588 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!589 = !DISubroutineType(types: !590)
!590 = !{!40, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!593 = !{!586}
!594 = !DILocation(line: 239, column: 1, scope: !587, inlinedAt: !595)
!595 = distinct !DILocation(line: 207, column: 24, scope: !577)
!596 = !DILocation(line: 241, column: 16, scope: !587, inlinedAt: !595)
!597 = !DILocation(line: 241, column: 10, scope: !587, inlinedAt: !595)
!598 = !DILocation(line: 207, column: 24, scope: !577)
!599 = !DILocation(line: 207, column: 22, scope: !577)
!600 = !{!601, !601, i64 0}
!601 = !{!"short", !425, i64 0}
!602 = !DILocation(line: 208, column: 16, scope: !603)
!603 = distinct !DILexicalBlock(scope: !577, file: !3, line: 208, column: 16)
!604 = !DILocation(line: 208, column: 29, scope: !603)
!605 = !DILocation(line: 209, column: 21, scope: !606)
!606 = distinct !DILexicalBlock(scope: !603, file: !3, line: 208, column: 50)
!607 = !DILocation(line: 213, column: 21, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !3, line: 213, column: 16)
!609 = distinct !DILexicalBlock(scope: !610, file: !3, line: 212, column: 57)
!610 = distinct !DILexicalBlock(scope: !578, file: !3, line: 212, column: 17)
!611 = !DILocation(line: 213, column: 16, scope: !609)
!612 = !DILocation(line: 214, column: 17, scope: !613)
!613 = distinct !DILexicalBlock(scope: !608, file: !3, line: 213, column: 26)
!614 = !DILocation(line: 217, column: 17, scope: !609)
!615 = !DILocation(line: 218, column: 28, scope: !609)
!616 = !DILocation(line: 239, column: 1, scope: !587, inlinedAt: !617)
!617 = distinct !DILocation(line: 218, column: 23, scope: !609)
!618 = !DILocation(line: 241, column: 16, scope: !587, inlinedAt: !617)
!619 = !DILocation(line: 241, column: 10, scope: !587, inlinedAt: !617)
!620 = !DILocation(line: 218, column: 21, scope: !609)
!621 = !DILocation(line: 219, column: 24, scope: !622)
!622 = distinct !DILexicalBlock(scope: !609, file: !3, line: 219, column: 16)
!623 = !DILocation(line: 219, column: 16, scope: !609)
!624 = !DILocation(line: 220, column: 16, scope: !622)
!625 = !DILocation(line: 216, column: 17, scope: !609)
!626 = !DILocation(line: 221, column: 26, scope: !609)
!627 = !DILocation(line: 222, column: 13, scope: !609)
!628 = !DILocation(line: 226, column: 13, scope: !629)
!629 = distinct !DILexicalBlock(scope: !610, file: !3, line: 223, column: 18)
!630 = distinct !{!630, !563, !631}
!631 = !DILocation(line: 229, column: 9, scope: !448)
!632 = !DILocation(line: 232, column: 12, scope: !633)
!633 = distinct !DILexicalBlock(scope: !448, file: !3, line: 232, column: 8)
!634 = !DILocation(line: 232, column: 8, scope: !448)
!635 = !DILocation(line: 233, column: 9, scope: !633)
!636 = !DILocation(line: 234, column: 12, scope: !637)
!637 = distinct !DILexicalBlock(scope: !448, file: !3, line: 234, column: 8)
!638 = !DILocation(line: 234, column: 8, scope: !448)
!639 = !DILocation(line: 235, column: 26, scope: !637)
!640 = !DILocation(line: 235, column: 9, scope: !637)
!641 = !DILocation(line: 237, column: 18, scope: !642)
!642 = distinct !DILexicalBlock(scope: !448, file: !3, line: 237, column: 8)
!643 = !DILocation(line: 168, column: 16, scope: !448)
!644 = !DILocation(line: 237, column: 37, scope: !642)
!645 = !DILocation(line: 237, column: 8, scope: !448)
!646 = !DILocation(line: 238, column: 8, scope: !642)
!647 = !DILocation(line: 239, column: 19, scope: !648)
!648 = distinct !DILexicalBlock(scope: !448, file: !3, line: 239, column: 8)
!649 = !DILocation(line: 168, column: 25, scope: !448)
!650 = !DILocation(line: 239, column: 39, scope: !648)
!651 = !DILocation(line: 239, column: 8, scope: !448)
!652 = !DILocation(line: 240, column: 8, scope: !648)
!653 = !DILocation(line: 241, column: 19, scope: !654)
!654 = distinct !DILexicalBlock(scope: !448, file: !3, line: 241, column: 8)
!655 = !DILocation(line: 167, column: 16, scope: !448)
!656 = !DILocation(line: 241, column: 38, scope: !654)
!657 = !DILocation(line: 241, column: 8, scope: !448)
!658 = !DILocation(line: 242, column: 8, scope: !654)
!659 = !DILocation(line: 243, column: 26, scope: !660)
!660 = distinct !DILexicalBlock(scope: !448, file: !3, line: 243, column: 8)
!661 = !DILocation(line: 243, column: 18, scope: !660)
!662 = !DILocation(line: 243, column: 24, scope: !660)
!663 = !{!664, !568, i64 0}
!664 = !{!"", !568, i64 0, !601, i64 8, !601, i64 10}
!665 = !DILocation(line: 243, column: 44, scope: !660)
!666 = !DILocation(line: 243, column: 8, scope: !448)
!667 = !DILocation(line: 244, column: 8, scope: !660)
!668 = !DILocation(line: 247, column: 5, scope: !448)
!669 = !DILocation(line: 248, column: 13, scope: !448)
!670 = !DILocation(line: 248, column: 24, scope: !448)
!671 = !{!672, !601, i64 0}
!672 = !{!"sockaddr_in", !601, i64 0, !601, i64 2, !673, i64 4, !425, i64 8}
!673 = !{!"in_addr", !442, i64 0}
!674 = !DILocation(line: 253, column: 24, scope: !536)
!675 = !DILocation(line: 253, column: 24, scope: !676)
!676 = distinct !DILexicalBlock(scope: !536, file: !3, line: 253, column: 24)
!677 = !{i32 -2146737844}
!678 = !DILocation(line: 253, column: 13, scope: !448)
!679 = !DILocation(line: 253, column: 22, scope: !448)
!680 = !{!672, !601, i64 2}
!681 = !DILocation(line: 165, column: 9, scope: !448)
!682 = !DILocation(line: 254, column: 14, scope: !448)
!683 = !DILocation(line: 256, column: 35, scope: !684)
!684 = distinct !DILexicalBlock(scope: !448, file: !3, line: 256, column: 8)
!685 = !DILocation(line: 256, column: 26, scope: !684)
!686 = !DILocation(line: 256, column: 33, scope: !684)
!687 = !{!672, !442, i64 4}
!688 = !DILocation(line: 256, column: 62, scope: !684)
!689 = !DILocation(line: 256, column: 8, scope: !448)
!690 = !DILocation(line: 263, column: 13, scope: !691)
!691 = distinct !DILexicalBlock(scope: !684, file: !3, line: 256, column: 78)
!692 = !DILocation(line: 274, column: 17, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !3, line: 274, column: 12)
!694 = distinct !DILexicalBlock(scope: !684, file: !3, line: 272, column: 12)
!695 = !DILocation(line: 274, column: 47, scope: !693)
!696 = !DILocation(line: 274, column: 12, scope: !694)
!697 = !DILocation(line: 275, column: 13, scope: !693)
!698 = !DILocation(line: 279, column: 17, scope: !448)
!699 = !DILocation(line: 279, column: 10, scope: !448)
!700 = !DILocation(line: 282, column: 12, scope: !448)
!701 = !DILocation(line: 282, column: 15, scope: !448)
!702 = !{!703, !601, i64 0}
!703 = !{!"", !601, i64 0, !442, i64 4, !442, i64 8, !442, i64 12, !442, i64 16, !442, i64 20, !442, i64 24, !442, i64 28, !442, i64 32, !601, i64 36, !601, i64 38, !601, i64 40, !601, i64 42}
!704 = !DILocation(line: 283, column: 12, scope: !448)
!705 = !DILocation(line: 287, column: 19, scope: !448)
!706 = !DILocation(line: 287, column: 12, scope: !448)
!707 = !DILocation(line: 287, column: 15, scope: !448)
!708 = !DILocation(line: 284, column: 19, scope: !448)
!709 = !{!703, !442, i64 20}
!710 = !DILocation(line: 288, column: 12, scope: !448)
!711 = !DILocation(line: 288, column: 15, scope: !448)
!712 = !{!703, !442, i64 24}
!713 = !DILocation(line: 289, column: 12, scope: !448)
!714 = !DILocation(line: 289, column: 14, scope: !448)
!715 = !{!703, !442, i64 28}
!716 = !DILocation(line: 290, column: 12, scope: !448)
!717 = !DILocation(line: 290, column: 18, scope: !448)
!718 = !{!703, !442, i64 32}
!719 = !DILocation(line: 291, column: 12, scope: !448)
!720 = !DILocation(line: 291, column: 20, scope: !448)
!721 = !{!703, !601, i64 36}
!722 = !DILocation(line: 292, column: 12, scope: !448)
!723 = !DILocation(line: 292, column: 20, scope: !448)
!724 = !{!703, !601, i64 38}
!725 = !DILocation(line: 293, column: 12, scope: !448)
!726 = !DILocation(line: 293, column: 20, scope: !448)
!727 = !{!703, !601, i64 40}
!728 = !DILocation(line: 294, column: 12, scope: !448)
!729 = !DILocation(line: 294, column: 20, scope: !448)
!730 = !{!703, !601, i64 42}
!731 = !DILocation(line: 298, column: 14, scope: !448)
!732 = !DILocation(line: 298, column: 21, scope: !448)
!733 = !{!664, !601, i64 10}
!734 = !DILocation(line: 302, column: 12, scope: !448)
!735 = !DILocation(line: 182, column: 11, scope: !448)
!736 = !DILocation(line: 303, column: 13, scope: !737)
!737 = distinct !DILexicalBlock(scope: !448, file: !3, line: 303, column: 8)
!738 = !DILocation(line: 303, column: 8, scope: !448)
!739 = !DILocation(line: 304, column: 13, scope: !740)
!740 = distinct !DILexicalBlock(scope: !737, file: !3, line: 303, column: 19)
!741 = !DILocation(line: 305, column: 13, scope: !740)
!742 = !DILocation(line: 307, column: 8, scope: !540)
!743 = !DILocation(line: 307, column: 21, scope: !540)
!744 = !DILocation(line: 308, column: 13, scope: !539)
!745 = !DILocation(line: 311, column: 20, scope: !746)
!746 = distinct !DILexicalBlock(scope: !747, file: !3, line: 311, column: 20)
!747 = distinct !DILexicalBlock(scope: !748, file: !3, line: 310, column: 35)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 310, column: 9)
!749 = distinct !DILexicalBlock(scope: !539, file: !3, line: 310, column: 9)
!750 = !DILocation(line: 315, column: 28, scope: !747)
!751 = !DILocation(line: 316, column: 21, scope: !747)
!752 = !DILocation(line: 0, scope: !539)
!753 = !DILocation(line: 311, column: 32, scope: !746)
!754 = !DILocation(line: 310, column: 9, scope: !749)
!755 = distinct !{!755, !754, !756}
!756 = !DILocation(line: 317, column: 9, scope: !749)
!757 = !DILocation(line: 318, column: 18, scope: !758)
!758 = distinct !DILexicalBlock(scope: !539, file: !3, line: 318, column: 12)
!759 = !DILocation(line: 318, column: 12, scope: !539)
!760 = !DILocation(line: 319, column: 17, scope: !761)
!761 = distinct !DILexicalBlock(scope: !758, file: !3, line: 318, column: 26)
!762 = !DILocation(line: 320, column: 17, scope: !761)
!763 = !DILocation(line: 322, column: 15, scope: !539)
!764 = !DILocation(line: 325, column: 28, scope: !765)
!765 = distinct !DILexicalBlock(scope: !448, file: !3, line: 325, column: 8)
!766 = !DILocation(line: 323, column: 5, scope: !539)
!767 = !DILocation(line: 302, column: 10, scope: !448)
!768 = !DILocation(line: 325, column: 8, scope: !765)
!769 = !DILocation(line: 325, column: 40, scope: !765)
!770 = !DILocation(line: 325, column: 8, scope: !448)
!771 = !DILocation(line: 326, column: 9, scope: !765)
!772 = !DILocation(line: 330, column: 8, scope: !773)
!773 = distinct !DILexicalBlock(scope: !448, file: !3, line: 330, column: 8)
!774 = !DILocation(line: 330, column: 21, scope: !773)
!775 = !DILocation(line: 330, column: 8, scope: !448)
!776 = !DILocation(line: 331, column: 9, scope: !773)
!777 = !DILocation(line: 332, column: 8, scope: !778)
!778 = distinct !DILexicalBlock(scope: !448, file: !3, line: 332, column: 8)
!779 = !DILocation(line: 332, column: 16, scope: !778)
!780 = !DILocation(line: 332, column: 8, scope: !448)
!781 = !DILocation(line: 333, column: 9, scope: !778)
!782 = !DILocation(line: 335, column: 9, scope: !778)
!783 = !DILocation(line: 339, column: 13, scope: !448)
!784 = !DILocation(line: 171, column: 9, scope: !448)
!785 = !DILocation(line: 340, column: 14, scope: !786)
!786 = distinct !DILexicalBlock(scope: !448, file: !3, line: 340, column: 8)
!787 = !DILocation(line: 340, column: 8, scope: !448)
!788 = !DILocation(line: 341, column: 9, scope: !786)
!789 = !DILocation(line: 342, column: 14, scope: !448)
!790 = !DILocation(line: 344, column: 24, scope: !791)
!791 = distinct !DILexicalBlock(scope: !448, file: !3, line: 344, column: 8)
!792 = !{!664, !601, i64 8}
!793 = !DILocation(line: 169, column: 14, scope: !448)
!794 = !DILocation(line: 349, column: 5, scope: !448)
!795 = !DILocation(line: 170, column: 16, scope: !448)
!796 = !DILocation(line: 350, column: 5, scope: !448)
!797 = !DILocation(line: 352, column: 5, scope: !448)
!798 = !DILocation(line: 354, column: 30, scope: !799)
!799 = distinct !DILexicalBlock(scope: !543, file: !3, line: 354, column: 12)
!800 = !{!801, !568, i64 0}
!801 = !{!"", !568, i64 0, !442, i64 8, !442, i64 12, !442, i64 16, !442, i64 20, !442, i64 24}
!802 = !DILocation(line: 354, column: 46, scope: !799)
!803 = !{!801, !442, i64 12}
!804 = !DILocation(line: 354, column: 37, scope: !799)
!805 = !DILocation(line: 355, column: 39, scope: !799)
!806 = !DILocation(line: 354, column: 12, scope: !799)
!807 = !DILocation(line: 355, column: 49, scope: !799)
!808 = !DILocation(line: 354, column: 12, scope: !543)
!809 = !DILocation(line: 356, column: 12, scope: !799)
!810 = !DILocation(line: 359, column: 9, scope: !542)
!811 = !{i32 -2146737256}
!812 = !DILocation(line: 360, column: 9, scope: !543)
!813 = !{!814, !814, i64 0}
!814 = !{!"long", !425, i64 0}
!815 = !DILocation(line: 173, column: 9, scope: !448)
!816 = !DILocation(line: 362, column: 21, scope: !543)
!817 = !DILocation(line: 362, column: 19, scope: !543)
!818 = !{!819, !814, i64 0}
!819 = !{!"timeval", !814, i64 0, !814, i64 8}
!820 = !DILocation(line: 363, column: 20, scope: !543)
!821 = !{!819, !814, i64 8}
!822 = !DILocation(line: 172, column: 12, scope: !448)
!823 = !DILocation(line: 174, column: 20, scope: !448)
!824 = !DILocation(line: 364, column: 13, scope: !543)
!825 = !DILocation(line: 175, column: 9, scope: !448)
!826 = !DILocation(line: 365, column: 12, scope: !543)
!827 = !DILocation(line: 366, column: 13, scope: !828)
!828 = distinct !DILexicalBlock(scope: !543, file: !3, line: 365, column: 12)
!829 = !DILocation(line: 368, column: 13, scope: !830)
!830 = distinct !DILexicalBlock(scope: !543, file: !3, line: 367, column: 12)
!831 = !DILocation(line: 369, column: 40, scope: !832)
!832 = distinct !DILexicalBlock(scope: !543, file: !3, line: 369, column: 12)
!833 = !DILocation(line: 369, column: 55, scope: !832)
!834 = !{!801, !442, i64 16}
!835 = !DILocation(line: 369, column: 47, scope: !832)
!836 = !DILocation(line: 369, column: 21, scope: !832)
!837 = !DILocation(line: 171, column: 15, scope: !448)
!838 = !DILocation(line: 371, column: 50, scope: !832)
!839 = !DILocation(line: 369, column: 12, scope: !543)
!840 = !DILocation(line: 372, column: 13, scope: !832)
!841 = !DILocation(line: 374, column: 28, scope: !543)
!842 = !DILocation(line: 377, column: 18, scope: !843)
!843 = distinct !DILexicalBlock(scope: !543, file: !3, line: 377, column: 12)
!844 = !DILocation(line: 377, column: 12, scope: !543)
!845 = !DILocation(line: 378, column: 28, scope: !846)
!846 = distinct !DILexicalBlock(scope: !843, file: !3, line: 377, column: 23)
!847 = !DILocation(line: 378, column: 18, scope: !846)
!848 = !DILocation(line: 378, column: 36, scope: !846)
!849 = !DILocation(line: 378, column: 61, scope: !846)
!850 = !DILocation(line: 378, column: 44, scope: !846)
!851 = !DILocation(line: 378, column: 42, scope: !846)
!852 = !DILocation(line: 178, column: 9, scope: !448)
!853 = !DILocation(line: 387, column: 30, scope: !448)
!854 = !DILocation(line: 387, column: 23, scope: !448)
!855 = !DILocation(line: 379, column: 12, scope: !846)
!856 = !DILocation(line: 381, column: 24, scope: !857)
!857 = distinct !DILexicalBlock(scope: !843, file: !3, line: 380, column: 14)
!858 = !DILocation(line: 381, column: 17, scope: !857)
!859 = !DILocation(line: 381, column: 27, scope: !857)
!860 = !DILocation(line: 0, scope: !843)
!861 = !DILocation(line: 384, column: 17, scope: !543)
!862 = !DILocation(line: 387, column: 20, scope: !448)
!863 = !DILocation(line: 387, column: 33, scope: !448)
!864 = !DILocation(line: 387, column: 9, scope: !543)
!865 = distinct !{!865, !797, !866}
!866 = !DILocation(line: 387, column: 48, scope: !448)
!867 = !DILocation(line: 389, column: 5, scope: !448)
!868 = !DILocation(line: 390, column: 5, scope: !448)
!869 = !DILocation(line: 398, column: 8, scope: !870)
!870 = distinct !DILexicalBlock(scope: !448, file: !3, line: 398, column: 8)
!871 = !DILocation(line: 398, column: 21, scope: !870)
!872 = !DILocation(line: 398, column: 8, scope: !448)
!873 = !DILocation(line: 399, column: 9, scope: !870)
!874 = !DILocation(line: 401, column: 49, scope: !870)
!875 = !DILocation(line: 401, column: 9, scope: !870)
!876 = !DILocation(line: 404, column: 5, scope: !448)
!877 = !DILocation(line: 403, column: 5, scope: !448)
!878 = !DILocation(line: 314, column: 28, scope: !747)
!879 = !DILocation(line: 315, column: 37, scope: !747)
!880 = distinct !DISubprogram(name: "verbose_output", scope: !3, file: !3, line: 411, type: !881, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !883)
!881 = !DISubroutineType(types: !882)
!882 = !{!40, !474}
!883 = !{!884, !885, !886, !887, !888, !889}
!884 = !DILocalVariable(name: "uindata", arg: 1, scope: !880, file: !3, line: 411, type: !474)
!885 = !DILocalVariable(name: "place", scope: !880, file: !3, line: 413, type: !40)
!886 = !DILocalVariable(name: "counter", scope: !880, file: !3, line: 413, type: !40)
!887 = !DILocalVariable(name: "count", scope: !880, file: !3, line: 413, type: !40)
!888 = !DILocalVariable(name: "question", scope: !880, file: !3, line: 414, type: !506)
!889 = !DILocalVariable(name: "header", scope: !880, file: !3, line: 415, type: !488)
!890 = !DILocation(line: 411, column: 31, scope: !880)
!891 = !DILocation(line: 413, column: 5, scope: !880)
!892 = !DILocation(line: 414, column: 5, scope: !880)
!893 = !DILocation(line: 415, column: 5, scope: !880)
!894 = !DILocation(line: 418, column: 26, scope: !895)
!895 = distinct !DILexicalBlock(scope: !880, file: !3, line: 418, column: 8)
!896 = !DILocation(line: 418, column: 18, scope: !895)
!897 = !DILocation(line: 418, column: 24, scope: !895)
!898 = !DILocation(line: 418, column: 44, scope: !895)
!899 = !DILocation(line: 418, column: 8, scope: !880)
!900 = !DILocation(line: 419, column: 8, scope: !895)
!901 = !DILocation(line: 415, column: 14, scope: !880)
!902 = !DILocation(line: 422, column: 8, scope: !903)
!903 = distinct !DILexicalBlock(scope: !880, file: !3, line: 422, column: 8)
!904 = !DILocation(line: 422, column: 34, scope: !903)
!905 = !DILocation(line: 422, column: 8, scope: !880)
!906 = !DILocation(line: 423, column: 9, scope: !903)
!907 = !DILocation(line: 425, column: 5, scope: !880)
!908 = !DILocation(line: 426, column: 39, scope: !880)
!909 = !DILocation(line: 426, column: 32, scope: !880)
!910 = !DILocation(line: 426, column: 5, scope: !880)
!911 = !DILocation(line: 427, column: 41, scope: !880)
!912 = !{!703, !442, i64 4}
!913 = !DILocation(line: 427, column: 5, scope: !880)
!914 = !DILocation(line: 428, column: 37, scope: !880)
!915 = !{!703, !442, i64 8}
!916 = !DILocation(line: 428, column: 5, scope: !880)
!917 = !DILocation(line: 429, column: 44, scope: !880)
!918 = !{!703, !442, i64 12}
!919 = !DILocation(line: 429, column: 5, scope: !880)
!920 = !DILocation(line: 430, column: 40, scope: !880)
!921 = !{!703, !442, i64 16}
!922 = !DILocation(line: 430, column: 5, scope: !880)
!923 = !DILocation(line: 431, column: 33, scope: !880)
!924 = !DILocation(line: 431, column: 5, scope: !880)
!925 = !DILocation(line: 432, column: 33, scope: !880)
!926 = !DILocation(line: 432, column: 5, scope: !880)
!927 = !DILocation(line: 433, column: 37, scope: !880)
!928 = !DILocation(line: 433, column: 5, scope: !880)
!929 = !DILocation(line: 434, column: 33, scope: !880)
!930 = !DILocation(line: 434, column: 5, scope: !880)
!931 = !DILocation(line: 435, column: 38, scope: !880)
!932 = !DILocation(line: 435, column: 31, scope: !880)
!933 = !DILocation(line: 435, column: 5, scope: !880)
!934 = !DILocation(line: 436, column: 38, scope: !880)
!935 = !DILocation(line: 436, column: 31, scope: !880)
!936 = !DILocation(line: 436, column: 5, scope: !880)
!937 = !DILocation(line: 437, column: 38, scope: !880)
!938 = !DILocation(line: 437, column: 31, scope: !880)
!939 = !DILocation(line: 437, column: 5, scope: !880)
!940 = !DILocation(line: 438, column: 38, scope: !880)
!941 = !DILocation(line: 438, column: 31, scope: !880)
!942 = !DILocation(line: 438, column: 5, scope: !880)
!943 = !DILocation(line: 439, column: 5, scope: !880)
!944 = !DILocation(line: 413, column: 9, scope: !880)
!945 = !DILocation(line: 442, column: 11, scope: !880)
!946 = !DILocation(line: 413, column: 15, scope: !880)
!947 = !DILocation(line: 443, column: 38, scope: !948)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 443, column: 5)
!949 = distinct !DILexicalBlock(scope: !880, file: !3, line: 443, column: 5)
!950 = !DILocation(line: 443, column: 29, scope: !948)
!951 = !DILocation(line: 443, column: 5, scope: !949)
!952 = !DILocation(line: 414, column: 16, scope: !880)
!953 = !DILocation(line: 444, column: 17, scope: !954)
!954 = distinct !DILexicalBlock(scope: !948, file: !3, line: 443, column: 57)
!955 = !DILocation(line: 413, column: 23, scope: !880)
!956 = !DILocation(line: 445, column: 18, scope: !957)
!957 = distinct !DILexicalBlock(scope: !954, file: !3, line: 445, column: 12)
!958 = !DILocation(line: 445, column: 12, scope: !954)
!959 = !DILocation(line: 446, column: 13, scope: !957)
!960 = !DILocation(line: 447, column: 15, scope: !954)
!961 = !DILocation(line: 448, column: 9, scope: !954)
!962 = !DILocation(line: 449, column: 34, scope: !954)
!963 = !DILocation(line: 449, column: 49, scope: !954)
!964 = !DILocation(line: 449, column: 40, scope: !954)
!965 = !DILocation(line: 449, column: 9, scope: !954)
!966 = !DILocation(line: 450, column: 32, scope: !954)
!967 = !DILocalVariable(name: "js", arg: 1, scope: !968, file: !3, line: 68, type: !474)
!968 = distinct !DISubprogram(name: "escape_stdout", scope: !3, file: !3, line: 68, type: !881, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !969)
!969 = !{!967, !970, !971}
!970 = !DILocalVariable(name: "counter", scope: !968, file: !3, line: 69, type: !40)
!971 = !DILocalVariable(name: "this", scope: !968, file: !3, line: 70, type: !93)
!972 = !DILocation(line: 68, column: 30, scope: !968, inlinedAt: !973)
!973 = distinct !DILocation(line: 450, column: 9, scope: !954)
!974 = !DILocation(line: 69, column: 9, scope: !968, inlinedAt: !973)
!975 = !DILocation(line: 73, column: 8, scope: !976, inlinedAt: !973)
!976 = distinct !DILexicalBlock(scope: !968, file: !3, line: 73, column: 8)
!977 = !DILocation(line: 73, column: 26, scope: !976, inlinedAt: !973)
!978 = !DILocation(line: 73, column: 8, scope: !968, inlinedAt: !973)
!979 = !DILocation(line: 75, column: 12, scope: !980, inlinedAt: !973)
!980 = distinct !DILexicalBlock(scope: !968, file: !3, line: 75, column: 8)
!981 = !{!801, !442, i64 8}
!982 = !DILocation(line: 75, column: 22, scope: !980, inlinedAt: !973)
!983 = !DILocation(line: 75, column: 8, scope: !968, inlinedAt: !973)
!984 = !DILocation(line: 78, column: 25, scope: !968, inlinedAt: !973)
!985 = !DILocation(line: 78, column: 19, scope: !968, inlinedAt: !973)
!986 = !DILocation(line: 78, column: 5, scope: !968, inlinedAt: !973)
!987 = !DILocation(line: 79, column: 22, scope: !988, inlinedAt: !973)
!988 = distinct !DILexicalBlock(scope: !968, file: !3, line: 78, column: 37)
!989 = !DILocation(line: 79, column: 29, scope: !988, inlinedAt: !973)
!990 = !DILocation(line: 79, column: 16, scope: !988, inlinedAt: !973)
!991 = !DILocation(line: 70, column: 19, scope: !968, inlinedAt: !973)
!992 = !DILocation(line: 80, column: 12, scope: !993, inlinedAt: !973)
!993 = distinct !DILexicalBlock(scope: !988, file: !3, line: 80, column: 12)
!994 = !DILocation(line: 80, column: 22, scope: !993, inlinedAt: !973)
!995 = !DILocation(line: 81, column: 13, scope: !993, inlinedAt: !973)
!996 = !DILocation(line: 82, column: 22, scope: !997, inlinedAt: !973)
!997 = distinct !DILexicalBlock(scope: !993, file: !3, line: 82, column: 17)
!998 = !DILocation(line: 82, column: 17, scope: !993, inlinedAt: !973)
!999 = !DILocation(line: 83, column: 13, scope: !997, inlinedAt: !973)
!1000 = !DILocation(line: 85, column: 13, scope: !997, inlinedAt: !973)
!1001 = !DILocation(line: 86, column: 16, scope: !988, inlinedAt: !973)
!1002 = distinct !{!1002, !1003, !1004}
!1003 = !DILocation(line: 78, column: 5, scope: !968)
!1004 = !DILocation(line: 87, column: 9, scope: !968)
!1005 = !DILocation(line: 451, column: 54, scope: !954)
!1006 = !DILocation(line: 451, column: 45, scope: !954)
!1007 = !DILocation(line: 451, column: 9, scope: !954)
!1008 = !DILocation(line: 452, column: 43, scope: !954)
!1009 = !DILocation(line: 452, column: 34, scope: !954)
!1010 = !DILocation(line: 452, column: 9, scope: !954)
!1011 = !DILocation(line: 443, column: 53, scope: !948)
!1012 = !DILocation(line: 443, column: 31, scope: !948)
!1013 = distinct !{!1013, !951, !1014}
!1014 = !DILocation(line: 453, column: 9, scope: !949)
!1015 = !DILocation(line: 457, column: 5, scope: !880)
!1016 = !DILocation(line: 458, column: 39, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 458, column: 5)
!1018 = distinct !DILexicalBlock(scope: !880, file: !3, line: 458, column: 5)
!1019 = !DILocation(line: 458, column: 30, scope: !1017)
!1020 = !DILocation(line: 458, column: 5, scope: !1018)
!1021 = !DILocation(line: 459, column: 9, scope: !1017)
!1022 = !DILocation(line: 458, column: 55, scope: !1017)
!1023 = !DILocation(line: 458, column: 32, scope: !1017)
!1024 = distinct !{!1024, !1020, !1025}
!1025 = !DILocation(line: 459, column: 34, scope: !1018)
!1026 = !DILocation(line: 462, column: 5, scope: !880)
!1027 = !DILocation(line: 463, column: 39, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 463, column: 5)
!1029 = distinct !DILexicalBlock(scope: !880, file: !3, line: 463, column: 5)
!1030 = !DILocation(line: 463, column: 30, scope: !1028)
!1031 = !DILocation(line: 463, column: 5, scope: !1029)
!1032 = !DILocation(line: 464, column: 9, scope: !1028)
!1033 = !DILocation(line: 463, column: 55, scope: !1028)
!1034 = !DILocation(line: 463, column: 32, scope: !1028)
!1035 = distinct !{!1035, !1031, !1036}
!1036 = !DILocation(line: 464, column: 34, scope: !1029)
!1037 = !DILocation(line: 467, column: 5, scope: !880)
!1038 = !DILocation(line: 468, column: 39, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 468, column: 5)
!1040 = distinct !DILexicalBlock(scope: !880, file: !3, line: 468, column: 5)
!1041 = !DILocation(line: 468, column: 30, scope: !1039)
!1042 = !DILocation(line: 468, column: 5, scope: !1040)
!1043 = !DILocation(line: 469, column: 9, scope: !1039)
!1044 = !DILocation(line: 468, column: 55, scope: !1039)
!1045 = !DILocation(line: 468, column: 32, scope: !1039)
!1046 = distinct !{!1046, !1042, !1047}
!1047 = !DILocation(line: 469, column: 34, scope: !1040)
!1048 = !DILocation(line: 472, column: 5, scope: !880)
!1049 = !DILocation(line: 471, column: 5, scope: !880)
!1050 = distinct !DISubprogram(name: "csv2_compatible_output", scope: !3, file: !3, line: 575, type: !1051, scopeLine: 575, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!40, !474, !474}
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1054 = !DILocalVariable(name: "uindata", arg: 1, scope: !1050, file: !3, line: 575, type: !474)
!1055 = !DILocalVariable(name: "query", arg: 2, scope: !1050, file: !3, line: 575, type: !474)
!1056 = !DILocalVariable(name: "place", scope: !1050, file: !3, line: 577, type: !40)
!1057 = !DILocalVariable(name: "counter", scope: !1050, file: !3, line: 577, type: !40)
!1058 = !DILocalVariable(name: "count", scope: !1050, file: !3, line: 577, type: !40)
!1059 = !DILocalVariable(name: "question", scope: !1050, file: !3, line: 578, type: !506)
!1060 = !DILocalVariable(name: "header", scope: !1050, file: !3, line: 579, type: !488)
!1061 = !DILocation(line: 575, column: 39, scope: !1050)
!1062 = !DILocation(line: 575, column: 59, scope: !1050)
!1063 = !DILocation(line: 577, column: 5, scope: !1050)
!1064 = !DILocation(line: 578, column: 5, scope: !1050)
!1065 = !DILocation(line: 579, column: 5, scope: !1050)
!1066 = !DILocation(line: 582, column: 26, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 582, column: 8)
!1068 = !DILocation(line: 582, column: 18, scope: !1067)
!1069 = !DILocation(line: 582, column: 24, scope: !1067)
!1070 = !DILocation(line: 582, column: 44, scope: !1067)
!1071 = !DILocation(line: 582, column: 8, scope: !1050)
!1072 = !DILocation(line: 583, column: 8, scope: !1067)
!1073 = !DILocation(line: 579, column: 14, scope: !1050)
!1074 = !DILocation(line: 586, column: 8, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 586, column: 8)
!1076 = !DILocation(line: 586, column: 34, scope: !1075)
!1077 = !DILocation(line: 586, column: 8, scope: !1050)
!1078 = !DILocation(line: 587, column: 9, scope: !1075)
!1079 = !DILocation(line: 589, column: 15, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 589, column: 8)
!1081 = !DILocation(line: 589, column: 18, scope: !1080)
!1082 = !DILocation(line: 589, column: 8, scope: !1050)
!1083 = !DILocation(line: 590, column: 9, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 589, column: 24)
!1085 = !DILocation(line: 591, column: 5, scope: !1084)
!1086 = !DILocation(line: 594, column: 19, scope: !1050)
!1087 = !DILocation(line: 594, column: 5, scope: !1050)
!1088 = !DILocation(line: 596, column: 17, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 594, column: 26)
!1090 = !DILocation(line: 597, column: 17, scope: !1089)
!1091 = !DILocation(line: 599, column: 17, scope: !1089)
!1092 = !DILocation(line: 600, column: 17, scope: !1089)
!1093 = !DILocation(line: 602, column: 17, scope: !1089)
!1094 = !DILocation(line: 603, column: 17, scope: !1089)
!1095 = !DILocation(line: 605, column: 17, scope: !1089)
!1096 = !DILocation(line: 606, column: 17, scope: !1089)
!1097 = !DILocation(line: 608, column: 17, scope: !1089)
!1098 = !DILocation(line: 609, column: 17, scope: !1089)
!1099 = !DILocation(line: 613, column: 17, scope: !1089)
!1100 = !DILocation(line: 615, column: 9, scope: !1089)
!1101 = !DILocation(line: 577, column: 9, scope: !1050)
!1102 = !DILocation(line: 618, column: 11, scope: !1050)
!1103 = !DILocation(line: 577, column: 15, scope: !1050)
!1104 = !DILocation(line: 619, column: 38, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 619, column: 5)
!1106 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 619, column: 5)
!1107 = !DILocation(line: 619, column: 29, scope: !1105)
!1108 = !DILocation(line: 619, column: 5, scope: !1106)
!1109 = !DILocation(line: 628, column: 15, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 619, column: 57)
!1111 = !DILocation(line: 634, column: 39, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 634, column: 5)
!1113 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 634, column: 5)
!1114 = !DILocation(line: 634, column: 30, scope: !1112)
!1115 = !DILocation(line: 634, column: 5, scope: !1113)
!1116 = !DILocation(line: 578, column: 16, scope: !1050)
!1117 = !DILocation(line: 620, column: 17, scope: !1110)
!1118 = !DILocation(line: 577, column: 23, scope: !1050)
!1119 = !DILocation(line: 621, column: 18, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 621, column: 12)
!1121 = !DILocation(line: 621, column: 12, scope: !1110)
!1122 = !DILocation(line: 622, column: 13, scope: !1120)
!1123 = !DILocation(line: 623, column: 9, scope: !1110)
!1124 = !DILocation(line: 624, column: 37, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 624, column: 12)
!1126 = !DILocation(line: 624, column: 52, scope: !1125)
!1127 = !DILocation(line: 624, column: 43, scope: !1125)
!1128 = !DILocation(line: 624, column: 12, scope: !1125)
!1129 = !DILocation(line: 624, column: 59, scope: !1125)
!1130 = !DILocation(line: 624, column: 12, scope: !1110)
!1131 = !DILocation(line: 625, column: 13, scope: !1125)
!1132 = !DILocation(line: 626, column: 34, scope: !1110)
!1133 = !DILocation(line: 626, column: 9, scope: !1110)
!1134 = !DILocation(line: 627, column: 9, scope: !1110)
!1135 = !DILocation(line: 619, column: 53, scope: !1105)
!1136 = !DILocation(line: 619, column: 31, scope: !1105)
!1137 = distinct !{!1137, !1108, !1138}
!1138 = !DILocation(line: 629, column: 9, scope: !1106)
!1139 = !DILocation(line: 635, column: 9, scope: !1112)
!1140 = !DILocation(line: 634, column: 55, scope: !1112)
!1141 = !DILocation(line: 634, column: 32, scope: !1112)
!1142 = distinct !{!1142, !1115, !1143}
!1143 = !DILocation(line: 635, column: 41, scope: !1113)
!1144 = !DILocation(line: 638, column: 5, scope: !1050)
!1145 = !DILocation(line: 639, column: 39, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 639, column: 5)
!1147 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 639, column: 5)
!1148 = !DILocation(line: 639, column: 30, scope: !1146)
!1149 = !DILocation(line: 639, column: 5, scope: !1147)
!1150 = !DILocation(line: 640, column: 9, scope: !1146)
!1151 = !DILocation(line: 639, column: 55, scope: !1146)
!1152 = !DILocation(line: 639, column: 32, scope: !1146)
!1153 = distinct !{!1153, !1149, !1154}
!1154 = !DILocation(line: 640, column: 41, scope: !1147)
!1155 = !DILocation(line: 643, column: 5, scope: !1050)
!1156 = !DILocation(line: 644, column: 39, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 644, column: 5)
!1158 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 644, column: 5)
!1159 = !DILocation(line: 644, column: 30, scope: !1157)
!1160 = !DILocation(line: 644, column: 5, scope: !1158)
!1161 = !DILocation(line: 645, column: 9, scope: !1157)
!1162 = !DILocation(line: 644, column: 55, scope: !1157)
!1163 = !DILocation(line: 644, column: 32, scope: !1157)
!1164 = distinct !{!1164, !1160, !1165}
!1165 = !DILocation(line: 645, column: 41, scope: !1158)
!1166 = !DILocation(line: 648, column: 5, scope: !1050)
!1167 = !DILocation(line: 647, column: 5, scope: !1050)
!1168 = distinct !DISubprogram(name: "csv2_answer", scope: !3, file: !3, line: 658, type: !1169, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1171)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!40, !474, !200, !474}
!1171 = !{!1172, !1173, !1174, !1175, !1185, !1198, !1206, !1207, !1208, !1209, !1210, !1211, !1218, !1220, !1221, !1223, !1224, !1226, !1227, !1229, !1230, !1232, !1233, !1235, !1236, !1238, !1239, !1241, !1242, !1245, !1246}
!1172 = !DILocalVariable(name: "uindata", arg: 1, scope: !1168, file: !3, line: 658, type: !474)
!1173 = !DILocalVariable(name: "place", arg: 2, scope: !1168, file: !3, line: 658, type: !200)
!1174 = !DILocalVariable(name: "query", arg: 3, scope: !1168, file: !3, line: 658, type: !474)
!1175 = !DILocalVariable(name: "rr_hdr", scope: !1168, file: !3, line: 660, type: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "q_rr", file: !489, line: 270, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 263, size: 256, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1177, file: !489, line: 264, baseType: !474, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !489, line: 265, baseType: !338, size: 16, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1177, file: !489, line: 266, baseType: !338, size: 16, offset: 80)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !1177, file: !489, line: 267, baseType: !24, size: 32, offset: 96)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rdlength", scope: !1177, file: !489, line: 268, baseType: !338, size: 16, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "rdata", scope: !1177, file: !489, line: 269, baseType: !474, size: 64, offset: 192)
!1185 = !DILocalVariable(name: "soa", scope: !1168, file: !3, line: 661, type: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "rr_soa", file: !489, line: 421, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 409, size: 320, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1195, !1196, !1197}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "mname", scope: !1187, file: !489, line: 410, baseType: !474, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "rname", scope: !1187, file: !489, line: 411, baseType: !474, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1187, file: !489, line: 412, baseType: !24, size: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !1187, file: !489, line: 413, baseType: !1193, size: 32, offset: 160)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1194, line: 196, baseType: !40)
!1194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1187, file: !489, line: 415, baseType: !1193, size: 32, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !1187, file: !489, line: 417, baseType: !1193, size: 32, offset: 224)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !1187, file: !489, line: 420, baseType: !24, size: 32, offset: 256)
!1198 = !DILocalVariable(name: "mx", scope: !1168, file: !3, line: 662, type: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "rr_mx", file: !489, line: 429, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 424, size: 128, elements: !1201)
!1201 = !{!1202, !1205}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "preference", scope: !1200, file: !489, line: 425, baseType: !1203, size: 16)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1194, line: 195, baseType: !1204)
!1204 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "exchange", scope: !1200, file: !489, line: 427, baseType: !474, size: 64, offset: 64)
!1206 = !DILocalVariable(name: "count", scope: !1168, file: !3, line: 663, type: !40)
!1207 = !DILocalVariable(name: "lower1", scope: !1168, file: !3, line: 664, type: !474)
!1208 = !DILocalVariable(name: "lower2", scope: !1168, file: !3, line: 664, type: !474)
!1209 = !DILocalVariable(name: "t", scope: !1168, file: !3, line: 665, type: !474)
!1210 = !DILocalVariable(name: "rtype", scope: !1168, file: !3, line: 666, type: !40)
!1211 = !DILocalVariable(name: "p", scope: !1212, file: !3, line: 768, type: !46)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 767, column: 37)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !3, line: 767, column: 13)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 757, column: 13)
!1215 = distinct !DILexicalBlock(scope: !1216, file: !3, line: 738, column: 13)
!1216 = distinct !DILexicalBlock(scope: !1217, file: !3, line: 726, column: 13)
!1217 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 711, column: 8)
!1218 = !DILocalVariable(name: "__v", scope: !1219, file: !3, line: 774, type: !21)
!1219 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 774, column: 20)
!1220 = !DILocalVariable(name: "__x", scope: !1219, file: !3, line: 774, type: !21)
!1221 = !DILocalVariable(name: "__v", scope: !1222, file: !3, line: 775, type: !21)
!1222 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 775, column: 20)
!1223 = !DILocalVariable(name: "__x", scope: !1222, file: !3, line: 775, type: !21)
!1224 = !DILocalVariable(name: "__v", scope: !1225, file: !3, line: 776, type: !21)
!1225 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 776, column: 20)
!1226 = !DILocalVariable(name: "__x", scope: !1225, file: !3, line: 776, type: !21)
!1227 = !DILocalVariable(name: "__v", scope: !1228, file: !3, line: 777, type: !21)
!1228 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 777, column: 20)
!1229 = !DILocalVariable(name: "__x", scope: !1228, file: !3, line: 777, type: !21)
!1230 = !DILocalVariable(name: "__v", scope: !1231, file: !3, line: 778, type: !21)
!1231 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 778, column: 20)
!1232 = !DILocalVariable(name: "__x", scope: !1231, file: !3, line: 778, type: !21)
!1233 = !DILocalVariable(name: "__v", scope: !1234, file: !3, line: 779, type: !21)
!1234 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 779, column: 20)
!1235 = !DILocalVariable(name: "__x", scope: !1234, file: !3, line: 779, type: !21)
!1236 = !DILocalVariable(name: "__v", scope: !1237, file: !3, line: 780, type: !21)
!1237 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 780, column: 20)
!1238 = !DILocalVariable(name: "__x", scope: !1237, file: !3, line: 780, type: !21)
!1239 = !DILocalVariable(name: "__v", scope: !1240, file: !3, line: 781, type: !21)
!1240 = distinct !DILexicalBlock(scope: !1212, file: !3, line: 781, column: 20)
!1241 = !DILocalVariable(name: "__x", scope: !1240, file: !3, line: 781, type: !21)
!1242 = !DILocalVariable(name: "len", scope: !1243, file: !3, line: 784, type: !40)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !3, line: 783, column: 36)
!1244 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 783, column: 13)
!1245 = !DILocalVariable(name: "p", scope: !1243, file: !3, line: 784, type: !40)
!1246 = !DILocalVariable(name: "q", scope: !1247, file: !3, line: 790, type: !40)
!1247 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 789, column: 24)
!1248 = !DILocation(line: 658, column: 28, scope: !1168)
!1249 = !DILocation(line: 658, column: 42, scope: !1168)
!1250 = !DILocation(line: 658, column: 60, scope: !1168)
!1251 = !DILocation(line: 660, column: 5, scope: !1168)
!1252 = !DILocation(line: 661, column: 5, scope: !1168)
!1253 = !DILocation(line: 669, column: 23, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 669, column: 8)
!1255 = !DILocation(line: 669, column: 16, scope: !1254)
!1256 = !DILocation(line: 669, column: 21, scope: !1254)
!1257 = !{!1258, !568, i64 0}
!1258 = !{!"", !568, i64 0, !601, i64 8, !601, i64 10, !442, i64 12, !601, i64 16, !568, i64 24}
!1259 = !DILocation(line: 669, column: 41, scope: !1254)
!1260 = !DILocation(line: 669, column: 8, scope: !1168)
!1261 = !DILocation(line: 670, column: 8, scope: !1254)
!1262 = !DILocation(line: 671, column: 21, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 671, column: 8)
!1264 = !DILocation(line: 671, column: 13, scope: !1263)
!1265 = !DILocation(line: 671, column: 19, scope: !1263)
!1266 = !{!1267, !568, i64 0}
!1267 = !{!"", !568, i64 0, !568, i64 8, !442, i64 16, !442, i64 20, !442, i64 24, !442, i64 28, !442, i64 32}
!1268 = !DILocation(line: 671, column: 39, scope: !1263)
!1269 = !DILocation(line: 671, column: 8, scope: !1168)
!1270 = !DILocation(line: 672, column: 8, scope: !1263)
!1271 = !DILocation(line: 673, column: 21, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 673, column: 8)
!1273 = !DILocation(line: 673, column: 13, scope: !1272)
!1274 = !DILocation(line: 673, column: 19, scope: !1272)
!1275 = !{!1267, !568, i64 8}
!1276 = !DILocation(line: 673, column: 39, scope: !1272)
!1277 = !DILocation(line: 673, column: 8, scope: !1168)
!1278 = !DILocation(line: 674, column: 8, scope: !1272)
!1279 = !DILocation(line: 675, column: 23, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 675, column: 8)
!1281 = !DILocation(line: 662, column: 11, scope: !1168)
!1282 = !DILocation(line: 675, column: 41, scope: !1280)
!1283 = !DILocation(line: 675, column: 8, scope: !1168)
!1284 = !DILocation(line: 676, column: 8, scope: !1280)
!1285 = !DILocation(line: 677, column: 18, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 677, column: 8)
!1287 = !DILocation(line: 664, column: 16, scope: !1168)
!1288 = !DILocation(line: 677, column: 36, scope: !1286)
!1289 = !DILocation(line: 677, column: 8, scope: !1168)
!1290 = !DILocation(line: 678, column: 8, scope: !1286)
!1291 = !DILocation(line: 679, column: 18, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 679, column: 8)
