; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.anon.1.39 = type { [20 x i8], i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.event_name_t = type { i32, [40 x i8] }
%struct.libvlc_instance_t = type { %struct.libvlc_int_t*, %struct.libvlc_vlm_t, i32, i32, %union.pthread_mutex_t, %struct.libvlc_callback_entry_list_t* }
%struct.libvlc_int_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.hotkey* }
%struct.vlc_object_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t* }
%struct.hotkey = type opaque
%struct.libvlc_vlm_t = type { %struct.vlm_t*, %struct.libvlc_event_manager_t*, void (%struct.libvlc_instance_t*)* }
%struct.vlm_t = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "lock", scope: !2, file: !3, line: 35, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "libvlc_setup_threads", scope: !3, file: !3, line: 33, type: !4, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !32)
!3 = !DIFile(filename: "control/error.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !9, globals: !13, nameTableKind: None)
!8 = !{}
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !0, !21, !26}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "context", scope: !7, file: !3, line: 31, type: !16, isLocal: true, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_threadvar_t", file: !17, line: 108, baseType: !18)
!17 = !DIFile(filename: "../include/vlc_threads.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !19, line: 164, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "refs", scope: !2, file: !3, line: 36, type: !23, isLocal: true, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !24, line: 122, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!25 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "oom", scope: !7, file: !3, line: 29, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 112, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!30 = !{!31}
!31 = !DISubrange(count: 14)
!32 = !{!33}
!33 = !DILocalVariable(name: "init", arg: 1, scope: !2, file: !3, line: 33, type: !6)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_mutex_t", file: !17, line: 102, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !19, line: 128, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !19, line: 90, size: 320, elements: !37)
!37 = !{!38, !57, !61}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !36, file: !19, line: 125, baseType: !39, size: 320)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !19, line: 92, size: 320, elements: !40)
!40 = !{!41, !43, !44, !45, !46, !47, !49, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !39, file: !19, line: 94, baseType: !42, size: 32)
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !39, file: !19, line: 95, baseType: !20, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !39, file: !19, line: 96, baseType: !42, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !39, file: !19, line: 98, baseType: !20, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !39, file: !19, line: 102, baseType: !42, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !39, file: !19, line: 104, baseType: !48, size: 16, offset: 160)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !39, file: !19, line: 105, baseType: !48, size: 16, offset: 176)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !39, file: !19, line: 106, baseType: !51, size: 128, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !19, line: 79, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !19, line: 75, size: 128, elements: !53)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !52, file: !19, line: 77, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !52, file: !19, line: 78, baseType: !55, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !36, file: !19, line: 126, baseType: !58, size: 320)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 320, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 40)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !36, file: !19, line: 127, baseType: !62, size: 64)
!62 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "optlist", scope: !65, file: !66, line: 765, type: !216, isLocal: true, isDefinition: true)
!65 = distinct !DISubprogram(name: "marq_option_bynumber", scope: !66, file: !66, line: 763, type: !67, scopeLine: 764, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !213)
!66 = !DIFile(filename: "control/video.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !20}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "opt_t", file: !66, line: 624, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 621, size: 192, elements: !74)
!74 = !{!75, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !66, line: 622, baseType: !76, size: 160)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 20)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !66, line: 623, baseType: !20, size: 32, offset: 160)
!80 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !163, globals: !202, nameTableKind: None)
!81 = !{!82, !93, !136, !143, !146, !156}
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "libvlc_state_t", file: !83, line: 85, baseType: !20, size: 32, elements: !84)
!83 = !DIFile(filename: "../include/vlc/libvlc_media.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92}
!85 = !DIEnumerator(name: "libvlc_NothingSpecial", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "libvlc_Opening", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "libvlc_Buffering", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "libvlc_Playing", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "libvlc_Paused", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "libvlc_Stopped", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "libvlc_Ended", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "libvlc_Error", value: 7, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "input_query_e", file: !94, line: 447, baseType: !20, size: 32, elements: !95)
!94 = !DIFile(filename: "../include/vlc_input.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!96 = !DIEnumerator(name: "INPUT_GET_POSITION", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "INPUT_SET_POSITION", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "INPUT_GET_LENGTH", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "INPUT_GET_TIME", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "INPUT_SET_TIME", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "INPUT_GET_RATE", value: 5, isUnsigned: true)
!102 = !DIEnumerator(name: "INPUT_SET_RATE", value: 6, isUnsigned: true)
!103 = !DIEnumerator(name: "INPUT_GET_STATE", value: 7, isUnsigned: true)
!104 = !DIEnumerator(name: "INPUT_SET_STATE", value: 8, isUnsigned: true)
!105 = !DIEnumerator(name: "INPUT_GET_AUDIO_DELAY", value: 9, isUnsigned: true)
!106 = !DIEnumerator(name: "INPUT_SET_AUDIO_DELAY", value: 10, isUnsigned: true)
!107 = !DIEnumerator(name: "INPUT_GET_SPU_DELAY", value: 11, isUnsigned: true)
!108 = !DIEnumerator(name: "INPUT_SET_SPU_DELAY", value: 12, isUnsigned: true)
!109 = !DIEnumerator(name: "INPUT_ADD_INFO", value: 13, isUnsigned: true)
!110 = !DIEnumerator(name: "INPUT_REPLACE_INFOS", value: 14, isUnsigned: true)
!111 = !DIEnumerator(name: "INPUT_MERGE_INFOS", value: 15, isUnsigned: true)
!112 = !DIEnumerator(name: "INPUT_GET_INFO", value: 16, isUnsigned: true)
!113 = !DIEnumerator(name: "INPUT_DEL_INFO", value: 17, isUnsigned: true)
!114 = !DIEnumerator(name: "INPUT_SET_NAME", value: 18, isUnsigned: true)
!115 = !DIEnumerator(name: "INPUT_ADD_OPTION", value: 19, isUnsigned: true)
!116 = !DIEnumerator(name: "INPUT_GET_VIDEO_FPS", value: 20, isUnsigned: true)
!117 = !DIEnumerator(name: "INPUT_GET_BOOKMARK", value: 21, isUnsigned: true)
!118 = !DIEnumerator(name: "INPUT_GET_BOOKMARKS", value: 22, isUnsigned: true)
!119 = !DIEnumerator(name: "INPUT_CLEAR_BOOKMARKS", value: 23, isUnsigned: true)
!120 = !DIEnumerator(name: "INPUT_ADD_BOOKMARK", value: 24, isUnsigned: true)
!121 = !DIEnumerator(name: "INPUT_CHANGE_BOOKMARK", value: 25, isUnsigned: true)
!122 = !DIEnumerator(name: "INPUT_DEL_BOOKMARK", value: 26, isUnsigned: true)
!123 = !DIEnumerator(name: "INPUT_SET_BOOKMARK", value: 27, isUnsigned: true)
!124 = !DIEnumerator(name: "INPUT_GET_ATTACHMENTS", value: 28, isUnsigned: true)
!125 = !DIEnumerator(name: "INPUT_GET_ATTACHMENT", value: 29, isUnsigned: true)
!126 = !DIEnumerator(name: "INPUT_ADD_SLAVE", value: 30, isUnsigned: true)
!127 = !DIEnumerator(name: "INPUT_ADD_SUBTITLE", value: 31, isUnsigned: true)
!128 = !DIEnumerator(name: "INPUT_SET_RECORD_STATE", value: 32, isUnsigned: true)
!129 = !DIEnumerator(name: "INPUT_GET_RECORD_STATE", value: 33, isUnsigned: true)
!130 = !DIEnumerator(name: "INPUT_RESTART_ES", value: 34, isUnsigned: true)
!131 = !DIEnumerator(name: "INPUT_GET_AOUT", value: 35, isUnsigned: true)
!132 = !DIEnumerator(name: "INPUT_GET_VOUTS", value: 36, isUnsigned: true)
!133 = !DIEnumerator(name: "INPUT_GET_ES_OBJECTS", value: 37, isUnsigned: true)
!134 = !DIEnumerator(name: "INPUT_GET_PCR_SYSTEM", value: 38, isUnsigned: true)
!135 = !DIEnumerator(name: "INPUT_MODIFY_PCR_SYSTEM", value: 39, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 120, baseType: !20, size: 32, elements: !138)
!137 = !DIFile(filename: "../include/vlc_variables.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!138 = !{!139, !140, !141, !142}
!139 = !DIEnumerator(name: "VLC_VAR_BOOL_TOGGLE", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "VLC_VAR_INTEGER_ADD", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "VLC_VAR_INTEGER_OR", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "VLC_VAR_INTEGER_NAND", value: 3, isUnsigned: true)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !65, file: !66, line: 778, baseType: !20, size: 32, elements: !144)
!144 = !{!145}
!145 = !DIEnumerator(name: "num_opts", value: 10, isUnsigned: true)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !147, file: !66, line: 843, baseType: !20, size: 32, elements: !154)
!147 = distinct !DISubprogram(name: "logo_option_bynumber", scope: !66, file: !66, line: 829, type: !148, scopeLine: 830, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !151)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !20}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!151 = !{!152, !153}
!152 = !DILocalVariable(name: "option", arg: 1, scope: !147, file: !66, line: 829, type: !20)
!153 = !DILocalVariable(name: "r", scope: !147, file: !66, line: 845, type: !150)
!154 = !{!155}
!155 = !DIEnumerator(name: "num_vlogo_opts", value: 8, isUnsigned: true)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !157, file: !66, line: 888, baseType: !20, size: 32, elements: !161)
!157 = distinct !DISubprogram(name: "adjust_option_bynumber", scope: !66, file: !66, line: 877, type: !148, scopeLine: 878, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !80, retainedNodes: !158)
!158 = !{!159, !160}
!159 = !DILocalVariable(name: "option", arg: 1, scope: !157, file: !66, line: 877, type: !20)
!160 = !DILocalVariable(name: "r", scope: !157, file: !66, line: 890, type: !150)
!161 = !{!162}
!162 = !DIEnumerator(name: "num_opts", value: 6, isUnsigned: true)
!163 = !{!164, !10, !20, !11, !195, !197, !199, !171}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !166, line: 177, baseType: !167)
!166 = !DIFile(filename: "../include/vlc_common.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !168, line: 60, size: 320, elements: !169)
!168 = !DIFile(filename: "../include/vlc_objects.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!169 = !{!170, !172, !173, !174, !176, !177, !194}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !167, file: !168, line: 62, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !167, file: !168, line: 62, baseType: !11, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !167, file: !168, line: 62, baseType: !42, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !167, file: !168, line: 62, baseType: !175, size: 8, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !167, file: !168, line: 62, baseType: !6, size: 8, offset: 168)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !167, file: !168, line: 62, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !166, line: 178, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !181, line: 38, size: 384, elements: !182)
!181 = !DIFile(filename: "../include/vlc_main.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !180, file: !181, line: 40, baseType: !171, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !180, file: !181, line: 40, baseType: !11, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !180, file: !181, line: 40, baseType: !42, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !180, file: !181, line: 40, baseType: !175, size: 8, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !180, file: !181, line: 40, baseType: !6, size: 8, offset: 168)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !180, file: !181, line: 40, baseType: !178, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !180, file: !181, line: 40, baseType: !164, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !180, file: !181, line: 43, baseType: !191, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "hotkey", file: !181, line: 31, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !167, file: !168, line: 62, baseType: !164, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !196, line: 62, baseType: !25)
!196 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!202 = !{!63, !203, !208}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "vlogo_optlist", scope: !147, file: !66, line: 831, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1536, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 8)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "optlist", scope: !157, file: !66, line: 879, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1152, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 6)
!213 = !{!214, !215}
!214 = !DILocalVariable(name: "option", arg: 1, scope: !65, file: !66, line: 763, type: !20)
!215 = !DILocalVariable(name: "r", scope: !65, file: !66, line: 780, type: !150)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1920, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 10)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "event_list", scope: !221, file: !222, line: 251, type: !257, isLocal: true, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !223, retainedTypes: !243, globals: !254, nameTableKind: None)
!222 = !DIFile(filename: "control/event.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!223 = !{!224, !82}
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "libvlc_meta_t", file: !83, line: 53, baseType: !20, size: 32, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!226 = !DIEnumerator(name: "libvlc_meta_Title", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "libvlc_meta_Artist", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "libvlc_meta_Genre", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "libvlc_meta_Copyright", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "libvlc_meta_Album", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "libvlc_meta_TrackNumber", value: 5, isUnsigned: true)
!232 = !DIEnumerator(name: "libvlc_meta_Description", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "libvlc_meta_Rating", value: 7, isUnsigned: true)
!234 = !DIEnumerator(name: "libvlc_meta_Date", value: 8, isUnsigned: true)
!235 = !DIEnumerator(name: "libvlc_meta_Setting", value: 9, isUnsigned: true)
!236 = !DIEnumerator(name: "libvlc_meta_URL", value: 10, isUnsigned: true)
!237 = !DIEnumerator(name: "libvlc_meta_Language", value: 11, isUnsigned: true)
!238 = !DIEnumerator(name: "libvlc_meta_NowPlaying", value: 12, isUnsigned: true)
!239 = !DIEnumerator(name: "libvlc_meta_Publisher", value: 13, isUnsigned: true)
!240 = !DIEnumerator(name: "libvlc_meta_EncodedBy", value: 14, isUnsigned: true)
!241 = !DIEnumerator(name: "libvlc_meta_ArtworkURL", value: 15, isUnsigned: true)
!242 = !DIEnumerator(name: "libvlc_meta_TrackID", value: 16, isUnsigned: true)
!243 = !{!10, !244, !171, !245, !247}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_name_t", file: !222, line: 249, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 245, size: 352, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !222, line: 247, baseType: !42, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !222, line: 248, baseType: !253, size: 320, offset: 32)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 320, elements: !59)
!254 = !{!219, !255}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "unknown_event_name", scope: !221, file: !222, line: 305, type: !28, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 15488, elements: !259)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!259 = !{!260}
!260 = !DISubrange(count: 44)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "vlc_to_libvlc_meta", scope: !263, file: !264, line: 67, type: !790, isLocal: true, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !365, globals: !784, nameTableKind: None)
!264 = !DIFile(filename: "control/media.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!265 = !{!82, !266, !317, !224, !322, !328, !345}
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "libvlc_event_e", file: !267, line: 45, baseType: !20, size: 32, elements: !268)
!267 = !DIFile(filename: "../include/vlc/libvlc_events.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!269 = !DIEnumerator(name: "libvlc_MediaMetaChanged", value: 0, isUnsigned: true)
!270 = !DIEnumerator(name: "libvlc_MediaSubItemAdded", value: 1, isUnsigned: true)
!271 = !DIEnumerator(name: "libvlc_MediaDurationChanged", value: 2, isUnsigned: true)
!272 = !DIEnumerator(name: "libvlc_MediaParsedChanged", value: 3, isUnsigned: true)
!273 = !DIEnumerator(name: "libvlc_MediaFreed", value: 4, isUnsigned: true)
!274 = !DIEnumerator(name: "libvlc_MediaStateChanged", value: 5, isUnsigned: true)
!275 = !DIEnumerator(name: "libvlc_MediaPlayerMediaChanged", value: 256, isUnsigned: true)
!276 = !DIEnumerator(name: "libvlc_MediaPlayerNothingSpecial", value: 257, isUnsigned: true)
!277 = !DIEnumerator(name: "libvlc_MediaPlayerOpening", value: 258, isUnsigned: true)
!278 = !DIEnumerator(name: "libvlc_MediaPlayerBuffering", value: 259, isUnsigned: true)
!279 = !DIEnumerator(name: "libvlc_MediaPlayerPlaying", value: 260, isUnsigned: true)
!280 = !DIEnumerator(name: "libvlc_MediaPlayerPaused", value: 261, isUnsigned: true)
!281 = !DIEnumerator(name: "libvlc_MediaPlayerStopped", value: 262, isUnsigned: true)
!282 = !DIEnumerator(name: "libvlc_MediaPlayerForward", value: 263, isUnsigned: true)
!283 = !DIEnumerator(name: "libvlc_MediaPlayerBackward", value: 264, isUnsigned: true)
!284 = !DIEnumerator(name: "libvlc_MediaPlayerEndReached", value: 265, isUnsigned: true)
!285 = !DIEnumerator(name: "libvlc_MediaPlayerEncounteredError", value: 266, isUnsigned: true)
!286 = !DIEnumerator(name: "libvlc_MediaPlayerTimeChanged", value: 267, isUnsigned: true)
!287 = !DIEnumerator(name: "libvlc_MediaPlayerPositionChanged", value: 268, isUnsigned: true)
!288 = !DIEnumerator(name: "libvlc_MediaPlayerSeekableChanged", value: 269, isUnsigned: true)
!289 = !DIEnumerator(name: "libvlc_MediaPlayerPausableChanged", value: 270, isUnsigned: true)
!290 = !DIEnumerator(name: "libvlc_MediaPlayerTitleChanged", value: 271, isUnsigned: true)
!291 = !DIEnumerator(name: "libvlc_MediaPlayerSnapshotTaken", value: 272, isUnsigned: true)
!292 = !DIEnumerator(name: "libvlc_MediaPlayerLengthChanged", value: 273, isUnsigned: true)
!293 = !DIEnumerator(name: "libvlc_MediaListItemAdded", value: 512, isUnsigned: true)
!294 = !DIEnumerator(name: "libvlc_MediaListWillAddItem", value: 513, isUnsigned: true)
!295 = !DIEnumerator(name: "libvlc_MediaListItemDeleted", value: 514, isUnsigned: true)
!296 = !DIEnumerator(name: "libvlc_MediaListWillDeleteItem", value: 515, isUnsigned: true)
!297 = !DIEnumerator(name: "libvlc_MediaListViewItemAdded", value: 768, isUnsigned: true)
!298 = !DIEnumerator(name: "libvlc_MediaListViewWillAddItem", value: 769, isUnsigned: true)
!299 = !DIEnumerator(name: "libvlc_MediaListViewItemDeleted", value: 770, isUnsigned: true)
!300 = !DIEnumerator(name: "libvlc_MediaListViewWillDeleteItem", value: 771, isUnsigned: true)
!301 = !DIEnumerator(name: "libvlc_MediaListPlayerPlayed", value: 1024, isUnsigned: true)
!302 = !DIEnumerator(name: "libvlc_MediaListPlayerNextItemSet", value: 1025, isUnsigned: true)
!303 = !DIEnumerator(name: "libvlc_MediaListPlayerStopped", value: 1026, isUnsigned: true)
!304 = !DIEnumerator(name: "libvlc_MediaDiscovererStarted", value: 1280, isUnsigned: true)
!305 = !DIEnumerator(name: "libvlc_MediaDiscovererEnded", value: 1281, isUnsigned: true)
!306 = !DIEnumerator(name: "libvlc_VlmMediaAdded", value: 1536, isUnsigned: true)
!307 = !DIEnumerator(name: "libvlc_VlmMediaRemoved", value: 1537, isUnsigned: true)
!308 = !DIEnumerator(name: "libvlc_VlmMediaChanged", value: 1538, isUnsigned: true)
!309 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStarted", value: 1539, isUnsigned: true)
!310 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStopped", value: 1540, isUnsigned: true)
!311 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStatusInit", value: 1541, isUnsigned: true)
!312 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStatusOpening", value: 1542, isUnsigned: true)
!313 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStatusPlaying", value: 1543, isUnsigned: true)
!314 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStatusPause", value: 1544, isUnsigned: true)
!315 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStatusEnd", value: 1545, isUnsigned: true)
!316 = !DIEnumerator(name: "libvlc_VlmMediaInstanceStatusError", value: 1546, isUnsigned: true)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "input_item_option_e", file: !318, line: 171, baseType: !20, size: 32, elements: !319)
!318 = !DIFile(filename: "../include/vlc_input_item.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!319 = !{!320, !321}
!320 = !DIEnumerator(name: "VLC_INPUT_OPTION_TRUSTED", value: 2, isUnsigned: true)
!321 = !DIEnumerator(name: "VLC_INPUT_OPTION_UNIQUE", value: 256, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "libvlc_track_type_t", file: !83, line: 103, baseType: !42, size: 32, elements: !323)
!323 = !{!324, !325, !326, !327}
!324 = !DIEnumerator(name: "libvlc_track_unknown", value: -1)
!325 = !DIEnumerator(name: "libvlc_track_audio", value: 0)
!326 = !DIEnumerator(name: "libvlc_track_video", value: 1)
!327 = !DIEnumerator(name: "libvlc_track_text", value: 2)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vlc_event_type_t", file: !329, line: 114, baseType: !20, size: 32, elements: !330)
!329 = !DIFile(filename: "../include/vlc_events.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!331 = !DIEnumerator(name: "vlc_InputStateChanged", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "vlc_InputSelectedStreamChanged", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "vlc_InputItemMetaChanged", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "vlc_InputItemSubItemAdded", value: 3, isUnsigned: true)
!335 = !DIEnumerator(name: "vlc_InputItemSubItemTreeAdded", value: 4, isUnsigned: true)
!336 = !DIEnumerator(name: "vlc_InputItemDurationChanged", value: 5, isUnsigned: true)
!337 = !DIEnumerator(name: "vlc_InputItemPreparsedChanged", value: 6, isUnsigned: true)
!338 = !DIEnumerator(name: "vlc_InputItemNameChanged", value: 7, isUnsigned: true)
!339 = !DIEnumerator(name: "vlc_InputItemInfoChanged", value: 8, isUnsigned: true)
!340 = !DIEnumerator(name: "vlc_InputItemErrorWhenReadingChanged", value: 9, isUnsigned: true)
!341 = !DIEnumerator(name: "vlc_ServicesDiscoveryItemAdded", value: 10, isUnsigned: true)
!342 = !DIEnumerator(name: "vlc_ServicesDiscoveryItemRemoved", value: 11, isUnsigned: true)
!343 = !DIEnumerator(name: "vlc_ServicesDiscoveryStarted", value: 12, isUnsigned: true)
!344 = !DIEnumerator(name: "vlc_ServicesDiscoveryEnded", value: 13, isUnsigned: true)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vlc_meta_type_t", file: !346, line: 33, baseType: !20, size: 32, elements: !347)
!346 = !DIFile(filename: "../include/vlc_meta.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!348 = !DIEnumerator(name: "vlc_meta_Title", value: 0, isUnsigned: true)
!349 = !DIEnumerator(name: "vlc_meta_Artist", value: 1, isUnsigned: true)
!350 = !DIEnumerator(name: "vlc_meta_Genre", value: 2, isUnsigned: true)
!351 = !DIEnumerator(name: "vlc_meta_Copyright", value: 3, isUnsigned: true)
!352 = !DIEnumerator(name: "vlc_meta_Album", value: 4, isUnsigned: true)
!353 = !DIEnumerator(name: "vlc_meta_TrackNumber", value: 5, isUnsigned: true)
!354 = !DIEnumerator(name: "vlc_meta_Description", value: 6, isUnsigned: true)
!355 = !DIEnumerator(name: "vlc_meta_Rating", value: 7, isUnsigned: true)
!356 = !DIEnumerator(name: "vlc_meta_Date", value: 8, isUnsigned: true)
!357 = !DIEnumerator(name: "vlc_meta_Setting", value: 9, isUnsigned: true)
!358 = !DIEnumerator(name: "vlc_meta_URL", value: 10, isUnsigned: true)
!359 = !DIEnumerator(name: "vlc_meta_Language", value: 11, isUnsigned: true)
!360 = !DIEnumerator(name: "vlc_meta_NowPlaying", value: 12, isUnsigned: true)
!361 = !DIEnumerator(name: "vlc_meta_Publisher", value: 13, isUnsigned: true)
!362 = !DIEnumerator(name: "vlc_meta_EncodedBy", value: 14, isUnsigned: true)
!363 = !DIEnumerator(name: "vlc_meta_ArtworkURL", value: 15, isUnsigned: true)
!364 = !DIEnumerator(name: "vlc_meta_TrackID", value: 16, isUnsigned: true)
!365 = !{!10, !366, !389}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !166, line: 177, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !168, line: 60, size: 320, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !388}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !368, file: !168, line: 62, baseType: !171, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !368, file: !168, line: 62, baseType: !11, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !368, file: !168, line: 62, baseType: !42, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !368, file: !168, line: 62, baseType: !175, size: 8, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !368, file: !168, line: 62, baseType: !6, size: 8, offset: 168)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !368, file: !168, line: 62, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !166, line: 178, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !181, line: 38, size: 384, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !378, file: !181, line: 40, baseType: !171, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !378, file: !181, line: 40, baseType: !11, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !378, file: !181, line: 40, baseType: !42, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !378, file: !181, line: 40, baseType: !175, size: 8, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !378, file: !181, line: 40, baseType: !6, size: 8, offset: 168)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !378, file: !181, line: 40, baseType: !376, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !378, file: !181, line: 40, baseType: !366, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !378, file: !181, line: 43, baseType: !191, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !368, file: !168, line: 62, baseType: !366, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_priv_t", file: !391, line: 222, baseType: !392)
!391 = !DIFile(filename: "./libvlc.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_priv_t", file: !391, line: 189, size: 1792, elements: !393)
!393 = !{!394, !395, !396, !397, !401, !402, !403, !404, !428, !483, !484, !488, !767, !771, !772, !776, !780, !783}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "public_data", scope: !392, file: !391, line: 191, baseType: !377, size: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_input_id", scope: !392, file: !391, line: 193, baseType: !42, size: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "playlist_active", scope: !392, file: !391, line: 194, baseType: !6, size: 8, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "msg_bank", scope: !392, file: !391, line: 197, baseType: !398, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "msg_bank_t", file: !391, line: 87, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "msg_bank_t", file: !391, line: 87, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_verbose", scope: !392, file: !391, line: 198, baseType: !42, size: 32, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_color", scope: !392, file: !391, line: 199, baseType: !6, size: 8, offset: 544)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_stats", scope: !392, file: !391, line: 202, baseType: !6, size: 8, offset: 552)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "timer_lock", scope: !392, file: !391, line: 203, baseType: !405, size: 320, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_mutex_t", file: !17, line: 102, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !19, line: 128, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !19, line: 90, size: 320, elements: !408)
!408 = !{!409, !426, !427}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !407, file: !19, line: 125, baseType: !410, size: 320)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !19, line: 92, size: 320, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !410, file: !19, line: 94, baseType: !42, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !410, file: !19, line: 95, baseType: !20, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !410, file: !19, line: 96, baseType: !42, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !410, file: !19, line: 98, baseType: !20, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !410, file: !19, line: 102, baseType: !42, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !410, file: !19, line: 104, baseType: !48, size: 16, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !410, file: !19, line: 105, baseType: !48, size: 16, offset: 176)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !410, file: !19, line: 106, baseType: !420, size: 128, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !19, line: 79, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !19, line: 75, size: 128, elements: !422)
!422 = !{!423, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !421, file: !19, line: 77, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !421, file: !19, line: 78, baseType: !424, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !407, file: !19, line: 126, baseType: !58, size: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !407, file: !19, line: 127, baseType: !62, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pp_timers", scope: !392, file: !391, line: 204, baseType: !429, size: 64, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_t", file: !166, line: 387, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_t", file: !433, line: 154, size: 512, elements: !434)
!433 = !DIFile(filename: "../include/vlc_messages.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!434 = !{!435, !436, !437, !438, !439, !440, !441, !481, !482}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !432, file: !433, line: 156, baseType: !20, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !432, file: !433, line: 157, baseType: !11, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !432, file: !433, line: 158, baseType: !42, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "p_obj", scope: !432, file: !433, line: 159, baseType: !10, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_compute_type", scope: !432, file: !433, line: 160, baseType: !42, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_samples", scope: !432, file: !433, line: 161, baseType: !42, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pp_samples", scope: !432, file: !433, line: 162, baseType: !442, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_sample_t", file: !166, line: 388, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "counter_sample_t", file: !433, line: 148, size: 128, elements: !446)
!446 = !{!447, !480}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !445, file: !433, line: 150, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_value_t", file: !166, line: 432, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !166, line: 417, size: 64, elements: !450)
!450 = !{!451, !452, !453, !455, !456, !457, !458, !468, !471, !477}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_int", scope: !449, file: !166, line: 419, baseType: !42, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_bool", scope: !449, file: !166, line: 420, baseType: !6, size: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "f_float", scope: !449, file: !166, line: 421, baseType: !454, size: 32)
!454 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "psz_string", scope: !449, file: !166, line: 422, baseType: !11, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "p_address", scope: !449, file: !166, line: 423, baseType: !10, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "p_object", scope: !449, file: !166, line: 424, baseType: !366, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "p_list", scope: !449, file: !166, line: 425, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_list_t", file: !166, line: 176, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_list_t", file: !166, line: 437, size: 192, elements: !462)
!462 = !{!463, !464, !466}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !461, file: !166, line: 439, baseType: !42, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "p_values", scope: !461, file: !166, line: 440, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pi_types", scope: !461, file: !166, line: 441, baseType: !467, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_time", scope: !449, file: !166, line: 426, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtime_t", file: !166, line: 131, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !24, line: 40, baseType: !62)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !449, file: !166, line: 427, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !166, line: 427, size: 64, elements: !473)
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !472, file: !166, line: 427, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !24, line: 38, baseType: !42)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !472, file: !166, line: 427, baseType: !475, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !449, file: !166, line: 430, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 64, elements: !206)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !24, line: 48, baseType: !201)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !445, file: !433, line: 151, baseType: !469, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "update_interval", scope: !432, file: !433, line: 164, baseType: !469, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "last_update", scope: !432, file: !433, line: 165, baseType: !469, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_timers", scope: !392, file: !391, line: 205, baseType: !42, size: 32, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "p_memcpy_module", scope: !392, file: !391, line: 208, baseType: !485, size: 64, offset: 1024)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_t", file: !166, line: 208, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_t", file: !166, line: 208, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "p_playlist", scope: !392, file: !391, line: 209, baseType: !489, size: 64, offset: 1088)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "playlist_t", file: !166, line: 199, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "playlist_t", file: !492, line: 159, size: 1344, elements: !493)
!492 = !DIFile(filename: "../include/vlc_playlist.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !491, file: !492, line: 161, baseType: !171, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !491, file: !492, line: 161, baseType: !11, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !491, file: !492, line: 161, baseType: !42, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !491, file: !492, line: 161, baseType: !175, size: 8, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !491, file: !492, line: 161, baseType: !6, size: 8, offset: 168)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !491, file: !492, line: 161, baseType: !376, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !491, file: !492, line: 161, baseType: !366, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !491, file: !492, line: 163, baseType: !502, size: 128, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "playlist_item_array_t", file: !492, line: 34, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 34, size: 128, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_alloc", scope: !503, file: !492, line: 34, baseType: !42, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !503, file: !492, line: 34, baseType: !42, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "p_elems", scope: !503, file: !492, line: 34, baseType: !508, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "playlist_item_t", file: !166, line: 200, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "playlist_item_t", file: !492, line: 133, size: 384, elements: !512)
!512 = !{!513, !749, !750, !751, !752, !753, !754}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !511, file: !492, line: 135, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_item_t", file: !166, line: 218, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_item_t", file: !318, line: 54, size: 2560, elements: !517)
!517 = !{!518, !532, !533, !534, !535, !536, !538, !540, !541, !542, !543, !558, !559, !676, !701, !702, !706, !707, !728, !745, !746, !747, !748}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "vlc_gc_data", scope: !516, file: !318, line: 56, baseType: !519, size: 192)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "gc_object_t", file: !166, line: 574, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gc_object_t", file: !166, line: 569, size: 192, elements: !521)
!521 = !{!522, !526, !527}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !520, file: !166, line: 571, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_spinlock_t", file: !17, line: 279, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_spinlock_t", file: !19, line: 234, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !520, file: !166, line: 572, baseType: !23, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destructor", scope: !520, file: !166, line: 573, baseType: !528, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !516, file: !318, line: 57, baseType: !42, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !516, file: !318, line: 59, baseType: !11, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "psz_uri", scope: !516, file: !318, line: 60, baseType: !11, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_options", scope: !516, file: !318, line: 62, baseType: !42, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_options", scope: !516, file: !318, line: 63, baseType: !537, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "optflagv", scope: !516, file: !318, line: 64, baseType: !539, size: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "optflagc", scope: !516, file: !318, line: 65, baseType: !20, size: 32, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !516, file: !318, line: 67, baseType: !469, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_categories", scope: !516, file: !318, line: 70, baseType: !42, size: 32, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pp_categories", scope: !516, file: !318, line: 71, baseType: !544, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "info_category_t", file: !166, line: 232, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_category_t", file: !318, line: 47, size: 192, elements: !548)
!548 = !{!549, !550, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !547, file: !318, line: 49, baseType: !11, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_infos", scope: !547, file: !318, line: 50, baseType: !42, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pp_infos", scope: !547, file: !318, line: 51, baseType: !552, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_t", file: !318, line: 41, size: 128, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !554, file: !318, line: 43, baseType: !11, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "psz_value", scope: !554, file: !318, line: 44, baseType: !11, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_es", scope: !516, file: !318, line: 73, baseType: !42, size: 32, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "es", scope: !516, file: !318, line: 74, baseType: !560, size: 64, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_format_t", file: !166, line: 239, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "es_format_t", file: !564, line: 228, size: 2816, elements: !565)
!564 = !DIFile(filename: "../include/vlc_es.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!565 = !{!566, !567, !570, !571, !572, !573, !574, !575, !576, !577, !584, !597, !609, !645, !670, !671, !672, !673, !674, !675}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_cat", scope: !563, file: !564, line: 230, baseType: !42, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_codec", scope: !563, file: !564, line: 231, baseType: !568, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_fourcc_t", file: !166, line: 138, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 51, baseType: !20)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_fourcc", scope: !563, file: !564, line: 232, baseType: !568, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !563, file: !564, line: 234, baseType: !42, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_group", scope: !563, file: !564, line: 237, baseType: !42, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_priority", scope: !563, file: !564, line: 241, baseType: !42, size: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !563, file: !564, line: 247, baseType: !11, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !563, file: !564, line: 248, baseType: !11, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra_languages", scope: !563, file: !564, line: 249, baseType: !42, size: 32, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra_languages", scope: !563, file: !564, line: 250, baseType: !578, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "extra_languages_t", file: !564, line: 223, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extra_languages_t", file: !564, line: 219, size: 128, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !580, file: !564, line: 221, baseType: !11, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !580, file: !564, line: 222, baseType: !11, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "audio", scope: !563, file: !564, line: 252, baseType: !585, size: 288, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_format_t", file: !166, line: 236, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audio_format_t", file: !564, line: 67, size: 288, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_format", scope: !586, file: !564, line: 69, baseType: !568, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !586, file: !564, line: 70, baseType: !20, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_physical_channels", scope: !586, file: !564, line: 74, baseType: !569, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_channels", scope: !586, file: !564, line: 78, baseType: !569, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_per_frame", scope: !586, file: !564, line: 82, baseType: !20, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_length", scope: !586, file: !564, line: 85, baseType: !20, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitspersample", scope: !586, file: !564, line: 93, baseType: !20, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_blockalign", scope: !586, file: !564, line: 94, baseType: !20, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_channels", scope: !586, file: !564, line: 95, baseType: !479, size: 8, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "audio_replay_gain", scope: !563, file: !564, line: 253, baseType: !598, size: 192, offset: 736)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_replay_gain_t", file: !564, line: 62, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 51, size: 192, elements: !600)
!600 = !{!601, !605, !607, !608}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pb_peak", scope: !599, file: !564, line: 54, baseType: !602, size: 16)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 16, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 2)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peak", scope: !599, file: !564, line: 56, baseType: !606, size: 64, offset: 32)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 64, elements: !603)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pb_gain", scope: !599, file: !564, line: 59, baseType: !602, size: 16, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gain", scope: !599, file: !564, line: 61, baseType: !606, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "video", scope: !563, file: !564, line: 254, baseType: !610, size: 768, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_format_t", file: !166, line: 237, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_format_t", file: !564, line: 101, size: 768, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma", scope: !611, file: !564, line: 103, baseType: !568, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !611, file: !564, line: 105, baseType: !20, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !611, file: !564, line: 106, baseType: !20, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_offset", scope: !611, file: !564, line: 107, baseType: !20, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_offset", scope: !611, file: !564, line: 108, baseType: !20, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_width", scope: !611, file: !564, line: 109, baseType: !20, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_height", scope: !611, file: !564, line: 110, baseType: !20, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_per_pixel", scope: !611, file: !564, line: 112, baseType: !20, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_num", scope: !611, file: !564, line: 114, baseType: !20, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_den", scope: !611, file: !564, line: 115, baseType: !20, size: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate", scope: !611, file: !564, line: 117, baseType: !20, size: 32, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate_base", scope: !611, file: !564, line: 118, baseType: !20, size: 32, offset: 352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_rmask", scope: !611, file: !564, line: 120, baseType: !569, size: 32, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_gmask", scope: !611, file: !564, line: 120, baseType: !569, size: 32, offset: 416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_bmask", scope: !611, file: !564, line: 120, baseType: !569, size: 32, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_rrshift", scope: !611, file: !564, line: 121, baseType: !42, size: 32, offset: 480)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_lrshift", scope: !611, file: !564, line: 121, baseType: !42, size: 32, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_rgshift", scope: !611, file: !564, line: 122, baseType: !42, size: 32, offset: 544)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_lgshift", scope: !611, file: !564, line: 122, baseType: !42, size: 32, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_rbshift", scope: !611, file: !564, line: 123, baseType: !42, size: 32, offset: 608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_lbshift", scope: !611, file: !564, line: 123, baseType: !42, size: 32, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "p_palette", scope: !611, file: !564, line: 124, baseType: !635, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_palette_t", file: !166, line: 240, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_palette_t", file: !564, line: 39, size: 8224, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_entries", scope: !637, file: !564, line: 41, baseType: !42, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !637, file: !564, line: 42, baseType: !641, size: 8192, offset: 32)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 8192, elements: !642)
!642 = !{!643, !644}
!643 = !DISubrange(count: 256)
!644 = !DISubrange(count: 4)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !563, file: !564, line: 255, baseType: !646, size: 832, offset: 1728)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "subs_format_t", file: !166, line: 238, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subs_format_t", file: !564, line: 184, size: 832, elements: !648)
!648 = !{!649, !650, !651, !652, !661, !665}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "psz_encoding", scope: !647, file: !564, line: 188, baseType: !11, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_origin", scope: !647, file: !564, line: 191, baseType: !42, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_origin", scope: !647, file: !564, line: 192, baseType: !42, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "spu", scope: !647, file: !564, line: 203, baseType: !653, size: 608, offset: 128)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !564, line: 194, size: 608, elements: !654)
!654 = !{!655, !659, !660}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !653, file: !564, line: 197, baseType: !656, size: 544)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 544, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 17)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_width", scope: !653, file: !564, line: 200, baseType: !42, size: 32, offset: 544)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_height", scope: !653, file: !564, line: 202, baseType: !42, size: 32, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !647, file: !564, line: 208, baseType: !662, size: 32, offset: 736)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !564, line: 205, size: 32, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !662, file: !564, line: 207, baseType: !42, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "teletext", scope: !647, file: !564, line: 213, baseType: !666, size: 64, offset: 768)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !564, line: 209, size: 64, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_magazine", scope: !666, file: !564, line: 211, baseType: !42, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_page", scope: !666, file: !564, line: 212, baseType: !42, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !563, file: !564, line: 257, baseType: !20, size: 32, offset: 2560)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile", scope: !563, file: !564, line: 258, baseType: !42, size: 32, offset: 2592)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_level", scope: !563, file: !564, line: 259, baseType: !42, size: 32, offset: 2624)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "b_packetized", scope: !563, file: !564, line: 261, baseType: !6, size: 8, offset: 2656)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra", scope: !563, file: !564, line: 262, baseType: !42, size: 32, offset: 2688)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra", scope: !563, file: !564, line: 263, baseType: !10, size: 64, offset: 2752)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "p_stats", scope: !516, file: !318, line: 76, baseType: !677, size: 64, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_stats_t", file: !166, line: 390, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_stats_t", file: !318, line: 274, size: 960, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !679, file: !318, line: 276, baseType: !405, size: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_read_packets", scope: !679, file: !318, line: 279, baseType: !42, size: 32, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_read_bytes", scope: !679, file: !318, line: 280, baseType: !42, size: 32, offset: 352)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "f_input_bitrate", scope: !679, file: !318, line: 281, baseType: !454, size: 32, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "f_average_input_bitrate", scope: !679, file: !318, line: 282, baseType: !454, size: 32, offset: 416)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_read_packets", scope: !679, file: !318, line: 285, baseType: !42, size: 32, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_read_bytes", scope: !679, file: !318, line: 286, baseType: !42, size: 32, offset: 480)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "f_demux_bitrate", scope: !679, file: !318, line: 287, baseType: !454, size: 32, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "f_average_demux_bitrate", scope: !679, file: !318, line: 288, baseType: !454, size: 32, offset: 544)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_corrupted", scope: !679, file: !318, line: 289, baseType: !42, size: 32, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_discontinuity", scope: !679, file: !318, line: 290, baseType: !42, size: 32, offset: 608)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_decoded_audio", scope: !679, file: !318, line: 293, baseType: !42, size: 32, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_decoded_video", scope: !679, file: !318, line: 294, baseType: !42, size: 32, offset: 672)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_displayed_pictures", scope: !679, file: !318, line: 297, baseType: !42, size: 32, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_lost_pictures", scope: !679, file: !318, line: 298, baseType: !42, size: 32, offset: 736)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_sent_packets", scope: !679, file: !318, line: 301, baseType: !42, size: 32, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_sent_bytes", scope: !679, file: !318, line: 302, baseType: !42, size: 32, offset: 800)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "f_send_bitrate", scope: !679, file: !318, line: 303, baseType: !454, size: 32, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_played_abuffers", scope: !679, file: !318, line: 306, baseType: !42, size: 32, offset: 864)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_lost_abuffers", scope: !679, file: !318, line: 307, baseType: !42, size: 32, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_played", scope: !516, file: !318, line: 77, baseType: !42, size: 32, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "p_meta", scope: !516, file: !318, line: 79, baseType: !703, size: 64, offset: 1088)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_meta_t", file: !166, line: 384, baseType: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_meta_t", file: !166, line: 384, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_epg", scope: !516, file: !318, line: 81, baseType: !42, size: 32, offset: 1152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pp_epg", scope: !516, file: !318, line: 82, baseType: !708, size: 64, offset: 1216)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_epg_t", file: !711, line: 50, baseType: !712)
!711 = !DIFile(filename: "../include/vlc_epg.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 43, size: 256, elements: !713)
!713 = !{!714, !715, !725, !726}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !712, file: !711, line: 45, baseType: !11, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "p_current", scope: !712, file: !711, line: 46, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_epg_event_t", file: !711, line: 41, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 32, size: 320, elements: !719)
!719 = !{!720, !721, !722, !723, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !718, file: !711, line: 34, baseType: !470, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !718, file: !711, line: 35, baseType: !42, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !718, file: !711, line: 37, baseType: !11, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "psz_short_description", scope: !718, file: !711, line: 38, baseType: !11, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !718, file: !711, line: 39, baseType: !11, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_event", scope: !712, file: !711, line: 48, baseType: !42, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pp_event", scope: !712, file: !711, line: 49, baseType: !727, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "event_manager", scope: !516, file: !318, line: 84, baseType: !729, size: 896, offset: 1280)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_event_manager_t", file: !329, line: 110, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_event_manager_t", file: !329, line: 103, size: 896, elements: !731)
!731 = !{!732, !733, !734, !735, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "p_obj", scope: !730, file: !329, line: 105, baseType: !10, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "object_lock", scope: !730, file: !329, line: 106, baseType: !405, size: 320, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "event_sending_lock", scope: !730, file: !329, line: 107, baseType: !405, size: 320, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent_object", scope: !730, file: !329, line: 108, baseType: !366, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "listeners_groups", scope: !730, file: !329, line: 109, baseType: !737, size: 128, offset: 768)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !730, file: !329, line: 109, size: 128, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_alloc", scope: !737, file: !329, line: 109, baseType: !42, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !737, file: !329, line: 109, baseType: !42, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "p_elems", scope: !737, file: !329, line: 109, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_event_listeners_group_t", file: !329, line: 100, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !516, file: !318, line: 86, baseType: !405, size: 320, offset: 2176)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !516, file: !318, line: 88, baseType: !479, size: 8, offset: 2496)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_name", scope: !516, file: !318, line: 89, baseType: !6, size: 8, offset: 2504)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "b_error_when_reading", scope: !516, file: !318, line: 90, baseType: !6, size: 8, offset: 2512)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_children", scope: !511, file: !492, line: 137, baseType: !42, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pp_children", scope: !511, file: !492, line: 138, baseType: !508, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !511, file: !492, line: 139, baseType: !509, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !511, file: !492, line: 141, baseType: !42, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !511, file: !492, line: 142, baseType: !479, size: 8, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "p_playlist", scope: !511, file: !492, line: 143, baseType: !489, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "all_items", scope: !491, file: !492, line: 164, baseType: !502, size: 128, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !491, file: !492, line: 166, baseType: !502, size: 128, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_current_index", scope: !491, file: !492, line: 167, baseType: !42, size: 32, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "p_root", scope: !491, file: !492, line: 170, baseType: !509, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "p_playing", scope: !491, file: !492, line: 171, baseType: !509, size: 64, offset: 832)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "p_media_library", scope: !491, file: !492, line: 172, baseType: !509, size: 64, offset: 896)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "p_root_category", scope: !491, file: !492, line: 175, baseType: !509, size: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "p_root_onelevel", scope: !491, file: !492, line: 176, baseType: !509, size: 64, offset: 1024)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "p_local_category", scope: !491, file: !492, line: 177, baseType: !509, size: 64, offset: 1088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "p_ml_category", scope: !491, file: !492, line: 178, baseType: !509, size: 64, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "p_local_onelevel", scope: !491, file: !492, line: 179, baseType: !509, size: 64, offset: 1216)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "p_ml_onelevel", scope: !491, file: !492, line: 180, baseType: !509, size: 64, offset: 1280)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "p_vlm", scope: !392, file: !391, line: 210, baseType: !768, size: 64, offset: 1152)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlm_t", file: !166, line: 380, baseType: !770)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "vlm_t", file: !166, line: 380, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "p_dialog_provider", scope: !392, file: !391, line: 211, baseType: !366, size: 64, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "p_httpd", scope: !392, file: !391, line: 212, baseType: !773, size: 64, offset: 1280)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "httpd_t", file: !166, line: 334, baseType: !775)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "httpd_t", file: !166, line: 334, flags: DIFlagFwdDecl)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "p_sap", scope: !392, file: !391, line: 214, baseType: !777, size: 64, offset: 1344)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "sap_handler_t", file: !391, line: 184, baseType: !779)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "sap_handler_t", file: !391, line: 184, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "p_intf", scope: !392, file: !391, line: 218, baseType: !781, size: 64, offset: 1408)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "intf_thread_t", file: !391, line: 218, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "structure_lock", scope: !392, file: !391, line: 221, baseType: !405, size: 320, offset: 1472)
!784 = !{!261, !785}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "libvlc_to_vlc_meta", scope: !263, file: !264, line: 46, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 544, elements: !657)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_meta_type_t", file: !346, line: 52, baseType: !345)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 544, elements: !657)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_meta_t", file: !83, line: 72, baseType: !224)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "psz_vlc_changeset", scope: !795, file: !796, line: 1, type: !798, isLocal: false, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, globals: !797, nameTableKind: None)
!796 = !DIFile(filename: "revision.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!797 = !{!793}
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 72, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 9)
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !803, nameTableKind: None)
!802 = !DIFile(filename: "control/core.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!803 = !{!10, !804, !11}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !166, line: 177, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !168, line: 60, size: 320, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !826}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !806, file: !168, line: 62, baseType: !171, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !806, file: !168, line: 62, baseType: !11, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !806, file: !168, line: 62, baseType: !42, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !806, file: !168, line: 62, baseType: !175, size: 8, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !806, file: !168, line: 62, baseType: !6, size: 8, offset: 168)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !806, file: !168, line: 62, baseType: !814, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !166, line: 178, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !181, line: 38, size: 384, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !816, file: !181, line: 40, baseType: !171, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !816, file: !181, line: 40, baseType: !11, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !816, file: !181, line: 40, baseType: !42, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !816, file: !181, line: 40, baseType: !175, size: 8, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !816, file: !181, line: 40, baseType: !6, size: 8, offset: 168)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !816, file: !181, line: 40, baseType: !814, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !816, file: !181, line: 40, baseType: !804, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !816, file: !181, line: 43, baseType: !191, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !806, file: !168, line: 62, baseType: !804, size: 64, offset: 256)
!827 = distinct !DICompileUnit(language: DW_LANG_C99, file: !828, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !829, retainedTypes: !835, nameTableKind: None)
!828 = !DIFile(filename: "control/log.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!829 = !{!830}
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !831, line: 175, baseType: !20, size: 32, elements: !832)
!831 = !DIFile(filename: "/usr/include/pthread.h", directory: "")
!832 = !{!833, !834}
!833 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0, isUnsigned: true)
!834 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1, isUnsigned: true)
!835 = !{!10, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_log_t", file: !838, line: 56, baseType: !839)
!838 = !DIFile(filename: "../include/vlc/libvlc_structures.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_log_t", file: !828, line: 66, size: 16640, elements: !840)
!840 = !{!841, !915, !919}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "p_instance", scope: !839, file: !828, line: 68, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_instance_t", file: !838, line: 44, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_instance_t", file: !845, line: 67, size: 704, elements: !846)
!845 = !DIFile(filename: "control/libvlc_internal.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!846 = !{!847, !871, !886, !887, !888, !912}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc_int", scope: !844, file: !845, line: 69, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !166, line: 178, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !181, line: 38, size: 384, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !870}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !850, file: !181, line: 40, baseType: !171, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !850, file: !181, line: 40, baseType: !11, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !850, file: !181, line: 40, baseType: !42, size: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !850, file: !181, line: 40, baseType: !175, size: 8, offset: 160)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !850, file: !181, line: 40, baseType: !6, size: 8, offset: 168)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !850, file: !181, line: 40, baseType: !848, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !850, file: !181, line: 40, baseType: !859, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !166, line: 177, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !168, line: 60, size: 320, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !861, file: !168, line: 62, baseType: !171, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !861, file: !168, line: 62, baseType: !11, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !861, file: !168, line: 62, baseType: !42, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !861, file: !168, line: 62, baseType: !175, size: 8, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !861, file: !168, line: 62, baseType: !6, size: 8, offset: 168)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !861, file: !168, line: 62, baseType: !848, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !861, file: !168, line: 62, baseType: !859, size: 64, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !850, file: !181, line: 43, baseType: !191, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "libvlc_vlm", scope: !844, file: !845, line: 70, baseType: !872, size: 192, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_vlm_t", file: !845, line: 65, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_vlm_t", file: !845, line: 60, size: 192, elements: !874)
!874 = !{!875, !876, !881}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "p_vlm", scope: !873, file: !845, line: 62, baseType: !768, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "p_event_manager", scope: !873, file: !845, line: 63, baseType: !877, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_event_manager_t", file: !879, line: 214, baseType: !880)
!879 = !DIFile(filename: "../include/vlc/libvlc.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/src")
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_event_manager_t", file: !879, line: 214, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !873, file: !845, line: 64, baseType: !882, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_vlm_release_func_t", file: !845, line: 54, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !842}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !844, file: !845, line: 71, baseType: !20, size: 32, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !844, file: !845, line: 72, baseType: !42, size: 32, offset: 288)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "instance_lock", scope: !844, file: !845, line: 73, baseType: !889, size: 320, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_mutex_t", file: !17, line: 102, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !19, line: 128, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !19, line: 90, size: 320, elements: !892)
!892 = !{!893, !910, !911}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !891, file: !19, line: 125, baseType: !894, size: 320)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !19, line: 92, size: 320, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !894, file: !19, line: 94, baseType: !42, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !894, file: !19, line: 95, baseType: !20, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !894, file: !19, line: 96, baseType: !42, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !894, file: !19, line: 98, baseType: !20, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !894, file: !19, line: 102, baseType: !42, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !894, file: !19, line: 104, baseType: !48, size: 16, offset: 160)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !894, file: !19, line: 105, baseType: !48, size: 16, offset: 176)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !894, file: !19, line: 106, baseType: !904, size: 128, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !19, line: 79, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !19, line: 75, size: 128, elements: !906)
!906 = !{!907, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !905, file: !19, line: 77, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !905, file: !19, line: 78, baseType: !908, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !891, file: !19, line: 126, baseType: !58, size: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !891, file: !19, line: 127, baseType: !62, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "p_callback_list", scope: !844, file: !845, line: 74, baseType: !913, size: 64, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_callback_entry_list_t", file: !845, line: 74, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "p_messages", scope: !839, file: !828, line: 69, baseType: !916, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "msg_subscription_t", file: !433, line: 85, baseType: !918)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "msg_subscription_t", file: !433, line: 85, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !839, file: !828, line: 70, baseType: !920, size: 16512, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "msg_cb_data_t", file: !433, line: 107, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msg_cb_data_t", file: !828, line: 43, size: 16512, elements: !922)
!922 = !{!923, !924, !949, !950}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !921, file: !828, line: 45, baseType: !523, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !921, file: !828, line: 46, baseType: !925, size: 16384, offset: 64)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 16384, elements: !948)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "msg_item_t", file: !433, line: 59, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 48, size: 640, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !928, file: !433, line: 50, baseType: !42, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "i_object_id", scope: !928, file: !433, line: 51, baseType: !23, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !928, file: !433, line: 52, baseType: !171, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "psz_module", scope: !928, file: !433, line: 53, baseType: !11, size: 64, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "psz_msg", scope: !928, file: !433, line: 54, baseType: !11, size: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !928, file: !433, line: 55, baseType: !11, size: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !928, file: !433, line: 57, baseType: !469, size: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vlc_gc_data", scope: !928, file: !433, line: 58, baseType: !938, size: 192, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "gc_object_t", file: !166, line: 574, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gc_object_t", file: !166, line: 569, size: 192, elements: !940)
!940 = !{!941, !942, !943}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !939, file: !166, line: 571, baseType: !523, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !939, file: !166, line: 572, baseType: !23, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destructor", scope: !939, file: !166, line: 573, baseType: !944, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!948 = !{!643}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !921, file: !828, line: 47, baseType: !20, size: 32, offset: 16448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !921, file: !828, line: 48, baseType: !42, size: 32, offset: 16480)
