; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._Jbig2Allocator.1 = type { {}*, void (%struct._Jbig2Allocator.1*, i8*)*, i8* (%struct._Jbig2Allocator.1*, i8*, i64)* }
%struct.mmr_table_node = type { i16, i16 }
%struct.Jbig2ArithQe = type { i16, i8, i8 }
%struct._Jbig2HuffmanLine = type { i32, i32, i32 }
%struct._Jbig2HuffmanParams = type { i32, i32, %struct._Jbig2HuffmanLine* }
%struct._Jbig2Ctx = type { %struct._Jbig2Allocator.1*, i32, %struct._Jbig2Ctx*, i32 (i8*, i8*, i32, i32)*, i8*, i8*, i64, i32, i32, i32, i8, i32, i32, %struct._Jbig2Segment**, i32, i32, i32, i32, %struct._Jbig2Page* }
%struct._Jbig2Segment = type { i32, i8, i32, i64, i32, i32*, i8* }
%struct._Jbig2Page = type { i32, i32, i32, i32, i32, i32, i16, i32, i32, i8, %struct._Jbig2Image* }
%struct._Jbig2Image = type { i32, i32, i32, i8*, i32 }
%struct.jbig2dec_params_t = type { i32, i32, i32, %struct.SHA1_CTX*, i8*, i32 }
%struct.SHA1_CTX = type { [5 x i32], [2 x i32], [64 x i8] }
%struct._Jbig2GlobalCtx = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 124, type: !71, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "parse_options", scope: !3, file: !3, line: 122, type: !4, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !70)
!3 = !DIFile(filename: "jbig2dec.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7, !10}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "jbig2dec_params_t", file: !3, line: 57, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 51, size: 320, elements: !13)
!13 = !{!14, !22, !23, !24, !46, !47}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !12, file: !3, line: 52, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "jbig2dec_mode", file: !3, line: 42, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 40, baseType: !17, size: 32, elements: !18)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "usage", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "dump", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "render", value: 2, isUnsigned: true)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !12, file: !3, line: 53, baseType: !6, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !12, file: !3, line: 53, baseType: !6, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ctx", scope: !12, file: !3, line: 54, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA1_CTX", file: !27, line: 15, baseType: !28)
!27 = !DIFile(filename: "./sha1.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 11, size: 736, elements: !29)
!29 = !{!30, !36, !40}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !28, file: !27, line: 12, baseType: !31, size: 160)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !34)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 51, baseType: !17)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!34 = !{!35}
!35 = !DISubrange(count: 5)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !28, file: !27, line: 13, baseType: !37, size: 64, offset: 160)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !28, file: !27, line: 14, baseType: !41, size: 512, offset: 224)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 512, elements: !44)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 48, baseType: !43)
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !{!45}
!45 = !DISubrange(count: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "output_file", scope: !12, file: !3, line: 55, baseType: !8, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "output_format", scope: !12, file: !3, line: 56, baseType: !48, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "jbig2dec_format", file: !3, line: 49, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 44, baseType: !17, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "jbig2dec_format_jbig2", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "jbig2dec_format_pbm", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "jbig2dec_format_png", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "jbig2dec_format_none", value: 3, isUnsigned: true)
!55 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !67, globals: !69, nameTableKind: None)
!56 = !{!16, !49, !57, !61}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 34, baseType: !17, size: 32, elements: !59)
!58 = !DIFile(filename: "./jbig2.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!59 = !{!60}
!60 = !DIEnumerator(name: "JBIG2_OPTIONS_EMBEDDED", value: 1, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 27, baseType: !17, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "JBIG2_SEVERITY_DEBUG", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "JBIG2_SEVERITY_INFO", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "JBIG2_SEVERITY_WARNING", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "JBIG2_SEVERITY_FATAL", value: 3, isUnsigned: true)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !{!0}
!70 = !{}
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 2304, elements: !82)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !73, line: 94, size: 256, elements: !74)
!73 = !DIFile(filename: "./getopt.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!74 = !{!75, !78, !79, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !73, line: 97, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !72, file: !73, line: 103, baseType: !6, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !73, line: 104, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !72, file: !73, line: 105, baseType: !6, size: 32, offset: 192)
!82 = !{!83}
!83 = !DISubrange(count: 9)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "jbig2_default_allocator", scope: !86, file: !87, line: 56, type: !112, isLocal: true, isDefinition: true)
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !105, globals: !222, nameTableKind: None)
!87 = !DIFile(filename: "jbig2.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!88 = !{!57, !61, !89, !98}
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 35, baseType: !17, size: 32, elements: !91)
!90 = !DIFile(filename: "./jbig2_priv.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!91 = !{!92, !93, !94, !95, !96, !97}
!92 = !DIEnumerator(name: "JBIG2_FILE_HEADER", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "JBIG2_FILE_SEQUENTIAL_HEADER", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "JBIG2_FILE_SEQUENTIAL_BODY", value: 2, isUnsigned: true)
!95 = !DIEnumerator(name: "JBIG2_FILE_RANDOM_HEADERS", value: 3, isUnsigned: true)
!96 = !DIEnumerator(name: "JBIG2_FILE_RANDOM_BODIES", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "JBIG2_FILE_EOF", value: 5, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 102, baseType: !17, size: 32, elements: !99)
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIEnumerator(name: "JBIG2_PAGE_FREE", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "JBIG2_PAGE_NEW", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "JBIG2_PAGE_COMPLETE", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "JBIG2_PAGE_RETURNED", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "JBIG2_PAGE_RELEASED", value: 4, isUnsigned: true)
!105 = !{!68, !106, !133, !155, !173, !144, !202, !205}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Ctx", file: !58, line: 40, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Ctx", file: !90, line: 44, size: 896, elements: !109)
!109 = !{!110, !130, !132, !135, !142, !143, !146, !147, !148, !149, !151, !152, !153, !154, !168, !169, !170, !171, !172}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !108, file: !90, line: 45, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Allocator", file: !58, line: 39, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Allocator", file: !58, line: 85, size: 192, elements: !114)
!114 = !{!115, !122, !126}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !113, file: !58, line: 86, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!68, !111, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 62, baseType: !121)
!120 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!121 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !113, file: !58, line: 87, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !111, !68}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !113, file: !58, line: 88, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!68, !111, !68, !119}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !108, file: !90, line: 46, baseType: !131, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Options", file: !58, line: 36, baseType: !57)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "global_ctx", scope: !108, file: !90, line: 47, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "error_callback", scope: !108, file: !90, line: 48, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2ErrorCallback", file: !58, line: 75, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!6, !68, !76, !140, !141}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Severity", file: !58, line: 32, baseType: !61)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !33, line: 38, baseType: !6)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "error_callback_data", scope: !108, file: !90, line: 49, baseType: !68, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !108, file: !90, line: 51, baseType: !144, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !90, line: 21, baseType: !42)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !108, file: !90, line: 52, baseType: !119, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "buf_rd_ix", scope: !108, file: !90, line: 53, baseType: !17, size: 32, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "buf_wr_ix", scope: !108, file: !90, line: 54, baseType: !17, size: 32, offset: 480)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !108, file: !90, line: 56, baseType: !150, size: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2FileState", file: !90, line: 42, baseType: !89)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "file_header_flags", scope: !108, file: !90, line: 58, baseType: !42, size: 8, offset: 544)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !108, file: !90, line: 59, baseType: !141, size: 32, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n_segments_max", scope: !108, file: !90, line: 61, baseType: !6, size: 32, offset: 608)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !108, file: !90, line: 62, baseType: !155, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Segment", file: !58, line: 42, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Segment", file: !58, line: 116, size: 384, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !158, file: !58, line: 117, baseType: !32, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !158, file: !58, line: 118, baseType: !42, size: 8, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "page_association", scope: !158, file: !58, line: 119, baseType: !32, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data_length", scope: !158, file: !58, line: 120, baseType: !119, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "referred_to_segment_count", scope: !158, file: !58, line: 121, baseType: !6, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "referred_to_segments", scope: !158, file: !58, line: 122, baseType: !166, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !158, file: !58, line: 123, baseType: !68, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "n_segments", scope: !108, file: !90, line: 63, baseType: !6, size: 32, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "segment_index", scope: !108, file: !90, line: 64, baseType: !6, size: 32, offset: 736)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "current_page", scope: !108, file: !90, line: 68, baseType: !6, size: 32, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "max_page_index", scope: !108, file: !90, line: 69, baseType: !6, size: 32, offset: 800)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !108, file: !90, line: 70, baseType: !173, size: 64, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Page", file: !58, line: 46, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Page", file: !90, line: 110, size: 384, elements: !176)
!176 = !{!177, !179, !180, !181, !182, !183, !184, !187, !189, !190, !191}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !175, file: !90, line: 111, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2PageState", file: !90, line: 108, baseType: !98)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !175, file: !90, line: 112, baseType: !32, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !175, file: !90, line: 113, baseType: !32, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !175, file: !90, line: 113, baseType: !32, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !175, file: !90, line: 114, baseType: !32, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !175, file: !90, line: 115, baseType: !32, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "stripe_size", scope: !175, file: !90, line: 116, baseType: !185, size: 16, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !33, line: 49, baseType: !186)
!186 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "striped", scope: !175, file: !90, line: 117, baseType: !188, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !90, line: 22, baseType: !6)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "end_row", scope: !175, file: !90, line: 118, baseType: !6, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !175, file: !90, line: 119, baseType: !42, size: 8, offset: 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !175, file: !90, line: 120, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Image", file: !58, line: 43, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Image", file: !58, line: 56, size: 256, elements: !195)
!195 = !{!196, !197, !198, !199, !201}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !194, file: !58, line: 57, baseType: !6, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !194, file: !58, line: 57, baseType: !6, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !194, file: !58, line: 57, baseType: !6, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !58, line: 58, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !194, file: !58, line: 59, baseType: !6, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2GlobalCtx", file: !58, line: 41, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2GlobalCtx", file: !58, line: 41, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2WordStreamBuf", file: !87, line: 391, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 387, size: 192, elements: !208)
!208 = !{!209, !218, !221}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "super", scope: !207, file: !87, line: 388, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2WordStream", file: !90, line: 164, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2WordStream", file: !90, line: 166, size: 64, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_word", scope: !211, file: !90, line: 167, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!32, !217, !6}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !87, line: 389, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !207, file: !87, line: 390, baseType: !119, size: 64, offset: 128)
!222 = !{!84}
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "jbig2_mmr_white_decode", scope: !225, file: !226, line: 96, type: !247, isLocal: false, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, globals: !227, nameTableKind: None)
!226 = !DIFile(filename: "jbig2_mmr.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!227 = !{!223, !228, !240, !245}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "jbig2_mmr_black_decode", scope: !225, file: !226, line: 404, type: !230, isLocal: false, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 10240, elements: !238)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "mmr_table_node", file: !226, line: 93, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 90, size: 32, elements: !234)
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !233, file: !226, line: 91, baseType: !236, size: 16)
!236 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "n_bits", scope: !233, file: !226, line: 92, baseType: !236, size: 16, offset: 16)
!238 = !{!239}
!239 = !DISubrange(count: 320)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "lm", scope: !225, file: !226, line: 767, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 64, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 8)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "rm", scope: !225, file: !226, line: 768, type: !242, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 9728, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 304)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "jbig2_arith_Qe", scope: !252, file: !253, line: 217, type: !276, isLocal: false, isDefinition: true)
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !254, globals: !275, nameTableKind: None)
!253 = !DIFile(filename: "jbig2_arith.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!254 = !{!255, !145}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2ArithState", file: !257, line: 19, baseType: !258)
!257 = !DIFile(filename: "./jbig2_arith.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2ArithState", file: !253, line: 38, size: 320, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !274}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !258, file: !253, line: 39, baseType: !32, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !258, file: !253, line: 40, baseType: !6, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "CT", scope: !258, file: !253, line: 42, baseType: !6, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next_word", scope: !258, file: !253, line: 44, baseType: !32, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next_word_bytes", scope: !258, file: !253, line: 45, baseType: !6, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ws", scope: !258, file: !253, line: 47, baseType: !266, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2WordStream", file: !90, line: 164, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2WordStream", file: !90, line: 166, size: 64, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_word", scope: !268, file: !90, line: 167, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!32, !266, !6}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !258, file: !253, line: 48, baseType: !6, size: 32, offset: 256)
!275 = !{!250}
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 1504, elements: !284)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2ArithQe", file: !253, line: 215, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 211, size: 32, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Qe", scope: !279, file: !253, line: 212, baseType: !186, size: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mps_xor", scope: !279, file: !253, line: 213, baseType: !145, size: 8, offset: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lps_xor", scope: !279, file: !253, line: 214, baseType: !145, size: 8, offset: 24)
!284 = !{!285}
!285 = !DISubrange(count: 47)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_A", scope: !288, file: !330, line: 30, type: !422, isLocal: false, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !290, globals: !327, nameTableKind: None)
!289 = !DIFile(filename: "jbig2_huffman.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!290 = !{!291, !68, !309, !315}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2HuffmanState", file: !293, line: 25, baseType: !294)
!293 = !DIFile(filename: "./jbig2_huffman.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2HuffmanState", file: !289, line: 44, size: 192, elements: !295)
!295 = !{!296, !297, !298, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "this_word", scope: !294, file: !289, line: 48, baseType: !32, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next_word", scope: !294, file: !289, line: 49, baseType: !32, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "offset_bits", scope: !294, file: !289, line: 50, baseType: !6, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !294, file: !289, line: 51, baseType: !6, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ws", scope: !294, file: !289, line: 53, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2WordStream", file: !90, line: 164, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2WordStream", file: !90, line: 166, size: 64, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_word", scope: !303, file: !90, line: 167, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!32, !301, !6}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2HuffmanTable", file: !293, line: 26, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2HuffmanTable", file: !293, line: 39, size: 128, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "log_table_size", scope: !311, file: !293, line: 40, baseType: !6, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !311, file: !293, line: 41, baseType: !315, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2HuffmanEntry", file: !293, line: 24, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2HuffmanEntry", file: !293, line: 29, size: 128, elements: !318)
!318 = !{!319, !324, !325, !326}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !317, file: !293, line: 33, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !293, line: 30, size: 64, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "RANGELOW", scope: !320, file: !293, line: 31, baseType: !141, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ext_table", scope: !320, file: !293, line: 32, baseType: !309, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "PREFLEN", scope: !317, file: !293, line: 34, baseType: !145, size: 8, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "RANGELEN", scope: !317, file: !293, line: 35, baseType: !145, size: 8, offset: 72)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !293, line: 36, baseType: !145, size: 8, offset: 80)
!327 = !{!286, !328, !346, !349, !351, !354, !356, !361, !363, !365, !367, !372, !374, !379, !381, !386, !388, !393, !395, !397, !399, !404, !406, !408, !410, !412, !414, !416, !418, !420}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_A", scope: !288, file: !330, line: 39, type: !331, isLocal: false, isDefinition: true)
!330 = !DIFile(filename: "./jbig2_hufftab.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2HuffmanParams", file: !293, line: 27, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2HuffmanParams", file: !293, line: 52, size: 128, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "HTOOB", scope: !333, file: !293, line: 53, baseType: !188, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "n_lines", scope: !333, file: !293, line: 54, baseType: !6, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !333, file: !293, line: 55, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2HuffmanLine", file: !293, line: 44, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2HuffmanLine", file: !293, line: 46, size: 96, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "PREFLEN", scope: !341, file: !293, line: 47, baseType: !6, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "RANGELEN", scope: !341, file: !293, line: 48, baseType: !6, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "RANGELOW", scope: !341, file: !293, line: 49, baseType: !6, size: 32, offset: 64)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_B", scope: !288, file: !330, line: 43, type: !348, isLocal: false, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 768, elements: !243)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_B", scope: !288, file: !330, line: 55, type: !331, isLocal: false, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_C", scope: !288, file: !330, line: 59, type: !353, isLocal: false, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 864, elements: !82)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_C", scope: !288, file: !330, line: 72, type: !331, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_D", scope: !288, file: !330, line: 76, type: !358, isLocal: false, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 672, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 7)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_D", scope: !288, file: !330, line: 87, type: !331, isLocal: false, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_E", scope: !288, file: !330, line: 91, type: !348, isLocal: false, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_E", scope: !288, file: !330, line: 103, type: !331, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_F", scope: !288, file: !330, line: 107, type: !369, isLocal: false, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 1344, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 14)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_F", scope: !288, file: !330, line: 125, type: !331, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_G", scope: !288, file: !330, line: 129, type: !376, isLocal: false, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 1440, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 15)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_G", scope: !288, file: !330, line: 148, type: !331, isLocal: false, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_H", scope: !288, file: !330, line: 152, type: !383, isLocal: false, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 2016, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 21)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_H", scope: !288, file: !330, line: 177, type: !331, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_I", scope: !288, file: !330, line: 181, type: !390, isLocal: false, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 2112, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 22)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_I", scope: !288, file: !330, line: 207, type: !331, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_J", scope: !288, file: !330, line: 211, type: !383, isLocal: false, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_J", scope: !288, file: !330, line: 236, type: !331, isLocal: false, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_K", scope: !288, file: !330, line: 240, type: !401, isLocal: false, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 1248, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 13)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_K", scope: !288, file: !330, line: 257, type: !331, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_L", scope: !288, file: !330, line: 261, type: !401, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_L", scope: !288, file: !330, line: 278, type: !331, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_M", scope: !288, file: !330, line: 283, type: !401, isLocal: false, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_M", scope: !288, file: !330, line: 300, type: !331, isLocal: false, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_N", scope: !288, file: !330, line: 304, type: !358, isLocal: false, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_N", scope: !288, file: !330, line: 315, type: !331, isLocal: false, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "jbig2_huffman_lines_O", scope: !288, file: !330, line: 319, type: !401, isLocal: false, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "jbig2_huffman_params_O", scope: !288, file: !330, line: 336, type: !331, isLocal: false, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 480, elements: !34)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !425, nameTableKind: None)
!424 = !DIFile(filename: "sha1.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!425 = !{!426, !43, !200, !42}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR64LONG16", scope: !428, file: !424, line: 135, baseType: !433)
!428 = distinct !DISubprogram(name: "SHA1_Transform", scope: !424, file: !424, line: 129, type: !429, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !423, retainedNodes: !70)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !166, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!433 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !428, file: !424, line: 132, size: 512, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !433, file: !424, line: 133, baseType: !41, size: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !433, file: !424, line: 134, baseType: !437, size: 512)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 16)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !442, retainedTypes: !450, nameTableKind: None)
!441 = !DIFile(filename: "jbig2_segment.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!442 = !{!57, !61, !89, !98, !443}
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 128, baseType: !17, size: 32, elements: !444)
!444 = !{!445, !446, !447, !448, !449}
!445 = !DIEnumerator(name: "JBIG2_COMPOSE_OR", value: 0, isUnsigned: true)
!446 = !DIEnumerator(name: "JBIG2_COMPOSE_AND", value: 1, isUnsigned: true)
!447 = !DIEnumerator(name: "JBIG2_COMPOSE_XOR", value: 2, isUnsigned: true)
!448 = !DIEnumerator(name: "JBIG2_COMPOSE_XNOR", value: 3, isUnsigned: true)
!449 = !DIEnumerator(name: "JBIG2_COMPOSE_REPLACE", value: 4, isUnsigned: true)
!450 = !{!451, !68}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Segment", file: !58, line: 42, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Segment", file: !58, line: 116, size: 384, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !453, file: !58, line: 117, baseType: !32, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !453, file: !58, line: 118, baseType: !42, size: 8, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "page_association", scope: !453, file: !58, line: 119, baseType: !32, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data_length", scope: !453, file: !58, line: 120, baseType: !119, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "referred_to_segment_count", scope: !453, file: !58, line: 121, baseType: !6, size: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "referred_to_segments", scope: !453, file: !58, line: 122, baseType: !166, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !453, file: !58, line: 123, baseType: !68, size: 64, offset: 320)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !442, retainedTypes: !67, nameTableKind: None)
!463 = !DIFile(filename: "jbig2_page.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !466, retainedTypes: !474, nameTableKind: None)
!465 = !DIFile(filename: "jbig2_symbol_dict.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!466 = !{!57, !61, !89, !98, !443, !467}
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !468, line: 23, baseType: !17, size: 32, elements: !469)
!468 = !DIFile(filename: "./jbig2_text.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!469 = !{!470, !471, !472, !473}
!470 = !DIEnumerator(name: "JBIG2_CORNER_BOTTOMLEFT", value: 0, isUnsigned: true)
!471 = !DIEnumerator(name: "JBIG2_CORNER_TOPLEFT", value: 1, isUnsigned: true)
!472 = !DIEnumerator(name: "JBIG2_CORNER_BOTTOMRIGHT", value: 2, isUnsigned: true)
!473 = !DIEnumerator(name: "JBIG2_CORNER_TOPRIGHT", value: 3, isUnsigned: true)
!474 = !{!475, !68, !482, !492, !141, !6, !493, !497}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2SymbolDict", file: !477, line: 25, baseType: !478)
!477 = !DIFile(filename: "./jbig2_symbol_dict.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 22, size: 128, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "n_symbols", scope: !478, file: !477, line: 23, baseType: !6, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !478, file: !477, line: 24, baseType: !482, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Image", file: !58, line: 43, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Image", file: !58, line: 56, size: 256, elements: !486)
!486 = !{!487, !488, !489, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !485, file: !58, line: 57, baseType: !6, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !485, file: !58, line: 57, baseType: !6, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !485, file: !58, line: 57, baseType: !6, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !58, line: 58, baseType: !200, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !485, file: !58, line: 59, baseType: !6, size: 32, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2WordStream", file: !90, line: 164, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2WordStream", file: !90, line: 166, size: 64, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_word", scope: !499, file: !90, line: 167, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!32, !497, !6}
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !466, retainedTypes: !507, nameTableKind: None)
!506 = !DIFile(filename: "jbig2_text.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!507 = !{!68, !80, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2SymbolDict", file: !477, line: 25, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 22, size: 128, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "n_symbols", scope: !513, file: !477, line: 23, baseType: !6, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !513, file: !477, line: 24, baseType: !517, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Image", file: !58, line: 43, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Image", file: !58, line: 56, size: 256, elements: !521)
!521 = !{!522, !523, !524, !525, !526}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !520, file: !58, line: 57, baseType: !6, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !520, file: !58, line: 57, baseType: !6, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !520, file: !58, line: 57, baseType: !6, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !520, file: !58, line: 58, baseType: !200, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !520, file: !58, line: 59, baseType: !6, size: 32, offset: 192)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !442, retainedTypes: !529, nameTableKind: None)
!528 = !DIFile(filename: "jbig2_generic.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!529 = !{!144}
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !442, retainedTypes: !67, nameTableKind: None)
!531 = !DIFile(filename: "jbig2_refinement.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !442, retainedTypes: !534, nameTableKind: None)
!533 = !DIFile(filename: "jbig2_image.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!534 = !{!535, !68, !200}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Image", file: !58, line: 43, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Image", file: !58, line: 56, size: 256, elements: !538)
!538 = !{!539, !540, !541, !542, !543}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !537, file: !58, line: 57, baseType: !6, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !537, file: !58, line: 57, baseType: !6, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !537, file: !58, line: 57, baseType: !6, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !58, line: 58, baseType: !200, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !537, file: !58, line: 59, baseType: !6, size: 32, offset: 192)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !546, retainedTypes: !562, nameTableKind: None)
!545 = !DIFile(filename: "jbig2_image_pbm.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!546 = !{!547}
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !548, line: 46, baseType: !17, size: 32, elements: !549)
!548 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561}
!550 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!551 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!552 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!553 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!554 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!555 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!556 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!557 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!558 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!559 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!560 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!561 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!562 = !{!68, !6, !186}
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !565, retainedTypes: !571, nameTableKind: None)
!564 = !DIFile(filename: "jbig2_metadata.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!565 = !{!566, !57, !61, !89, !98}
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !567, line: 26, baseType: !17, size: 32, elements: !568)
!567 = !DIFile(filename: "./jbig2_metadata.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!568 = !{!569, !570}
!569 = !DIEnumerator(name: "JBIG2_ENCODING_ASCII", value: 0, isUnsigned: true)
!570 = !DIEnumerator(name: "JBIG2_ENCODING_UCS16", value: 1, isUnsigned: true)
!571 = !{!68, !8}
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !574, nameTableKind: None)
!573 = !DIFile(filename: "jbig2_arith_int.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2ArithIntCtx", file: !577, line: 19, baseType: !578)
!577 = !DIFile(filename: "./jbig2_arith_int.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2ArithIntCtx", file: !573, line: 37, size: 4096, elements: !579)
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "IAx", scope: !578, file: !573, line: 38, baseType: !581, size: 4096)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 4096, elements: !583)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2ArithCx", file: !257, line: 24, baseType: !43)
!583 = !{!584}
!584 = !DISubrange(count: 512)
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !587, nameTableKind: None)
!586 = !DIFile(filename: "jbig2_arith_iaid.c", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2ArithIaidCtx", file: !590, line: 19, baseType: !591)
!590 = !DIFile(filename: "./jbig2_arith_iaid.h", directory: "/root/llvm/codesample/39apps/ghostscript-8.64/jbig2dec")
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2ArithIaidCtx", file: !586, line: 41, size: 128, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "SBSYMCODELEN", scope: !591, file: !586, line: 42, baseType: !6, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "IAIDx", scope: !591, file: !586, line: 43, baseType: !595, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!596 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)"}
!597 = !{i32 2, !"Dwarf Version", i32 4}
!598 = !{i32 2, !"Debug Info Version", i32 3}
!599 = !{i32 1, !"wchar_size", i32 4}
!600 = !{i32 1, !"ThinLTO", i32 0}
!601 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!602 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 369, type: !603, scopeLine: 370, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !70)
!603 = !DISubroutineType(types: !604)
!604 = !{!6, !6, !7}
!605 = !DILocalVariable(name: "argc", arg: 1, scope: !602, file: !3, line: 369, type: !6)
!606 = !DILocation(line: 369, column: 11, scope: !602)
!607 = !DILocalVariable(name: "argv", arg: 2, scope: !602, file: !3, line: 369, type: !7)
!608 = !DILocation(line: 369, column: 24, scope: !602)
!609 = !DILocalVariable(name: "f", scope: !602, file: !3, line: 371, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !612, line: 48, baseType: !613)
!612 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !614, line: 241, size: 1728, elements: !615)
!614 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !636, !637, !638, !639, !643, !644, !646, !650, !653, !655, !656, !657, !658, !659, !660, !661}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !613, file: !614, line: 242, baseType: !6, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !613, file: !614, line: 247, baseType: !8, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !613, file: !614, line: 248, baseType: !8, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !613, file: !614, line: 249, baseType: !8, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !613, file: !614, line: 250, baseType: !8, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !613, file: !614, line: 251, baseType: !8, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !613, file: !614, line: 252, baseType: !8, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !613, file: !614, line: 253, baseType: !8, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !613, file: !614, line: 254, baseType: !8, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !613, file: !614, line: 256, baseType: !8, size: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !613, file: !614, line: 257, baseType: !8, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !613, file: !614, line: 258, baseType: !8, size: 64, offset: 704)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !613, file: !614, line: 260, baseType: !629, size: 64, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !614, line: 156, size: 192, elements: !631)
!631 = !{!632, !633, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !630, file: !614, line: 157, baseType: !629, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !630, file: !614, line: 158, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !630, file: !614, line: 162, baseType: !6, size: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !613, file: !614, line: 262, baseType: !634, size: 64, offset: 832)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !613, file: !614, line: 264, baseType: !6, size: 32, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !613, file: !614, line: 268, baseType: !6, size: 32, offset: 928)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !613, file: !614, line: 270, baseType: !640, size: 64, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !641, line: 131, baseType: !642)
!641 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!642 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !613, file: !614, line: 274, baseType: !186, size: 16, offset: 1024)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !613, file: !614, line: 275, baseType: !645, size: 8, offset: 1040)
!645 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !613, file: !614, line: 276, baseType: !647, size: 8, offset: 1048)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 1)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !613, file: !614, line: 280, baseType: !651, size: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !614, line: 150, baseType: null)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !613, file: !614, line: 289, baseType: !654, size: 64, offset: 1152)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !641, line: 132, baseType: !642)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !613, file: !614, line: 297, baseType: !68, size: 64, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !613, file: !614, line: 298, baseType: !68, size: 64, offset: 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !613, file: !614, line: 299, baseType: !68, size: 64, offset: 1344)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !613, file: !614, line: 300, baseType: !68, size: 64, offset: 1408)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !613, file: !614, line: 302, baseType: !119, size: 64, offset: 1472)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !613, file: !614, line: 303, baseType: !6, size: 32, offset: 1536)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !613, file: !614, line: 305, baseType: !662, size: 160, offset: 1568)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 20)
!665 = !DILocation(line: 371, column: 9, scope: !602)
!666 = !DILocalVariable(name: "f_page", scope: !602, file: !3, line: 371, type: !610)
!667 = !DILocation(line: 371, column: 20, scope: !602)
!668 = !DILocalVariable(name: "ctx", scope: !602, file: !3, line: 372, type: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Ctx", file: !58, line: 40, baseType: !671)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Ctx", file: !58, line: 40, flags: DIFlagFwdDecl)
!672 = !DILocation(line: 372, column: 13, scope: !602)
!673 = !DILocalVariable(name: "buf", scope: !602, file: !3, line: 373, type: !674)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32768, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 4096)
!677 = !DILocation(line: 373, column: 11, scope: !602)
!678 = !DILocalVariable(name: "params", scope: !602, file: !3, line: 374, type: !11)
!679 = !DILocation(line: 374, column: 21, scope: !602)
!680 = !DILocalVariable(name: "filearg", scope: !602, file: !3, line: 375, type: !6)
!681 = !DILocation(line: 375, column: 7, scope: !602)
!682 = !DILocation(line: 378, column: 10, scope: !602)
!683 = !DILocation(line: 378, column: 15, scope: !602)
!684 = !DILocation(line: 379, column: 10, scope: !602)
!685 = !DILocation(line: 379, column: 18, scope: !602)
!686 = !DILocation(line: 380, column: 10, scope: !602)
!687 = !DILocation(line: 380, column: 15, scope: !602)
!688 = !DILocation(line: 381, column: 10, scope: !602)
!689 = !DILocation(line: 381, column: 22, scope: !602)
!690 = !DILocation(line: 382, column: 10, scope: !602)
!691 = !DILocation(line: 382, column: 24, scope: !602)
!692 = !DILocation(line: 384, column: 27, scope: !602)
!693 = !DILocation(line: 384, column: 33, scope: !602)
!694 = !DILocation(line: 384, column: 13, scope: !602)
!695 = !DILocation(line: 384, column: 11, scope: !602)
!696 = !DILocation(line: 386, column: 14, scope: !697)
!697 = distinct !DILexicalBlock(scope: !602, file: !3, line: 386, column: 7)
!698 = !DILocation(line: 386, column: 7, scope: !697)
!699 = !DILocation(line: 386, column: 7, scope: !602)
!700 = !DILocation(line: 386, column: 20, scope: !697)
!701 = !DILocation(line: 388, column: 18, scope: !602)
!702 = !DILocation(line: 388, column: 3, scope: !602)
!703 = !DILocation(line: 390, column: 9, scope: !704)
!704 = distinct !DILexicalBlock(scope: !602, file: !3, line: 388, column: 24)
!705 = !DILocation(line: 391, column: 9, scope: !704)
!706 = !DILocation(line: 394, column: 17, scope: !704)
!707 = !DILocation(line: 394, column: 9, scope: !704)
!708 = !DILocation(line: 395, column: 9, scope: !704)
!709 = !DILocation(line: 398, column: 8, scope: !710)
!710 = distinct !DILexicalBlock(scope: !704, file: !3, line: 398, column: 7)
!711 = !DILocation(line: 398, column: 15, scope: !710)
!712 = !DILocation(line: 398, column: 13, scope: !710)
!713 = !DILocation(line: 398, column: 24, scope: !710)
!714 = !DILocation(line: 398, column: 7, scope: !704)
!715 = !DILocalVariable(name: "fn", scope: !716, file: !3, line: 401, type: !8)
!716 = distinct !DILexicalBlock(scope: !710, file: !3, line: 400, column: 5)
!717 = !DILocation(line: 401, column: 13, scope: !716)
!718 = !DILocation(line: 401, column: 18, scope: !716)
!719 = !DILocation(line: 401, column: 23, scope: !716)
!720 = !DILocation(line: 403, column: 17, scope: !716)
!721 = !DILocation(line: 403, column: 11, scope: !716)
!722 = !DILocation(line: 403, column: 9, scope: !716)
!723 = !DILocation(line: 404, column: 11, scope: !724)
!724 = distinct !DILexicalBlock(scope: !716, file: !3, line: 404, column: 11)
!725 = !DILocation(line: 404, column: 13, scope: !724)
!726 = !DILocation(line: 404, column: 11, scope: !716)
!727 = !DILocation(line: 406, column: 12, scope: !728)
!728 = distinct !DILexicalBlock(scope: !724, file: !3, line: 405, column: 2)
!729 = !DILocation(line: 406, column: 42, scope: !728)
!730 = !DILocation(line: 406, column: 4, scope: !728)
!731 = !DILocation(line: 407, column: 4, scope: !728)
!732 = !DILocation(line: 409, column: 5, scope: !716)
!733 = !DILocation(line: 410, column: 13, scope: !734)
!734 = distinct !DILexicalBlock(scope: !710, file: !3, line: 410, column: 12)
!735 = !DILocation(line: 410, column: 20, scope: !734)
!736 = !DILocation(line: 410, column: 18, scope: !734)
!737 = !DILocation(line: 410, column: 29, scope: !734)
!738 = !DILocation(line: 410, column: 12, scope: !710)
!739 = !DILocalVariable(name: "fn", scope: !740, file: !3, line: 413, type: !8)
!740 = distinct !DILexicalBlock(scope: !734, file: !3, line: 412, column: 5)
!741 = !DILocation(line: 413, column: 13, scope: !740)
!742 = !DILocation(line: 413, column: 18, scope: !740)
!743 = !DILocation(line: 413, column: 23, scope: !740)
!744 = !DILocalVariable(name: "fn_page", scope: !740, file: !3, line: 414, type: !8)
!745 = !DILocation(line: 414, column: 13, scope: !740)
!746 = !DILocation(line: 414, column: 23, scope: !740)
!747 = !DILocation(line: 414, column: 28, scope: !740)
!748 = !DILocation(line: 414, column: 35, scope: !740)
!749 = !DILocation(line: 416, column: 17, scope: !740)
!750 = !DILocation(line: 416, column: 11, scope: !740)
!751 = !DILocation(line: 416, column: 9, scope: !740)
!752 = !DILocation(line: 417, column: 11, scope: !753)
!753 = distinct !DILexicalBlock(scope: !740, file: !3, line: 417, column: 11)
!754 = !DILocation(line: 417, column: 13, scope: !753)
!755 = !DILocation(line: 417, column: 11, scope: !740)
!756 = !DILocation(line: 419, column: 12, scope: !757)
!757 = distinct !DILexicalBlock(scope: !753, file: !3, line: 418, column: 2)
!758 = !DILocation(line: 419, column: 42, scope: !757)
!759 = !DILocation(line: 419, column: 4, scope: !757)
!760 = !DILocation(line: 420, column: 4, scope: !757)
!761 = !DILocation(line: 423, column: 22, scope: !740)
!762 = !DILocation(line: 423, column: 16, scope: !740)
!763 = !DILocation(line: 423, column: 14, scope: !740)
!764 = !DILocation(line: 424, column: 11, scope: !765)
!765 = distinct !DILexicalBlock(scope: !740, file: !3, line: 424, column: 11)
!766 = !DILocation(line: 424, column: 18, scope: !765)
!767 = !DILocation(line: 424, column: 11, scope: !740)
!768 = !DILocation(line: 426, column: 12, scope: !769)
!769 = distinct !DILexicalBlock(scope: !765, file: !3, line: 425, column: 2)
!770 = !DILocation(line: 426, column: 42, scope: !769)
!771 = !DILocation(line: 426, column: 4, scope: !769)
!772 = !DILocation(line: 427, column: 4, scope: !769)
!773 = !DILocation(line: 429, column: 5, scope: !740)
!774 = !DILocation(line: 432, column: 12, scope: !734)
!775 = !DILocation(line: 432, column: 5, scope: !734)
!776 = !DILocation(line: 434, column: 29, scope: !704)
!777 = !DILocation(line: 434, column: 36, scope: !704)
!778 = !DILocation(line: 436, column: 25, scope: !704)
!779 = !DILocation(line: 434, column: 9, scope: !704)
!780 = !DILocation(line: 434, column: 7, scope: !704)
!781 = !DILocation(line: 439, column: 3, scope: !704)
!782 = !DILocalVariable(name: "n_bytes", scope: !783, file: !3, line: 441, type: !6)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 440, column: 5)
!784 = distinct !DILexicalBlock(scope: !785, file: !3, line: 439, column: 3)
!785 = distinct !DILexicalBlock(scope: !704, file: !3, line: 439, column: 3)
!786 = !DILocation(line: 441, column: 11, scope: !783)
!787 = !DILocation(line: 441, column: 27, scope: !783)
!788 = !DILocation(line: 441, column: 48, scope: !783)
!789 = !DILocation(line: 441, column: 21, scope: !783)
!790 = !DILocation(line: 442, column: 11, scope: !791)
!791 = distinct !DILexicalBlock(scope: !783, file: !3, line: 442, column: 11)
!792 = !DILocation(line: 442, column: 19, scope: !791)
!793 = !DILocation(line: 442, column: 11, scope: !783)
!794 = !DILocation(line: 443, column: 2, scope: !791)
!795 = !DILocation(line: 444, column: 21, scope: !783)
!796 = !DILocation(line: 444, column: 26, scope: !783)
!797 = !DILocation(line: 444, column: 31, scope: !783)
!798 = !DILocation(line: 444, column: 7, scope: !783)
!799 = !DILocation(line: 439, column: 3, scope: !784)
!800 = distinct !{!800, !801, !802}
!801 = !DILocation(line: 439, column: 3, scope: !785)
!802 = !DILocation(line: 445, column: 5, scope: !785)
!803 = !DILocation(line: 446, column: 10, scope: !704)
!804 = !DILocation(line: 446, column: 3, scope: !704)
!805 = !DILocation(line: 449, column: 7, scope: !806)
!806 = distinct !DILexicalBlock(scope: !704, file: !3, line: 449, column: 7)
!807 = !DILocation(line: 449, column: 14, scope: !806)
!808 = !DILocation(line: 449, column: 7, scope: !704)
!809 = !DILocalVariable(name: "global_ctx", scope: !810, file: !3, line: 451, type: !202)
!810 = distinct !DILexicalBlock(scope: !806, file: !3, line: 450, column: 5)
!811 = !DILocation(line: 451, column: 23, scope: !810)
!812 = !DILocation(line: 451, column: 58, scope: !810)
!813 = !DILocation(line: 451, column: 36, scope: !810)
!814 = !DILocation(line: 452, column: 57, scope: !810)
!815 = !DILocation(line: 453, column: 21, scope: !810)
!816 = !DILocation(line: 452, column: 13, scope: !810)
!817 = !DILocation(line: 452, column: 11, scope: !810)
!818 = !DILocation(line: 454, column: 7, scope: !810)
!819 = !DILocalVariable(name: "n_bytes", scope: !820, file: !3, line: 456, type: !6)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 455, column: 2)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 454, column: 7)
!822 = distinct !DILexicalBlock(scope: !810, file: !3, line: 454, column: 7)
!823 = !DILocation(line: 456, column: 8, scope: !820)
!824 = !DILocation(line: 456, column: 24, scope: !820)
!825 = !DILocation(line: 456, column: 45, scope: !820)
!826 = !DILocation(line: 456, column: 18, scope: !820)
!827 = !DILocation(line: 457, column: 8, scope: !828)
!828 = distinct !DILexicalBlock(scope: !820, file: !3, line: 457, column: 8)
!829 = !DILocation(line: 457, column: 16, scope: !828)
!830 = !DILocation(line: 457, column: 8, scope: !820)
!831 = !DILocation(line: 458, column: 6, scope: !828)
!832 = !DILocation(line: 459, column: 18, scope: !820)
!833 = !DILocation(line: 459, column: 23, scope: !820)
!834 = !DILocation(line: 459, column: 28, scope: !820)
!835 = !DILocation(line: 459, column: 4, scope: !820)
!836 = !DILocation(line: 454, column: 7, scope: !821)
!837 = distinct !{!837, !838, !839}
!838 = !DILocation(line: 454, column: 7, scope: !822)
!839 = !DILocation(line: 460, column: 2, scope: !822)
!840 = !DILocation(line: 461, column: 14, scope: !810)
!841 = !DILocation(line: 461, column: 7, scope: !810)
!842 = !DILocation(line: 462, column: 29, scope: !810)
!843 = !DILocation(line: 462, column: 7, scope: !810)
!844 = !DILocation(line: 463, column: 5, scope: !810)
!845 = !DILocalVariable(name: "image", scope: !846, file: !3, line: 467, type: !847)
!846 = distinct !DILexicalBlock(scope: !704, file: !3, line: 466, column: 3)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "Jbig2Image", file: !58, line: 43, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Jbig2Image", file: !58, line: 56, size: 256, elements: !850)
!850 = !{!851, !852, !853, !854, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !849, file: !58, line: 57, baseType: !6, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !849, file: !58, line: 57, baseType: !6, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !849, file: !58, line: 57, baseType: !6, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !849, file: !58, line: 58, baseType: !200, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !849, file: !58, line: 59, baseType: !6, size: 32, offset: 192)
!856 = !DILocation(line: 467, column: 17, scope: !846)
!857 = !DILocation(line: 470, column: 9, scope: !858)
!858 = distinct !DILexicalBlock(scope: !846, file: !3, line: 470, column: 9)
!859 = !DILocation(line: 470, column: 16, scope: !858)
!860 = !DILocation(line: 470, column: 9, scope: !846)
!861 = !DILocation(line: 471, column: 27, scope: !858)
!862 = !DILocation(line: 471, column: 7, scope: !858)
!863 = !DILocation(line: 473, column: 16, scope: !864)
!864 = distinct !DILexicalBlock(scope: !846, file: !3, line: 473, column: 9)
!865 = !DILocation(line: 473, column: 28, scope: !864)
!866 = !DILocation(line: 473, column: 9, scope: !846)
!867 = !DILocation(line: 479, column: 51, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !3, line: 474, column: 7)
!869 = !DILocation(line: 479, column: 56, scope: !868)
!870 = !DILocation(line: 479, column: 30, scope: !868)
!871 = !DILocation(line: 479, column: 16, scope: !868)
!872 = !DILocation(line: 479, column: 28, scope: !868)
!873 = !DILocation(line: 480, column: 16, scope: !868)
!874 = !DILocation(line: 480, column: 30, scope: !868)
!875 = !DILocation(line: 482, column: 7, scope: !868)
!876 = !DILocalVariable(name: "len", scope: !877, file: !3, line: 483, type: !6)
!877 = distinct !DILexicalBlock(scope: !864, file: !3, line: 482, column: 14)
!878 = !DILocation(line: 483, column: 13, scope: !877)
!879 = !DILocation(line: 483, column: 33, scope: !877)
!880 = !DILocation(line: 483, column: 19, scope: !877)
!881 = !DILocation(line: 484, column: 14, scope: !882)
!882 = distinct !DILexicalBlock(scope: !877, file: !3, line: 484, column: 13)
!883 = !DILocation(line: 484, column: 18, scope: !882)
!884 = !DILocation(line: 484, column: 24, scope: !882)
!885 = !DILocation(line: 484, column: 35, scope: !882)
!886 = !DILocation(line: 484, column: 49, scope: !882)
!887 = !DILocation(line: 484, column: 13, scope: !877)
!888 = !DILocation(line: 486, column: 45, scope: !882)
!889 = !DILocation(line: 486, column: 59, scope: !882)
!890 = !DILocation(line: 486, column: 57, scope: !882)
!891 = !DILocation(line: 486, column: 63, scope: !882)
!892 = !DILocation(line: 486, column: 11, scope: !882)
!893 = !DILocation(line: 490, column: 5, scope: !846)
!894 = !DILocation(line: 490, column: 36, scope: !846)
!895 = !DILocation(line: 490, column: 21, scope: !846)
!896 = !DILocation(line: 490, column: 19, scope: !846)
!897 = !DILocation(line: 490, column: 42, scope: !846)
!898 = !DILocation(line: 491, column: 33, scope: !899)
!899 = distinct !DILexicalBlock(scope: !846, file: !3, line: 490, column: 51)
!900 = !DILocation(line: 491, column: 7, scope: !899)
!901 = !DILocation(line: 492, column: 18, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !3, line: 492, column: 11)
!903 = !DILocation(line: 492, column: 11, scope: !902)
!904 = !DILocation(line: 492, column: 11, scope: !899)
!905 = !DILocation(line: 492, column: 44, scope: !902)
!906 = !DILocation(line: 492, column: 24, scope: !902)
!907 = !DILocation(line: 493, column: 26, scope: !899)
!908 = !DILocation(line: 493, column: 31, scope: !899)
!909 = !DILocation(line: 493, column: 7, scope: !899)
!910 = distinct !{!910, !893, !911}
!911 = !DILocation(line: 494, column: 5, scope: !846)
!912 = !DILocation(line: 495, column: 16, scope: !913)
!913 = distinct !DILexicalBlock(scope: !846, file: !3, line: 495, column: 9)
!914 = !DILocation(line: 495, column: 9, scope: !913)
!915 = !DILocation(line: 495, column: 9, scope: !846)
!916 = !DILocation(line: 495, column: 22, scope: !913)
!917 = !DILocation(line: 498, column: 18, scope: !704)
!918 = !DILocation(line: 498, column: 3, scope: !704)
!919 = !DILocation(line: 500, column: 3, scope: !704)
!920 = !DILocation(line: 502, column: 14, scope: !921)
!921 = distinct !DILexicalBlock(scope: !602, file: !3, line: 502, column: 7)
!922 = !DILocation(line: 502, column: 7, scope: !921)
!923 = !DILocation(line: 502, column: 7, scope: !602)
!924 = !DILocation(line: 502, column: 39, scope: !921)
!925 = !DILocation(line: 502, column: 27, scope: !921)
!926 = !DILocation(line: 503, column: 14, scope: !927)
!927 = distinct !DILexicalBlock(scope: !602, file: !3, line: 503, column: 7)
!928 = !DILocation(line: 503, column: 7, scope: !927)
!929 = !DILocation(line: 503, column: 7, scope: !602)
!930 = !DILocation(line: 503, column: 20, scope: !927)
!931 = !DILocation(line: 506, column: 3, scope: !602)
!932 = !DILocation(line: 507, column: 1, scope: !602)
!933 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 122, type: !6)
!934 = !DILocation(line: 122, column: 19, scope: !2)
!935 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 122, type: !7)
!936 = !DILocation(line: 122, column: 31, scope: !2)
!937 = !DILocalVariable(name: "params", arg: 3, scope: !2, file: !3, line: 122, type: !10)
!938 = !DILocation(line: 122, column: 58, scope: !2)
!939 = !DILocalVariable(name: "option_idx", scope: !2, file: !3, line: 135, type: !6)
!940 = !DILocation(line: 135, column: 6, scope: !2)
!941 = !DILocalVariable(name: "option", scope: !2, file: !3, line: 136, type: !6)
!942 = !DILocation(line: 136, column: 6, scope: !2)
!943 = !DILocation(line: 138, column: 2, scope: !2)
!944 = !DILocation(line: 139, column: 24, scope: !945)
!945 = distinct !DILexicalBlock(scope: !2, file: !3, line: 138, column: 12)
!946 = !DILocation(line: 139, column: 30, scope: !945)
!947 = !DILocation(line: 139, column: 12, scope: !945)
!948 = !DILocation(line: 139, column: 10, scope: !945)
!949 = !DILocation(line: 141, column: 7, scope: !950)
!950 = distinct !DILexicalBlock(scope: !945, file: !3, line: 141, column: 7)
!951 = !DILocation(line: 141, column: 14, scope: !950)
!952 = !DILocation(line: 141, column: 7, scope: !945)
!953 = !DILocation(line: 141, column: 21, scope: !950)
!954 = !DILocation(line: 143, column: 11, scope: !945)
!955 = !DILocation(line: 143, column: 3, scope: !945)
!956 = !DILocation(line: 145, column: 10, scope: !957)
!957 = distinct !DILexicalBlock(scope: !958, file: !3, line: 145, column: 9)
!958 = distinct !DILexicalBlock(scope: !945, file: !3, line: 143, column: 19)
!959 = !DILocation(line: 145, column: 18, scope: !957)
!960 = !DILocation(line: 145, column: 9, scope: !958)
!961 = !DILocation(line: 145, column: 35, scope: !957)
!962 = !DILocation(line: 147, column: 19, scope: !957)
!963 = !DILocation(line: 147, column: 6, scope: !957)
!964 = !DILocation(line: 147, column: 31, scope: !957)
!965 = !DILocation(line: 145, column: 27, scope: !957)
!966 = !DILocation(line: 148, column: 6, scope: !958)
!967 = !DILocation(line: 150, column: 5, scope: !958)
!968 = !DILocation(line: 150, column: 13, scope: !958)
!969 = !DILocation(line: 150, column: 21, scope: !958)
!970 = !DILocation(line: 151, column: 5, scope: !958)
!971 = !DILocation(line: 153, column: 37, scope: !972)
!972 = distinct !DILexicalBlock(scope: !958, file: !3, line: 153, column: 37)
!973 = !DILocation(line: 153, column: 37, scope: !958)
!974 = !DILocation(line: 153, column: 68, scope: !972)
!975 = !DILocation(line: 153, column: 63, scope: !972)
!976 = !DILocation(line: 153, column: 45, scope: !972)
!977 = !DILocation(line: 153, column: 53, scope: !972)
!978 = !DILocation(line: 153, column: 61, scope: !972)
!979 = !DILocation(line: 154, column: 38, scope: !972)
!980 = !DILocation(line: 154, column: 46, scope: !972)
!981 = !DILocation(line: 154, column: 54, scope: !972)
!982 = !DILocation(line: 155, column: 33, scope: !958)
!983 = !DILocation(line: 158, column: 5, scope: !958)
!984 = !DILocation(line: 158, column: 13, scope: !958)
!985 = !DILocation(line: 158, column: 18, scope: !958)
!986 = !DILocation(line: 159, column: 33, scope: !958)
!987 = !DILocation(line: 163, column: 33, scope: !958)
!988 = !DILocation(line: 164, column: 33, scope: !958)
!989 = !DILocation(line: 167, column: 5, scope: !958)
!990 = !DILocation(line: 167, column: 13, scope: !958)
!991 = !DILocation(line: 167, column: 17, scope: !958)
!992 = !DILocation(line: 168, column: 5, scope: !958)
!993 = !DILocation(line: 170, column: 33, scope: !958)
!994 = !DILocation(line: 170, column: 41, scope: !958)
!995 = !DILocation(line: 170, column: 46, scope: !958)
!996 = !DILocation(line: 171, column: 33, scope: !958)
!997 = !DILocation(line: 173, column: 34, scope: !958)
!998 = !DILocation(line: 173, column: 27, scope: !958)
!999 = !DILocation(line: 173, column: 5, scope: !958)
!1000 = !DILocation(line: 173, column: 13, scope: !958)
!1001 = !DILocation(line: 173, column: 25, scope: !958)
!1002 = !DILocation(line: 174, column: 5, scope: !958)
!1003 = !DILocation(line: 176, column: 44, scope: !958)
!1004 = !DILocation(line: 176, column: 52, scope: !958)
!1005 = !DILocation(line: 176, column: 26, scope: !958)
!1006 = !DILocation(line: 177, column: 33, scope: !958)
!1007 = !DILocation(line: 179, column: 10, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !958, file: !3, line: 179, column: 9)
!1009 = !DILocation(line: 179, column: 18, scope: !1008)
!1010 = !DILocation(line: 179, column: 9, scope: !958)
!1011 = !DILocation(line: 179, column: 35, scope: !1008)
!1012 = !DILocation(line: 180, column: 36, scope: !1008)
!1013 = !DILocation(line: 179, column: 27, scope: !1008)
!1014 = !DILocation(line: 181, column: 5, scope: !958)
!1015 = distinct !{!1015, !943, !1016}
!1016 = !DILocation(line: 183, column: 2, scope: !2)
!1017 = !DILocation(line: 184, column: 10, scope: !2)
!1018 = !DILocation(line: 184, column: 2, scope: !2)
!1019 = distinct !DISubprogram(name: "hash_init", scope: !3, file: !3, line: 64, type: !1020, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !70)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !10}
!1022 = !DILocalVariable(name: "params", arg: 1, scope: !1019, file: !3, line: 64, type: !10)
!1023 = !DILocation(line: 64, column: 30, scope: !1019)
!1024 = !DILocation(line: 66, column: 24, scope: !1019)
!1025 = !DILocation(line: 66, column: 5, scope: !1019)
!1026 = !DILocation(line: 66, column: 13, scope: !1019)
!1027 = !DILocation(line: 66, column: 22, scope: !1019)
!1028 = !DILocation(line: 67, column: 9, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 67, column: 9)
!1030 = !DILocation(line: 67, column: 17, scope: !1029)
!1031 = !DILocation(line: 67, column: 26, scope: !1029)
!1032 = !DILocation(line: 67, column: 9, scope: !1019)
!1033 = !DILocation(line: 68, column: 17, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 67, column: 35)
!1035 = !DILocation(line: 68, column: 9, scope: !1034)
!1036 = !DILocation(line: 69, column: 9, scope: !1034)
!1037 = !DILocation(line: 69, column: 17, scope: !1034)
!1038 = !DILocation(line: 69, column: 22, scope: !1034)
!1039 = !DILocation(line: 70, column: 9, scope: !1034)
!1040 = !DILocation(line: 72, column: 19, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 71, column: 12)
!1042 = !DILocation(line: 72, column: 27, scope: !1041)
!1043 = !DILocation(line: 72, column: 9, scope: !1041)
!1044 = !DILocation(line: 74, column: 1, scope: !1019)
!1045 = distinct !DISubprogram(name: "print_usage", scope: !3, file: !3, line: 195, type: !1046, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !70)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!6}
!1048 = !DILocation(line: 197, column: 11, scope: !1045)
!1049 = !DILocation(line: 197, column: 3, scope: !1045)
!1050 = !DILocation(line: 227, column: 3, scope: !1045)
!1051 = distinct !DISubprogram(name: "error_callback", scope: !3, file: !3, line: 231, type: !1052, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !70)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!6, !68, !76, !140, !1054}
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1055, line: 196, baseType: !6)
!1055 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!1056 = !DILocalVariable(name: "error_callback_data", arg: 1, scope: !1051, file: !3, line: 231, type: !68)
!1057 = !DILocation(line: 231, column: 22, scope: !1051)
!1058 = !DILocalVariable(name: "buf", arg: 2, scope: !1051, file: !3, line: 231, type: !76)
!1059 = !DILocation(line: 231, column: 55, scope: !1051)
!1060 = !DILocalVariable(name: "severity", arg: 3, scope: !1051, file: !3, line: 231, type: !140)
!1061 = !DILocation(line: 231, column: 74, scope: !1051)
!1062 = !DILocalVariable(name: "seg_idx", arg: 4, scope: !1051, file: !3, line: 232, type: !1054)
!1063 = !DILocation(line: 232, column: 17, scope: !1051)
!1064 = !DILocalVariable(name: "params", scope: !1051, file: !3, line: 234, type: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!1067 = !DILocation(line: 234, column: 30, scope: !1051)
!1068 = !DILocation(line: 234, column: 39, scope: !1051)
!1069 = !DILocalVariable(name: "type", scope: !1051, file: !3, line: 235, type: !8)
!1070 = !DILocation(line: 235, column: 11, scope: !1051)
!1071 = !DILocalVariable(name: "segment", scope: !1051, file: !3, line: 236, type: !1072)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 176, elements: !391)
!1073 = !DILocation(line: 236, column: 10, scope: !1051)
!1074 = !DILocation(line: 238, column: 13, scope: !1051)
!1075 = !DILocation(line: 238, column: 5, scope: !1051)
!1076 = !DILocation(line: 240, column: 17, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 240, column: 17)
!1078 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 238, column: 23)
!1079 = !DILocation(line: 240, column: 25, scope: !1077)
!1080 = !DILocation(line: 240, column: 33, scope: !1077)
!1081 = !DILocation(line: 240, column: 17, scope: !1078)
!1082 = !DILocation(line: 240, column: 38, scope: !1077)
!1083 = !DILocation(line: 241, column: 18, scope: !1078)
!1084 = !DILocation(line: 241, column: 29, scope: !1078)
!1085 = !DILocation(line: 243, column: 17, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 243, column: 17)
!1087 = !DILocation(line: 243, column: 25, scope: !1086)
!1088 = !DILocation(line: 243, column: 33, scope: !1086)
!1089 = !DILocation(line: 243, column: 17, scope: !1078)
!1090 = !DILocation(line: 243, column: 38, scope: !1086)
!1091 = !DILocation(line: 244, column: 18, scope: !1078)
!1092 = !DILocation(line: 244, column: 28, scope: !1078)
!1093 = !DILocation(line: 246, column: 17, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 246, column: 17)
!1095 = !DILocation(line: 246, column: 25, scope: !1094)
!1096 = !DILocation(line: 246, column: 33, scope: !1094)
!1097 = !DILocation(line: 246, column: 17, scope: !1078)
!1098 = !DILocation(line: 246, column: 38, scope: !1094)
!1099 = !DILocation(line: 247, column: 18, scope: !1078)
!1100 = !DILocation(line: 247, column: 31, scope: !1078)
!1101 = !DILocation(line: 248, column: 41, scope: !1078)
!1102 = !DILocation(line: 248, column: 58, scope: !1078)
!1103 = !DILocation(line: 249, column: 23, scope: !1078)
!1104 = !DILocation(line: 249, column: 44, scope: !1078)
!1105 = !DILocation(line: 251, column: 9, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 251, column: 9)
!1107 = !DILocation(line: 251, column: 17, scope: !1106)
!1108 = !DILocation(line: 251, column: 9, scope: !1051)
!1109 = !DILocation(line: 251, column: 24, scope: !1106)
!1110 = !DILocation(line: 251, column: 35, scope: !1106)
!1111 = !DILocation(line: 252, column: 19, scope: !1106)
!1112 = !DILocation(line: 252, column: 65, scope: !1106)
!1113 = !DILocation(line: 252, column: 10, scope: !1106)
!1114 = !DILocation(line: 254, column: 13, scope: !1051)
!1115 = !DILocation(line: 254, column: 44, scope: !1051)
!1116 = !DILocation(line: 254, column: 50, scope: !1051)
!1117 = !DILocation(line: 254, column: 55, scope: !1051)
!1118 = !DILocation(line: 254, column: 5, scope: !1051)
!1119 = !DILocation(line: 256, column: 5, scope: !1051)
!1120 = !DILocation(line: 257, column: 1, scope: !1051)
!1121 = distinct !DISubprogram(name: "make_output_filename", scope: !3, file: !3, line: 260, type: !1122, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !70)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!8, !76, !76}
!1124 = !DILocalVariable(name: "input_filename", arg: 1, scope: !1121, file: !3, line: 260, type: !76)
!1125 = !DILocation(line: 260, column: 34, scope: !1121)
!1126 = !DILocalVariable(name: "extension", arg: 2, scope: !1121, file: !3, line: 260, type: !76)
!1127 = !DILocation(line: 260, column: 62, scope: !1121)
!1128 = !DILocalVariable(name: "output_filename", scope: !1121, file: !3, line: 262, type: !8)
!1129 = !DILocation(line: 262, column: 11, scope: !1121)
!1130 = !DILocalVariable(name: "c", scope: !1121, file: !3, line: 263, type: !76)
!1131 = !DILocation(line: 263, column: 17, scope: !1121)
!1132 = !DILocalVariable(name: "e", scope: !1121, file: !3, line: 263, type: !76)
!1133 = !DILocation(line: 263, column: 21, scope: !1121)
!1134 = !DILocalVariable(name: "len", scope: !1121, file: !3, line: 264, type: !6)
!1135 = !DILocation(line: 264, column: 9, scope: !1121)
!1136 = !DILocation(line: 266, column: 9, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 266, column: 9)
!1138 = !DILocation(line: 266, column: 19, scope: !1137)
!1139 = !DILocation(line: 266, column: 9, scope: !1121)
!1140 = !DILocation(line: 267, column: 17, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 266, column: 28)
!1142 = !DILocation(line: 267, column: 9, scope: !1141)
!1143 = !DILocation(line: 268, column: 9, scope: !1141)
!1144 = !DILocation(line: 271, column: 9, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 271, column: 9)
!1146 = !DILocation(line: 271, column: 24, scope: !1145)
!1147 = !DILocation(line: 271, column: 9, scope: !1121)
!1148 = !DILocation(line: 272, column: 9, scope: !1145)
!1149 = !DILocation(line: 272, column: 7, scope: !1145)
!1150 = !DILocation(line: 275, column: 19, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 273, column: 10)
!1152 = !DILocation(line: 275, column: 11, scope: !1151)
!1153 = !DILocation(line: 275, column: 9, scope: !1151)
!1154 = !DILocation(line: 276, column: 11, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 276, column: 11)
!1156 = !DILocation(line: 276, column: 13, scope: !1155)
!1157 = !DILocation(line: 276, column: 11, scope: !1151)
!1158 = !DILocation(line: 277, column: 21, scope: !1155)
!1159 = !DILocation(line: 277, column: 13, scope: !1155)
!1160 = !DILocation(line: 277, column: 11, scope: !1155)
!1161 = !DILocation(line: 277, column: 9, scope: !1155)
!1162 = !DILocation(line: 278, column: 11, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 278, column: 11)
!1164 = !DILocation(line: 278, column: 13, scope: !1163)
!1165 = !DILocation(line: 278, column: 11, scope: !1151)
!1166 = !DILocation(line: 279, column: 10, scope: !1163)
!1167 = !DILocation(line: 279, column: 9, scope: !1163)
!1168 = !DILocation(line: 281, column: 13, scope: !1163)
!1169 = !DILocation(line: 281, column: 11, scope: !1163)
!1170 = !DILocation(line: 285, column: 10, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 285, column: 9)
!1172 = !DILocation(line: 285, column: 9, scope: !1171)
!1173 = !DILocation(line: 285, column: 12, scope: !1171)
!1174 = !DILocation(line: 285, column: 9, scope: !1121)
!1175 = !DILocation(line: 286, column: 9, scope: !1171)
!1176 = !DILocation(line: 286, column: 7, scope: !1171)
!1177 = !DILocation(line: 289, column: 18, scope: !1121)
!1178 = !DILocation(line: 289, column: 11, scope: !1121)
!1179 = !DILocation(line: 289, column: 9, scope: !1121)
!1180 = !DILocation(line: 290, column: 17, scope: !1121)
!1181 = !DILocation(line: 290, column: 9, scope: !1121)
!1182 = !DILocation(line: 290, column: 7, scope: !1121)
!1183 = !DILocation(line: 291, column: 9, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 291, column: 9)
!1185 = !DILocation(line: 291, column: 11, scope: !1184)
!1186 = !DILocation(line: 291, column: 9, scope: !1121)
!1187 = !DILocation(line: 292, column: 21, scope: !1184)
!1188 = !DILocation(line: 292, column: 14, scope: !1184)
!1189 = !DILocation(line: 292, column: 11, scope: !1184)
!1190 = !DILocation(line: 292, column: 7, scope: !1184)
!1191 = !DILocation(line: 295, column: 30, scope: !1121)
!1192 = !DILocation(line: 295, column: 43, scope: !1121)
