; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._TextBuffer = type { %struct._TextBuffer*, %struct._TextBuffer*, i32, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { [100 x i32] }
%struct._AttributeBlock = type { %struct._AttributeBlock*, i32, i32, %union.anon.1 }
%union.anon.1 = type { %struct.anon.2 }
%struct.anon.2 = type { i64 }
%struct.anon.4 = type { %struct._TextBuffer* }

@specialMalloc = external thread_local global i8, align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @TtaWCToMBstring(i32, i8**) #0 !dbg !86 {
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  %5 = alloca i8**, align 8
  %6 = alloca i8, align 1
  %7 = alloca i8*, align 8
  %8 = alloca i32, align 4
  store i32 %0, i32* %4, align 4
  call void @llvm.dbg.declare(metadata i32* %4, metadata !93, metadata !DIExpression()), !dbg !94
  store i8** %1, i8*** %5, align 8
  call void @llvm.dbg.declare(metadata i8*** %5, metadata !95, metadata !DIExpression()), !dbg !96
  call void @llvm.dbg.declare(metadata i8* %6, metadata !97, metadata !DIExpression()), !dbg !98
  call void @llvm.dbg.declare(metadata i8** %7, metadata !99, metadata !DIExpression()), !dbg !100
  %9 = load i8**, i8*** %5, align 8, !dbg !101
  %10 = load i8*, i8** %9, align 8, !dbg !102
  store i8* %10, i8** %7, align 8, !dbg !100

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, nameTableKind: None)
!1 = !DIFile(filename: "main.c", directory: "/root/llvm/codesample/39apps/Amaya-sample")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 40, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "AtNumAttr", value: 0, isUnsigned: true)
!7 = !DIEnumerator(name: "AtTextAttr", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "AtReferenceAttr", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "AtEnumAttr", value: 3, isUnsigned: true)
!10 = !{!11, !12, !78}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PtrAttribute", file: !1, line: 23, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AttributeBlock", file: !1, line: 55, size: 192, elements: !15)
!15 = !{!16, !17, !19, !21}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "AeNext", scope: !14, file: !1, line: 57, baseType: !12, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "AeAttrNum", scope: !14, file: !1, line: 59, baseType: !18, size: 32, offset: 64)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "AeAttrType", scope: !14, file: !1, line: 61, baseType: !20, size: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "AttribType", file: !1, line: 46, baseType: !3)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !14, file: !1, line: 77, baseType: !22, size: 64, offset: 128)
!22 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !1, line: 62, size: 64, elements: !23)
!23 = !{!24, !30, !41}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "s0", scope: !22, file: !1, line: 67, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !22, file: !1, line: 64, size: 64, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_AeAttrValue_", scope: !25, file: !1, line: 66, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !1, line: 14, baseType: !29)
!29 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "s1", scope: !22, file: !1, line: 72, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !22, file: !1, line: 68, size: 64, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_AeAttrReference_", scope: !31, file: !1, line: 70, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PtrReference", file: !1, line: 20, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ReferenceDescriptor", file: !1, line: 26, size: 192, elements: !37)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "RdNext", scope: !36, file: !1, line: 28, baseType: !34, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "RdPrevious", scope: !36, file: !1, line: 29, baseType: !34, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "RdAttribute", scope: !36, file: !1, line: 32, baseType: !12, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "s2", scope: !22, file: !1, line: 76, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !22, file: !1, line: 73, size: 64, elements: !43)
!43 = !{!44}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_AeAttrText_", scope: !42, file: !1, line: 75, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PtrTextBuffer", file: !1, line: 37, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TextBuffer", file: !1, line: 100, size: 3392, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "BuNext", scope: !47, file: !1, line: 102, baseType: !45, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "BuPrevious", scope: !47, file: !1, line: 103, baseType: !45, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "BuLength", scope: !47, file: !1, line: 104, baseType: !18, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !47, file: !1, line: 116, baseType: !53, size: 3200, offset: 160)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !47, file: !1, line: 106, size: 3200, elements: !54)
!54 = !{!55, !66}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "s0", scope: !53, file: !1, line: 111, baseType: !56, size: 3200)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !1, line: 108, size: 3200, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_BuContent_", scope: !56, file: !1, line: 110, baseType: !59, size: 3200)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Buffer", file: !1, line: 90, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 3200, elements: !64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_T", file: !1, line: 87, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !63, line: 90, baseType: !18)
!63 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!64 = !{!65}
!65 = !DISubrange(count: 100)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "s1", scope: !53, file: !1, line: 115, baseType: !67, size: 768)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !1, line: 112, size: 768, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_BuPoints_", scope: !67, file: !1, line: 114, baseType: !70, size: 768)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 768, elements: !76)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolyLinePoint", file: !1, line: 96, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PolyLinePoint", file: !1, line: 92, size: 64, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "XCoord", scope: !72, file: !1, line: 94, baseType: !18, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "YCoord", scope: !72, file: !1, line: 95, baseType: !18, size: 32, offset: 32)
!76 = !{!77}
!77 = !DISubrange(count: 12)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!80 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)"}
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{i32 1, !"wchar_size", i32 4}
!84 = !{i32 1, !"ThinLTO", i32 0}
!85 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!86 = distinct !DISubprogram(name: "TtaWCToMBstring", scope: !1, file: !1, line: 122, type: !87, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !92)
!87 = !DISubroutineType(types: !88)
!88 = !{!18, !62, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!92 = !{}
!93 = !DILocalVariable(name: "src", arg: 1, scope: !86, file: !1, line: 122, type: !62)
!94 = !DILocation(line: 122, column: 30, scope: !86)
!95 = !DILocalVariable(name: "dest", arg: 2, scope: !86, file: !1, line: 122, type: !89)
!96 = !DILocation(line: 122, column: 51, scope: !86)
!97 = !DILocalVariable(name: "leadByteMark", scope: !86, file: !1, line: 124, type: !91)
!98 = !DILocation(line: 124, column: 19, scope: !86)
!99 = !DILocalVariable(name: "mbcptr", scope: !86, file: !1, line: 125, type: !90)
!100 = !DILocation(line: 125, column: 19, scope: !86)
!101 = !DILocation(line: 125, column: 29, scope: !86)
!102 = !DILocation(line: 125, column: 28, scope: !86)
!103 = !DILocalVariable(name: "nbBytes", scope: !86, file: !1, line: 126, type: !18)
!104 = !DILocation(line: 126, column: 19, scope: !86)
!105 = !DILocation(line: 128, column: 7, scope: !106)
!106 = distinct !DILexicalBlock(scope: !86, file: !1, line: 128, column: 7)
!107 = !DILocation(line: 128, column: 11, scope: !106)
!108 = !DILocation(line: 128, column: 7, scope: !86)
!109 = !DILocation(line: 130, column: 16, scope: !110)
!110 = distinct !DILexicalBlock(scope: !106, file: !1, line: 129, column: 5)
!111 = !DILocation(line: 131, column: 20, scope: !110)
!112 = !DILocation(line: 132, column: 5, scope: !110)
!113 = !DILocation(line: 133, column: 12, scope: !114)
!114 = distinct !DILexicalBlock(scope: !106, file: !1, line: 133, column: 12)
!115 = !DILocation(line: 133, column: 16, scope: !114)
!116 = !DILocation(line: 133, column: 12, scope: !106)
!117 = !DILocation(line: 135, column: 20, scope: !118)
!118 = distinct !DILexicalBlock(scope: !114, file: !1, line: 134, column: 5)
!119 = !DILocation(line: 136, column: 20, scope: !118)
!120 = !DILocation(line: 137, column: 5, scope: !118)
!121 = !DILocation(line: 138, column: 12, scope: !122)
!122 = distinct !DILexicalBlock(scope: !114, file: !1, line: 138, column: 12)
!123 = !DILocation(line: 138, column: 16, scope: !122)
!124 = !DILocation(line: 138, column: 12, scope: !114)
!125 = !DILocation(line: 140, column: 20, scope: !126)
!126 = distinct !DILexicalBlock(scope: !122, file: !1, line: 139, column: 5)
!127 = !DILocation(line: 141, column: 20, scope: !126)
!128 = !DILocation(line: 142, column: 5, scope: !126)
!129 = !DILocation(line: 143, column: 12, scope: !130)
!130 = distinct !DILexicalBlock(scope: !122, file: !1, line: 143, column: 12)
!131 = !DILocation(line: 143, column: 16, scope: !130)
!132 = !DILocation(line: 143, column: 12, scope: !122)
!133 = !DILocation(line: 145, column: 20, scope: !134)
!134 = distinct !DILexicalBlock(scope: !130, file: !1, line: 144, column: 5)
!135 = !DILocation(line: 146, column: 20, scope: !134)
!136 = !DILocation(line: 147, column: 5, scope: !134)
!137 = !DILocation(line: 150, column: 8, scope: !138)
