; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.opj_option = type { i8*, i32, i32*, i32 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.dircnt = type { i8*, i8** }
%struct.img_folder = type { i8*, i8*, i8, i8 }
%struct.opj_dparameters = type { i32, i32, [4096 x i8], [4096 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.opj_image = type { i32, i32, i32, i32, i32, i32, %struct.opj_image_comp*, i8*, i32 }
%struct.opj_image_comp = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32* }
%struct.opj_codestream_info_v2 = type { i32, i32, i32, i32, i32, i32, i32, %struct.opj_tile_v2_info, %struct.opj_tile_v2_info* }
%struct.opj_tile_v2_info = type { i32, i32, i32, i32, i32, %struct.opj_tccp_info* }
%struct.opj_tccp_info = type { i32, i32, i32, i32, i32, i32, i32, i32, [97 x i32], [97 x i32], i32, i32, [33 x i32], [33 x i32] }
%struct.opj_codestream_index = type { i64, i64, i64, i32, %struct.opj_marker_info_t*, i32, i32, %struct.opj_tile_index* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "extension", scope: !2, file: !3, line: 168, type: !59, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "get_file_format", scope: !3, file: !3, line: 166, type: !4, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!3 = !DIFile(filename: "j2k_dump.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !11, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !12, retainedTypes: !41, globals: !51, nameTableKind: None)
!11 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec/j2k_dump.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!12 = !{!13, !20, !27, !35}
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LIMIT_DECODING", file: !14, line: 202, baseType: !15, size: 32, elements: !16)
!14 = !DIFile(filename: "libopenjpeg/openjpeg.h", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "NO_LIMITATION", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "LIMIT_TO_MAIN_HEADER", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "DECODE_ALL_BUT_PACKETS", value: 2, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "COLOR_SPACE", file: !14, line: 181, baseType: !6, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "CLRSPC_UNKNOWN", value: -1)
!23 = !DIEnumerator(name: "CLRSPC_UNSPECIFIED", value: 0)
!24 = !DIEnumerator(name: "CLRSPC_SRGB", value: 1)
!25 = !DIEnumerator(name: "CLRSPC_GRAY", value: 2)
!26 = !DIEnumerator(name: "CLRSPC_SYCC", value: 3)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PROG_ORDER", file: !14, line: 169, baseType: !6, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "PROG_UNKNOWN", value: -1)
!30 = !DIEnumerator(name: "LRCP", value: 0)
!31 = !DIEnumerator(name: "RLCP", value: 1)
!32 = !DIEnumerator(name: "RPCL", value: 2)
!33 = !DIEnumerator(name: "PCRL", value: 3)
!34 = !DIEnumerator(name: "CPRL", value: 4)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CODEC_FORMAT", file: !14, line: 192, baseType: !6, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "CODEC_UNKNOWN", value: -1)
!38 = !DIEnumerator(name: "CODEC_J2K", value: 0)
!39 = !DIEnumerator(name: "CODEC_JPT", value: 1)
!40 = !DIEnumerator(name: "CODEC_JP2", value: 2)
!41 = !{!42, !43, !44, !50}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "dircnt_t", file: !3, line: 60, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dircnt", file: !3, line: 55, size: 128, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "filename_buf", scope: !46, file: !3, line: 57, baseType: !43, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !46, file: !3, line: 59, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!51 = !{!0, !52}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 169, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 448, elements: !56)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!56 = !{!57}
!57 = !DISubrange(count: 14)
!58 = !{}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 896, elements: !56)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "opj_opterr", scope: !62, file: !68, line: 45, type: !6, isLocal: false, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !64, globals: !65, nameTableKind: None)
!63 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/common/opj_getopt.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!64 = !{!6}
!65 = !{!60, !66, !69, !76, !92, !94, !96, !98, !100}
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "opj_optind", scope: !62, file: !68, line: 46, type: !6, isLocal: false, isDefinition: true)
!68 = !DIFile(filename: "common/opj_getopt.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications")
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "place", scope: !71, file: !68, line: 67, type: !43, isLocal: true, isDefinition: true)
!71 = distinct !DISubprogram(name: "opj_getopt", scope: !68, file: !68, line: 65, type: !72, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !62, retainedNodes: !58)
!72 = !DISubroutineType(types: !73)
!73 = !{!6, !6, !74, !7}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "lastidx", scope: !78, file: !68, line: 126, type: !6, isLocal: true, isDefinition: true)
!78 = distinct !DISubprogram(name: "opj_getopt_long", scope: !68, file: !68, line: 124, type: !79, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !62, retainedNodes: !58)
!79 = !DISubroutineType(types: !80)
!80 = !{!6, !6, !74, !7, !81, !6}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_option_t", file: !84, line: 12, baseType: !85)
!84 = !DIFile(filename: "common/opj_getopt.h", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_option", file: !84, line: 6, size: 256, elements: !86)
!86 = !{!87, !88, !89, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !84, line: 8, baseType: !7, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !85, file: !84, line: 9, baseType: !6, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !85, file: !84, line: 10, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !85, file: !84, line: 11, baseType: !6, size: 32, offset: 192)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "lastofs", scope: !78, file: !68, line: 126, type: !6, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "opj_optopt", scope: !62, file: !68, line: 47, type: !6, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "opj_optreset", scope: !62, file: !68, line: 48, type: !6, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "opj_optarg", scope: !62, file: !68, line: 49, type: !43, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "EMSG", scope: !62, file: !68, line: 53, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !106, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, retainedTypes: !135, nameTableKind: None)
!106 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec/convert.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!107 = !{!20, !27, !108, !114, !120}
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CINEMA_MODE", file: !14, line: 159, baseType: !15, size: 32, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIEnumerator(name: "OFF", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "CINEMA2K_24", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "CINEMA2K_48", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "CINEMA4K_24", value: 3, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RSIZ_CAPABILITIES", file: !14, line: 149, baseType: !15, size: 32, elements: !115)
!115 = !{!116, !117, !118, !119}
!116 = !DIEnumerator(name: "STD_RSIZ", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "CINEMA2K", value: 3, isUnsigned: true)
!118 = !DIEnumerator(name: "CINEMA4K", value: 4, isUnsigned: true)
!119 = !DIEnumerator(name: "MCT", value: 33024, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 46, baseType: !15, size: 32, elements: !122)
!121 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!123 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!124 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!125 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!126 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!127 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!128 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!129 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!130 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!131 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!134 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!135 = !{!136, !137, !138, !6, !9, !139, !43, !42, !140, !141, !142, !143, !15, !144}
!136 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!137 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!139 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!140 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_image_cmptparm_t", file: !14, line: 679, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_image_comptparm", file: !14, line: 660, size: 288, elements: !147)
!147 = !{!148, !152, !153, !154, !155, !156, !157, !158, !159}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !146, file: !14, line: 662, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_UINT32", file: !14, line: 91, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !151, line: 51, baseType: !15)
!151 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !146, file: !14, line: 664, baseType: !149, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !146, file: !14, line: 666, baseType: !149, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !146, file: !14, line: 668, baseType: !149, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !146, file: !14, line: 670, baseType: !149, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !146, file: !14, line: 672, baseType: !149, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !146, file: !14, line: 674, baseType: !149, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !146, file: !14, line: 676, baseType: !149, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sgnd", scope: !146, file: !14, line: 678, baseType: !149, size: 32, offset: 256)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !163, nameTableKind: None)
!161 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec/index.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!162 = !{!27}
!163 = !{!6, !136}
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !167, nameTableKind: None)
!165 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/common/color.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!166 = !{!20}
!167 = !{!90, !6, !136}
!168 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!169 = !{i32 2, !"Dwarf Version", i32 4}
!170 = !{i32 2, !"Debug Info Version", i32 3}
!171 = !{i32 1, !"wchar_size", i32 4}
!172 = !{i32 1, !"ThinLTO", i32 0}
!173 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!174 = distinct !DISubprogram(name: "decode_help_display", scope: !3, file: !3, line: 87, type: !175, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!175 = !DISubroutineType(types: !176)
!176 = !{null}
!177 = !DILocation(line: 88, column: 10, scope: !174)
!178 = !DILocation(line: 88, column: 2, scope: !174)
!179 = !DILocation(line: 89, column: 10, scope: !174)
!180 = !DILocation(line: 89, column: 2, scope: !174)
!181 = !DILocation(line: 92, column: 10, scope: !174)
!182 = !DILocation(line: 92, column: 2, scope: !174)
!183 = !DILocation(line: 98, column: 10, scope: !174)
!184 = !DILocation(line: 98, column: 2, scope: !174)
!185 = !DILocation(line: 99, column: 10, scope: !174)
!186 = !DILocation(line: 99, column: 2, scope: !174)
!187 = !DILocation(line: 100, column: 10, scope: !174)
!188 = !DILocation(line: 100, column: 2, scope: !174)
!189 = !DILocation(line: 101, column: 10, scope: !174)
!190 = !DILocation(line: 101, column: 2, scope: !174)
!191 = !DILocation(line: 102, column: 10, scope: !174)
!192 = !DILocation(line: 102, column: 2, scope: !174)
!193 = !DILocation(line: 103, column: 10, scope: !174)
!194 = !DILocation(line: 103, column: 2, scope: !174)
!195 = !DILocation(line: 104, column: 10, scope: !174)
!196 = !DILocation(line: 104, column: 2, scope: !174)
!197 = !DILocation(line: 105, column: 10, scope: !174)
!198 = !DILocation(line: 105, column: 2, scope: !174)
!199 = !DILocation(line: 106, column: 10, scope: !174)
!200 = !DILocation(line: 106, column: 2, scope: !174)
!201 = !DILocation(line: 107, column: 10, scope: !174)
!202 = !DILocation(line: 107, column: 2, scope: !174)
!203 = !DILocation(line: 108, column: 10, scope: !174)
!204 = !DILocation(line: 108, column: 2, scope: !174)
!205 = !DILocation(line: 109, column: 10, scope: !174)
!206 = !DILocation(line: 109, column: 2, scope: !174)
!207 = !DILocation(line: 110, column: 10, scope: !174)
!208 = !DILocation(line: 110, column: 2, scope: !174)
!209 = !DILocation(line: 111, column: 10, scope: !174)
!210 = !DILocation(line: 111, column: 2, scope: !174)
!211 = !DILocation(line: 112, column: 10, scope: !174)
!212 = !DILocation(line: 112, column: 2, scope: !174)
!213 = !DILocation(line: 113, column: 10, scope: !174)
!214 = !DILocation(line: 113, column: 2, scope: !174)
!215 = !DILocation(line: 114, column: 10, scope: !174)
!216 = !DILocation(line: 114, column: 2, scope: !174)
!217 = !DILocation(line: 115, column: 1, scope: !174)
!218 = distinct !DISubprogram(name: "get_num_images", scope: !3, file: !3, line: 118, type: !219, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!219 = !DISubroutineType(types: !220)
!220 = !{!6, !43}
!221 = !DILocalVariable(name: "imgdirpath", arg: 1, scope: !218, file: !3, line: 118, type: !43)
!222 = !DILocation(line: 118, column: 26, scope: !218)
!223 = !DILocalVariable(name: "dir", scope: !218, file: !3, line: 119, type: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !226, line: 127, baseType: !227)
!226 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !226, line: 127, flags: DIFlagFwdDecl)
!228 = !DILocation(line: 119, column: 7, scope: !218)
!229 = !DILocalVariable(name: "content", scope: !218, file: !3, line: 120, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !232, line: 22, size: 2240, elements: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!233 = !{!234, !238, !241, !242, !243}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !231, file: !232, line: 25, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !236, line: 127, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!237 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !231, file: !232, line: 26, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !236, line: 131, baseType: !240)
!240 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !231, file: !232, line: 31, baseType: !141, size: 16, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !231, file: !232, line: 32, baseType: !137, size: 8, offset: 144)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !231, file: !232, line: 33, baseType: !244, size: 2048, offset: 152)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 256)
!247 = !DILocation(line: 120, column: 17, scope: !218)
!248 = !DILocalVariable(name: "num_images", scope: !218, file: !3, line: 121, type: !6)
!249 = !DILocation(line: 121, column: 6, scope: !218)
!250 = !DILocation(line: 125, column: 15, scope: !218)
!251 = !DILocation(line: 125, column: 7, scope: !218)
!252 = !DILocation(line: 125, column: 5, scope: !218)
!253 = !DILocation(line: 126, column: 6, scope: !254)
!254 = distinct !DILexicalBlock(scope: !218, file: !3, line: 126, column: 5)
!255 = !DILocation(line: 126, column: 5, scope: !218)
!256 = !DILocation(line: 127, column: 11, scope: !257)
!257 = distinct !DILexicalBlock(scope: !254, file: !3, line: 126, column: 10)
!258 = !DILocation(line: 127, column: 47, scope: !257)
!259 = !DILocation(line: 127, column: 3, scope: !257)
!260 = !DILocation(line: 128, column: 3, scope: !257)
!261 = !DILocation(line: 131, column: 2, scope: !218)
!262 = !DILocation(line: 131, column: 25, scope: !218)
!263 = !DILocation(line: 131, column: 17, scope: !218)
!264 = !DILocation(line: 131, column: 16, scope: !218)
!265 = !DILocation(line: 131, column: 30, scope: !218)
!266 = !DILocation(line: 132, column: 17, scope: !267)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 132, column: 6)
!268 = distinct !DILexicalBlock(scope: !218, file: !3, line: 131, column: 37)
!269 = !DILocation(line: 132, column: 26, scope: !267)
!270 = !DILocation(line: 132, column: 6, scope: !267)
!271 = !DILocation(line: 132, column: 33, scope: !267)
!272 = !DILocation(line: 132, column: 37, scope: !267)
!273 = !DILocation(line: 132, column: 52, scope: !267)
!274 = !DILocation(line: 132, column: 61, scope: !267)
!275 = !DILocation(line: 132, column: 40, scope: !267)
!276 = !DILocation(line: 132, column: 68, scope: !267)
!277 = !DILocation(line: 132, column: 6, scope: !268)
!278 = !DILocation(line: 133, column: 4, scope: !267)
!279 = distinct !{!279, !261, !280}
!280 = !DILocation(line: 135, column: 2, scope: !218)
!281 = !DILocation(line: 134, column: 13, scope: !268)
!282 = !DILocation(line: 136, column: 9, scope: !218)
!283 = !DILocation(line: 136, column: 2, scope: !218)
!284 = !DILocation(line: 137, column: 1, scope: !218)
!285 = distinct !DISubprogram(name: "load_images", scope: !3, file: !3, line: 140, type: !286, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!286 = !DISubroutineType(types: !287)
!287 = !{!6, !44, !43}
!288 = !DILocalVariable(name: "dirptr", arg: 1, scope: !285, file: !3, line: 140, type: !44)
!289 = !DILocation(line: 140, column: 27, scope: !285)
!290 = !DILocalVariable(name: "imgdirpath", arg: 2, scope: !285, file: !3, line: 140, type: !43)
!291 = !DILocation(line: 140, column: 41, scope: !285)
!292 = !DILocalVariable(name: "dir", scope: !285, file: !3, line: 141, type: !224)
!293 = !DILocation(line: 141, column: 7, scope: !285)
!294 = !DILocalVariable(name: "content", scope: !285, file: !3, line: 142, type: !230)
!295 = !DILocation(line: 142, column: 17, scope: !285)
!296 = !DILocalVariable(name: "i", scope: !285, file: !3, line: 143, type: !6)
!297 = !DILocation(line: 143, column: 6, scope: !285)
!298 = !DILocation(line: 147, column: 15, scope: !285)
!299 = !DILocation(line: 147, column: 7, scope: !285)
!300 = !DILocation(line: 147, column: 5, scope: !285)
!301 = !DILocation(line: 148, column: 6, scope: !302)
!302 = distinct !DILexicalBlock(scope: !285, file: !3, line: 148, column: 5)
!303 = !DILocation(line: 148, column: 5, scope: !285)
!304 = !DILocation(line: 149, column: 11, scope: !305)
!305 = distinct !DILexicalBlock(scope: !302, file: !3, line: 148, column: 10)
!306 = !DILocation(line: 149, column: 47, scope: !305)
!307 = !DILocation(line: 149, column: 3, scope: !305)
!308 = !DILocation(line: 150, column: 3, scope: !305)
!309 = !DILocation(line: 152, column: 11, scope: !310)
!310 = distinct !DILexicalBlock(scope: !302, file: !3, line: 151, column: 8)
!311 = !DILocation(line: 152, column: 3, scope: !310)
!312 = !DILocation(line: 155, column: 2, scope: !285)
!313 = !DILocation(line: 155, column: 25, scope: !285)
!314 = !DILocation(line: 155, column: 17, scope: !285)
!315 = !DILocation(line: 155, column: 16, scope: !285)
!316 = !DILocation(line: 155, column: 30, scope: !285)
!317 = !DILocation(line: 156, column: 17, scope: !318)
!318 = distinct !DILexicalBlock(scope: !319, file: !3, line: 156, column: 6)
!319 = distinct !DILexicalBlock(scope: !285, file: !3, line: 155, column: 37)
!320 = !DILocation(line: 156, column: 26, scope: !318)
!321 = !DILocation(line: 156, column: 6, scope: !318)
!322 = !DILocation(line: 156, column: 33, scope: !318)
!323 = !DILocation(line: 156, column: 37, scope: !318)
!324 = !DILocation(line: 156, column: 52, scope: !318)
!325 = !DILocation(line: 156, column: 61, scope: !318)
!326 = !DILocation(line: 156, column: 40, scope: !318)
!327 = !DILocation(line: 156, column: 68, scope: !318)
!328 = !DILocation(line: 156, column: 6, scope: !319)
!329 = !DILocation(line: 157, column: 4, scope: !318)
!330 = distinct !{!330, !312, !331}
!331 = !DILocation(line: 161, column: 2, scope: !285)
!332 = !DILocation(line: 159, column: 10, scope: !319)
!333 = !DILocation(line: 159, column: 18, scope: !319)
!334 = !DILocation(line: 159, column: 27, scope: !319)
!335 = !DILocation(line: 159, column: 30, scope: !319)
!336 = !DILocation(line: 159, column: 39, scope: !319)
!337 = !DILocation(line: 159, column: 3, scope: !319)
!338 = !DILocation(line: 160, column: 4, scope: !319)
!339 = !DILocation(line: 162, column: 2, scope: !285)
!340 = !DILocation(line: 163, column: 1, scope: !285)
!341 = !DILocalVariable(name: "filename", arg: 1, scope: !2, file: !3, line: 166, type: !7)
!342 = !DILocation(line: 166, column: 33, scope: !2)
!343 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 167, type: !15)
!344 = !DILocation(line: 167, column: 15, scope: !2)
!345 = !DILocalVariable(name: "ext", scope: !2, file: !3, line: 170, type: !43)
!346 = !DILocation(line: 170, column: 9, scope: !2)
!347 = !DILocation(line: 170, column: 23, scope: !2)
!348 = !DILocation(line: 170, column: 15, scope: !2)
!349 = !DILocation(line: 171, column: 6, scope: !350)
!350 = distinct !DILexicalBlock(scope: !2, file: !3, line: 171, column: 6)
!351 = !DILocation(line: 171, column: 10, scope: !350)
!352 = !DILocation(line: 171, column: 6, scope: !2)
!353 = !DILocation(line: 172, column: 3, scope: !350)
!354 = !DILocation(line: 173, column: 5, scope: !2)
!355 = !DILocation(line: 174, column: 5, scope: !356)
!356 = distinct !DILexicalBlock(scope: !2, file: !3, line: 174, column: 5)
!357 = !DILocation(line: 174, column: 5, scope: !2)
!358 = !DILocation(line: 175, column: 9, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 175, column: 3)
!360 = distinct !DILexicalBlock(scope: !356, file: !3, line: 174, column: 10)
!361 = !DILocation(line: 175, column: 7, scope: !359)
!362 = !DILocation(line: 175, column: 14, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !3, line: 175, column: 3)
!364 = !DILocation(line: 175, column: 16, scope: !363)
!365 = !DILocation(line: 175, column: 3, scope: !359)
!366 = !DILocation(line: 176, column: 17, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 176, column: 7)
!368 = distinct !DILexicalBlock(scope: !363, file: !3, line: 175, column: 55)
!369 = !DILocation(line: 176, column: 32, scope: !367)
!370 = !DILocation(line: 176, column: 22, scope: !367)
!371 = !DILocation(line: 176, column: 7, scope: !367)
!372 = !DILocation(line: 176, column: 39, scope: !367)
!373 = !DILocation(line: 176, column: 7, scope: !368)
!374 = !DILocation(line: 177, column: 19, scope: !375)
!375 = distinct !DILexicalBlock(scope: !367, file: !3, line: 176, column: 45)
!376 = !DILocation(line: 177, column: 12, scope: !375)
!377 = !DILocation(line: 177, column: 5, scope: !375)
!378 = !DILocation(line: 179, column: 3, scope: !368)
!379 = !DILocation(line: 175, column: 51, scope: !363)
!380 = !DILocation(line: 175, column: 3, scope: !363)
!381 = distinct !{!381, !365, !382}
!382 = !DILocation(line: 179, column: 3, scope: !359)
!383 = !DILocation(line: 180, column: 2, scope: !360)
!384 = !DILocation(line: 182, column: 2, scope: !2)
!385 = !DILocation(line: 183, column: 1, scope: !2)
!386 = distinct !DISubprogram(name: "get_next_file", scope: !3, file: !3, line: 186, type: !387, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!387 = !DISubroutineType(types: !388)
!388 = !{!9, !6, !44, !389, !397}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "img_fol_t", file: !3, line: 73, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "img_folder", file: !3, line: 63, size: 192, elements: !392)
!392 = !{!393, !394, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "imgdirpath", scope: !391, file: !3, line: 65, baseType: !43, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !391, file: !3, line: 67, baseType: !7, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "set_imgdir", scope: !391, file: !3, line: 69, baseType: !9, size: 8, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "set_out_format", scope: !391, file: !3, line: 71, baseType: !9, size: 8, offset: 136)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_dparameters_t", file: !14, line: 490, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_dparameters", file: !14, line: 423, size: 66048, elements: !400)
!400 = !{!401, !402, !403, !407, !408, !409, !410, !411, !412, !413, !414, !416, !417, !418, !419, !420, !421, !423}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cp_reduce", scope: !399, file: !14, line: 431, baseType: !6, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cp_layer", scope: !399, file: !14, line: 438, baseType: !6, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !399, file: !14, line: 443, baseType: !404, size: 32768, offset: 64)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32768, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 4096)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !399, file: !14, line: 445, baseType: !404, size: 32768, offset: 32832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "decod_format", scope: !399, file: !14, line: 447, baseType: !6, size: 32, offset: 65600)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cod_format", scope: !399, file: !14, line: 449, baseType: !6, size: 32, offset: 65632)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "DA_x0", scope: !399, file: !14, line: 452, baseType: !149, size: 32, offset: 65664)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "DA_x1", scope: !399, file: !14, line: 454, baseType: !149, size: 32, offset: 65696)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DA_y0", scope: !399, file: !14, line: 456, baseType: !149, size: 32, offset: 65728)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "DA_y1", scope: !399, file: !14, line: 458, baseType: !149, size: 32, offset: 65760)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "m_verbose", scope: !399, file: !14, line: 460, baseType: !415, size: 32, offset: 65792)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_bool", file: !14, line: 75, baseType: !6)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tile_index", scope: !399, file: !14, line: 463, baseType: !149, size: 32, offset: 65824)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nb_tile_to_decode", scope: !399, file: !14, line: 465, baseType: !149, size: 32, offset: 65856)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "jpwl_correct", scope: !399, file: !14, line: 473, baseType: !415, size: 32, offset: 65888)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "jpwl_exp_comps", scope: !399, file: !14, line: 475, baseType: !6, size: 32, offset: 65920)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "jpwl_max_tiles", scope: !399, file: !14, line: 477, baseType: !6, size: 32, offset: 65952)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cp_limit_decoding", scope: !399, file: !14, line: 487, baseType: !422, size: 32, offset: 65984)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_LIMIT_DECODING", file: !14, line: 206, baseType: !13)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !14, line: 489, baseType: !15, size: 32, offset: 66016)
!424 = !DILocalVariable(name: "imageno", arg: 1, scope: !386, file: !3, line: 186, type: !6)
!425 = !DILocation(line: 186, column: 24, scope: !386)
!426 = !DILocalVariable(name: "dirptr", arg: 2, scope: !386, file: !3, line: 186, type: !44)
!427 = !DILocation(line: 186, column: 42, scope: !386)
!428 = !DILocalVariable(name: "img_fol", arg: 3, scope: !386, file: !3, line: 186, type: !389)
!429 = !DILocation(line: 186, column: 60, scope: !386)
!430 = !DILocalVariable(name: "parameters", arg: 4, scope: !386, file: !3, line: 186, type: !397)
!431 = !DILocation(line: 186, column: 88, scope: !386)
!432 = !DILocalVariable(name: "image_filename", scope: !386, file: !3, line: 187, type: !404)
!433 = !DILocation(line: 187, column: 7, scope: !386)
!434 = !DILocalVariable(name: "infilename", scope: !386, file: !3, line: 187, type: !404)
!435 = !DILocation(line: 187, column: 37, scope: !386)
!436 = !DILocalVariable(name: "outfilename", scope: !386, file: !3, line: 187, type: !404)
!437 = !DILocation(line: 187, column: 62, scope: !386)
!438 = !DILocalVariable(name: "temp_ofname", scope: !386, file: !3, line: 187, type: !404)
!439 = !DILocation(line: 187, column: 88, scope: !386)
!440 = !DILocalVariable(name: "temp_p", scope: !386, file: !3, line: 188, type: !43)
!441 = !DILocation(line: 188, column: 8, scope: !386)
!442 = !DILocalVariable(name: "temp1", scope: !386, file: !3, line: 188, type: !404)
!443 = !DILocation(line: 188, column: 16, scope: !386)
!444 = !DILocation(line: 190, column: 9, scope: !386)
!445 = !DILocation(line: 190, column: 24, scope: !386)
!446 = !DILocation(line: 190, column: 32, scope: !386)
!447 = !DILocation(line: 190, column: 41, scope: !386)
!448 = !DILocation(line: 190, column: 2, scope: !386)
!449 = !DILocation(line: 191, column: 10, scope: !386)
!450 = !DILocation(line: 191, column: 43, scope: !386)
!451 = !DILocation(line: 191, column: 51, scope: !386)
!452 = !DILocation(line: 191, column: 2, scope: !386)
!453 = !DILocation(line: 192, column: 45, scope: !386)
!454 = !DILocation(line: 192, column: 29, scope: !386)
!455 = !DILocation(line: 192, column: 2, scope: !386)
!456 = !DILocation(line: 192, column: 14, scope: !386)
!457 = !DILocation(line: 192, column: 27, scope: !386)
!458 = !DILocation(line: 193, column: 6, scope: !459)
!459 = distinct !DILexicalBlock(scope: !386, file: !3, line: 193, column: 6)
!460 = !DILocation(line: 193, column: 18, scope: !459)
!461 = !DILocation(line: 193, column: 31, scope: !459)
!462 = !DILocation(line: 193, column: 6, scope: !386)
!463 = !DILocation(line: 194, column: 3, scope: !459)
!464 = !DILocation(line: 195, column: 10, scope: !386)
!465 = !DILocation(line: 195, column: 29, scope: !386)
!466 = !DILocation(line: 195, column: 38, scope: !386)
!467 = !DILocation(line: 195, column: 49, scope: !386)
!468 = !DILocation(line: 195, column: 2, scope: !386)
!469 = !DILocation(line: 196, column: 10, scope: !386)
!470 = !DILocation(line: 196, column: 22, scope: !386)
!471 = !DILocation(line: 196, column: 30, scope: !386)
!472 = !DILocation(line: 196, column: 2, scope: !386)
!473 = !DILocation(line: 199, column: 9, scope: !386)
!474 = !DILocation(line: 199, column: 28, scope: !386)
!475 = !DILocation(line: 199, column: 21, scope: !386)
!476 = !DILocation(line: 199, column: 2, scope: !386)
!477 = !DILocation(line: 200, column: 2, scope: !386)
!478 = !DILocation(line: 200, column: 18, scope: !386)
!479 = !DILocation(line: 200, column: 16, scope: !386)
!480 = !DILocation(line: 200, column: 36, scope: !386)
!481 = !DILocation(line: 201, column: 10, scope: !482)
!482 = distinct !DILexicalBlock(scope: !386, file: !3, line: 200, column: 44)
!483 = !DILocation(line: 201, column: 22, scope: !482)
!484 = !DILocation(line: 201, column: 3, scope: !482)
!485 = !DILocation(line: 202, column: 11, scope: !482)
!486 = !DILocation(line: 202, column: 23, scope: !482)
!487 = !DILocation(line: 202, column: 3, scope: !482)
!488 = distinct !{!488, !477, !489}
!489 = !DILocation(line: 203, column: 2, scope: !386)
!490 = !DILocation(line: 204, column: 5, scope: !491)
!491 = distinct !DILexicalBlock(scope: !386, file: !3, line: 204, column: 5)
!492 = !DILocation(line: 204, column: 14, scope: !491)
!493 = !DILocation(line: 204, column: 28, scope: !491)
!494 = !DILocation(line: 204, column: 5, scope: !386)
!495 = !DILocation(line: 205, column: 11, scope: !496)
!496 = distinct !DILexicalBlock(scope: !491, file: !3, line: 204, column: 32)
!497 = !DILocation(line: 205, column: 34, scope: !496)
!498 = !DILocation(line: 205, column: 43, scope: !496)
!499 = !DILocation(line: 205, column: 54, scope: !496)
!500 = !DILocation(line: 205, column: 66, scope: !496)
!501 = !DILocation(line: 205, column: 75, scope: !496)
!502 = !DILocation(line: 205, column: 3, scope: !496)
!503 = !DILocation(line: 206, column: 11, scope: !496)
!504 = !DILocation(line: 206, column: 23, scope: !496)
!505 = !DILocation(line: 206, column: 32, scope: !496)
!506 = !DILocation(line: 206, column: 3, scope: !496)
!507 = !DILocation(line: 207, column: 2, scope: !496)
!508 = !DILocation(line: 208, column: 2, scope: !386)
!509 = !DILocation(line: 209, column: 1, scope: !386)
!510 = distinct !DISubprogram(name: "parse_cmdline_decoder", scope: !3, file: !3, line: 271, type: !511, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!511 = !DISubroutineType(types: !512)
!512 = !{!6, !6, !50, !397, !389}
!513 = !DILocalVariable(name: "argc", arg: 1, scope: !510, file: !3, line: 271, type: !6)
!514 = !DILocation(line: 271, column: 31, scope: !510)
!515 = !DILocalVariable(name: "argv", arg: 2, scope: !510, file: !3, line: 271, type: !50)
!516 = !DILocation(line: 271, column: 44, scope: !510)
!517 = !DILocalVariable(name: "parameters", arg: 3, scope: !510, file: !3, line: 271, type: !397)
!518 = !DILocation(line: 271, column: 69, scope: !510)
!519 = !DILocalVariable(name: "img_fol", arg: 4, scope: !510, file: !3, line: 271, type: !389)
!520 = !DILocation(line: 271, column: 91, scope: !510)
!521 = !DILocalVariable(name: "totlen", scope: !510, file: !3, line: 272, type: !6)
!522 = !DILocation(line: 272, column: 6, scope: !510)
!523 = !DILocalVariable(name: "c", scope: !510, file: !3, line: 272, type: !6)
!524 = !DILocation(line: 272, column: 14, scope: !510)
!525 = !DILocalVariable(name: "long_option", scope: !510, file: !3, line: 273, type: !526)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 256, elements: !103)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_option_t", file: !84, line: 12, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_option", file: !84, line: 6, size: 256, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !84, line: 8, baseType: !7, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !528, file: !84, line: 9, baseType: !6, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !84, line: 10, baseType: !90, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !528, file: !84, line: 11, baseType: !6, size: 32, offset: 192)
!534 = !DILocation(line: 273, column: 15, scope: !510)
!535 = !DILocalVariable(name: "optlist", scope: !510, file: !3, line: 276, type: !536)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 56, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 7)
!539 = !DILocation(line: 276, column: 13, scope: !510)
!540 = !DILocation(line: 278, column: 8, scope: !510)
!541 = !DILocation(line: 279, column: 2, scope: !510)
!542 = !DILocation(line: 279, column: 11, scope: !510)
!543 = !DILocation(line: 279, column: 26, scope: !510)
!544 = !DILocation(line: 280, column: 2, scope: !510)
!545 = !DILocation(line: 281, column: 23, scope: !546)
!546 = distinct !DILexicalBlock(scope: !510, file: !3, line: 280, column: 5)
!547 = !DILocation(line: 281, column: 29, scope: !546)
!548 = !DILocation(line: 281, column: 34, scope: !546)
!549 = !DILocation(line: 281, column: 42, scope: !546)
!550 = !DILocation(line: 281, column: 54, scope: !546)
!551 = !DILocation(line: 281, column: 7, scope: !546)
!552 = !DILocation(line: 281, column: 5, scope: !546)
!553 = !DILocation(line: 282, column: 7, scope: !554)
!554 = distinct !DILexicalBlock(scope: !546, file: !3, line: 282, column: 7)
!555 = !DILocation(line: 282, column: 9, scope: !554)
!556 = !DILocation(line: 282, column: 7, scope: !546)
!557 = !DILocation(line: 283, column: 4, scope: !554)
!558 = !DILocation(line: 284, column: 11, scope: !546)
!559 = !DILocation(line: 284, column: 3, scope: !546)
!560 = !DILocalVariable(name: "infile", scope: !561, file: !3, line: 287, type: !43)
!561 = distinct !DILexicalBlock(scope: !562, file: !3, line: 286, column: 4)
!562 = distinct !DILexicalBlock(scope: !546, file: !3, line: 284, column: 14)
!563 = !DILocation(line: 287, column: 11, scope: !561)
!564 = !DILocation(line: 287, column: 20, scope: !561)
!565 = !DILocation(line: 288, column: 46, scope: !561)
!566 = !DILocation(line: 288, column: 32, scope: !561)
!567 = !DILocation(line: 288, column: 5, scope: !561)
!568 = !DILocation(line: 288, column: 17, scope: !561)
!569 = !DILocation(line: 288, column: 30, scope: !561)
!570 = !DILocation(line: 289, column: 12, scope: !561)
!571 = !DILocation(line: 289, column: 24, scope: !561)
!572 = !DILocation(line: 289, column: 5, scope: !561)
!573 = !DILocation(line: 291, column: 7, scope: !574)
!574 = distinct !DILexicalBlock(scope: !561, file: !3, line: 289, column: 38)
!575 = !DILocation(line: 293, column: 7, scope: !574)
!576 = !DILocation(line: 295, column: 7, scope: !574)
!577 = !DILocation(line: 297, column: 15, scope: !574)
!578 = !DILocation(line: 299, column: 8, scope: !574)
!579 = !DILocation(line: 297, column: 7, scope: !574)
!580 = !DILocation(line: 300, column: 7, scope: !574)
!581 = !DILocation(line: 302, column: 13, scope: !561)
!582 = !DILocation(line: 302, column: 25, scope: !561)
!583 = !DILocation(line: 302, column: 33, scope: !561)
!584 = !DILocation(line: 302, column: 5, scope: !561)
!585 = !DILocation(line: 304, column: 4, scope: !562)
!586 = !DILocalVariable(name: "outfile", scope: !587, file: !3, line: 310, type: !43)
!587 = distinct !DILexicalBlock(scope: !562, file: !3, line: 309, column: 4)
!588 = !DILocation(line: 310, column: 12, scope: !587)
!589 = !DILocation(line: 310, column: 22, scope: !587)
!590 = !DILocation(line: 311, column: 14, scope: !587)
!591 = !DILocation(line: 311, column: 26, scope: !587)
!592 = !DILocation(line: 311, column: 35, scope: !587)
!593 = !DILocation(line: 311, column: 6, scope: !587)
!594 = !DILocation(line: 313, column: 4, scope: !562)
!595 = !DILocation(line: 318, column: 5, scope: !562)
!596 = !DILocation(line: 319, column: 5, scope: !562)
!597 = !DILocation(line: 325, column: 48, scope: !598)
!598 = distinct !DILexicalBlock(scope: !562, file: !3, line: 324, column: 4)
!599 = !DILocation(line: 325, column: 41, scope: !598)
!600 = !DILocation(line: 325, column: 60, scope: !598)
!601 = !DILocation(line: 325, column: 34, scope: !598)
!602 = !DILocation(line: 325, column: 5, scope: !598)
!603 = !DILocation(line: 325, column: 14, scope: !598)
!604 = !DILocation(line: 325, column: 25, scope: !598)
!605 = !DILocation(line: 326, column: 12, scope: !598)
!606 = !DILocation(line: 326, column: 21, scope: !598)
!607 = !DILocation(line: 326, column: 32, scope: !598)
!608 = !DILocation(line: 326, column: 5, scope: !598)
!609 = !DILocation(line: 327, column: 5, scope: !598)
!610 = !DILocation(line: 327, column: 14, scope: !598)
!611 = !DILocation(line: 327, column: 24, scope: !598)
!612 = !DILocation(line: 329, column: 4, scope: !562)
!613 = !DILocation(line: 335, column: 5, scope: !614)
!614 = distinct !DILexicalBlock(scope: !562, file: !3, line: 334, column: 4)
!615 = !DILocation(line: 335, column: 17, scope: !614)
!616 = !DILocation(line: 335, column: 27, scope: !614)
!617 = !DILocation(line: 337, column: 4, scope: !562)
!618 = !DILocation(line: 341, column: 13, scope: !562)
!619 = !DILocation(line: 341, column: 71, scope: !562)
!620 = !DILocation(line: 341, column: 74, scope: !562)
!621 = !DILocation(line: 341, column: 5, scope: !562)
!622 = !DILocation(line: 342, column: 5, scope: !562)
!623 = !DILocation(line: 344, column: 2, scope: !546)
!624 = !DILocation(line: 344, column: 9, scope: !510)
!625 = !DILocation(line: 344, column: 11, scope: !510)
!626 = distinct !{!626, !544, !627}
!627 = !DILocation(line: 344, column: 16, scope: !510)
!628 = !DILocation(line: 347, column: 5, scope: !629)
!629 = distinct !DILexicalBlock(scope: !510, file: !3, line: 347, column: 5)
!630 = !DILocation(line: 347, column: 14, scope: !629)
!631 = !DILocation(line: 347, column: 24, scope: !629)
!632 = !DILocation(line: 347, column: 5, scope: !510)
!633 = !DILocation(line: 348, column: 8, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 348, column: 6)
!635 = distinct !DILexicalBlock(scope: !629, file: !3, line: 347, column: 28)
!636 = !DILocation(line: 348, column: 20, scope: !634)
!637 = !DILocation(line: 348, column: 29, scope: !634)
!638 = !DILocation(line: 348, column: 6, scope: !635)
!639 = !DILocation(line: 349, column: 12, scope: !640)
!640 = distinct !DILexicalBlock(scope: !634, file: !3, line: 348, column: 34)
!641 = !DILocation(line: 349, column: 4, scope: !640)
!642 = !DILocation(line: 350, column: 4, scope: !640)
!643 = !DILocation(line: 352, column: 6, scope: !644)
!644 = distinct !DILexicalBlock(scope: !635, file: !3, line: 352, column: 6)
!645 = !DILocation(line: 352, column: 15, scope: !644)
!646 = !DILocation(line: 352, column: 30, scope: !644)
!647 = !DILocation(line: 352, column: 6, scope: !635)
!648 = !DILocation(line: 353, column: 12, scope: !649)
!649 = distinct !DILexicalBlock(scope: !644, file: !3, line: 352, column: 35)
!650 = !DILocation(line: 353, column: 4, scope: !649)
!651 = !DILocation(line: 354, column: 12, scope: !649)
!652 = !DILocation(line: 354, column: 4, scope: !649)
!653 = !DILocation(line: 355, column: 4, scope: !649)
!654 = !DILocation(line: 357, column: 8, scope: !655)
!655 = distinct !DILexicalBlock(scope: !635, file: !3, line: 357, column: 6)
!656 = !DILocation(line: 357, column: 20, scope: !655)
!657 = !DILocation(line: 357, column: 31, scope: !655)
!658 = !DILocation(line: 357, column: 6, scope: !635)
!659 = !DILocation(line: 358, column: 12, scope: !660)
!660 = distinct !DILexicalBlock(scope: !655, file: !3, line: 357, column: 37)
!661 = !DILocation(line: 358, column: 4, scope: !660)
!662 = !DILocation(line: 359, column: 4, scope: !660)
!663 = !DILocation(line: 361, column: 2, scope: !635)
!664 = !DILocation(line: 362, column: 6, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !3, line: 362, column: 6)
!666 = distinct !DILexicalBlock(scope: !629, file: !3, line: 361, column: 7)
!667 = !DILocation(line: 362, column: 18, scope: !665)
!668 = !DILocation(line: 362, column: 28, scope: !665)
!669 = !DILocation(line: 362, column: 6, scope: !666)
!670 = !DILocation(line: 363, column: 12, scope: !671)
!671 = distinct !DILexicalBlock(scope: !665, file: !3, line: 362, column: 34)
!672 = !DILocation(line: 363, column: 49, scope: !671)
!673 = !DILocation(line: 363, column: 4, scope: !671)
!674 = !DILocation(line: 364, column: 12, scope: !671)
!675 = !DILocation(line: 364, column: 39, scope: !671)
!676 = !DILocation(line: 364, column: 4, scope: !671)
!677 = !DILocation(line: 365, column: 4, scope: !671)
!678 = !DILocation(line: 369, column: 2, scope: !510)
!679 = !DILocation(line: 370, column: 1, scope: !510)
!680 = distinct !DISubprogram(name: "infile_format", scope: !3, file: !3, line: 217, type: !4, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !58)
!681 = !DILocalVariable(name: "fname", arg: 1, scope: !680, file: !3, line: 217, type: !7)
!682 = !DILocation(line: 217, column: 38, scope: !680)
!683 = !DILocalVariable(name: "reader", scope: !680, file: !3, line: 219, type: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !686, line: 48, baseType: !687)
!686 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !688, line: 241, size: 1728, elements: !689)
!688 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !710, !711, !712, !713, !714, !715, !716, !717, !720, !722, !723, !724, !725, !726, !729, !730}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !687, file: !688, line: 242, baseType: !6, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !687, file: !688, line: 247, baseType: !43, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !687, file: !688, line: 248, baseType: !43, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !687, file: !688, line: 249, baseType: !43, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !687, file: !688, line: 250, baseType: !43, size: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !687, file: !688, line: 251, baseType: !43, size: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !687, file: !688, line: 252, baseType: !43, size: 64, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !687, file: !688, line: 253, baseType: !43, size: 64, offset: 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !687, file: !688, line: 254, baseType: !43, size: 64, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !687, file: !688, line: 256, baseType: !43, size: 64, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !687, file: !688, line: 257, baseType: !43, size: 64, offset: 640)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !687, file: !688, line: 258, baseType: !43, size: 64, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !687, file: !688, line: 260, baseType: !703, size: 64, offset: 768)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !688, line: 156, size: 192, elements: !705)
!705 = !{!706, !707, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !704, file: !688, line: 157, baseType: !703, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !704, file: !688, line: 158, baseType: !708, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !704, file: !688, line: 162, baseType: !6, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !687, file: !688, line: 262, baseType: !708, size: 64, offset: 832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !687, file: !688, line: 264, baseType: !6, size: 32, offset: 896)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !687, file: !688, line: 268, baseType: !6, size: 32, offset: 928)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !687, file: !688, line: 270, baseType: !239, size: 64, offset: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !687, file: !688, line: 274, baseType: !141, size: 16, offset: 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !687, file: !688, line: 275, baseType: !140, size: 8, offset: 1040)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !687, file: !688, line: 276, baseType: !102, size: 8, offset: 1048)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !687, file: !688, line: 280, baseType: !718, size: 64, offset: 1088)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !688, line: 150, baseType: null)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !687, file: !688, line: 289, baseType: !721, size: 64, offset: 1152)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !236, line: 132, baseType: !240)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !687, file: !688, line: 297, baseType: !42, size: 64, offset: 1216)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !687, file: !688, line: 298, baseType: !42, size: 64, offset: 1280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !687, file: !688, line: 299, baseType: !42, size: 64, offset: 1344)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !687, file: !688, line: 300, baseType: !42, size: 64, offset: 1408)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !687, file: !688, line: 302, baseType: !727, size: 64, offset: 1472)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !728, line: 62, baseType: !237)
!728 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !687, file: !688, line: 303, baseType: !6, size: 32, offset: 1536)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !687, file: !688, line: 305, baseType: !731, size: 160, offset: 1568)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 20)
!734 = !DILocation(line: 219, column: 8, scope: !680)
!735 = !DILocalVariable(name: "s", scope: !680, file: !3, line: 220, type: !7)
!736 = !DILocation(line: 220, column: 14, scope: !680)
!737 = !DILocalVariable(name: "magic_s", scope: !680, file: !3, line: 220, type: !7)
!738 = !DILocation(line: 220, column: 18, scope: !680)
!739 = !DILocalVariable(name: "ext_format", scope: !680, file: !3, line: 221, type: !6)
!740 = !DILocation(line: 221, column: 6, scope: !680)
!741 = !DILocalVariable(name: "magic_format", scope: !680, file: !3, line: 221, type: !6)
!742 = !DILocation(line: 221, column: 18, scope: !680)
!743 = !DILocalVariable(name: "buf", scope: !680, file: !3, line: 222, type: !744)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 96, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 12)
!747 = !DILocation(line: 222, column: 16, scope: !680)
!748 = !DILocalVariable(name: "l_nb_read", scope: !680, file: !3, line: 223, type: !15)
!749 = !DILocation(line: 223, column: 15, scope: !680)
!750 = !DILocation(line: 225, column: 17, scope: !680)
!751 = !DILocation(line: 225, column: 11, scope: !680)
!752 = !DILocation(line: 225, column: 9, scope: !680)
!753 = !DILocation(line: 227, column: 6, scope: !754)
!754 = distinct !DILexicalBlock(scope: !680, file: !3, line: 227, column: 6)
!755 = !DILocation(line: 227, column: 13, scope: !754)
!756 = !DILocation(line: 227, column: 6, scope: !680)
!757 = !DILocation(line: 228, column: 3, scope: !754)
!758 = !DILocation(line: 230, column: 2, scope: !680)
!759 = !DILocation(line: 231, column: 20, scope: !680)
!760 = !DILocation(line: 231, column: 32, scope: !680)
!761 = !DILocation(line: 231, column: 14, scope: !680)
!762 = !DILocation(line: 231, column: 12, scope: !680)
!763 = !DILocation(line: 232, column: 9, scope: !680)
!764 = !DILocation(line: 232, column: 2, scope: !680)
!765 = !DILocation(line: 233, column: 6, scope: !766)
!766 = distinct !DILexicalBlock(scope: !680, file: !3, line: 233, column: 6)
!767 = !DILocation(line: 233, column: 16, scope: !766)
!768 = !DILocation(line: 233, column: 6, scope: !680)
!769 = !DILocation(line: 234, column: 3, scope: !766)
!770 = !DILocation(line: 238, column: 31, scope: !680)
!771 = !DILocation(line: 238, column: 15, scope: !680)
!772 = !DILocation(line: 238, column: 13, scope: !680)
!773 = !DILocation(line: 240, column: 6, scope: !774)
!774 = distinct !DILexicalBlock(scope: !680, file: !3, line: 240, column: 6)
!775 = !DILocation(line: 240, column: 17, scope: !774)
!776 = !DILocation(line: 240, column: 6, scope: !680)
!777 = !DILocation(line: 241, column: 3, scope: !774)
!778 = !DILocation(line: 243, column: 13, scope: !779)
!779 = distinct !DILexicalBlock(scope: !680, file: !3, line: 243, column: 6)
!780 = !DILocation(line: 243, column: 6, scope: !779)
!781 = !DILocation(line: 243, column: 41, scope: !779)
!782 = !DILocation(line: 243, column: 46, scope: !779)
!783 = !DILocation(line: 243, column: 56, scope: !779)
!784 = !DILocation(line: 243, column: 49, scope: !779)
!785 = !DILocation(line: 243, column: 75, scope: !779)
!786 = !DILocation(line: 243, column: 6, scope: !680)
!787 = !DILocation(line: 244, column: 16, scope: !788)
!788 = distinct !DILexicalBlock(scope: !779, file: !3, line: 243, column: 81)
!789 = !DILocation(line: 245, column: 11, scope: !788)
!790 = !DILocation(line: 246, column: 2, scope: !788)
!791 = !DILocation(line: 247, column: 18, scope: !792)
!792 = distinct !DILexicalBlock(scope: !779, file: !3, line: 247, column: 11)
!793 = !DILocation(line: 247, column: 11, scope: !792)
!794 = !DILocation(line: 247, column: 48, scope: !792)
!795 = !DILocation(line: 247, column: 11, scope: !779)
!796 = !DILocation(line: 248, column: 16, scope: !797)
!797 = distinct !DILexicalBlock(scope: !792, file: !3, line: 247, column: 54)
!798 = !DILocation(line: 249, column: 11, scope: !797)
!799 = !DILocation(line: 250, column: 2, scope: !797)
!800 = !DILocation(line: 252, column: 3, scope: !792)
!801 = !DILocation(line: 254, column: 6, scope: !802)
!802 = distinct !DILexicalBlock(scope: !680, file: !3, line: 254, column: 6)
!803 = !DILocation(line: 254, column: 22, scope: !802)
!804 = !DILocation(line: 254, column: 19, scope: !802)
!805 = !DILocation(line: 254, column: 6, scope: !680)
!806 = !DILocation(line: 255, column: 10, scope: !802)
!807 = !DILocation(line: 255, column: 3, scope: !802)
!808 = !DILocation(line: 257, column: 6, scope: !680)
!809 = !DILocation(line: 257, column: 21, scope: !680)
!810 = !DILocation(line: 257, column: 14, scope: !680)
!811 = !DILocation(line: 257, column: 12, scope: !680)
!812 = !DILocation(line: 257, column: 28, scope: !680)
!813 = !DILocation(line: 257, column: 4, scope: !680)
!814 = !DILocation(line: 259, column: 59, scope: !680)
!815 = !DILocation(line: 259, column: 2, scope: !680)
!816 = !DILocation(line: 260, column: 10, scope: !680)
!817 = !DILocation(line: 261, column: 34, scope: !680)
!818 = !DILocation(line: 261, column: 37, scope: !680)
!819 = !DILocation(line: 260, column: 2, scope: !680)
!820 = !DILocation(line: 262, column: 57, scope: !680)
!821 = !DILocation(line: 262, column: 2, scope: !680)
!822 = !DILocation(line: 264, column: 9, scope: !680)
!823 = !DILocation(line: 264, column: 2, scope: !680)
!824 = !DILocation(line: 265, column: 1, scope: !680)
!825 = distinct !DISubprogram(name: "error_callback", scope: !3, file: !3, line: 377, type: !826, scopeLine: 377, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !7, !42}
!828 = !DILocalVariable(name: "msg", arg: 1, scope: !825, file: !3, line: 377, type: !7)
!829 = !DILocation(line: 377, column: 33, scope: !825)
!830 = !DILocalVariable(name: "client_data", arg: 2, scope: !825, file: !3, line: 377, type: !42)
!831 = !DILocation(line: 377, column: 44, scope: !825)
!832 = !DILocation(line: 378, column: 8, scope: !825)
!833 = !DILocation(line: 379, column: 10, scope: !825)
!834 = !DILocation(line: 379, column: 32, scope: !825)
!835 = !DILocation(line: 379, column: 2, scope: !825)
!836 = !DILocation(line: 380, column: 1, scope: !825)
!837 = distinct !DISubprogram(name: "warning_callback", scope: !3, file: !3, line: 384, type: !826, scopeLine: 384, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!838 = !DILocalVariable(name: "msg", arg: 1, scope: !837, file: !3, line: 384, type: !7)
!839 = !DILocation(line: 384, column: 35, scope: !837)
!840 = !DILocalVariable(name: "client_data", arg: 2, scope: !837, file: !3, line: 384, type: !42)
!841 = !DILocation(line: 384, column: 46, scope: !837)
!842 = !DILocation(line: 385, column: 8, scope: !837)
!843 = !DILocation(line: 386, column: 10, scope: !837)
!844 = !DILocation(line: 386, column: 34, scope: !837)
!845 = !DILocation(line: 386, column: 2, scope: !837)
!846 = !DILocation(line: 387, column: 1, scope: !837)
!847 = distinct !DISubprogram(name: "info_callback", scope: !3, file: !3, line: 391, type: !826, scopeLine: 391, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!848 = !DILocalVariable(name: "msg", arg: 1, scope: !847, file: !3, line: 391, type: !7)
!849 = !DILocation(line: 391, column: 32, scope: !847)
!850 = !DILocalVariable(name: "client_data", arg: 2, scope: !847, file: !3, line: 391, type: !42)
!851 = !DILocation(line: 391, column: 43, scope: !847)
!852 = !DILocation(line: 392, column: 8, scope: !847)
!853 = !DILocation(line: 393, column: 10, scope: !847)
!854 = !DILocation(line: 393, column: 31, scope: !847)
!855 = !DILocation(line: 393, column: 2, scope: !847)
!856 = !DILocation(line: 394, column: 1, scope: !847)
!857 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 401, type: !858, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !58)
!858 = !DISubroutineType(types: !859)
!859 = !{!6, !6, !50}
!860 = !DILocalVariable(name: "argc", arg: 1, scope: !857, file: !3, line: 401, type: !6)
!861 = !DILocation(line: 401, column: 14, scope: !857)
!862 = !DILocalVariable(name: "argv", arg: 2, scope: !857, file: !3, line: 401, type: !50)
!863 = !DILocation(line: 401, column: 26, scope: !857)
!864 = !DILocalVariable(name: "fsrc", scope: !857, file: !3, line: 403, type: !684)
!865 = !DILocation(line: 403, column: 8, scope: !857)
!866 = !DILocalVariable(name: "fout", scope: !857, file: !3, line: 403, type: !684)
!867 = !DILocation(line: 403, column: 22, scope: !857)
!868 = !DILocalVariable(name: "parameters", scope: !857, file: !3, line: 405, type: !398)
!869 = !DILocation(line: 405, column: 20, scope: !857)
!870 = !DILocalVariable(name: "image", scope: !857, file: !3, line: 406, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_image_t", file: !14, line: 654, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_image", file: !14, line: 635, size: 384, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !882, !903, !906}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !873, file: !14, line: 637, baseType: !149, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !873, file: !14, line: 639, baseType: !149, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !873, file: !14, line: 641, baseType: !149, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !873, file: !14, line: 643, baseType: !149, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "numcomps", scope: !873, file: !14, line: 645, baseType: !149, size: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !873, file: !14, line: 647, baseType: !881, size: 32, offset: 160)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_COLOR_SPACE", file: !14, line: 187, baseType: !20)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !873, file: !14, line: 649, baseType: !883, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_image_comp_t", file: !14, line: 630, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_image_comp", file: !14, line: 605, size: 448, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !885, file: !14, line: 607, baseType: !149, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !885, file: !14, line: 609, baseType: !149, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !885, file: !14, line: 611, baseType: !149, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !885, file: !14, line: 613, baseType: !149, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !885, file: !14, line: 615, baseType: !149, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !885, file: !14, line: 617, baseType: !149, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !885, file: !14, line: 619, baseType: !149, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !885, file: !14, line: 621, baseType: !149, size: 32, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "sgnd", scope: !885, file: !14, line: 623, baseType: !149, size: 32, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "resno_decoded", scope: !885, file: !14, line: 625, baseType: !149, size: 32, offset: 288)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !885, file: !14, line: 627, baseType: !149, size: 32, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !885, file: !14, line: 629, baseType: !899, size: 64, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_INT32", file: !14, line: 90, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !902, line: 196, baseType: !6)
!902 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!903 = !DIDerivedType(tag: DW_TAG_member, name: "icc_profile_buf", scope: !873, file: !14, line: 651, baseType: !904, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_BYTE", file: !14, line: 82, baseType: !137)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "icc_profile_len", scope: !873, file: !14, line: 653, baseType: !149, size: 32, offset: 320)
!907 = !DILocation(line: 406, column: 15, scope: !857)
!908 = !DILocalVariable(name: "l_codec", scope: !857, file: !3, line: 407, type: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_codec_t", file: !14, line: 542, baseType: !42)
!911 = !DILocation(line: 407, column: 15, scope: !857)
!912 = !DILocalVariable(name: "l_stream", scope: !857, file: !3, line: 408, type: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_stream_t", file: !14, line: 594, baseType: !42)
!915 = !DILocation(line: 408, column: 16, scope: !857)
!916 = !DILocalVariable(name: "cstr_info", scope: !857, file: !3, line: 409, type: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_codestream_info_v2_t", file: !14, line: 912, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_codestream_info_v2", file: !14, line: 888, size: 576, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !963}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tx0", scope: !919, file: !14, line: 891, baseType: !149, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ty0", scope: !919, file: !14, line: 893, baseType: !149, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tdx", scope: !919, file: !14, line: 895, baseType: !149, size: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tdy", scope: !919, file: !14, line: 897, baseType: !149, size: 32, offset: 96)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tw", scope: !919, file: !14, line: 899, baseType: !149, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "th", scope: !919, file: !14, line: 901, baseType: !149, size: 32, offset: 160)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nbcomps", scope: !919, file: !14, line: 904, baseType: !149, size: 32, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "m_default_tile_info", scope: !919, file: !14, line: 907, baseType: !929, size: 256, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_tile_info_v2_t", file: !14, line: 883, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_tile_v2_info", file: !14, line: 867, size: 256, elements: !931)
!931 = !{!932, !933, !934, !936, !937, !938}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tileno", scope: !930, file: !14, line: 870, baseType: !6, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "csty", scope: !930, file: !14, line: 872, baseType: !149, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "prg", scope: !930, file: !14, line: 874, baseType: !935, size: 32, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_PROG_ORDER", file: !14, line: 176, baseType: !27)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "numlayers", scope: !930, file: !14, line: 876, baseType: !149, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mct", scope: !930, file: !14, line: 878, baseType: !149, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tccp_info", scope: !930, file: !14, line: 881, baseType: !939, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_tccp_info_t", file: !14, line: 862, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_tccp_info", file: !14, line: 831, size: 8640, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950, !951, !955, !956, !957, !958, !962}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "compno", scope: !941, file: !14, line: 834, baseType: !149, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "csty", scope: !941, file: !14, line: 836, baseType: !149, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "numresolutions", scope: !941, file: !14, line: 838, baseType: !149, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "cblkw", scope: !941, file: !14, line: 840, baseType: !149, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "cblkh", scope: !941, file: !14, line: 842, baseType: !149, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cblksty", scope: !941, file: !14, line: 844, baseType: !149, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "qmfbid", scope: !941, file: !14, line: 846, baseType: !149, size: 32, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "qntsty", scope: !941, file: !14, line: 848, baseType: !149, size: 32, offset: 224)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "stepsizes_mant", scope: !941, file: !14, line: 850, baseType: !952, size: 3104, offset: 256)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 3104, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 97)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "stepsizes_expn", scope: !941, file: !14, line: 852, baseType: !952, size: 3104, offset: 3360)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "numgbits", scope: !941, file: !14, line: 854, baseType: !149, size: 32, offset: 6464)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "roishift", scope: !941, file: !14, line: 856, baseType: !900, size: 32, offset: 6496)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "prcw", scope: !941, file: !14, line: 858, baseType: !959, size: 1056, offset: 6528)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 1056, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 33)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "prch", scope: !941, file: !14, line: 860, baseType: !959, size: 1056, offset: 7584)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !919, file: !14, line: 910, baseType: !964, size: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!965 = !DILocation(line: 409, column: 28, scope: !857)
!966 = !DILocalVariable(name: "cstr_index", scope: !857, file: !3, line: 410, type: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_codestream_index_t", file: !14, line: 986, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_codestream_index", file: !14, line: 963, size: 448, elements: !970)
!970 = !{!971, !975, !976, !979, !980, !988, !989, !990}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "main_head_start", scope: !969, file: !14, line: 965, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_OFF_T", file: !973, line: 49, baseType: !974)
!973 = !DIFile(filename: "libopenjpeg/opj_stdint.h", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src")
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !902, line: 197, baseType: !240)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "main_head_end", scope: !969, file: !14, line: 967, baseType: !972, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "codestream_size", scope: !969, file: !14, line: 970, baseType: !977, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_UINT64", file: !14, line: 93, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !151, line: 55, baseType: !237)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "marknum", scope: !969, file: !14, line: 974, baseType: !149, size: 32, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !969, file: !14, line: 976, baseType: !981, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_marker_info_t", file: !14, line: 714, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_marker_info_t", file: !14, line: 707, size: 192, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !14, line: 709, baseType: !141, size: 16)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !983, file: !14, line: 711, baseType: !972, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !983, file: !14, line: 713, baseType: !6, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "maxmarknum", scope: !969, file: !14, line: 978, baseType: !149, size: 32, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nb_of_tiles", scope: !969, file: !14, line: 982, baseType: !149, size: 32, offset: 352)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "tile_index", scope: !969, file: !14, line: 984, baseType: !991, size: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_tile_index_t", file: !14, line: 958, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_tile_index", file: !14, line: 931, size: 448, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1007, !1008, !1009, !1010, !1011}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "tileno", scope: !993, file: !14, line: 933, baseType: !149, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "nb_tps", scope: !993, file: !14, line: 936, baseType: !149, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "current_nb_tps", scope: !993, file: !14, line: 938, baseType: !149, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "current_tpsno", scope: !993, file: !14, line: 940, baseType: !149, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tp_index", scope: !993, file: !14, line: 942, baseType: !1000, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_tp_index_t", file: !14, line: 926, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_tp_index", file: !14, line: 918, size: 192, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !1002, file: !14, line: 920, baseType: !972, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "end_header", scope: !1002, file: !14, line: 922, baseType: !972, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "end_pos", scope: !1002, file: !14, line: 924, baseType: !972, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "marknum", scope: !993, file: !14, line: 946, baseType: !149, size: 32, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !993, file: !14, line: 948, baseType: !981, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "maxmarknum", scope: !993, file: !14, line: 950, baseType: !149, size: 32, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nb_packet", scope: !993, file: !14, line: 954, baseType: !149, size: 32, offset: 352)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "packet_index", scope: !993, file: !14, line: 956, baseType: !1012, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_packet_info_t", file: !14, line: 700, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_packet_info", file: !14, line: 691, size: 256, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !1014, file: !14, line: 693, baseType: !972, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "end_ph_pos", scope: !1014, file: !14, line: 695, baseType: !972, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "end_pos", scope: !1014, file: !14, line: 697, baseType: !972, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "disto", scope: !1014, file: !14, line: 699, baseType: !1020, size: 64, offset: 192)
!1020 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1021 = !DILocation(line: 410, column: 26, scope: !857)
!1022 = !DILocalVariable(name: "num_images", scope: !857, file: !3, line: 412, type: !900)
!1023 = !DILocation(line: 412, column: 12, scope: !857)
!1024 = !DILocalVariable(name: "imageno", scope: !857, file: !3, line: 412, type: !900)
!1025 = !DILocation(line: 412, column: 24, scope: !857)
!1026 = !DILocalVariable(name: "img_fol", scope: !857, file: !3, line: 413, type: !390)
!1027 = !DILocation(line: 413, column: 12, scope: !857)
!1028 = !DILocalVariable(name: "dirptr", scope: !857, file: !3, line: 414, type: !44)
!1029 = !DILocation(line: 414, column: 12, scope: !857)
!1030 = !DILocation(line: 423, column: 2, scope: !857)
!1031 = !DILocation(line: 426, column: 2, scope: !857)
!1032 = !DILocation(line: 429, column: 27, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !857, file: !3, line: 429, column: 5)
!1034 = !DILocation(line: 429, column: 33, scope: !1033)
!1035 = !DILocation(line: 429, column: 5, scope: !1033)
!1036 = !DILocation(line: 429, column: 61, scope: !1033)
!1037 = !DILocation(line: 429, column: 5, scope: !857)
!1038 = !DILocation(line: 430, column: 3, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 429, column: 67)
!1040 = !DILocation(line: 434, column: 13, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !857, file: !3, line: 434, column: 5)
!1042 = !DILocation(line: 434, column: 5, scope: !1041)
!1043 = !DILocation(line: 434, column: 23, scope: !1041)
!1044 = !DILocation(line: 434, column: 5, scope: !857)
!1045 = !DILocalVariable(name: "it_image", scope: !1046, file: !3, line: 435, type: !6)
!1046 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 434, column: 27)
!1047 = !DILocation(line: 435, column: 7, scope: !1046)
!1048 = !DILocation(line: 436, column: 37, scope: !1046)
!1049 = !DILocation(line: 436, column: 14, scope: !1046)
!1050 = !DILocation(line: 436, column: 13, scope: !1046)
!1051 = !DILocation(line: 438, column: 21, scope: !1046)
!1052 = !DILocation(line: 438, column: 10, scope: !1046)
!1053 = !DILocation(line: 438, column: 9, scope: !1046)
!1054 = !DILocation(line: 439, column: 6, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 439, column: 6)
!1056 = !DILocation(line: 439, column: 6, scope: !1046)
!1057 = !DILocation(line: 440, column: 41, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 439, column: 13)
!1059 = !DILocation(line: 440, column: 51, scope: !1058)
!1060 = !DILocation(line: 440, column: 64, scope: !1058)
!1061 = !DILocation(line: 440, column: 34, scope: !1058)
!1062 = !DILocation(line: 440, column: 4, scope: !1058)
!1063 = !DILocation(line: 440, column: 12, scope: !1058)
!1064 = !DILocation(line: 440, column: 25, scope: !1058)
!1065 = !DILocation(line: 441, column: 39, scope: !1058)
!1066 = !DILocation(line: 441, column: 49, scope: !1058)
!1067 = !DILocation(line: 441, column: 32, scope: !1058)
!1068 = !DILocation(line: 441, column: 23, scope: !1058)
!1069 = !DILocation(line: 441, column: 4, scope: !1058)
!1070 = !DILocation(line: 441, column: 12, scope: !1058)
!1071 = !DILocation(line: 441, column: 21, scope: !1058)
!1072 = !DILocation(line: 443, column: 8, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 443, column: 7)
!1074 = !DILocation(line: 443, column: 16, scope: !1073)
!1075 = !DILocation(line: 443, column: 7, scope: !1058)
!1076 = !DILocation(line: 444, column: 5, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 443, column: 29)
!1078 = !DILocation(line: 447, column: 16, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 447, column: 4)
!1080 = !DILocation(line: 447, column: 8, scope: !1079)
!1081 = !DILocation(line: 447, column: 19, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 447, column: 4)
!1083 = !DILocation(line: 447, column: 28, scope: !1082)
!1084 = !DILocation(line: 447, column: 27, scope: !1082)
!1085 = !DILocation(line: 447, column: 4, scope: !1079)
!1086 = !DILocation(line: 448, column: 34, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 447, column: 50)
!1088 = !DILocation(line: 448, column: 42, scope: !1087)
!1089 = !DILocation(line: 448, column: 57, scope: !1087)
!1090 = !DILocation(line: 448, column: 65, scope: !1087)
!1091 = !DILocation(line: 448, column: 55, scope: !1087)
!1092 = !DILocation(line: 448, column: 5, scope: !1087)
!1093 = !DILocation(line: 448, column: 13, scope: !1087)
!1094 = !DILocation(line: 448, column: 22, scope: !1087)
!1095 = !DILocation(line: 448, column: 32, scope: !1087)
!1096 = !DILocation(line: 449, column: 4, scope: !1087)
!1097 = !DILocation(line: 447, column: 47, scope: !1082)
!1098 = !DILocation(line: 447, column: 4, scope: !1082)
!1099 = distinct !{!1099, !1085, !1100}
!1100 = !DILocation(line: 449, column: 4, scope: !1079)
!1101 = !DILocation(line: 450, column: 3, scope: !1058)
!1102 = !DILocation(line: 451, column: 18, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 451, column: 6)
!1104 = !DILocation(line: 451, column: 33, scope: !1103)
!1105 = !DILocation(line: 451, column: 6, scope: !1103)
!1106 = !DILocation(line: 451, column: 44, scope: !1103)
!1107 = !DILocation(line: 451, column: 6, scope: !1046)
!1108 = !DILocation(line: 452, column: 4, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 451, column: 48)
!1110 = !DILocation(line: 455, column: 7, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 455, column: 7)
!1112 = !DILocation(line: 455, column: 17, scope: !1111)
!1113 = !DILocation(line: 455, column: 7, scope: !1046)
!1114 = !DILocation(line: 456, column: 12, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 455, column: 21)
!1116 = !DILocation(line: 456, column: 4, scope: !1115)
!1117 = !DILocation(line: 457, column: 4, scope: !1115)
!1118 = !DILocation(line: 459, column: 2, scope: !1046)
!1119 = !DILocation(line: 460, column: 13, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 459, column: 7)
!1121 = !DILocation(line: 464, column: 17, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !857, file: !3, line: 464, column: 6)
!1123 = !DILocation(line: 464, column: 6, scope: !1122)
!1124 = !DILocation(line: 464, column: 28, scope: !1122)
!1125 = !DILocation(line: 464, column: 6, scope: !857)
!1126 = !DILocation(line: 465, column: 27, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 464, column: 33)
!1128 = !DILocation(line: 465, column: 16, scope: !1127)
!1129 = !DILocation(line: 465, column: 10, scope: !1127)
!1130 = !DILocation(line: 465, column: 8, scope: !1127)
!1131 = !DILocation(line: 466, column: 8, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 466, column: 7)
!1133 = !DILocation(line: 466, column: 7, scope: !1127)
!1134 = !DILocation(line: 467, column: 12, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 466, column: 13)
!1136 = !DILocation(line: 467, column: 75, scope: !1135)
!1137 = !DILocation(line: 467, column: 64, scope: !1135)
!1138 = !DILocation(line: 467, column: 4, scope: !1135)
!1139 = !DILocation(line: 468, column: 4, scope: !1135)
!1140 = !DILocation(line: 470, column: 2, scope: !1127)
!1141 = !DILocation(line: 472, column: 10, scope: !1122)
!1142 = !DILocation(line: 472, column: 8, scope: !1122)
!1143 = !DILocation(line: 475, column: 14, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !857, file: !3, line: 475, column: 2)
!1145 = !DILocation(line: 475, column: 6, scope: !1144)
!1146 = !DILocation(line: 475, column: 19, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 475, column: 2)
!1148 = !DILocation(line: 475, column: 29, scope: !1147)
!1149 = !DILocation(line: 475, column: 27, scope: !1147)
!1150 = !DILocation(line: 475, column: 2, scope: !1144)
!1151 = !DILocation(line: 477, column: 11, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 475, column: 52)
!1153 = !DILocation(line: 477, column: 3, scope: !1152)
!1154 = !DILocation(line: 479, column: 14, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 479, column: 6)
!1156 = !DILocation(line: 479, column: 6, scope: !1155)
!1157 = !DILocation(line: 479, column: 24, scope: !1155)
!1158 = !DILocation(line: 479, column: 6, scope: !1152)
!1159 = !DILocation(line: 480, column: 22, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 480, column: 8)
!1161 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 479, column: 28)
!1162 = !DILocation(line: 480, column: 31, scope: !1160)
!1163 = !DILocation(line: 480, column: 8, scope: !1160)
!1164 = !DILocation(line: 480, column: 8, scope: !1161)
!1165 = !DILocation(line: 481, column: 13, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 480, column: 62)
!1167 = !DILocation(line: 481, column: 5, scope: !1166)
!1168 = !DILocation(line: 482, column: 5, scope: !1166)
!1169 = !DILocation(line: 484, column: 3, scope: !1161)
!1170 = !DILocation(line: 488, column: 27, scope: !1152)
!1171 = !DILocation(line: 488, column: 16, scope: !1152)
!1172 = !DILocation(line: 488, column: 10, scope: !1152)
!1173 = !DILocation(line: 488, column: 8, scope: !1152)
!1174 = !DILocation(line: 489, column: 8, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 489, column: 7)
!1176 = !DILocation(line: 489, column: 7, scope: !1152)
!1177 = !DILocation(line: 490, column: 12, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 489, column: 14)
!1179 = !DILocation(line: 490, column: 75, scope: !1178)
!1180 = !DILocation(line: 490, column: 64, scope: !1178)
!1181 = !DILocation(line: 490, column: 4, scope: !1178)
!1182 = !DILocation(line: 491, column: 4, scope: !1178)
!1183 = !DILocation(line: 494, column: 52, scope: !1152)
!1184 = !DILocation(line: 494, column: 14, scope: !1152)
!1185 = !DILocation(line: 494, column: 12, scope: !1152)
!1186 = !DILocation(line: 495, column: 8, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 495, column: 7)
!1188 = !DILocation(line: 495, column: 7, scope: !1152)
!1189 = !DILocation(line: 496, column: 11, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 495, column: 17)
!1191 = !DILocation(line: 496, column: 4, scope: !1190)
!1192 = !DILocation(line: 497, column: 12, scope: !1190)
!1193 = !DILocation(line: 497, column: 4, scope: !1190)
!1194 = !DILocation(line: 498, column: 4, scope: !1190)
!1195 = !DILocation(line: 504, column: 21, scope: !1152)
!1196 = !DILocation(line: 504, column: 3, scope: !1152)
!1197 = !DILocation(line: 508, column: 15, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 506, column: 4)
!1199 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 504, column: 35)
!1200 = !DILocation(line: 508, column: 13, scope: !1198)
!1201 = !DILocation(line: 509, column: 5, scope: !1198)
!1202 = !DILocation(line: 514, column: 15, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 512, column: 4)
!1204 = !DILocation(line: 514, column: 13, scope: !1203)
!1205 = !DILocation(line: 515, column: 5, scope: !1203)
!1206 = !DILocation(line: 520, column: 15, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 518, column: 4)
!1208 = !DILocation(line: 520, column: 13, scope: !1207)
!1209 = !DILocation(line: 521, column: 5, scope: !1207)
!1210 = !DILocation(line: 524, column: 13, scope: !1199)
!1211 = !DILocation(line: 524, column: 5, scope: !1199)
!1212 = !DILocation(line: 525, column: 24, scope: !1199)
!1213 = !DILocation(line: 525, column: 5, scope: !1199)
!1214 = !DILocation(line: 526, column: 5, scope: !1199)
!1215 = !DILocation(line: 530, column: 24, scope: !1152)
!1216 = !DILocation(line: 530, column: 3, scope: !1152)
!1217 = !DILocation(line: 531, column: 27, scope: !1152)
!1218 = !DILocation(line: 531, column: 3, scope: !1152)
!1219 = !DILocation(line: 532, column: 25, scope: !1152)
!1220 = !DILocation(line: 532, column: 3, scope: !1152)
!1221 = !DILocation(line: 535, column: 27, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 535, column: 8)
!1223 = !DILocation(line: 535, column: 9, scope: !1222)
!1224 = !DILocation(line: 535, column: 8, scope: !1152)
!1225 = !DILocation(line: 536, column: 12, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 535, column: 50)
!1227 = !DILocation(line: 536, column: 4, scope: !1226)
!1228 = !DILocation(line: 537, column: 23, scope: !1226)
!1229 = !DILocation(line: 537, column: 4, scope: !1226)
!1230 = !DILocation(line: 538, column: 11, scope: !1226)
!1231 = !DILocation(line: 538, column: 4, scope: !1226)
!1232 = !DILocation(line: 539, column: 22, scope: !1226)
!1233 = !DILocation(line: 539, column: 4, scope: !1226)
!1234 = !DILocation(line: 540, column: 11, scope: !1226)
!1235 = !DILocation(line: 540, column: 4, scope: !1226)
!1236 = !DILocation(line: 541, column: 4, scope: !1226)
!1237 = !DILocation(line: 545, column: 24, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 545, column: 6)
!1239 = !DILocation(line: 545, column: 34, scope: !1238)
!1240 = !DILocation(line: 545, column: 8, scope: !1238)
!1241 = !DILocation(line: 545, column: 6, scope: !1152)
!1242 = !DILocation(line: 546, column: 12, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 545, column: 51)
!1244 = !DILocation(line: 546, column: 4, scope: !1243)
!1245 = !DILocation(line: 547, column: 23, scope: !1243)
!1246 = !DILocation(line: 547, column: 4, scope: !1243)
!1247 = !DILocation(line: 548, column: 11, scope: !1243)
!1248 = !DILocation(line: 548, column: 4, scope: !1243)
!1249 = !DILocation(line: 549, column: 22, scope: !1243)
!1250 = !DILocation(line: 549, column: 4, scope: !1243)
!1251 = !DILocation(line: 550, column: 22, scope: !1243)
!1252 = !DILocation(line: 550, column: 4, scope: !1243)
!1253 = !DILocation(line: 551, column: 11, scope: !1243)
!1254 = !DILocation(line: 551, column: 4, scope: !1243)
!1255 = !DILocation(line: 552, column: 4, scope: !1243)
!1256 = !DILocation(line: 555, column: 18, scope: !1152)
!1257 = !DILocation(line: 555, column: 76, scope: !1152)
!1258 = !DILocation(line: 555, column: 3, scope: !1152)
!1259 = !DILocation(line: 557, column: 33, scope: !1152)
!1260 = !DILocation(line: 557, column: 15, scope: !1152)
!1261 = !DILocation(line: 557, column: 13, scope: !1152)
!1262 = !DILocation(line: 559, column: 35, scope: !1152)
!1263 = !DILocation(line: 559, column: 16, scope: !1152)
!1264 = !DILocation(line: 559, column: 14, scope: !1152)
!1265 = !DILocation(line: 562, column: 22, scope: !1152)
!1266 = !DILocation(line: 562, column: 3, scope: !1152)
!1267 = !DILocation(line: 563, column: 10, scope: !1152)
!1268 = !DILocation(line: 563, column: 3, scope: !1152)
!1269 = !DILocation(line: 566, column: 7, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 566, column: 7)
!1271 = !DILocation(line: 566, column: 7, scope: !1152)
!1272 = !DILocation(line: 567, column: 22, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 566, column: 16)
!1274 = !DILocation(line: 567, column: 4, scope: !1273)
!1275 = !DILocation(line: 568, column: 3, scope: !1273)
!1276 = !DILocation(line: 571, column: 21, scope: !1152)
!1277 = !DILocation(line: 571, column: 3, scope: !1152)
!1278 = !DILocation(line: 574, column: 3, scope: !1152)
!1279 = !DILocation(line: 577, column: 3, scope: !1152)
!1280 = !DILocation(line: 579, column: 2, scope: !1152)
!1281 = !DILocation(line: 475, column: 49, scope: !1147)
!1282 = !DILocation(line: 475, column: 2, scope: !1147)
!1283 = distinct !{!1283, !1150, !1284}
!1284 = !DILocation(line: 579, column: 2, scope: !1144)
!1285 = !DILocation(line: 582, column: 9, scope: !857)
!1286 = !DILocation(line: 582, column: 2, scope: !857)
!1287 = !DILocation(line: 584, column: 3, scope: !857)
!1288 = !DILocation(line: 585, column: 1, scope: !857)
!1289 = distinct !DISubprogram(name: "tgatoimage", scope: !1290, file: !1290, line: 254, type: !1291, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !105, retainedNodes: !58)
!1290 = !DIFile(filename: "convert.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!1293, !7, !1322}
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_image_t", file: !14, line: 654, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_image", file: !14, line: 635, size: 384, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302, !1303, !1320, !1321}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !1295, file: !14, line: 637, baseType: !149, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !1295, file: !14, line: 639, baseType: !149, size: 32, offset: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !1295, file: !14, line: 641, baseType: !149, size: 32, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !1295, file: !14, line: 643, baseType: !149, size: 32, offset: 96)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "numcomps", scope: !1295, file: !14, line: 645, baseType: !149, size: 32, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1295, file: !14, line: 647, baseType: !881, size: 32, offset: 160)
