; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.dircnt = type { i8*, i8** }
%struct.img_folder = type { i8*, i8*, i8, i8 }
%struct.opj_dparameters = type { i32, i32, [4096 x i8], [4096 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.opj_option = type { i8*, i32, i32*, i32 }
%struct.opj_image = type { i32, i32, i32, i32, i32, i32, %struct.opj_image_comp*, i8*, i32 }
%struct.opj_image_comp = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32* }
%struct.opj_codestream_index = type { i64, i64, i64, i32, %struct.opj_marker_info_t*, i32, i32, %struct.opj_tile_index* }
%struct.opj_marker_info_t = type { i16, i64, i32 }
%struct.opj_tile_index = type { i32, i32, i32, i32, %struct.opj_tp_index*, i32, %struct.opj_marker_info_t*, i32, i32, %struct.opj_packet_info* }
%struct.opj_tp_index = type { i64, i64, i64 }
%struct.opj_packet_info = type { i64, i64, i64, double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "extension", scope: !2, file: !3, line: 217, type: !51, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "get_file_format", scope: !3, file: !3, line: 215, type: !4, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!3 = !DIFile(filename: "j2k_to_image.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !11, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !12, retainedTypes: !33, globals: !43, nameTableKind: None)
!11 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec/j2k_to_image.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!12 = !{!13, !20, !27}
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LIMIT_DECODING", file: !14, line: 202, baseType: !15, size: 32, elements: !16)
!14 = !DIFile(filename: "libopenjpeg/openjpeg.h", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "NO_LIMITATION", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "LIMIT_TO_MAIN_HEADER", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "DECODE_ALL_BUT_PACKETS", value: 2, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "COLOR_SPACE", file: !14, line: 181, baseType: !6, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "CLRSPC_UNKNOWN", value: -1)
!23 = !DIEnumerator(name: "CLRSPC_UNSPECIFIED", value: 0)
!24 = !DIEnumerator(name: "CLRSPC_SRGB", value: 1)
!25 = !DIEnumerator(name: "CLRSPC_GRAY", value: 2)
!26 = !DIEnumerator(name: "CLRSPC_SYCC", value: 3)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CODEC_FORMAT", file: !14, line: 192, baseType: !6, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIEnumerator(name: "CODEC_UNKNOWN", value: -1)
!30 = !DIEnumerator(name: "CODEC_J2K", value: 0)
!31 = !DIEnumerator(name: "CODEC_JPT", value: 1)
!32 = !DIEnumerator(name: "CODEC_JP2", value: 2)
!33 = !{!34, !35, !6, !36, !42}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "dircnt_t", file: !3, line: 73, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dircnt", file: !3, line: 68, size: 128, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "filename_buf", scope: !38, file: !3, line: 70, baseType: !35, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !38, file: !3, line: 72, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!43 = !{!0, !44}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 218, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 480, elements: !48)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!48 = !{!49}
!49 = !DISubrange(count: 15)
!50 = !{}
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 960, elements: !48)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "opj_opterr", scope: !54, file: !60, line: 45, type: !6, isLocal: false, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !50, retainedTypes: !56, globals: !57, nameTableKind: None)
!55 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/common/opj_getopt.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!56 = !{!6}
!57 = !{!52, !58, !61, !68, !84, !86, !88, !90, !92}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "opj_optind", scope: !54, file: !60, line: 46, type: !6, isLocal: false, isDefinition: true)
!60 = !DIFile(filename: "common/opj_getopt.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications")
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "place", scope: !63, file: !60, line: 67, type: !35, isLocal: true, isDefinition: true)
!63 = distinct !DISubprogram(name: "opj_getopt", scope: !60, file: !60, line: 65, type: !64, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !50)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !6, !66, !7}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "lastidx", scope: !70, file: !60, line: 126, type: !6, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "opj_getopt_long", scope: !60, file: !60, line: 124, type: !71, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !50)
!71 = !DISubroutineType(types: !72)
!72 = !{!6, !6, !66, !7, !73, !6}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_option_t", file: !76, line: 12, baseType: !77)
!76 = !DIFile(filename: "common/opj_getopt.h", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_option", file: !76, line: 6, size: 256, elements: !78)
!78 = !{!79, !80, !81, !83}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !76, line: 8, baseType: !7, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !77, file: !76, line: 9, baseType: !6, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !77, file: !76, line: 10, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !77, file: !76, line: 11, baseType: !6, size: 32, offset: 192)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "lastofs", scope: !70, file: !60, line: 126, type: !6, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "opj_optopt", scope: !54, file: !60, line: 47, type: !6, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "opj_optreset", scope: !54, file: !60, line: 48, type: !6, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "opj_optarg", scope: !54, file: !60, line: 49, type: !35, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "EMSG", scope: !54, file: !60, line: 53, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = distinct !DICompileUnit(language: DW_LANG_C99, file: !98, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !99, retainedTypes: !135, nameTableKind: None)
!98 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec/convert.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!99 = !{!20, !100, !108, !114, !120}
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PROG_ORDER", file: !14, line: 169, baseType: !6, size: 32, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107}
!102 = !DIEnumerator(name: "PROG_UNKNOWN", value: -1)
!103 = !DIEnumerator(name: "LRCP", value: 0)
!104 = !DIEnumerator(name: "RLCP", value: 1)
!105 = !DIEnumerator(name: "RPCL", value: 2)
!106 = !DIEnumerator(name: "PCRL", value: 3)
!107 = !DIEnumerator(name: "CPRL", value: 4)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CINEMA_MODE", file: !14, line: 159, baseType: !15, size: 32, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIEnumerator(name: "OFF", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "CINEMA2K_24", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "CINEMA2K_48", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "CINEMA4K_24", value: 3, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RSIZ_CAPABILITIES", file: !14, line: 149, baseType: !15, size: 32, elements: !115)
!115 = !{!116, !117, !118, !119}
!116 = !DIEnumerator(name: "STD_RSIZ", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "CINEMA2K", value: 3, isUnsigned: true)
!118 = !DIEnumerator(name: "CINEMA4K", value: 4, isUnsigned: true)
!119 = !DIEnumerator(name: "MCT", value: 33024, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 46, baseType: !15, size: 32, elements: !122)
!121 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!123 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!124 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!125 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!126 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!127 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!128 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!129 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!130 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!131 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!134 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!135 = !{!136, !137, !138, !6, !9, !139, !35, !34, !140, !141, !142, !143, !15, !144}
!136 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!137 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!139 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!140 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_image_cmptparm_t", file: !14, line: 679, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_image_comptparm", file: !14, line: 660, size: 288, elements: !147)
!147 = !{!148, !152, !153, !154, !155, !156, !157, !158, !159}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !146, file: !14, line: 662, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_UINT32", file: !14, line: 91, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !151, line: 51, baseType: !15)
!151 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !146, file: !14, line: 664, baseType: !149, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !146, file: !14, line: 666, baseType: !149, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !146, file: !14, line: 668, baseType: !149, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !146, file: !14, line: 670, baseType: !149, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !146, file: !14, line: 672, baseType: !149, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !146, file: !14, line: 674, baseType: !149, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !146, file: !14, line: 676, baseType: !149, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sgnd", scope: !146, file: !14, line: 678, baseType: !149, size: 32, offset: 256)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !163, nameTableKind: None)
!161 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec/index.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!162 = !{!100}
!163 = !{!6, !136}
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !167, nameTableKind: None)
!165 = !DIFile(filename: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/common/color.c", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src/applications/codec")
!166 = !{!20}
!167 = !{!82, !6, !136}
!168 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!169 = !{i32 2, !"Dwarf Version", i32 4}
!170 = !{i32 2, !"Debug Info Version", i32 3}
!171 = !{i32 1, !"wchar_size", i32 4}
!172 = !{i32 1, !"ThinLTO", i32 0}
!173 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!174 = distinct !DISubprogram(name: "decode_help_display", scope: !3, file: !3, line: 100, type: !175, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!175 = !DISubroutineType(types: !176)
!176 = !{null}
!177 = !DILocation(line: 101, column: 10, scope: !174)
!178 = !DILocation(line: 101, column: 2, scope: !174)
!179 = !DILocation(line: 102, column: 10, scope: !174)
!180 = !DILocation(line: 102, column: 2, scope: !174)
!181 = !DILocation(line: 105, column: 10, scope: !174)
!182 = !DILocation(line: 105, column: 2, scope: !174)
!183 = !DILocation(line: 111, column: 10, scope: !174)
!184 = !DILocation(line: 111, column: 2, scope: !174)
!185 = !DILocation(line: 112, column: 10, scope: !174)
!186 = !DILocation(line: 112, column: 2, scope: !174)
!187 = !DILocation(line: 113, column: 10, scope: !174)
!188 = !DILocation(line: 113, column: 2, scope: !174)
!189 = !DILocation(line: 114, column: 10, scope: !174)
!190 = !DILocation(line: 114, column: 2, scope: !174)
!191 = !DILocation(line: 115, column: 10, scope: !174)
!192 = !DILocation(line: 115, column: 2, scope: !174)
!193 = !DILocation(line: 116, column: 10, scope: !174)
!194 = !DILocation(line: 116, column: 2, scope: !174)
!195 = !DILocation(line: 117, column: 10, scope: !174)
!196 = !DILocation(line: 117, column: 2, scope: !174)
!197 = !DILocation(line: 118, column: 10, scope: !174)
!198 = !DILocation(line: 118, column: 2, scope: !174)
!199 = !DILocation(line: 119, column: 10, scope: !174)
!200 = !DILocation(line: 119, column: 2, scope: !174)
!201 = !DILocation(line: 120, column: 10, scope: !174)
!202 = !DILocation(line: 120, column: 2, scope: !174)
!203 = !DILocation(line: 121, column: 10, scope: !174)
!204 = !DILocation(line: 121, column: 2, scope: !174)
!205 = !DILocation(line: 122, column: 10, scope: !174)
!206 = !DILocation(line: 122, column: 2, scope: !174)
!207 = !DILocation(line: 123, column: 10, scope: !174)
!208 = !DILocation(line: 123, column: 2, scope: !174)
!209 = !DILocation(line: 124, column: 10, scope: !174)
!210 = !DILocation(line: 124, column: 2, scope: !174)
!211 = !DILocation(line: 125, column: 10, scope: !174)
!212 = !DILocation(line: 125, column: 2, scope: !174)
!213 = !DILocation(line: 126, column: 10, scope: !174)
!214 = !DILocation(line: 126, column: 2, scope: !174)
!215 = !DILocation(line: 127, column: 10, scope: !174)
!216 = !DILocation(line: 127, column: 2, scope: !174)
!217 = !DILocation(line: 128, column: 10, scope: !174)
!218 = !DILocation(line: 128, column: 2, scope: !174)
!219 = !DILocation(line: 129, column: 10, scope: !174)
!220 = !DILocation(line: 129, column: 2, scope: !174)
!221 = !DILocation(line: 130, column: 10, scope: !174)
!222 = !DILocation(line: 130, column: 2, scope: !174)
!223 = !DILocation(line: 131, column: 10, scope: !174)
!224 = !DILocation(line: 131, column: 2, scope: !174)
!225 = !DILocation(line: 132, column: 10, scope: !174)
!226 = !DILocation(line: 132, column: 2, scope: !174)
!227 = !DILocation(line: 133, column: 10, scope: !174)
!228 = !DILocation(line: 133, column: 2, scope: !174)
!229 = !DILocation(line: 134, column: 10, scope: !174)
!230 = !DILocation(line: 134, column: 2, scope: !174)
!231 = !DILocation(line: 135, column: 10, scope: !174)
!232 = !DILocation(line: 135, column: 2, scope: !174)
!233 = !DILocation(line: 136, column: 10, scope: !174)
!234 = !DILocation(line: 136, column: 2, scope: !174)
!235 = !DILocation(line: 137, column: 10, scope: !174)
!236 = !DILocation(line: 137, column: 2, scope: !174)
!237 = !DILocation(line: 138, column: 10, scope: !174)
!238 = !DILocation(line: 138, column: 2, scope: !174)
!239 = !DILocation(line: 139, column: 10, scope: !174)
!240 = !DILocation(line: 139, column: 2, scope: !174)
!241 = !DILocation(line: 140, column: 10, scope: !174)
!242 = !DILocation(line: 140, column: 2, scope: !174)
!243 = !DILocation(line: 141, column: 10, scope: !174)
!244 = !DILocation(line: 141, column: 2, scope: !174)
!245 = !DILocation(line: 142, column: 10, scope: !174)
!246 = !DILocation(line: 142, column: 2, scope: !174)
!247 = !DILocation(line: 143, column: 10, scope: !174)
!248 = !DILocation(line: 143, column: 2, scope: !174)
!249 = !DILocation(line: 144, column: 10, scope: !174)
!250 = !DILocation(line: 144, column: 2, scope: !174)
!251 = !DILocation(line: 145, column: 10, scope: !174)
!252 = !DILocation(line: 145, column: 2, scope: !174)
!253 = !DILocation(line: 146, column: 10, scope: !174)
!254 = !DILocation(line: 146, column: 2, scope: !174)
!255 = !DILocation(line: 147, column: 10, scope: !174)
!256 = !DILocation(line: 147, column: 2, scope: !174)
!257 = !DILocation(line: 148, column: 10, scope: !174)
!258 = !DILocation(line: 148, column: 2, scope: !174)
!259 = !DILocation(line: 149, column: 10, scope: !174)
!260 = !DILocation(line: 149, column: 2, scope: !174)
!261 = !DILocation(line: 150, column: 10, scope: !174)
!262 = !DILocation(line: 150, column: 2, scope: !174)
!263 = !DILocation(line: 151, column: 10, scope: !174)
!264 = !DILocation(line: 151, column: 2, scope: !174)
!265 = !DILocation(line: 162, column: 10, scope: !174)
!266 = !DILocation(line: 162, column: 2, scope: !174)
!267 = !DILocation(line: 163, column: 1, scope: !174)
!268 = distinct !DISubprogram(name: "get_num_images", scope: !3, file: !3, line: 167, type: !269, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!269 = !DISubroutineType(types: !270)
!270 = !{!6, !35}
!271 = !DILocalVariable(name: "imgdirpath", arg: 1, scope: !268, file: !3, line: 167, type: !35)
!272 = !DILocation(line: 167, column: 26, scope: !268)
!273 = !DILocalVariable(name: "dir", scope: !268, file: !3, line: 168, type: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !276, line: 127, baseType: !277)
!276 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !276, line: 127, flags: DIFlagFwdDecl)
!278 = !DILocation(line: 168, column: 7, scope: !268)
!279 = !DILocalVariable(name: "content", scope: !268, file: !3, line: 169, type: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !282, line: 22, size: 2240, elements: !283)
!282 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!283 = !{!284, !288, !291, !292, !293}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !281, file: !282, line: 25, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !286, line: 127, baseType: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!287 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !281, file: !282, line: 26, baseType: !289, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !286, line: 131, baseType: !290)
!290 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !281, file: !282, line: 31, baseType: !141, size: 16, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !281, file: !282, line: 32, baseType: !137, size: 8, offset: 144)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !281, file: !282, line: 33, baseType: !294, size: 2048, offset: 152)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 256)
!297 = !DILocation(line: 169, column: 17, scope: !268)
!298 = !DILocalVariable(name: "num_images", scope: !268, file: !3, line: 170, type: !6)
!299 = !DILocation(line: 170, column: 6, scope: !268)
!300 = !DILocation(line: 174, column: 15, scope: !268)
!301 = !DILocation(line: 174, column: 7, scope: !268)
!302 = !DILocation(line: 174, column: 5, scope: !268)
!303 = !DILocation(line: 175, column: 6, scope: !304)
!304 = distinct !DILexicalBlock(scope: !268, file: !3, line: 175, column: 5)
!305 = !DILocation(line: 175, column: 5, scope: !268)
!306 = !DILocation(line: 176, column: 11, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !3, line: 175, column: 10)
!308 = !DILocation(line: 176, column: 47, scope: !307)
!309 = !DILocation(line: 176, column: 3, scope: !307)
!310 = !DILocation(line: 177, column: 3, scope: !307)
!311 = !DILocation(line: 180, column: 2, scope: !268)
!312 = !DILocation(line: 180, column: 25, scope: !268)
!313 = !DILocation(line: 180, column: 17, scope: !268)
!314 = !DILocation(line: 180, column: 16, scope: !268)
!315 = !DILocation(line: 180, column: 30, scope: !268)
!316 = !DILocation(line: 181, column: 17, scope: !317)
!317 = distinct !DILexicalBlock(scope: !318, file: !3, line: 181, column: 6)
!318 = distinct !DILexicalBlock(scope: !268, file: !3, line: 180, column: 37)
!319 = !DILocation(line: 181, column: 26, scope: !317)
!320 = !DILocation(line: 181, column: 6, scope: !317)
!321 = !DILocation(line: 181, column: 33, scope: !317)
!322 = !DILocation(line: 181, column: 37, scope: !317)
!323 = !DILocation(line: 181, column: 52, scope: !317)
!324 = !DILocation(line: 181, column: 61, scope: !317)
!325 = !DILocation(line: 181, column: 40, scope: !317)
!326 = !DILocation(line: 181, column: 68, scope: !317)
!327 = !DILocation(line: 181, column: 6, scope: !318)
!328 = !DILocation(line: 182, column: 4, scope: !317)
!329 = distinct !{!329, !311, !330}
!330 = !DILocation(line: 184, column: 2, scope: !268)
!331 = !DILocation(line: 183, column: 13, scope: !318)
!332 = !DILocation(line: 185, column: 9, scope: !268)
!333 = !DILocation(line: 185, column: 2, scope: !268)
!334 = !DILocation(line: 186, column: 1, scope: !268)
!335 = distinct !DISubprogram(name: "load_images", scope: !3, file: !3, line: 189, type: !336, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!336 = !DISubroutineType(types: !337)
!337 = !{!6, !36, !35}
!338 = !DILocalVariable(name: "dirptr", arg: 1, scope: !335, file: !3, line: 189, type: !36)
!339 = !DILocation(line: 189, column: 27, scope: !335)
!340 = !DILocalVariable(name: "imgdirpath", arg: 2, scope: !335, file: !3, line: 189, type: !35)
!341 = !DILocation(line: 189, column: 41, scope: !335)
!342 = !DILocalVariable(name: "dir", scope: !335, file: !3, line: 190, type: !274)
!343 = !DILocation(line: 190, column: 7, scope: !335)
!344 = !DILocalVariable(name: "content", scope: !335, file: !3, line: 191, type: !280)
!345 = !DILocation(line: 191, column: 17, scope: !335)
!346 = !DILocalVariable(name: "i", scope: !335, file: !3, line: 192, type: !6)
!347 = !DILocation(line: 192, column: 6, scope: !335)
!348 = !DILocation(line: 196, column: 15, scope: !335)
!349 = !DILocation(line: 196, column: 7, scope: !335)
!350 = !DILocation(line: 196, column: 5, scope: !335)
!351 = !DILocation(line: 197, column: 6, scope: !352)
!352 = distinct !DILexicalBlock(scope: !335, file: !3, line: 197, column: 5)
!353 = !DILocation(line: 197, column: 5, scope: !335)
!354 = !DILocation(line: 198, column: 11, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !3, line: 197, column: 10)
!356 = !DILocation(line: 198, column: 47, scope: !355)
!357 = !DILocation(line: 198, column: 3, scope: !355)
!358 = !DILocation(line: 199, column: 3, scope: !355)
!359 = !DILocation(line: 201, column: 11, scope: !360)
!360 = distinct !DILexicalBlock(scope: !352, file: !3, line: 200, column: 8)
!361 = !DILocation(line: 201, column: 3, scope: !360)
!362 = !DILocation(line: 204, column: 2, scope: !335)
!363 = !DILocation(line: 204, column: 25, scope: !335)
!364 = !DILocation(line: 204, column: 17, scope: !335)
!365 = !DILocation(line: 204, column: 16, scope: !335)
!366 = !DILocation(line: 204, column: 30, scope: !335)
!367 = !DILocation(line: 205, column: 17, scope: !368)
!368 = distinct !DILexicalBlock(scope: !369, file: !3, line: 205, column: 6)
!369 = distinct !DILexicalBlock(scope: !335, file: !3, line: 204, column: 37)
!370 = !DILocation(line: 205, column: 26, scope: !368)
!371 = !DILocation(line: 205, column: 6, scope: !368)
!372 = !DILocation(line: 205, column: 33, scope: !368)
!373 = !DILocation(line: 205, column: 37, scope: !368)
!374 = !DILocation(line: 205, column: 52, scope: !368)
!375 = !DILocation(line: 205, column: 61, scope: !368)
!376 = !DILocation(line: 205, column: 40, scope: !368)
!377 = !DILocation(line: 205, column: 68, scope: !368)
!378 = !DILocation(line: 205, column: 6, scope: !369)
!379 = !DILocation(line: 206, column: 4, scope: !368)
!380 = distinct !{!380, !362, !381}
!381 = !DILocation(line: 210, column: 2, scope: !335)
!382 = !DILocation(line: 208, column: 10, scope: !369)
!383 = !DILocation(line: 208, column: 18, scope: !369)
!384 = !DILocation(line: 208, column: 27, scope: !369)
!385 = !DILocation(line: 208, column: 30, scope: !369)
!386 = !DILocation(line: 208, column: 39, scope: !369)
!387 = !DILocation(line: 208, column: 3, scope: !369)
!388 = !DILocation(line: 209, column: 4, scope: !369)
!389 = !DILocation(line: 211, column: 2, scope: !335)
!390 = !DILocation(line: 212, column: 1, scope: !335)
!391 = !DILocalVariable(name: "filename", arg: 1, scope: !2, file: !3, line: 215, type: !7)
!392 = !DILocation(line: 215, column: 33, scope: !2)
!393 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 216, type: !15)
!394 = !DILocation(line: 216, column: 15, scope: !2)
!395 = !DILocalVariable(name: "ext", scope: !2, file: !3, line: 219, type: !35)
!396 = !DILocation(line: 219, column: 9, scope: !2)
!397 = !DILocation(line: 219, column: 23, scope: !2)
!398 = !DILocation(line: 219, column: 15, scope: !2)
!399 = !DILocation(line: 220, column: 6, scope: !400)
!400 = distinct !DILexicalBlock(scope: !2, file: !3, line: 220, column: 6)
!401 = !DILocation(line: 220, column: 10, scope: !400)
!402 = !DILocation(line: 220, column: 6, scope: !2)
!403 = !DILocation(line: 221, column: 3, scope: !400)
!404 = !DILocation(line: 222, column: 5, scope: !2)
!405 = !DILocation(line: 223, column: 5, scope: !406)
!406 = distinct !DILexicalBlock(scope: !2, file: !3, line: 223, column: 5)
!407 = !DILocation(line: 223, column: 5, scope: !2)
!408 = !DILocation(line: 224, column: 9, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 224, column: 3)
!410 = distinct !DILexicalBlock(scope: !406, file: !3, line: 223, column: 10)
!411 = !DILocation(line: 224, column: 7, scope: !409)
!412 = !DILocation(line: 224, column: 14, scope: !413)
!413 = distinct !DILexicalBlock(scope: !409, file: !3, line: 224, column: 3)
!414 = !DILocation(line: 224, column: 16, scope: !413)
!415 = !DILocation(line: 224, column: 3, scope: !409)
!416 = !DILocation(line: 225, column: 18, scope: !417)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 225, column: 7)
!418 = distinct !DILexicalBlock(scope: !413, file: !3, line: 224, column: 55)
!419 = !DILocation(line: 225, column: 33, scope: !417)
!420 = !DILocation(line: 225, column: 23, scope: !417)
!421 = !DILocation(line: 225, column: 7, scope: !417)
!422 = !DILocation(line: 225, column: 37, scope: !417)
!423 = !DILocation(line: 225, column: 7, scope: !418)
!424 = !DILocation(line: 226, column: 19, scope: !425)
!425 = distinct !DILexicalBlock(scope: !417, file: !3, line: 225, column: 43)
!426 = !DILocation(line: 226, column: 12, scope: !425)
!427 = !DILocation(line: 226, column: 5, scope: !425)
!428 = !DILocation(line: 228, column: 3, scope: !418)
!429 = !DILocation(line: 224, column: 51, scope: !413)
!430 = !DILocation(line: 224, column: 3, scope: !413)
!431 = distinct !{!431, !415, !432}
!432 = !DILocation(line: 228, column: 3, scope: !409)
!433 = !DILocation(line: 229, column: 2, scope: !410)
!434 = !DILocation(line: 231, column: 2, scope: !2)
!435 = !DILocation(line: 232, column: 1, scope: !2)
!436 = distinct !DISubprogram(name: "get_next_file", scope: !3, file: !3, line: 235, type: !437, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!437 = !DISubroutineType(types: !438)
!438 = !{!9, !6, !36, !439, !447}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "img_fol_t", file: !3, line: 86, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "img_folder", file: !3, line: 76, size: 192, elements: !442)
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "imgdirpath", scope: !441, file: !3, line: 78, baseType: !35, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !441, file: !3, line: 80, baseType: !7, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "set_imgdir", scope: !441, file: !3, line: 82, baseType: !9, size: 8, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "set_out_format", scope: !441, file: !3, line: 84, baseType: !9, size: 8, offset: 136)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_dparameters_t", file: !14, line: 490, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_dparameters", file: !14, line: 423, size: 66048, elements: !450)
!450 = !{!451, !452, !453, !457, !458, !459, !460, !461, !462, !463, !464, !466, !467, !468, !469, !470, !471, !473}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cp_reduce", scope: !449, file: !14, line: 431, baseType: !6, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cp_layer", scope: !449, file: !14, line: 438, baseType: !6, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !449, file: !14, line: 443, baseType: !454, size: 32768, offset: 64)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32768, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 4096)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !449, file: !14, line: 445, baseType: !454, size: 32768, offset: 32832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "decod_format", scope: !449, file: !14, line: 447, baseType: !6, size: 32, offset: 65600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cod_format", scope: !449, file: !14, line: 449, baseType: !6, size: 32, offset: 65632)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DA_x0", scope: !449, file: !14, line: 452, baseType: !149, size: 32, offset: 65664)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DA_x1", scope: !449, file: !14, line: 454, baseType: !149, size: 32, offset: 65696)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DA_y0", scope: !449, file: !14, line: 456, baseType: !149, size: 32, offset: 65728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "DA_y1", scope: !449, file: !14, line: 458, baseType: !149, size: 32, offset: 65760)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "m_verbose", scope: !449, file: !14, line: 460, baseType: !465, size: 32, offset: 65792)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_bool", file: !14, line: 75, baseType: !6)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tile_index", scope: !449, file: !14, line: 463, baseType: !149, size: 32, offset: 65824)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nb_tile_to_decode", scope: !449, file: !14, line: 465, baseType: !149, size: 32, offset: 65856)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "jpwl_correct", scope: !449, file: !14, line: 473, baseType: !465, size: 32, offset: 65888)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "jpwl_exp_comps", scope: !449, file: !14, line: 475, baseType: !6, size: 32, offset: 65920)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "jpwl_max_tiles", scope: !449, file: !14, line: 477, baseType: !6, size: 32, offset: 65952)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "cp_limit_decoding", scope: !449, file: !14, line: 487, baseType: !472, size: 32, offset: 65984)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_LIMIT_DECODING", file: !14, line: 206, baseType: !13)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !14, line: 489, baseType: !15, size: 32, offset: 66016)
!474 = !DILocalVariable(name: "imageno", arg: 1, scope: !436, file: !3, line: 235, type: !6)
!475 = !DILocation(line: 235, column: 24, scope: !436)
!476 = !DILocalVariable(name: "dirptr", arg: 2, scope: !436, file: !3, line: 235, type: !36)
!477 = !DILocation(line: 235, column: 42, scope: !436)
!478 = !DILocalVariable(name: "img_fol", arg: 3, scope: !436, file: !3, line: 235, type: !439)
!479 = !DILocation(line: 235, column: 60, scope: !436)
!480 = !DILocalVariable(name: "parameters", arg: 4, scope: !436, file: !3, line: 235, type: !447)
!481 = !DILocation(line: 235, column: 88, scope: !436)
!482 = !DILocalVariable(name: "image_filename", scope: !436, file: !3, line: 236, type: !454)
!483 = !DILocation(line: 236, column: 7, scope: !436)
!484 = !DILocalVariable(name: "infilename", scope: !436, file: !3, line: 236, type: !454)
!485 = !DILocation(line: 236, column: 37, scope: !436)
!486 = !DILocalVariable(name: "outfilename", scope: !436, file: !3, line: 236, type: !454)
!487 = !DILocation(line: 236, column: 62, scope: !436)
!488 = !DILocalVariable(name: "temp_ofname", scope: !436, file: !3, line: 236, type: !454)
!489 = !DILocation(line: 236, column: 88, scope: !436)
!490 = !DILocalVariable(name: "temp_p", scope: !436, file: !3, line: 237, type: !35)
!491 = !DILocation(line: 237, column: 8, scope: !436)
!492 = !DILocalVariable(name: "temp1", scope: !436, file: !3, line: 237, type: !454)
!493 = !DILocation(line: 237, column: 16, scope: !436)
!494 = !DILocation(line: 239, column: 9, scope: !436)
!495 = !DILocation(line: 239, column: 24, scope: !436)
!496 = !DILocation(line: 239, column: 32, scope: !436)
!497 = !DILocation(line: 239, column: 41, scope: !436)
!498 = !DILocation(line: 239, column: 2, scope: !436)
!499 = !DILocation(line: 240, column: 10, scope: !436)
!500 = !DILocation(line: 240, column: 43, scope: !436)
!501 = !DILocation(line: 240, column: 51, scope: !436)
!502 = !DILocation(line: 240, column: 2, scope: !436)
!503 = !DILocation(line: 241, column: 43, scope: !436)
!504 = !DILocation(line: 241, column: 29, scope: !436)
!505 = !DILocation(line: 241, column: 2, scope: !436)
!506 = !DILocation(line: 241, column: 14, scope: !436)
!507 = !DILocation(line: 241, column: 27, scope: !436)
!508 = !DILocation(line: 242, column: 6, scope: !509)
!509 = distinct !DILexicalBlock(scope: !436, file: !3, line: 242, column: 6)
!510 = !DILocation(line: 242, column: 18, scope: !509)
!511 = !DILocation(line: 242, column: 31, scope: !509)
!512 = !DILocation(line: 242, column: 6, scope: !436)
!513 = !DILocation(line: 243, column: 3, scope: !509)
!514 = !DILocation(line: 244, column: 10, scope: !436)
!515 = !DILocation(line: 244, column: 29, scope: !436)
!516 = !DILocation(line: 244, column: 38, scope: !436)
!517 = !DILocation(line: 244, column: 49, scope: !436)
!518 = !DILocation(line: 244, column: 2, scope: !436)
!519 = !DILocation(line: 245, column: 10, scope: !436)
!520 = !DILocation(line: 245, column: 22, scope: !436)
!521 = !DILocation(line: 245, column: 30, scope: !436)
!522 = !DILocation(line: 245, column: 2, scope: !436)
!523 = !DILocation(line: 248, column: 9, scope: !436)
!524 = !DILocation(line: 248, column: 28, scope: !436)
!525 = !DILocation(line: 248, column: 21, scope: !436)
!526 = !DILocation(line: 248, column: 2, scope: !436)
!527 = !DILocation(line: 249, column: 2, scope: !436)
!528 = !DILocation(line: 249, column: 18, scope: !436)
!529 = !DILocation(line: 249, column: 16, scope: !436)
!530 = !DILocation(line: 249, column: 36, scope: !436)
!531 = !DILocation(line: 250, column: 10, scope: !532)
!532 = distinct !DILexicalBlock(scope: !436, file: !3, line: 249, column: 44)
!533 = !DILocation(line: 250, column: 22, scope: !532)
!534 = !DILocation(line: 250, column: 3, scope: !532)
!535 = !DILocation(line: 251, column: 11, scope: !532)
!536 = !DILocation(line: 251, column: 23, scope: !532)
!537 = !DILocation(line: 251, column: 3, scope: !532)
!538 = distinct !{!538, !527, !539}
!539 = !DILocation(line: 252, column: 2, scope: !436)
!540 = !DILocation(line: 253, column: 5, scope: !541)
!541 = distinct !DILexicalBlock(scope: !436, file: !3, line: 253, column: 5)
!542 = !DILocation(line: 253, column: 14, scope: !541)
!543 = !DILocation(line: 253, column: 28, scope: !541)
!544 = !DILocation(line: 253, column: 5, scope: !436)
!545 = !DILocation(line: 254, column: 11, scope: !546)
!546 = distinct !DILexicalBlock(scope: !541, file: !3, line: 253, column: 32)
!547 = !DILocation(line: 254, column: 34, scope: !546)
!548 = !DILocation(line: 254, column: 43, scope: !546)
!549 = !DILocation(line: 254, column: 54, scope: !546)
!550 = !DILocation(line: 254, column: 66, scope: !546)
!551 = !DILocation(line: 254, column: 75, scope: !546)
!552 = !DILocation(line: 254, column: 3, scope: !546)
!553 = !DILocation(line: 255, column: 11, scope: !546)
!554 = !DILocation(line: 255, column: 23, scope: !546)
!555 = !DILocation(line: 255, column: 32, scope: !546)
!556 = !DILocation(line: 255, column: 3, scope: !546)
!557 = !DILocation(line: 256, column: 2, scope: !546)
!558 = !DILocation(line: 257, column: 2, scope: !436)
!559 = !DILocation(line: 258, column: 1, scope: !436)
!560 = distinct !DISubprogram(name: "infile_format", scope: !3, file: !3, line: 266, type: !4, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !50)
!561 = !DILocalVariable(name: "fname", arg: 1, scope: !560, file: !3, line: 266, type: !7)
!562 = !DILocation(line: 266, column: 38, scope: !560)
!563 = !DILocalVariable(name: "reader", scope: !560, file: !3, line: 268, type: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !566, line: 48, baseType: !567)
!566 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !568, line: 241, size: 1728, elements: !569)
!568 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !590, !591, !592, !593, !594, !595, !596, !597, !600, !602, !603, !604, !605, !606, !609, !610}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !567, file: !568, line: 242, baseType: !6, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !567, file: !568, line: 247, baseType: !35, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !567, file: !568, line: 248, baseType: !35, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !567, file: !568, line: 249, baseType: !35, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !567, file: !568, line: 250, baseType: !35, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !567, file: !568, line: 251, baseType: !35, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !567, file: !568, line: 252, baseType: !35, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !567, file: !568, line: 253, baseType: !35, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !567, file: !568, line: 254, baseType: !35, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !567, file: !568, line: 256, baseType: !35, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !567, file: !568, line: 257, baseType: !35, size: 64, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !567, file: !568, line: 258, baseType: !35, size: 64, offset: 704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !567, file: !568, line: 260, baseType: !583, size: 64, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !568, line: 156, size: 192, elements: !585)
!585 = !{!586, !587, !589}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !584, file: !568, line: 157, baseType: !583, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !584, file: !568, line: 158, baseType: !588, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !584, file: !568, line: 162, baseType: !6, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !567, file: !568, line: 262, baseType: !588, size: 64, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !567, file: !568, line: 264, baseType: !6, size: 32, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !567, file: !568, line: 268, baseType: !6, size: 32, offset: 928)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !567, file: !568, line: 270, baseType: !289, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !567, file: !568, line: 274, baseType: !141, size: 16, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !567, file: !568, line: 275, baseType: !140, size: 8, offset: 1040)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !567, file: !568, line: 276, baseType: !94, size: 8, offset: 1048)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !567, file: !568, line: 280, baseType: !598, size: 64, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !568, line: 150, baseType: null)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !567, file: !568, line: 289, baseType: !601, size: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !286, line: 132, baseType: !290)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !567, file: !568, line: 297, baseType: !34, size: 64, offset: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !567, file: !568, line: 298, baseType: !34, size: 64, offset: 1280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !567, file: !568, line: 299, baseType: !34, size: 64, offset: 1344)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !567, file: !568, line: 300, baseType: !34, size: 64, offset: 1408)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !567, file: !568, line: 302, baseType: !607, size: 64, offset: 1472)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !608, line: 62, baseType: !287)
!608 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !567, file: !568, line: 303, baseType: !6, size: 32, offset: 1536)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !567, file: !568, line: 305, baseType: !611, size: 160, offset: 1568)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 20)
!614 = !DILocation(line: 268, column: 8, scope: !560)
!615 = !DILocalVariable(name: "s", scope: !560, file: !3, line: 269, type: !7)
!616 = !DILocation(line: 269, column: 14, scope: !560)
!617 = !DILocalVariable(name: "magic_s", scope: !560, file: !3, line: 269, type: !7)
!618 = !DILocation(line: 269, column: 18, scope: !560)
!619 = !DILocalVariable(name: "ext_format", scope: !560, file: !3, line: 270, type: !6)
!620 = !DILocation(line: 270, column: 6, scope: !560)
!621 = !DILocalVariable(name: "magic_format", scope: !560, file: !3, line: 270, type: !6)
!622 = !DILocation(line: 270, column: 18, scope: !560)
!623 = !DILocalVariable(name: "buf", scope: !560, file: !3, line: 271, type: !624)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 96, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 12)
!627 = !DILocation(line: 271, column: 16, scope: !560)
!628 = !DILocalVariable(name: "l_nb_read", scope: !560, file: !3, line: 272, type: !15)
!629 = !DILocation(line: 272, column: 15, scope: !560)
!630 = !DILocation(line: 274, column: 17, scope: !560)
!631 = !DILocation(line: 274, column: 11, scope: !560)
!632 = !DILocation(line: 274, column: 9, scope: !560)
!633 = !DILocation(line: 276, column: 6, scope: !634)
!634 = distinct !DILexicalBlock(scope: !560, file: !3, line: 276, column: 6)
!635 = !DILocation(line: 276, column: 13, scope: !634)
!636 = !DILocation(line: 276, column: 6, scope: !560)
!637 = !DILocation(line: 277, column: 3, scope: !634)
!638 = !DILocation(line: 279, column: 2, scope: !560)
!639 = !DILocation(line: 280, column: 20, scope: !560)
!640 = !DILocation(line: 280, column: 32, scope: !560)
!641 = !DILocation(line: 280, column: 14, scope: !560)
!642 = !DILocation(line: 280, column: 12, scope: !560)
!643 = !DILocation(line: 281, column: 9, scope: !560)
!644 = !DILocation(line: 281, column: 2, scope: !560)
!645 = !DILocation(line: 282, column: 6, scope: !646)
!646 = distinct !DILexicalBlock(scope: !560, file: !3, line: 282, column: 6)
!647 = !DILocation(line: 282, column: 16, scope: !646)
!648 = !DILocation(line: 282, column: 6, scope: !560)
!649 = !DILocation(line: 283, column: 3, scope: !646)
!650 = !DILocation(line: 287, column: 31, scope: !560)
!651 = !DILocation(line: 287, column: 15, scope: !560)
!652 = !DILocation(line: 287, column: 13, scope: !560)
!653 = !DILocation(line: 289, column: 6, scope: !654)
!654 = distinct !DILexicalBlock(scope: !560, file: !3, line: 289, column: 6)
!655 = !DILocation(line: 289, column: 17, scope: !654)
!656 = !DILocation(line: 289, column: 6, scope: !560)
!657 = !DILocation(line: 290, column: 3, scope: !654)
!658 = !DILocation(line: 292, column: 13, scope: !659)
!659 = distinct !DILexicalBlock(scope: !560, file: !3, line: 292, column: 6)
!660 = !DILocation(line: 292, column: 6, scope: !659)
!661 = !DILocation(line: 292, column: 41, scope: !659)
!662 = !DILocation(line: 292, column: 46, scope: !659)
!663 = !DILocation(line: 292, column: 56, scope: !659)
!664 = !DILocation(line: 292, column: 49, scope: !659)
!665 = !DILocation(line: 292, column: 75, scope: !659)
!666 = !DILocation(line: 292, column: 6, scope: !560)
!667 = !DILocation(line: 293, column: 16, scope: !668)
!668 = distinct !DILexicalBlock(scope: !659, file: !3, line: 292, column: 81)
!669 = !DILocation(line: 294, column: 11, scope: !668)
!670 = !DILocation(line: 295, column: 2, scope: !668)
!671 = !DILocation(line: 296, column: 18, scope: !672)
!672 = distinct !DILexicalBlock(scope: !659, file: !3, line: 296, column: 11)
!673 = !DILocation(line: 296, column: 11, scope: !672)
!674 = !DILocation(line: 296, column: 48, scope: !672)
!675 = !DILocation(line: 296, column: 11, scope: !659)
!676 = !DILocation(line: 297, column: 16, scope: !677)
!677 = distinct !DILexicalBlock(scope: !672, file: !3, line: 296, column: 54)
!678 = !DILocation(line: 298, column: 11, scope: !677)
!679 = !DILocation(line: 299, column: 2, scope: !677)
!680 = !DILocation(line: 301, column: 3, scope: !672)
!681 = !DILocation(line: 303, column: 6, scope: !682)
!682 = distinct !DILexicalBlock(scope: !560, file: !3, line: 303, column: 6)
!683 = !DILocation(line: 303, column: 22, scope: !682)
!684 = !DILocation(line: 303, column: 19, scope: !682)
!685 = !DILocation(line: 303, column: 6, scope: !560)
!686 = !DILocation(line: 304, column: 10, scope: !682)
!687 = !DILocation(line: 304, column: 3, scope: !682)
!688 = !DILocation(line: 306, column: 6, scope: !560)
!689 = !DILocation(line: 306, column: 21, scope: !560)
!690 = !DILocation(line: 306, column: 14, scope: !560)
!691 = !DILocation(line: 306, column: 12, scope: !560)
!692 = !DILocation(line: 306, column: 28, scope: !560)
!693 = !DILocation(line: 306, column: 4, scope: !560)
!694 = !DILocation(line: 308, column: 59, scope: !560)
!695 = !DILocation(line: 308, column: 2, scope: !560)
!696 = !DILocation(line: 309, column: 10, scope: !560)
!697 = !DILocation(line: 310, column: 34, scope: !560)
!698 = !DILocation(line: 310, column: 37, scope: !560)
!699 = !DILocation(line: 309, column: 2, scope: !560)
!700 = !DILocation(line: 311, column: 57, scope: !560)
!701 = !DILocation(line: 311, column: 2, scope: !560)
!702 = !DILocation(line: 313, column: 9, scope: !560)
!703 = !DILocation(line: 313, column: 2, scope: !560)
!704 = !DILocation(line: 314, column: 1, scope: !560)
!705 = distinct !DISubprogram(name: "parse_cmdline_decoder", scope: !3, file: !3, line: 321, type: !706, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!706 = !DISubroutineType(types: !707)
!707 = !{!6, !6, !42, !447, !439, !35}
!708 = !DILocalVariable(name: "argc", arg: 1, scope: !705, file: !3, line: 321, type: !6)
!709 = !DILocation(line: 321, column: 31, scope: !705)
!710 = !DILocalVariable(name: "argv", arg: 2, scope: !705, file: !3, line: 321, type: !42)
!711 = !DILocation(line: 321, column: 44, scope: !705)
!712 = !DILocalVariable(name: "parameters", arg: 3, scope: !705, file: !3, line: 321, type: !447)
!713 = !DILocation(line: 321, column: 69, scope: !705)
!714 = !DILocalVariable(name: "img_fol", arg: 4, scope: !705, file: !3, line: 321, type: !439)
!715 = !DILocation(line: 321, column: 91, scope: !705)
!716 = !DILocalVariable(name: "indexfilename", arg: 5, scope: !705, file: !3, line: 321, type: !35)
!717 = !DILocation(line: 321, column: 106, scope: !705)
!718 = !DILocalVariable(name: "totlen", scope: !705, file: !3, line: 323, type: !6)
!719 = !DILocation(line: 323, column: 6, scope: !705)
!720 = !DILocalVariable(name: "c", scope: !705, file: !3, line: 323, type: !6)
!721 = !DILocation(line: 323, column: 14, scope: !705)
!722 = !DILocalVariable(name: "long_option", scope: !705, file: !3, line: 324, type: !723)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 512, elements: !731)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_option_t", file: !76, line: 12, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_option", file: !76, line: 6, size: 256, elements: !726)
!726 = !{!727, !728, !729, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !76, line: 8, baseType: !7, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !725, file: !76, line: 9, baseType: !6, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !76, line: 10, baseType: !82, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !725, file: !76, line: 11, baseType: !6, size: 32, offset: 192)
!731 = !{!732}
!732 = !DISubrange(count: 2)
!733 = !DILocation(line: 324, column: 15, scope: !705)
!734 = !DILocalVariable(name: "optlist", scope: !705, file: !3, line: 329, type: !735)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 16)
!738 = !DILocation(line: 329, column: 13, scope: !705)
!739 = !DILocation(line: 337, column: 8, scope: !705)
!740 = !DILocation(line: 338, column: 2, scope: !705)
!741 = !DILocation(line: 338, column: 11, scope: !705)
!742 = !DILocation(line: 338, column: 26, scope: !705)
!743 = !DILocation(line: 339, column: 2, scope: !705)
!744 = !DILocation(line: 340, column: 23, scope: !745)
!745 = distinct !DILexicalBlock(scope: !705, file: !3, line: 339, column: 5)
!746 = !DILocation(line: 340, column: 29, scope: !745)
!747 = !DILocation(line: 340, column: 34, scope: !745)
!748 = !DILocation(line: 340, column: 42, scope: !745)
!749 = !DILocation(line: 340, column: 54, scope: !745)
!750 = !DILocation(line: 340, column: 7, scope: !745)
!751 = !DILocation(line: 340, column: 5, scope: !745)
!752 = !DILocation(line: 341, column: 7, scope: !753)
!753 = distinct !DILexicalBlock(scope: !745, file: !3, line: 341, column: 7)
!754 = !DILocation(line: 341, column: 9, scope: !753)
!755 = !DILocation(line: 341, column: 7, scope: !745)
!756 = !DILocation(line: 342, column: 4, scope: !753)
!757 = !DILocation(line: 343, column: 11, scope: !745)
!758 = !DILocation(line: 343, column: 3, scope: !745)
!759 = !DILocalVariable(name: "infile", scope: !760, file: !3, line: 346, type: !35)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 345, column: 4)
!761 = distinct !DILexicalBlock(scope: !745, file: !3, line: 343, column: 14)
!762 = !DILocation(line: 346, column: 11, scope: !760)
!763 = !DILocation(line: 346, column: 20, scope: !760)
!764 = !DILocation(line: 347, column: 46, scope: !760)
!765 = !DILocation(line: 347, column: 32, scope: !760)
!766 = !DILocation(line: 347, column: 5, scope: !760)
!767 = !DILocation(line: 347, column: 17, scope: !760)
!768 = !DILocation(line: 347, column: 30, scope: !760)
!769 = !DILocation(line: 348, column: 12, scope: !760)
!770 = !DILocation(line: 348, column: 24, scope: !760)
!771 = !DILocation(line: 348, column: 5, scope: !760)
!772 = !DILocation(line: 350, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !760, file: !3, line: 348, column: 38)
!774 = !DILocation(line: 352, column: 7, scope: !773)
!775 = !DILocation(line: 354, column: 7, scope: !773)
!776 = !DILocation(line: 356, column: 15, scope: !773)
!777 = !DILocation(line: 358, column: 8, scope: !773)
!778 = !DILocation(line: 356, column: 7, scope: !773)
!779 = !DILocation(line: 359, column: 7, scope: !773)
!780 = !DILocation(line: 361, column: 15, scope: !773)
!781 = !DILocation(line: 363, column: 8, scope: !773)
!782 = !DILocation(line: 361, column: 7, scope: !773)
!783 = !DILocation(line: 364, column: 7, scope: !773)
!784 = !DILocation(line: 366, column: 13, scope: !760)
!785 = !DILocation(line: 366, column: 25, scope: !760)
!786 = !DILocation(line: 366, column: 33, scope: !760)
!787 = !DILocation(line: 366, column: 5, scope: !760)
!788 = !DILocation(line: 368, column: 4, scope: !761)
!789 = !DILocalVariable(name: "outfile", scope: !790, file: !3, line: 374, type: !35)
!790 = distinct !DILexicalBlock(scope: !761, file: !3, line: 373, column: 4)
!791 = !DILocation(line: 374, column: 11, scope: !790)
!792 = !DILocation(line: 374, column: 21, scope: !790)
!793 = !DILocation(line: 375, column: 46, scope: !790)
!794 = !DILocation(line: 375, column: 30, scope: !790)
!795 = !DILocation(line: 375, column: 5, scope: !790)
!796 = !DILocation(line: 375, column: 17, scope: !790)
!797 = !DILocation(line: 375, column: 28, scope: !790)
!798 = !DILocation(line: 376, column: 12, scope: !790)
!799 = !DILocation(line: 376, column: 24, scope: !790)
!800 = !DILocation(line: 376, column: 5, scope: !790)
!801 = !DILocation(line: 378, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !790, file: !3, line: 376, column: 36)
!803 = !DILocation(line: 380, column: 7, scope: !802)
!804 = !DILocation(line: 382, column: 7, scope: !802)
!805 = !DILocation(line: 384, column: 7, scope: !802)
!806 = !DILocation(line: 386, column: 7, scope: !802)
!807 = !DILocation(line: 388, column: 7, scope: !802)
!808 = !DILocation(line: 390, column: 7, scope: !802)
!809 = !DILocation(line: 392, column: 7, scope: !802)
!810 = !DILocation(line: 394, column: 15, scope: !802)
!811 = !DILocation(line: 394, column: 126, scope: !802)
!812 = !DILocation(line: 394, column: 7, scope: !802)
!813 = !DILocation(line: 395, column: 7, scope: !802)
!814 = !DILocation(line: 397, column: 13, scope: !790)
!815 = !DILocation(line: 397, column: 25, scope: !790)
!816 = !DILocation(line: 397, column: 34, scope: !790)
!817 = !DILocation(line: 397, column: 5, scope: !790)
!818 = !DILocation(line: 399, column: 4, scope: !761)
!819 = !DILocalVariable(name: "outformat", scope: !820, file: !3, line: 405, type: !821)
!820 = distinct !DILexicalBlock(scope: !761, file: !3, line: 404, column: 4)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 400, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 50)
!824 = !DILocation(line: 405, column: 10, scope: !820)
!825 = !DILocalVariable(name: "of", scope: !820, file: !3, line: 406, type: !35)
!826 = !DILocation(line: 406, column: 11, scope: !820)
!827 = !DILocation(line: 406, column: 16, scope: !820)
!828 = !DILocation(line: 407, column: 13, scope: !820)
!829 = !DILocation(line: 407, column: 29, scope: !820)
!830 = !DILocation(line: 407, column: 5, scope: !820)
!831 = !DILocation(line: 408, column: 5, scope: !820)
!832 = !DILocation(line: 408, column: 14, scope: !820)
!833 = !DILocation(line: 408, column: 29, scope: !820)
!834 = !DILocation(line: 409, column: 46, scope: !820)
!835 = !DILocation(line: 409, column: 30, scope: !820)
!836 = !DILocation(line: 409, column: 5, scope: !820)
!837 = !DILocation(line: 409, column: 17, scope: !820)
!838 = !DILocation(line: 409, column: 28, scope: !820)
!839 = !DILocation(line: 410, column: 12, scope: !820)
!840 = !DILocation(line: 410, column: 24, scope: !820)
!841 = !DILocation(line: 410, column: 5, scope: !820)
!842 = !DILocation(line: 412, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !820, file: !3, line: 410, column: 36)
!844 = !DILocation(line: 412, column: 16, scope: !843)
!845 = !DILocation(line: 412, column: 27, scope: !843)
!846 = !DILocation(line: 413, column: 7, scope: !843)
!847 = !DILocation(line: 415, column: 7, scope: !843)
!848 = !DILocation(line: 415, column: 16, scope: !843)
!849 = !DILocation(line: 415, column: 27, scope: !843)
!850 = !DILocation(line: 416, column: 7, scope: !843)
!851 = !DILocation(line: 418, column: 7, scope: !843)
!852 = !DILocation(line: 418, column: 16, scope: !843)
!853 = !DILocation(line: 418, column: 27, scope: !843)
!854 = !DILocation(line: 419, column: 7, scope: !843)
!855 = !DILocation(line: 421, column: 7, scope: !843)
!856 = !DILocation(line: 421, column: 16, scope: !843)
!857 = !DILocation(line: 421, column: 27, scope: !843)
!858 = !DILocation(line: 422, column: 7, scope: !843)
!859 = !DILocation(line: 424, column: 7, scope: !843)
!860 = !DILocation(line: 424, column: 16, scope: !843)
!861 = !DILocation(line: 424, column: 27, scope: !843)
!862 = !DILocation(line: 425, column: 7, scope: !843)
!863 = !DILocation(line: 427, column: 7, scope: !843)
!864 = !DILocation(line: 427, column: 16, scope: !843)
!865 = !DILocation(line: 427, column: 27, scope: !843)
!866 = !DILocation(line: 428, column: 7, scope: !843)
!867 = !DILocation(line: 430, column: 7, scope: !843)
!868 = !DILocation(line: 430, column: 16, scope: !843)
!869 = !DILocation(line: 430, column: 27, scope: !843)
!870 = !DILocation(line: 431, column: 7, scope: !843)
!871 = !DILocation(line: 433, column: 7, scope: !843)
!872 = !DILocation(line: 433, column: 16, scope: !843)
!873 = !DILocation(line: 433, column: 27, scope: !843)
!874 = !DILocation(line: 434, column: 7, scope: !843)
!875 = !DILocation(line: 436, column: 15, scope: !843)
!876 = !DILocation(line: 436, column: 126, scope: !843)
!877 = !DILocation(line: 436, column: 7, scope: !843)
!878 = !DILocation(line: 437, column: 7, scope: !843)
!879 = !DILocation(line: 441, column: 4, scope: !761)
!880 = !DILocation(line: 448, column: 12, scope: !881)
!881 = distinct !DILexicalBlock(scope: !761, file: !3, line: 447, column: 4)
!882 = !DILocation(line: 448, column: 31, scope: !881)
!883 = !DILocation(line: 448, column: 43, scope: !881)
!884 = !DILocation(line: 448, column: 5, scope: !881)
!885 = !DILocation(line: 450, column: 4, scope: !761)
!886 = !DILocation(line: 457, column: 12, scope: !887)
!887 = distinct !DILexicalBlock(scope: !761, file: !3, line: 456, column: 4)
!888 = !DILocation(line: 457, column: 31, scope: !887)
!889 = !DILocation(line: 457, column: 43, scope: !887)
!890 = !DILocation(line: 457, column: 5, scope: !887)
!891 = !DILocation(line: 459, column: 4, scope: !761)
!892 = !DILocation(line: 464, column: 5, scope: !761)
!893 = !DILocation(line: 465, column: 5, scope: !761)
!894 = !DILocation(line: 471, column: 49, scope: !895)
!895 = distinct !DILexicalBlock(scope: !761, file: !3, line: 470, column: 5)
!896 = !DILocation(line: 471, column: 42, scope: !895)
!897 = !DILocation(line: 471, column: 61, scope: !895)
!898 = !DILocation(line: 471, column: 35, scope: !895)
!899 = !DILocation(line: 471, column: 6, scope: !895)
!900 = !DILocation(line: 471, column: 15, scope: !895)
!901 = !DILocation(line: 471, column: 26, scope: !895)
!902 = !DILocation(line: 472, column: 13, scope: !895)
!903 = !DILocation(line: 472, column: 22, scope: !895)
!904 = !DILocation(line: 472, column: 33, scope: !895)
!905 = !DILocation(line: 472, column: 6, scope: !895)
!906 = !DILocation(line: 473, column: 6, scope: !895)
!907 = !DILocation(line: 473, column: 15, scope: !895)
!908 = !DILocation(line: 473, column: 25, scope: !895)
!909 = !DILocation(line: 475, column: 5, scope: !761)
!910 = !DILocalVariable(name: "size_optarg", scope: !911, file: !3, line: 481, type: !6)
!911 = distinct !DILexicalBlock(scope: !761, file: !3, line: 480, column: 4)
!912 = !DILocation(line: 481, column: 9, scope: !911)
!913 = !DILocation(line: 481, column: 35, scope: !911)
!914 = !DILocation(line: 481, column: 28, scope: !911)
!915 = !DILocation(line: 481, column: 23, scope: !911)
!916 = !DILocation(line: 481, column: 47, scope: !911)
!917 = !DILocalVariable(name: "ROI_values", scope: !911, file: !3, line: 482, type: !35)
!918 = !DILocation(line: 482, column: 11, scope: !911)
!919 = !DILocation(line: 482, column: 39, scope: !911)
!920 = !DILocation(line: 482, column: 32, scope: !911)
!921 = !DILocation(line: 483, column: 5, scope: !911)
!922 = !DILocation(line: 483, column: 19, scope: !911)
!923 = !DILocation(line: 484, column: 13, scope: !911)
!924 = !DILocation(line: 484, column: 25, scope: !911)
!925 = !DILocation(line: 484, column: 44, scope: !911)
!926 = !DILocation(line: 484, column: 37, scope: !911)
!927 = !DILocation(line: 484, column: 5, scope: !911)
!928 = !DILocation(line: 485, column: 5, scope: !911)
!929 = !DILocation(line: 485, column: 23, scope: !911)
!930 = !DILocation(line: 485, column: 16, scope: !911)
!931 = !DILocation(line: 485, column: 36, scope: !911)
!932 = !DILocation(line: 487, column: 22, scope: !911)
!933 = !DILocation(line: 487, column: 35, scope: !911)
!934 = !DILocation(line: 487, column: 47, scope: !911)
!935 = !DILocation(line: 487, column: 55, scope: !911)
!936 = !DILocation(line: 487, column: 67, scope: !911)
!937 = !DILocation(line: 487, column: 75, scope: !911)
!938 = !DILocation(line: 487, column: 87, scope: !911)
!939 = !DILocation(line: 487, column: 95, scope: !911)
!940 = !DILocation(line: 487, column: 107, scope: !911)
!941 = !DILocation(line: 487, column: 5, scope: !911)
!942 = !DILocation(line: 489, column: 10, scope: !911)
!943 = !DILocation(line: 489, column: 5, scope: !911)
!944 = !DILocation(line: 491, column: 4, scope: !761)
!945 = !DILocation(line: 497, column: 12, scope: !946)
!946 = distinct !DILexicalBlock(scope: !761, file: !3, line: 496, column: 4)
!947 = !DILocation(line: 497, column: 31, scope: !946)
!948 = !DILocation(line: 497, column: 43, scope: !946)
!949 = !DILocation(line: 497, column: 5, scope: !946)
!950 = !DILocation(line: 498, column: 5, scope: !946)
!951 = !DILocation(line: 498, column: 17, scope: !946)
!952 = !DILocation(line: 498, column: 35, scope: !946)
!953 = !DILocation(line: 500, column: 4, scope: !761)
!954 = !DILocalVariable(name: "index", scope: !955, file: !3, line: 506, type: !35)
!955 = distinct !DILexicalBlock(scope: !761, file: !3, line: 505, column: 5)
!956 = !DILocation(line: 506, column: 12, scope: !955)
!957 = !DILocation(line: 506, column: 20, scope: !955)
!958 = !DILocation(line: 507, column: 14, scope: !955)
!959 = !DILocation(line: 507, column: 29, scope: !955)
!960 = !DILocation(line: 507, column: 6, scope: !955)
!961 = !DILocation(line: 509, column: 5, scope: !761)
!962 = !DILocation(line: 585, column: 13, scope: !761)
!963 = !DILocation(line: 585, column: 71, scope: !761)
!964 = !DILocation(line: 585, column: 74, scope: !761)
!965 = !DILocation(line: 585, column: 5, scope: !761)
!966 = !DILocation(line: 586, column: 5, scope: !761)
!967 = !DILocation(line: 588, column: 2, scope: !745)
!968 = !DILocation(line: 588, column: 9, scope: !705)
!969 = !DILocation(line: 588, column: 11, scope: !705)
!970 = distinct !{!970, !743, !971}
!971 = !DILocation(line: 588, column: 16, scope: !705)
!972 = !DILocation(line: 591, column: 5, scope: !973)
!973 = distinct !DILexicalBlock(scope: !705, file: !3, line: 591, column: 5)
!974 = !DILocation(line: 591, column: 14, scope: !973)
!975 = !DILocation(line: 591, column: 24, scope: !973)
!976 = !DILocation(line: 591, column: 5, scope: !705)
!977 = !DILocation(line: 592, column: 8, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !3, line: 592, column: 6)
!979 = distinct !DILexicalBlock(scope: !973, file: !3, line: 591, column: 28)
!980 = !DILocation(line: 592, column: 20, scope: !978)
!981 = !DILocation(line: 592, column: 29, scope: !978)
!982 = !DILocation(line: 592, column: 6, scope: !979)
!983 = !DILocation(line: 593, column: 12, scope: !984)
!984 = distinct !DILexicalBlock(scope: !978, file: !3, line: 592, column: 34)
!985 = !DILocation(line: 593, column: 4, scope: !984)
!986 = !DILocation(line: 594, column: 4, scope: !984)
!987 = !DILocation(line: 596, column: 6, scope: !988)
!988 = distinct !DILexicalBlock(scope: !979, file: !3, line: 596, column: 6)
!989 = !DILocation(line: 596, column: 15, scope: !988)
!990 = !DILocation(line: 596, column: 30, scope: !988)
!991 = !DILocation(line: 596, column: 6, scope: !979)
!992 = !DILocation(line: 597, column: 12, scope: !993)
!993 = distinct !DILexicalBlock(scope: !988, file: !3, line: 596, column: 35)
!994 = !DILocation(line: 597, column: 4, scope: !993)
!995 = !DILocation(line: 598, column: 12, scope: !993)
!996 = !DILocation(line: 598, column: 4, scope: !993)
!997 = !DILocation(line: 599, column: 4, scope: !993)
!998 = !DILocation(line: 601, column: 9, scope: !999)
!999 = distinct !DILexicalBlock(scope: !979, file: !3, line: 601, column: 6)
!1000 = !DILocation(line: 601, column: 21, scope: !999)
!1001 = !DILocation(line: 601, column: 32, scope: !999)
!1002 = !DILocation(line: 601, column: 6, scope: !979)
!1003 = !DILocation(line: 602, column: 12, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !999, file: !3, line: 601, column: 39)
!1005 = !DILocation(line: 602, column: 4, scope: !1004)
!1006 = !DILocation(line: 603, column: 4, scope: !1004)
!1007 = !DILocation(line: 605, column: 2, scope: !979)
!1008 = !DILocation(line: 606, column: 7, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 606, column: 6)
!1010 = distinct !DILexicalBlock(scope: !973, file: !3, line: 605, column: 7)
!1011 = !DILocation(line: 606, column: 19, scope: !1009)
!1012 = !DILocation(line: 606, column: 29, scope: !1009)
!1013 = !DILocation(line: 606, column: 35, scope: !1009)
!1014 = !DILocation(line: 606, column: 39, scope: !1009)
!1015 = !DILocation(line: 606, column: 51, scope: !1009)
!1016 = !DILocation(line: 606, column: 62, scope: !1009)
!1017 = !DILocation(line: 606, column: 6, scope: !1010)
!1018 = !DILocation(line: 607, column: 12, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 606, column: 69)
!1020 = !DILocation(line: 607, column: 62, scope: !1019)
!1021 = !DILocation(line: 607, column: 4, scope: !1019)
!1022 = !DILocation(line: 608, column: 12, scope: !1019)
!1023 = !DILocation(line: 608, column: 39, scope: !1019)
!1024 = !DILocation(line: 608, column: 4, scope: !1019)
!1025 = !DILocation(line: 609, column: 4, scope: !1019)
!1026 = !DILocation(line: 613, column: 2, scope: !705)
!1027 = !DILocation(line: 614, column: 1, scope: !705)
!1028 = distinct !DISubprogram(name: "parse_DA_values", scope: !3, file: !3, line: 622, type: !1029, scopeLine: 623, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!6, !35, !1031, !1031, !1031, !1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!1032 = !DILocalVariable(name: "inArg", arg: 1, scope: !1028, file: !3, line: 622, type: !35)
!1033 = !DILocation(line: 622, column: 28, scope: !1028)
!1034 = !DILocalVariable(name: "DA_x0", arg: 2, scope: !1028, file: !3, line: 622, type: !1031)
!1035 = !DILocation(line: 622, column: 49, scope: !1028)
!1036 = !DILocalVariable(name: "DA_y0", arg: 3, scope: !1028, file: !3, line: 622, type: !1031)
!1037 = !DILocation(line: 622, column: 70, scope: !1028)
!1038 = !DILocalVariable(name: "DA_x1", arg: 4, scope: !1028, file: !3, line: 622, type: !1031)
!1039 = !DILocation(line: 622, column: 91, scope: !1028)
!1040 = !DILocalVariable(name: "DA_y1", arg: 5, scope: !1028, file: !3, line: 622, type: !1031)
!1041 = !DILocation(line: 622, column: 112, scope: !1028)
!1042 = !DILocalVariable(name: "it", scope: !1028, file: !3, line: 624, type: !6)
!1043 = !DILocation(line: 624, column: 6, scope: !1028)
!1044 = !DILocalVariable(name: "values", scope: !1028, file: !3, line: 625, type: !1045)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 4)
!1048 = !DILocation(line: 625, column: 6, scope: !1028)
!1049 = !DILocalVariable(name: "delims", scope: !1028, file: !3, line: 626, type: !1050)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 16, elements: !731)
!1051 = !DILocation(line: 626, column: 7, scope: !1028)
!1052 = !DILocalVariable(name: "result", scope: !1028, file: !3, line: 627, type: !35)
!1053 = !DILocation(line: 627, column: 8, scope: !1028)
!1054 = !DILocation(line: 628, column: 19, scope: !1028)
!1055 = !DILocation(line: 628, column: 26, scope: !1028)
!1056 = !DILocation(line: 628, column: 11, scope: !1028)
!1057 = !DILocation(line: 628, column: 9, scope: !1028)
!1058 = !DILocation(line: 630, column: 2, scope: !1028)
!1059 = !DILocation(line: 630, column: 10, scope: !1028)
!1060 = !DILocation(line: 630, column: 17, scope: !1028)
!1061 = !DILocation(line: 630, column: 26, scope: !1028)
!1062 = !DILocation(line: 630, column: 30, scope: !1028)
!1063 = !DILocation(line: 630, column: 33, scope: !1028)
!1064 = !DILocation(line: 0, scope: !1028)
!1065 = !DILocation(line: 631, column: 21, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 630, column: 41)
!1067 = !DILocation(line: 631, column: 16, scope: !1066)
!1068 = !DILocation(line: 631, column: 10, scope: !1066)
!1069 = !DILocation(line: 631, column: 3, scope: !1066)
!1070 = !DILocation(line: 631, column: 14, scope: !1066)
!1071 = !DILocation(line: 632, column: 26, scope: !1066)
!1072 = !DILocation(line: 632, column: 12, scope: !1066)
!1073 = !DILocation(line: 632, column: 10, scope: !1066)
!1074 = !DILocation(line: 633, column: 5, scope: !1066)
!1075 = distinct !{!1075, !1058, !1076}
!1076 = !DILocation(line: 634, column: 2, scope: !1028)
!1077 = !DILocation(line: 636, column: 6, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 636, column: 6)
!1079 = !DILocation(line: 636, column: 9, scope: !1078)
!1080 = !DILocation(line: 636, column: 6, scope: !1028)
!1081 = !DILocation(line: 637, column: 3, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 636, column: 15)
!1083 = !DILocation(line: 640, column: 12, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 639, column: 6)
!1085 = !DILocation(line: 640, column: 4, scope: !1084)
!1086 = !DILocation(line: 640, column: 10, scope: !1084)
!1087 = !DILocation(line: 640, column: 32, scope: !1084)
!1088 = !DILocation(line: 640, column: 24, scope: !1084)
!1089 = !DILocation(line: 640, column: 30, scope: !1084)
!1090 = !DILocation(line: 641, column: 12, scope: !1084)
!1091 = !DILocation(line: 641, column: 4, scope: !1084)
!1092 = !DILocation(line: 641, column: 10, scope: !1084)
!1093 = !DILocation(line: 641, column: 32, scope: !1084)
!1094 = !DILocation(line: 641, column: 24, scope: !1084)
!1095 = !DILocation(line: 641, column: 30, scope: !1084)
!1096 = !DILocation(line: 642, column: 3, scope: !1084)
!1097 = !DILocation(line: 644, column: 1, scope: !1028)
!1098 = distinct !DISubprogram(name: "error_callback", scope: !3, file: !3, line: 651, type: !1099, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{null, !7, !34}
!1101 = !DILocalVariable(name: "msg", arg: 1, scope: !1098, file: !3, line: 651, type: !7)
!1102 = !DILocation(line: 651, column: 33, scope: !1098)
!1103 = !DILocalVariable(name: "client_data", arg: 2, scope: !1098, file: !3, line: 651, type: !34)
!1104 = !DILocation(line: 651, column: 44, scope: !1098)
!1105 = !DILocation(line: 652, column: 8, scope: !1098)
!1106 = !DILocation(line: 653, column: 10, scope: !1098)
!1107 = !DILocation(line: 653, column: 32, scope: !1098)
!1108 = !DILocation(line: 653, column: 2, scope: !1098)
!1109 = !DILocation(line: 654, column: 1, scope: !1098)
!1110 = distinct !DISubprogram(name: "warning_callback", scope: !3, file: !3, line: 658, type: !1099, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!1111 = !DILocalVariable(name: "msg", arg: 1, scope: !1110, file: !3, line: 658, type: !7)
!1112 = !DILocation(line: 658, column: 35, scope: !1110)
!1113 = !DILocalVariable(name: "client_data", arg: 2, scope: !1110, file: !3, line: 658, type: !34)
!1114 = !DILocation(line: 658, column: 46, scope: !1110)
!1115 = !DILocation(line: 659, column: 8, scope: !1110)
!1116 = !DILocation(line: 660, column: 10, scope: !1110)
!1117 = !DILocation(line: 660, column: 34, scope: !1110)
!1118 = !DILocation(line: 660, column: 2, scope: !1110)
!1119 = !DILocation(line: 661, column: 1, scope: !1110)
!1120 = distinct !DISubprogram(name: "info_callback", scope: !3, file: !3, line: 665, type: !1099, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!1121 = !DILocalVariable(name: "msg", arg: 1, scope: !1120, file: !3, line: 665, type: !7)
!1122 = !DILocation(line: 665, column: 32, scope: !1120)
!1123 = !DILocalVariable(name: "client_data", arg: 2, scope: !1120, file: !3, line: 665, type: !34)
!1124 = !DILocation(line: 665, column: 43, scope: !1120)
!1125 = !DILocation(line: 666, column: 8, scope: !1120)
!1126 = !DILocation(line: 667, column: 10, scope: !1120)
!1127 = !DILocation(line: 667, column: 31, scope: !1120)
!1128 = !DILocation(line: 667, column: 2, scope: !1120)
!1129 = !DILocation(line: 668, column: 1, scope: !1120)
!1130 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 675, type: !1131, scopeLine: 676, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !50)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!6, !6, !42}
!1133 = !DILocalVariable(name: "argc", arg: 1, scope: !1130, file: !3, line: 675, type: !6)
!1134 = !DILocation(line: 675, column: 14, scope: !1130)
!1135 = !DILocalVariable(name: "argv", arg: 2, scope: !1130, file: !3, line: 675, type: !42)
!1136 = !DILocation(line: 675, column: 27, scope: !1130)
!1137 = !DILocalVariable(name: "fsrc", scope: !1130, file: !3, line: 677, type: !564)
!1138 = !DILocation(line: 677, column: 8, scope: !1130)
!1139 = !DILocalVariable(name: "parameters", scope: !1130, file: !3, line: 679, type: !448)
!1140 = !DILocation(line: 679, column: 20, scope: !1130)
!1141 = !DILocalVariable(name: "image", scope: !1130, file: !3, line: 680, type: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_image_t", file: !14, line: 654, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_image", file: !14, line: 635, size: 384, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1151, !1153, !1174, !1177}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !1144, file: !14, line: 637, baseType: !149, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !1144, file: !14, line: 639, baseType: !149, size: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !1144, file: !14, line: 641, baseType: !149, size: 32, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !1144, file: !14, line: 643, baseType: !149, size: 32, offset: 96)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "numcomps", scope: !1144, file: !14, line: 645, baseType: !149, size: 32, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1144, file: !14, line: 647, baseType: !1152, size: 32, offset: 160)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_COLOR_SPACE", file: !14, line: 187, baseType: !20)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !1144, file: !14, line: 649, baseType: !1154, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_image_comp_t", file: !14, line: 630, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_image_comp", file: !14, line: 605, size: 448, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !1156, file: !14, line: 607, baseType: !149, size: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1156, file: !14, line: 609, baseType: !149, size: 32, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1156, file: !14, line: 611, baseType: !149, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1156, file: !14, line: 613, baseType: !149, size: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !1156, file: !14, line: 615, baseType: !149, size: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !1156, file: !14, line: 617, baseType: !149, size: 32, offset: 160)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !1156, file: !14, line: 619, baseType: !149, size: 32, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "bpp", scope: !1156, file: !14, line: 621, baseType: !149, size: 32, offset: 224)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sgnd", scope: !1156, file: !14, line: 623, baseType: !149, size: 32, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "resno_decoded", scope: !1156, file: !14, line: 625, baseType: !149, size: 32, offset: 288)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !1156, file: !14, line: 627, baseType: !149, size: 32, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !14, line: 629, baseType: !1170, size: 64, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_INT32", file: !14, line: 90, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1173, line: 196, baseType: !6)
!1173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "icc_profile_buf", scope: !1144, file: !14, line: 651, baseType: !1175, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_BYTE", file: !14, line: 82, baseType: !137)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "icc_profile_len", scope: !1144, file: !14, line: 653, baseType: !149, size: 32, offset: 320)
!1178 = !DILocation(line: 680, column: 15, scope: !1130)
!1179 = !DILocalVariable(name: "l_stream", scope: !1130, file: !3, line: 681, type: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_stream_t", file: !14, line: 594, baseType: !34)
!1182 = !DILocation(line: 681, column: 16, scope: !1130)
!1183 = !DILocalVariable(name: "l_codec", scope: !1130, file: !3, line: 682, type: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_codec_t", file: !14, line: 542, baseType: !34)
!1186 = !DILocation(line: 682, column: 15, scope: !1130)
!1187 = !DILocalVariable(name: "cstr_index", scope: !1130, file: !3, line: 683, type: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_codestream_index_t", file: !14, line: 986, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_codestream_index", file: !14, line: 963, size: 448, elements: !1191)
!1191 = !{!1192, !1196, !1197, !1200, !1201, !1209, !1210, !1211}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "main_head_start", scope: !1190, file: !14, line: 965, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_OFF_T", file: !1194, line: 49, baseType: !1195)
!1194 = !DIFile(filename: "libopenjpeg/opj_stdint.h", directory: "/root/llvm/codesample/real-effectiveness/openjpeg-3991bbe/src")
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1173, line: 197, baseType: !290)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "main_head_end", scope: !1190, file: !14, line: 967, baseType: !1193, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "codestream_size", scope: !1190, file: !14, line: 970, baseType: !1198, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPJ_UINT64", file: !14, line: 93, baseType: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !151, line: 55, baseType: !287)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "marknum", scope: !1190, file: !14, line: 974, baseType: !149, size: 32, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !1190, file: !14, line: 976, baseType: !1202, size: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_marker_info_t", file: !14, line: 714, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_marker_info_t", file: !14, line: 707, size: 192, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1204, file: !14, line: 709, baseType: !141, size: 16)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1204, file: !14, line: 711, baseType: !1193, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1204, file: !14, line: 713, baseType: !6, size: 32, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "maxmarknum", scope: !1190, file: !14, line: 978, baseType: !149, size: 32, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_of_tiles", scope: !1190, file: !14, line: 982, baseType: !149, size: 32, offset: 352)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "tile_index", scope: !1190, file: !14, line: 984, baseType: !1212, size: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_tile_index_t", file: !14, line: 958, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_tile_index", file: !14, line: 931, size: 448, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1228, !1229, !1230, !1231, !1232}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "tileno", scope: !1214, file: !14, line: 933, baseType: !149, size: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_tps", scope: !1214, file: !14, line: 936, baseType: !149, size: 32, offset: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "current_nb_tps", scope: !1214, file: !14, line: 938, baseType: !149, size: 32, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "current_tpsno", scope: !1214, file: !14, line: 940, baseType: !149, size: 32, offset: 96)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_index", scope: !1214, file: !14, line: 942, baseType: !1221, size: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_tp_index_t", file: !14, line: 926, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_tp_index", file: !14, line: 918, size: 192, elements: !1224)
!1224 = !{!1225, !1226, !1227}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !1223, file: !14, line: 920, baseType: !1193, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "end_header", scope: !1223, file: !14, line: 922, baseType: !1193, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "end_pos", scope: !1223, file: !14, line: 924, baseType: !1193, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "marknum", scope: !1214, file: !14, line: 946, baseType: !149, size: 32, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !1214, file: !14, line: 948, baseType: !1202, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "maxmarknum", scope: !1214, file: !14, line: 950, baseType: !149, size: 32, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_packet", scope: !1214, file: !14, line: 954, baseType: !149, size: 32, offset: 352)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "packet_index", scope: !1214, file: !14, line: 956, baseType: !1233, size: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "opj_packet_info_t", file: !14, line: 700, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opj_packet_info", file: !14, line: 691, size: 256, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !1235, file: !14, line: 693, baseType: !1193, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "end_ph_pos", scope: !1235, file: !14, line: 695, baseType: !1193, size: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "end_pos", scope: !1235, file: !14, line: 697, baseType: !1193, size: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "disto", scope: !1235, file: !14, line: 699, baseType: !1241, size: 64, offset: 192)
!1241 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1242 = !DILocation(line: 683, column: 26, scope: !1130)
!1243 = !DILocalVariable(name: "indexfilename", scope: !1130, file: !3, line: 685, type: !454)
!1244 = !DILocation(line: 685, column: 7, scope: !1130)
!1245 = !DILocalVariable(name: "num_images", scope: !1130, file: !3, line: 687, type: !1171)
!1246 = !DILocation(line: 687, column: 12, scope: !1130)
!1247 = !DILocalVariable(name: "imageno", scope: !1130, file: !3, line: 687, type: !1171)
!1248 = !DILocation(line: 687, column: 24, scope: !1130)
!1249 = !DILocalVariable(name: "img_fol", scope: !1130, file: !3, line: 688, type: !440)
!1250 = !DILocation(line: 688, column: 12, scope: !1130)
!1251 = !DILocalVariable(name: "dirptr", scope: !1130, file: !3, line: 689, type: !36)
!1252 = !DILocation(line: 689, column: 12, scope: !1130)
!1253 = !DILocation(line: 692, column: 2, scope: !1130)
!1254 = !DILocation(line: 695, column: 2, scope: !1130)
!1255 = !DILocation(line: 695, column: 17, scope: !1130)
!1256 = !DILocation(line: 698, column: 2, scope: !1130)
!1257 = !DILocation(line: 701, column: 27, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 701, column: 5)
!1259 = !DILocation(line: 701, column: 33, scope: !1258)
!1260 = !DILocation(line: 701, column: 61, scope: !1258)
!1261 = !DILocation(line: 701, column: 5, scope: !1258)
!1262 = !DILocation(line: 701, column: 76, scope: !1258)
!1263 = !DILocation(line: 701, column: 5, scope: !1130)
!1264 = !DILocation(line: 702, column: 3, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 701, column: 82)
!1266 = !DILocation(line: 706, column: 13, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 706, column: 5)
!1268 = !DILocation(line: 706, column: 5, scope: !1267)
!1269 = !DILocation(line: 706, column: 23, scope: !1267)
!1270 = !DILocation(line: 706, column: 5, scope: !1130)
!1271 = !DILocalVariable(name: "it_image", scope: !1272, file: !3, line: 707, type: !6)
!1272 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 706, column: 27)
!1273 = !DILocation(line: 707, column: 7, scope: !1272)
!1274 = !DILocation(line: 708, column: 37, scope: !1272)
!1275 = !DILocation(line: 708, column: 14, scope: !1272)
!1276 = !DILocation(line: 708, column: 13, scope: !1272)
!1277 = !DILocation(line: 710, column: 21, scope: !1272)
!1278 = !DILocation(line: 710, column: 10, scope: !1272)
!1279 = !DILocation(line: 710, column: 9, scope: !1272)
!1280 = !DILocation(line: 711, column: 6, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 711, column: 6)
!1282 = !DILocation(line: 711, column: 6, scope: !1272)
!1283 = !DILocation(line: 712, column: 41, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1281, file: !3, line: 711, column: 13)
!1285 = !DILocation(line: 712, column: 51, scope: !1284)
!1286 = !DILocation(line: 712, column: 64, scope: !1284)
!1287 = !DILocation(line: 712, column: 34, scope: !1284)
!1288 = !DILocation(line: 712, column: 4, scope: !1284)
!1289 = !DILocation(line: 712, column: 12, scope: !1284)
!1290 = !DILocation(line: 712, column: 25, scope: !1284)
!1291 = !DILocation(line: 713, column: 39, scope: !1284)
!1292 = !DILocation(line: 713, column: 49, scope: !1284)
!1293 = !DILocation(line: 713, column: 32, scope: !1284)
!1294 = !DILocation(line: 713, column: 23, scope: !1284)
!1295 = !DILocation(line: 713, column: 4, scope: !1284)
!1296 = !DILocation(line: 713, column: 12, scope: !1284)
!1297 = !DILocation(line: 713, column: 21, scope: !1284)
!1298 = !DILocation(line: 715, column: 8, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1284, file: !3, line: 715, column: 7)
!1300 = !DILocation(line: 715, column: 16, scope: !1299)
!1301 = !DILocation(line: 715, column: 7, scope: !1284)
!1302 = !DILocation(line: 716, column: 5, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1299, file: !3, line: 715, column: 29)
!1304 = !DILocation(line: 718, column: 16, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1284, file: !3, line: 718, column: 4)
!1306 = !DILocation(line: 718, column: 8, scope: !1305)
!1307 = !DILocation(line: 718, column: 19, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1305, file: !3, line: 718, column: 4)
!1309 = !DILocation(line: 718, column: 28, scope: !1308)
!1310 = !DILocation(line: 718, column: 27, scope: !1308)
!1311 = !DILocation(line: 718, column: 4, scope: !1305)
!1312 = !DILocation(line: 719, column: 34, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 718, column: 50)
!1314 = !DILocation(line: 719, column: 42, scope: !1313)
!1315 = !DILocation(line: 719, column: 57, scope: !1313)
!1316 = !DILocation(line: 719, column: 65, scope: !1313)
!1317 = !DILocation(line: 719, column: 55, scope: !1313)
!1318 = !DILocation(line: 719, column: 5, scope: !1313)
!1319 = !DILocation(line: 719, column: 13, scope: !1313)
!1320 = !DILocation(line: 719, column: 22, scope: !1313)
!1321 = !DILocation(line: 719, column: 32, scope: !1313)
!1322 = !DILocation(line: 720, column: 4, scope: !1313)
!1323 = !DILocation(line: 718, column: 47, scope: !1308)
!1324 = !DILocation(line: 718, column: 4, scope: !1308)
!1325 = distinct !{!1325, !1311, !1326}
!1326 = !DILocation(line: 720, column: 4, scope: !1305)
!1327 = !DILocation(line: 721, column: 3, scope: !1284)
!1328 = !DILocation(line: 722, column: 18, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 722, column: 6)
!1330 = !DILocation(line: 722, column: 33, scope: !1329)
!1331 = !DILocation(line: 722, column: 6, scope: !1329)
!1332 = !DILocation(line: 722, column: 44, scope: !1329)
!1333 = !DILocation(line: 722, column: 6, scope: !1272)
!1334 = !DILocation(line: 723, column: 4, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1329, file: !3, line: 722, column: 48)
!1336 = !DILocation(line: 725, column: 7, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 725, column: 7)
!1338 = !DILocation(line: 725, column: 17, scope: !1337)
!1339 = !DILocation(line: 725, column: 7, scope: !1272)
!1340 = !DILocation(line: 726, column: 12, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1337, file: !3, line: 725, column: 21)
!1342 = !DILocation(line: 726, column: 4, scope: !1341)
!1343 = !DILocation(line: 727, column: 4, scope: !1341)
!1344 = !DILocation(line: 729, column: 2, scope: !1272)
!1345 = !DILocation(line: 730, column: 13, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 729, column: 7)
!1347 = !DILocation(line: 734, column: 14, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 734, column: 2)
!1349 = !DILocation(line: 734, column: 6, scope: !1348)
!1350 = !DILocation(line: 734, column: 19, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 734, column: 2)
!1352 = !DILocation(line: 734, column: 29, scope: !1351)
!1353 = !DILocation(line: 734, column: 27, scope: !1351)
!1354 = !DILocation(line: 734, column: 2, scope: !1348)
!1355 = !DILocation(line: 736, column: 11, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1351, file: !3, line: 734, column: 53)
!1357 = !DILocation(line: 736, column: 3, scope: !1356)
!1358 = !DILocation(line: 738, column: 14, scope: !1359)
