; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.module_t = type opaque
%struct.module_config_t = type { i32, i8*, i8*, i8, i8*, i8*, %union.module_value_t, %union.module_value_t, %union.module_value_t, %union.module_nvalue_t, %union.module_nvalue_t, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i8*, i8**, i32*, i8**, i32, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)**, i8**, i32, i8, i8, i8, i8, i8*, i8, i8, i8, i8 }
%union.module_value_t = type { i8* }
%union.module_nvalue_t = type { i32 }
%struct.vlc_object_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t* }
%struct.libvlc_int_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.hotkey* }
%struct.hotkey = type opaque
%struct.entries_sect_s = type { [8 x i8], i8, i8, i16, [500 x %struct.anon.1], [36 x i8] }
%struct.anon.1 = type { i8, %struct.msf_s }
%struct.msf_s = type { i8, i8, i8 }
%struct.vcddev_s = type { i8*, i32, i32, i32*, i32 }
%struct.access_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.module_t*, i8*, i8*, i8*, i64 (%struct.access_t*, i8*, i64)*, %struct.block_t* (%struct.access_t*)*, i32 (%struct.access_t*, i64)*, i32 (%struct.access_t*, i32, %struct.__va_list_tag*)*, %struct.anon.0, %struct.access_sys_t*, %struct.input_thread_t* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !37, nameTableKind: None)
!1 = !DIFile(filename: "vcd.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vlc_module_properties", file: !4, line: 37, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "../../../include/vlc_plugin.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!7 = !DIEnumerator(name: "VLC_SUBMODULE_CREATE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "VLC_CONFIG_CREATE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "VLC_MODULE_CPU_REQUIREMENT", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "VLC_MODULE_SHORTCUT", value: 257, isUnsigned: true)
!11 = !DIEnumerator(name: "VLC_MODULE_CAPABILITY", value: 258, isUnsigned: true)
!12 = !DIEnumerator(name: "VLC_MODULE_SCORE", value: 259, isUnsigned: true)
!13 = !DIEnumerator(name: "VLC_MODULE_CB_OPEN", value: 260, isUnsigned: true)
!14 = !DIEnumerator(name: "VLC_MODULE_CB_CLOSE", value: 261, isUnsigned: true)
!15 = !DIEnumerator(name: "VLC_MODULE_NO_UNLOAD", value: 262, isUnsigned: true)
!16 = !DIEnumerator(name: "VLC_MODULE_NAME", value: 263, isUnsigned: true)
!17 = !DIEnumerator(name: "VLC_MODULE_SHORTNAME", value: 264, isUnsigned: true)
!18 = !DIEnumerator(name: "VLC_MODULE_DESCRIPTION", value: 265, isUnsigned: true)
!19 = !DIEnumerator(name: "VLC_MODULE_HELP", value: 266, isUnsigned: true)
!20 = !DIEnumerator(name: "VLC_MODULE_TEXTDOMAIN", value: 267, isUnsigned: true)
!21 = !DIEnumerator(name: "VLC_CONFIG_NAME", value: 4096, isUnsigned: true)
!22 = !DIEnumerator(name: "VLC_CONFIG_VALUE", value: 4097, isUnsigned: true)
!23 = !DIEnumerator(name: "VLC_CONFIG_RANGE", value: 4098, isUnsigned: true)
!24 = !DIEnumerator(name: "VLC_CONFIG_ADVANCED", value: 4099, isUnsigned: true)
!25 = !DIEnumerator(name: "VLC_CONFIG_VOLATILE", value: 4100, isUnsigned: true)
!26 = !DIEnumerator(name: "VLC_CONFIG_PERSISTENT", value: 4101, isUnsigned: true)
!27 = !DIEnumerator(name: "VLC_CONFIG_RESTART", value: 4102, isUnsigned: true)
!28 = !DIEnumerator(name: "VLC_CONFIG_PRIVATE", value: 4103, isUnsigned: true)
!29 = !DIEnumerator(name: "VLC_CONFIG_REMOVED", value: 4104, isUnsigned: true)
!30 = !DIEnumerator(name: "VLC_CONFIG_CAPABILITY", value: 4105, isUnsigned: true)
!31 = !DIEnumerator(name: "VLC_CONFIG_SHORTCUT", value: 4106, isUnsigned: true)
!32 = !DIEnumerator(name: "VLC_CONFIG_OLDNAME", value: 4107, isUnsigned: true)
!33 = !DIEnumerator(name: "VLC_CONFIG_SAFE", value: 4108, isUnsigned: true)
!34 = !DIEnumerator(name: "VLC_CONFIG_DESC", value: 4109, isUnsigned: true)
!35 = !DIEnumerator(name: "VLC_CONFIG_LIST", value: 4110, isUnsigned: true)
!36 = !DIEnumerator(name: "VLC_CONFIG_ADD_ACTION", value: 4111, isUnsigned: true)
!37 = !{!38, !41, !42, !43, !117, !144, !253, !255, !48, !101, !55, !175, !220, !221, !209, !112, !257, !259}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_callback_t", file: !44, line: 490, baseType: !45)
!44 = !DIFile(filename: "../../../include/vlc_common.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!41, !48, !38, !79, !79, !42}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !44, line: 177, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !51, line: 60, size: 320, elements: !52)
!51 = !DIFile(filename: "../../../include/vlc_objects.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!52 = !{!53, !54, !56, !57, !60, !61, !78}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !50, file: !51, line: 62, baseType: !38, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !50, file: !51, line: 62, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !50, file: !51, line: 62, baseType: !41, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !50, file: !51, line: 62, baseType: !58, size: 8, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !59)
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !50, file: !51, line: 62, baseType: !59, size: 8, offset: 168)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !50, file: !51, line: 62, baseType: !62, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !44, line: 178, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !65, line: 38, size: 384, elements: !66)
!65 = !DIFile(filename: "../../../include/vlc_main.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !64, file: !65, line: 40, baseType: !38, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !64, file: !65, line: 40, baseType: !55, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !64, file: !65, line: 40, baseType: !41, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !64, file: !65, line: 40, baseType: !58, size: 8, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !64, file: !65, line: 40, baseType: !59, size: 8, offset: 168)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !64, file: !65, line: 40, baseType: !62, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !64, file: !65, line: 40, baseType: !48, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !64, file: !65, line: 43, baseType: !75, size: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "hotkey", file: !65, line: 31, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !50, file: !51, line: 62, baseType: !48, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_value_t", file: !44, line: 432, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !44, line: 417, size: 64, elements: !81)
!81 = !{!82, !83, !84, !86, !87, !88, !89, !99, !104, !110}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_int", scope: !80, file: !44, line: 419, baseType: !41, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "b_bool", scope: !80, file: !44, line: 420, baseType: !59, size: 8)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "f_float", scope: !80, file: !44, line: 421, baseType: !85, size: 32)
!85 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "psz_string", scope: !80, file: !44, line: 422, baseType: !55, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "p_address", scope: !80, file: !44, line: 423, baseType: !42, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "p_object", scope: !80, file: !44, line: 424, baseType: !48, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "p_list", scope: !80, file: !44, line: 425, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_list_t", file: !44, line: 176, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_list_t", file: !44, line: 437, size: 192, elements: !93)
!93 = !{!94, !95, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !92, file: !44, line: 439, baseType: !41, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "p_values", scope: !92, file: !44, line: 440, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pi_types", scope: !92, file: !44, line: 441, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_time", scope: !80, file: !44, line: 426, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtime_t", file: !44, line: 131, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !102, line: 197, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !80, file: !44, line: 427, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !44, line: 427, size: 64, elements: !106)
!106 = !{!107, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !105, file: !44, line: 427, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !102, line: 196, baseType: !41)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !105, file: !44, line: 427, baseType: !108, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !80, file: !44, line: 430, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !115)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !113, line: 48, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!114 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !{!116}
!116 = !DISubrange(count: 8)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_t", file: !44, line: 220, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_t", file: !120, line: 74, size: 1280, elements: !121)
!120 = !DIFile(filename: "../../../include/vlc_access.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !133, !134, !135, !136, !147, !171, !176, !187, !196, !233}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !119, file: !120, line: 76, baseType: !38, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !119, file: !120, line: 76, baseType: !55, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !119, file: !120, line: 76, baseType: !41, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !119, file: !120, line: 76, baseType: !58, size: 8, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !119, file: !120, line: 76, baseType: !59, size: 8, offset: 168)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !119, file: !120, line: 76, baseType: !62, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !119, file: !120, line: 76, baseType: !48, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !119, file: !120, line: 79, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_t", file: !44, line: 208, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_t", file: !44, line: 208, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "psz_access", scope: !119, file: !120, line: 82, baseType: !55, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !119, file: !120, line: 84, baseType: !55, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "psz_demux", scope: !119, file: !120, line: 89, baseType: !55, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !119, file: !120, line: 93, baseType: !137, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !117, !143, !144}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !102, line: 109, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !142, line: 172, baseType: !103)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 62, baseType: !146)
!145 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!146 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pf_block", scope: !119, file: !120, line: 94, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !117}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_t", file: !44, line: 330, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_t", file: !154, line: 103, size: 576, elements: !155)
!154 = !DIFile(filename: "../../../include/vlc_block.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!155 = !{!156, !157, !159, !160, !161, !162, !163, !164, !165, !166}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !153, file: !154, line: 105, baseType: !151, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !153, file: !154, line: 107, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !113, line: 51, baseType: !5)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !153, file: !154, line: 109, baseType: !100, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !153, file: !154, line: 110, baseType: !100, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !153, file: !154, line: 111, baseType: !100, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_samples", scope: !153, file: !154, line: 113, baseType: !5, size: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !153, file: !154, line: 114, baseType: !41, size: 32, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_buffer", scope: !153, file: !154, line: 116, baseType: !144, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "p_buffer", scope: !153, file: !154, line: 117, baseType: !143, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !153, file: !154, line: 120, baseType: !167, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_free_t", file: !154, line: 101, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !151}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pf_seek", scope: !119, file: !120, line: 98, baseType: !172, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!41, !117, !175}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !113, line: 55, baseType: !146)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !119, file: !120, line: 102, baseType: !177, size: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!41, !117, !41, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 97, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !181, file: !1, line: 97, baseType: !5, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !181, file: !1, line: 97, baseType: !5, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !181, file: !1, line: 97, baseType: !42, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !181, file: !1, line: 97, baseType: !42, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !119, file: !120, line: 116, baseType: !188, size: 320, offset: 832)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !120, line: 105, size: 320, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_update", scope: !188, file: !120, line: 107, baseType: !5, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !188, file: !120, line: 110, baseType: !175, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_pos", scope: !188, file: !120, line: 111, baseType: !175, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !188, file: !120, line: 112, baseType: !59, size: 8, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_title", scope: !188, file: !120, line: 114, baseType: !41, size: 32, offset: 224)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !188, file: !120, line: 115, baseType: !41, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !119, file: !120, line: 117, baseType: !197, size: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_sys_t", file: !44, line: 221, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_sys_t", file: !1, line: 74, size: 6592, elements: !200)
!200 = !{!201, !206, !207, !231, !232}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "vcddev", scope: !199, file: !1, line: 76, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "vcddev_t", file: !204, line: 57, baseType: !205)
!204 = !DIFile(filename: "./cdrom.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "vcddev_s", file: !204, line: 57, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_titles", scope: !199, file: !1, line: 79, baseType: !41, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !199, file: !1, line: 80, baseType: !208, size: 6336, offset: 128)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 6336, elements: !229)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_title_t", file: !211, line: 131, baseType: !212)
!211 = !DIFile(filename: "../../../include/vlc_input.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 118, size: 384, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !212, file: !211, line: 120, baseType: !55, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "b_menu", scope: !212, file: !211, line: 122, baseType: !59, size: 8, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !212, file: !211, line: 124, baseType: !101, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !212, file: !211, line: 125, baseType: !101, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !212, file: !211, line: 128, baseType: !41, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "seekpoint", scope: !212, file: !211, line: 129, baseType: !220, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "seekpoint_t", file: !44, line: 230, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seekpoint_t", file: !211, line: 81, size: 256, elements: !224)
!224 = !{!225, !226, !227, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_byte_offset", scope: !223, file: !211, line: 83, baseType: !101, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset", scope: !223, file: !211, line: 84, baseType: !101, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !223, file: !211, line: 85, baseType: !55, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_level", scope: !223, file: !211, line: 86, baseType: !41, size: 32, offset: 192)
!229 = !{!230}
!230 = !DISubrange(count: 99)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_sector", scope: !199, file: !1, line: 83, baseType: !41, size: 32, offset: 6464)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "p_sectors", scope: !199, file: !1, line: 84, baseType: !98, size: 64, offset: 6528)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !119, file: !120, line: 120, baseType: !234, size: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_t", file: !44, line: 216, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_t", file: !211, line: 266, size: 448, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !236, file: !211, line: 268, baseType: !38, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !236, file: !211, line: 268, baseType: !55, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !236, file: !211, line: 268, baseType: !41, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !236, file: !211, line: 268, baseType: !58, size: 8, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !236, file: !211, line: 268, baseType: !59, size: 8, offset: 168)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !236, file: !211, line: 268, baseType: !62, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !236, file: !211, line: 268, baseType: !48, size: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !236, file: !211, line: 270, baseType: !59, size: 8, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !236, file: !211, line: 271, baseType: !59, size: 8, offset: 328)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_preparsing", scope: !236, file: !211, line: 272, baseType: !59, size: 8, offset: 336)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_dead", scope: !236, file: !211, line: 273, baseType: !59, size: 8, offset: 344)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !236, file: !211, line: 277, baseType: !250, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_private_t", file: !211, line: 254, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_private_t", file: !211, line: 254, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !113, line: 49, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !284, nameTableKind: None)
!262 = !DIFile(filename: "cdrom.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!263 = !{!264}
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vlc_meta_type_t", file: !265, line: 33, baseType: !5, size: 32, elements: !266)
!265 = !DIFile(filename: "../../../include/vlc_meta.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!267 = !DIEnumerator(name: "vlc_meta_Title", value: 0, isUnsigned: true)
!268 = !DIEnumerator(name: "vlc_meta_Artist", value: 1, isUnsigned: true)
!269 = !DIEnumerator(name: "vlc_meta_Genre", value: 2, isUnsigned: true)
!270 = !DIEnumerator(name: "vlc_meta_Copyright", value: 3, isUnsigned: true)
!271 = !DIEnumerator(name: "vlc_meta_Album", value: 4, isUnsigned: true)
!272 = !DIEnumerator(name: "vlc_meta_TrackNumber", value: 5, isUnsigned: true)
!273 = !DIEnumerator(name: "vlc_meta_Description", value: 6, isUnsigned: true)
!274 = !DIEnumerator(name: "vlc_meta_Rating", value: 7, isUnsigned: true)
!275 = !DIEnumerator(name: "vlc_meta_Date", value: 8, isUnsigned: true)
!276 = !DIEnumerator(name: "vlc_meta_Setting", value: 9, isUnsigned: true)
!277 = !DIEnumerator(name: "vlc_meta_URL", value: 10, isUnsigned: true)
!278 = !DIEnumerator(name: "vlc_meta_Language", value: 11, isUnsigned: true)
!279 = !DIEnumerator(name: "vlc_meta_NowPlaying", value: 12, isUnsigned: true)
!280 = !DIEnumerator(name: "vlc_meta_Publisher", value: 13, isUnsigned: true)
!281 = !DIEnumerator(name: "vlc_meta_EncodedBy", value: 14, isUnsigned: true)
!282 = !DIEnumerator(name: "vlc_meta_ArtworkURL", value: 15, isUnsigned: true)
!283 = !DIEnumerator(name: "vlc_meta_TrackID", value: 16, isUnsigned: true)
!284 = !{!42, !55, !285, !308, !144, !253, !255, !38, !41}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !44, line: 177, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !51, line: 60, size: 320, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !307}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !287, file: !51, line: 62, baseType: !38, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !287, file: !51, line: 62, baseType: !55, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !287, file: !51, line: 62, baseType: !41, size: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !287, file: !51, line: 62, baseType: !58, size: 8, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !287, file: !51, line: 62, baseType: !59, size: 8, offset: 168)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !287, file: !51, line: 62, baseType: !295, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !44, line: 178, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !65, line: 38, size: 384, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !297, file: !65, line: 40, baseType: !38, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !297, file: !65, line: 40, baseType: !55, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !297, file: !65, line: 40, baseType: !41, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !297, file: !65, line: 40, baseType: !58, size: 8, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !297, file: !65, line: 40, baseType: !59, size: 8, offset: 168)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !297, file: !65, line: 40, baseType: !295, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !297, file: !65, line: 40, baseType: !285, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !297, file: !65, line: 43, baseType: !75, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !287, file: !51, line: 62, baseType: !285, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cdrom_msf0", file: !310, line: 154, size: 24, elements: !311)
!310 = !DIFile(filename: "/usr/include/linux/cdrom.h", directory: "")
!311 = !{!312, !315, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !309, file: !310, line: 156, baseType: !313, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !314, line: 20, baseType: !114)
!314 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !309, file: !310, line: 157, baseType: !313, size: 8, offset: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !309, file: !310, line: 158, baseType: !313, size: 8, offset: 16)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, nameTableKind: None)
!318 = !DIFile(filename: "strlcpy.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/compat")
!319 = !{}
!320 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!321 = !{i32 2, !"Dwarf Version", i32 4}
!322 = !{i32 2, !"Debug Info Version", i32 3}
!323 = !{i32 1, !"wchar_size", i32 4}
!324 = !{i32 7, !"PIC Level", i32 2}
!325 = !{i32 1, !"ThinLTO", i32 0}
!326 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!327 = distinct !DISubprogram(name: "vlc_entry__1_1_0g", scope: !1, file: !1, line: 51, type: !328, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !330)
!328 = !DISubroutineType(types: !329)
!329 = !{!41, !130}
!330 = !{!331, !332, !381}
!331 = !DILocalVariable(name: "p_module", arg: 1, scope: !327, file: !1, line: 51, type: !130)
!332 = !DILocalVariable(name: "p_config", scope: !327, file: !1, line: 51, type: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_config_t", file: !44, line: 209, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_config_t", file: !336, line: 150, size: 1408, elements: !337)
!336 = !DIFile(filename: "../../../include/vlc_configuration.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!337 = !{!338, !339, !340, !341, !342, !343, !344, !351, !352, !353, !359, !360, !361, !362, !364, !365, !366, !367, !368, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !335, file: !336, line: 152, baseType: !41, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "psz_type", scope: !335, file: !336, line: 153, baseType: !55, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !335, file: !336, line: 154, baseType: !55, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_short", scope: !335, file: !336, line: 155, baseType: !40, size: 8, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "psz_text", scope: !335, file: !336, line: 156, baseType: !55, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "psz_longtext", scope: !335, file: !336, line: 157, baseType: !55, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !335, file: !336, line: 158, baseType: !345, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_value_t", file: !336, line: 142, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !336, line: 137, size: 64, elements: !347)
!347 = !{!348, !349, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "psz", scope: !346, file: !336, line: 139, baseType: !55, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !346, file: !336, line: 140, baseType: !41, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !346, file: !336, line: 141, baseType: !85, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !335, file: !336, line: 159, baseType: !345, size: 64, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !335, file: !336, line: 160, baseType: !345, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !335, file: !336, line: 161, baseType: !354, size: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_nvalue_t", file: !336, line: 148, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !336, line: 144, size: 32, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !355, file: !336, line: 146, baseType: !41, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !355, file: !336, line: 147, baseType: !85, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !335, file: !336, line: 162, baseType: !354, size: 32, offset: 608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pf_callback", scope: !335, file: !336, line: 165, baseType: !43, size: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "p_callback_data", scope: !335, file: !336, line: 166, baseType: !42, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list", scope: !335, file: !336, line: 169, baseType: !363, size: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pi_list", scope: !335, file: !336, line: 170, baseType: !98, size: 64, offset: 832)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list_text", scope: !335, file: !336, line: 171, baseType: !363, size: 64, offset: 896)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_list", scope: !335, file: !336, line: 172, baseType: !41, size: 32, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pf_update_list", scope: !335, file: !336, line: 173, baseType: !43, size: 64, offset: 1024)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ppf_action", scope: !335, file: !336, line: 176, baseType: !369, size: 64, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_action_text", scope: !335, file: !336, line: 177, baseType: !363, size: 64, offset: 1152)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_action", scope: !335, file: !336, line: 178, baseType: !41, size: 32, offset: 1216)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "b_dirty", scope: !335, file: !336, line: 181, baseType: !59, size: 8, offset: 1248)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "b_advanced", scope: !335, file: !336, line: 182, baseType: !59, size: 8, offset: 1256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_internal", scope: !335, file: !336, line: 183, baseType: !59, size: 8, offset: 1264)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_restart", scope: !335, file: !336, line: 184, baseType: !59, size: 8, offset: 1272)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "psz_oldname", scope: !335, file: !336, line: 188, baseType: !55, size: 64, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "b_removed", scope: !335, file: !336, line: 189, baseType: !59, size: 8, offset: 1344)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_autosave", scope: !335, file: !336, line: 192, baseType: !59, size: 8, offset: 1352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_unsaveable", scope: !335, file: !336, line: 193, baseType: !59, size: 8, offset: 1360)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b_safe", scope: !335, file: !336, line: 195, baseType: !59, size: 8, offset: 1368)
!381 = !DILocalVariable(name: "p_submodule", scope: !382, file: !1, line: 51, type: !130)
!382 = distinct !DILexicalBlock(scope: !327, file: !1, line: 51, column: 1)
!383 = !DILocation(line: 51, column: 1, scope: !327)
!384 = !{!385, !385, i64 0}
!385 = !{!"any pointer", !386, i64 0}
!386 = !{!"omnipotent char", !387, i64 0}
!387 = !{!"Simple C/C++ TBAA"}
!388 = !DILocation(line: 51, column: 1, scope: !389)
!389 = distinct !DILexicalBlock(scope: !327, file: !1, line: 51, column: 1)
!390 = !DILocation(line: 51, column: 1, scope: !382)
!391 = !DILocation(line: 52, column: 5, scope: !392)
!392 = distinct !DILexicalBlock(scope: !382, file: !1, line: 52, column: 5)
!393 = !DILocation(line: 52, column: 5, scope: !382)
!394 = !DILocation(line: 53, column: 5, scope: !395)
!395 = distinct !DILexicalBlock(scope: !382, file: !1, line: 53, column: 5)
!396 = !DILocation(line: 53, column: 5, scope: !382)
!397 = !DILocation(line: 54, column: 5, scope: !398)
!398 = distinct !DILexicalBlock(scope: !382, file: !1, line: 54, column: 5)
!399 = !DILocation(line: 54, column: 5, scope: !382)
!400 = !DILocation(line: 55, column: 5, scope: !401)
!401 = distinct !DILexicalBlock(scope: !382, file: !1, line: 55, column: 5)
!402 = !DILocation(line: 55, column: 5, scope: !382)
!403 = !DILocation(line: 56, column: 5, scope: !382)
!404 = !DILocation(line: 57, column: 5, scope: !382)
!405 = !DILocation(line: 59, column: 5, scope: !382)
!406 = !DILocation(line: 60, column: 5, scope: !382)
!407 = !DILocation(line: 60, column: 5, scope: !408)
!408 = distinct !DILexicalBlock(scope: !382, file: !1, line: 60, column: 5)
!409 = !DILocation(line: 62, column: 5, scope: !410)
!410 = distinct !DILexicalBlock(scope: !382, file: !1, line: 62, column: 5)
!411 = !DILocation(line: 62, column: 5, scope: !382)
!412 = !DILocation(line: 63, column: 5, scope: !413)
!413 = distinct !DILexicalBlock(scope: !382, file: !1, line: 63, column: 5)
!414 = !DILocation(line: 64, column: 1, scope: !327)
!415 = distinct !DISubprogram(name: "Open", scope: !1, file: !1, line: 95, type: !416, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{!41, !48}
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !433, !434, !436, !437, !439, !440, !442, !443, !447, !449}
!419 = !DILocalVariable(name: "p_this", arg: 1, scope: !415, file: !1, line: 95, type: !48)
!420 = !DILocalVariable(name: "p_access", scope: !415, file: !1, line: 97, type: !117)
!421 = !DILocalVariable(name: "p_sys", scope: !415, file: !1, line: 98, type: !197)
!422 = !DILocalVariable(name: "psz_dup", scope: !415, file: !1, line: 99, type: !55)
!423 = !DILocalVariable(name: "psz", scope: !415, file: !1, line: 100, type: !55)
!424 = !DILocalVariable(name: "i_title", scope: !415, file: !1, line: 101, type: !41)
!425 = !DILocalVariable(name: "i_chapter", scope: !415, file: !1, line: 102, type: !41)
!426 = !DILocalVariable(name: "i", scope: !415, file: !1, line: 103, type: !41)
!427 = !DILocalVariable(name: "vcddev", scope: !415, file: !1, line: 104, type: !202)
!428 = !DILocalVariable(name: "__s1_len", scope: !429, file: !1, line: 121, type: !144)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 121, column: 13)
!430 = distinct !DILexicalBlock(scope: !431, file: !1, line: 121, column: 13)
!431 = distinct !DILexicalBlock(scope: !432, file: !1, line: 117, column: 5)
!432 = distinct !DILexicalBlock(scope: !415, file: !1, line: 116, column: 9)
!433 = !DILocalVariable(name: "__s2_len", scope: !429, file: !1, line: 121, type: !144)
!434 = !DILocalVariable(name: "__s2", scope: !435, file: !1, line: 121, type: !255)
!435 = distinct !DILexicalBlock(scope: !429, file: !1, line: 121, column: 13)
!436 = !DILocalVariable(name: "__result", scope: !435, file: !1, line: 121, type: !41)
!437 = !DILocalVariable(name: "__s1_len", scope: !438, file: !1, line: 122, type: !144)
!438 = distinct !DILexicalBlock(scope: !430, file: !1, line: 122, column: 13)
!439 = !DILocalVariable(name: "__s2_len", scope: !438, file: !1, line: 122, type: !144)
!440 = !DILocalVariable(name: "__s2", scope: !441, file: !1, line: 122, type: !255)
!441 = distinct !DILexicalBlock(scope: !438, file: !1, line: 122, column: 13)
!442 = !DILocalVariable(name: "__result", scope: !441, file: !1, line: 122, type: !41)
!443 = !DILocalVariable(name: "t", scope: !444, file: !1, line: 179, type: !209)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 178, column: 5)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 177, column: 5)
!446 = distinct !DILexicalBlock(scope: !415, file: !1, line: 177, column: 5)
!447 = !DILocalVariable(name: "__len", scope: !448, file: !1, line: 214, type: !144)
!448 = distinct !DILexicalBlock(scope: !415, file: !1, line: 214, column: 27)
!449 = !DILocalVariable(name: "__retval", scope: !448, file: !1, line: 214, type: !55)
!450 = !DILocalVariable(name: "sector", scope: !451, file: !1, line: 446, type: !506)
!451 = distinct !DISubprogram(name: "EntryPoints", scope: !1, file: !1, line: 443, type: !452, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !454)
!452 = !DISubroutineType(types: !453)
!453 = !{!41, !117}
!454 = !{!455, !456, !450, !457, !484, !485, !486, !489, !490, !492, !493, !495, !496, !498, !499, !504, !505}
!455 = !DILocalVariable(name: "p_access", arg: 1, scope: !451, file: !1, line: 443, type: !117)
!456 = !DILocalVariable(name: "p_sys", scope: !451, file: !1, line: 445, type: !197)
!457 = !DILocalVariable(name: "entries", scope: !451, file: !1, line: 448, type: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "entries_sect_t", file: !204, line: 88, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "entries_sect_s", file: !204, line: 72, size: 16384, elements: !460)
!460 = !{!461, !463, !464, !465, !466, !480}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "psz_id", scope: !459, file: !204, line: 74, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !115)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_version", scope: !459, file: !204, line: 75, baseType: !112, size: 8, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_sys_prof_tag", scope: !459, file: !204, line: 77, baseType: !112, size: 8, offset: 72)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_entries_nb", scope: !459, file: !204, line: 79, baseType: !259, size: 16, offset: 80)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !459, file: !204, line: 86, baseType: !467, size: 16000, offset: 96)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 16000, elements: !478)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !204, line: 81, size: 32, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_track", scope: !468, file: !204, line: 83, baseType: !112, size: 8)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "msf", scope: !468, file: !204, line: 84, baseType: !472, size: 24, offset: 8)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "msf_t", file: !204, line: 67, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msf_s", file: !204, line: 62, size: 24, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !473, file: !204, line: 64, baseType: !112, size: 8)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !473, file: !204, line: 65, baseType: !112, size: 8, offset: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !473, file: !204, line: 66, baseType: !112, size: 8, offset: 16)
!478 = !{!479}
!479 = !DISubrange(count: 500)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "zeros", scope: !459, file: !204, line: 87, baseType: !481, size: 288, offset: 16096)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 288, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 36)
!484 = !DILocalVariable(name: "i_nb", scope: !451, file: !1, line: 449, type: !41)
!485 = !DILocalVariable(name: "i", scope: !451, file: !1, line: 449, type: !41)
!486 = !DILocalVariable(name: "__s1_len", scope: !487, file: !1, line: 467, type: !144)
!487 = distinct !DILexicalBlock(scope: !488, file: !1, line: 467, column: 9)
!488 = distinct !DILexicalBlock(scope: !451, file: !1, line: 467, column: 9)
!489 = !DILocalVariable(name: "__s2_len", scope: !487, file: !1, line: 467, type: !144)
!490 = !DILocalVariable(name: "__s2", scope: !491, file: !1, line: 467, type: !255)
!491 = distinct !DILexicalBlock(scope: !487, file: !1, line: 467, column: 9)
!492 = !DILocalVariable(name: "__result", scope: !491, file: !1, line: 467, type: !41)
!493 = !DILocalVariable(name: "__s1_len", scope: !494, file: !1, line: 468, type: !144)
!494 = distinct !DILexicalBlock(scope: !488, file: !1, line: 468, column: 9)
!495 = !DILocalVariable(name: "__s2_len", scope: !494, file: !1, line: 468, type: !144)
!496 = !DILocalVariable(name: "__s2", scope: !497, file: !1, line: 468, type: !255)
!497 = distinct !DILexicalBlock(scope: !494, file: !1, line: 468, column: 9)
!498 = !DILocalVariable(name: "__result", scope: !497, file: !1, line: 468, type: !41)
!499 = !DILocalVariable(name: "i_title", scope: !500, file: !1, line: 476, type: !503)
!500 = distinct !DILexicalBlock(scope: !501, file: !1, line: 475, column: 5)
!501 = distinct !DILexicalBlock(scope: !502, file: !1, line: 474, column: 5)
!502 = distinct !DILexicalBlock(scope: !451, file: !1, line: 474, column: 5)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!504 = !DILocalVariable(name: "i_sector", scope: !500, file: !1, line: 477, type: !503)
!505 = !DILocalVariable(name: "s", scope: !500, file: !1, line: 481, type: !221)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 18592, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 2324)
!509 = !DILocation(line: 446, column: 18, scope: !451, inlinedAt: !510)
!510 = distinct !DILocation(line: 189, column: 9, scope: !511)
!511 = distinct !DILexicalBlock(scope: !415, file: !1, line: 189, column: 9)
!512 = !DILocation(line: 95, column: 32, scope: !415)
!513 = !DILocation(line: 97, column: 19, scope: !415)
!514 = !DILocation(line: 99, column: 44, scope: !415)
!515 = !{!516, !385, i64 56}
!516 = !{!"access_t", !385, i64 0, !385, i64 8, !517, i64 16, !518, i64 20, !518, i64 21, !385, i64 24, !385, i64 32, !385, i64 40, !385, i64 48, !385, i64 56, !385, i64 64, !385, i64 72, !385, i64 80, !385, i64 88, !385, i64 96, !519, i64 104, !385, i64 144, !385, i64 152}
!517 = !{!"int", !386, i64 0}
!518 = !{!"_Bool", !386, i64 0}
!519 = !{!"", !517, i64 0, !520, i64 8, !520, i64 16, !518, i64 24, !517, i64 28, !517, i64 32}
!520 = !{!"long", !386, i64 0}
!521 = !DILocation(line: 99, column: 21, scope: !415)
!522 = !DILocation(line: 99, column: 11, scope: !415)
!523 = !DILocation(line: 100, column: 5, scope: !415)
!524 = !DILocation(line: 101, column: 9, scope: !415)
!525 = !DILocation(line: 102, column: 9, scope: !415)
!526 = !DILocation(line: 107, column: 17, scope: !527)
!527 = distinct !DILexicalBlock(scope: !415, file: !1, line: 107, column: 9)
!528 = !DILocation(line: 100, column: 11, scope: !415)
!529 = !DILocation(line: 107, column: 15, scope: !527)
!530 = !DILocation(line: 107, column: 9, scope: !415)
!531 = !DILocation(line: 109, column: 13, scope: !532)
!532 = distinct !DILexicalBlock(scope: !527, file: !1, line: 108, column: 5)
!533 = !DILocation(line: 109, column: 16, scope: !532)
!534 = !{!386, !386, i64 0}
!535 = !DILocation(line: 111, column: 19, scope: !532)
!536 = !DILocation(line: 112, column: 14, scope: !537)
!537 = distinct !DILexicalBlock(scope: !532, file: !1, line: 112, column: 13)
!538 = !DILocation(line: 112, column: 13, scope: !537)
!539 = !DILocation(line: 112, column: 13, scope: !532)
!540 = !DILocation(line: 113, column: 36, scope: !537)
!541 = !DILocation(line: 113, column: 25, scope: !537)
!542 = !DILocation(line: 113, column: 13, scope: !537)
!543 = !DILocation(line: 0, scope: !415)
!544 = !DILocation(line: 116, column: 9, scope: !432)
!545 = !DILocation(line: 116, column: 18, scope: !432)
!546 = !DILocation(line: 116, column: 9, scope: !415)
!547 = !DILocation(line: 118, column: 9, scope: !431)
!548 = !DILocation(line: 121, column: 13, scope: !429)
!549 = !DILocation(line: 121, column: 13, scope: !435)
!550 = !{!516, !385, i64 48}
!551 = !DILocation(line: 121, column: 13, scope: !552)
!552 = distinct !DILexicalBlock(scope: !435, file: !1, line: 121, column: 13)
!553 = !DILocation(line: 121, column: 13, scope: !554)
!554 = distinct !DILexicalBlock(scope: !552, file: !1, line: 121, column: 13)
!555 = !DILocation(line: 121, column: 13, scope: !556)
!556 = distinct !DILexicalBlock(scope: !554, file: !1, line: 121, column: 13)
!557 = !DILocation(line: 121, column: 13, scope: !558)
!558 = distinct !DILexicalBlock(scope: !556, file: !1, line: 121, column: 13)
!559 = !DILocation(line: 121, column: 13, scope: !560)
!560 = distinct !DILexicalBlock(scope: !558, file: !1, line: 121, column: 13)
!561 = !DILocation(line: 0, scope: !435)
!562 = !DILocation(line: 121, column: 13, scope: !430)
!563 = !DILocation(line: 121, column: 51, scope: !430)
!564 = !DILocation(line: 122, column: 13, scope: !438)
!565 = !DILocation(line: 122, column: 13, scope: !430)
!566 = !DILocation(line: 121, column: 13, scope: !431)
!567 = !DILocalVariable(name: "p_obj", arg: 1, scope: !568, file: !569, line: 512, type: !48)
!568 = distinct !DISubprogram(name: "var_CreateGetString", scope: !569, file: !569, line: 512, type: !570, scopeLine: 514, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !572)
!569 = !DIFile(filename: "../../../include/vlc_variables.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/vcd")
!570 = !DISubroutineType(types: !571)
!571 = !{!55, !48, !38}
!572 = !{!567, !573}
!573 = !DILocalVariable(name: "psz_name", arg: 2, scope: !568, file: !569, line: 513, type: !38)
!574 = !DILocation(line: 512, column: 56, scope: !568, inlinedAt: !575)
!575 = distinct !DILocation(line: 125, column: 19, scope: !431)
!576 = !DILocation(line: 515, column: 5, scope: !568, inlinedAt: !575)
!577 = !DILocalVariable(name: "p_obj", arg: 1, scope: !578, file: !569, line: 374, type: !48)
!578 = distinct !DISubprogram(name: "var_GetString", scope: !569, file: !569, line: 374, type: !570, scopeLine: 375, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !579)
!579 = !{!577, !580, !581}
!580 = !DILocalVariable(name: "psz_name", arg: 2, scope: !578, file: !569, line: 374, type: !38)
!581 = !DILocalVariable(name: "val", scope: !578, file: !569, line: 376, type: !79)
!582 = !DILocation(line: 374, column: 50, scope: !578, inlinedAt: !583)
!583 = distinct !DILocation(line: 516, column: 12, scope: !568, inlinedAt: !575)
!584 = !DILocation(line: 376, column: 5, scope: !578, inlinedAt: !583)
!585 = !DILocation(line: 376, column: 26, scope: !578, inlinedAt: !583)
!586 = !DILocation(line: 376, column: 37, scope: !578, inlinedAt: !583)
!587 = !DILocation(line: 376, column: 17, scope: !578, inlinedAt: !583)
!588 = !DILocation(line: 377, column: 9, scope: !589, inlinedAt: !583)
!589 = distinct !DILexicalBlock(scope: !578, file: !569, line: 377, column: 9)
!590 = !DILocation(line: 377, column: 9, scope: !578, inlinedAt: !583)
!591 = !DILocation(line: 381, column: 1, scope: !578, inlinedAt: !583)
!592 = !DILocation(line: 126, column: 13, scope: !593)
!593 = distinct !DILexicalBlock(scope: !431, file: !1, line: 126, column: 13)
!594 = !DILocation(line: 126, column: 22, scope: !593)
!595 = !DILocation(line: 126, column: 13, scope: !431)
!596 = !DILocation(line: 128, column: 13, scope: !597)
!597 = distinct !DILexicalBlock(scope: !593, file: !1, line: 127, column: 9)
!598 = !DILocation(line: 129, column: 13, scope: !597)
!599 = !DILocation(line: 139, column: 14, scope: !415)
!600 = !DILocation(line: 104, column: 15, scope: !415)
!601 = !DILocation(line: 140, column: 5, scope: !415)
!602 = !DILocation(line: 141, column: 10, scope: !603)
!603 = distinct !DILexicalBlock(scope: !415, file: !1, line: 141, column: 9)
!604 = !DILocation(line: 141, column: 9, scope: !415)
!605 = !DILocation(line: 145, column: 15, scope: !415)
!606 = !DILocation(line: 145, column: 23, scope: !415)
!607 = !{!516, !385, i64 72}
!608 = !DILocation(line: 146, column: 15, scope: !415)
!609 = !DILocation(line: 146, column: 24, scope: !415)
!610 = !{!516, !385, i64 80}
!611 = !DILocation(line: 147, column: 15, scope: !415)
!612 = !DILocation(line: 147, column: 26, scope: !415)
!613 = !{!516, !385, i64 96}
!614 = !DILocation(line: 148, column: 15, scope: !415)
!615 = !DILocation(line: 148, column: 23, scope: !415)
!616 = !{!516, !385, i64 88}
!617 = !DILocation(line: 149, column: 15, scope: !415)
!618 = !DILocation(line: 149, column: 20, scope: !415)
!619 = !DILocation(line: 149, column: 29, scope: !415)
!620 = !{!516, !517, i64 104}
!621 = !DILocation(line: 150, column: 20, scope: !415)
!622 = !DILocation(line: 151, column: 20, scope: !415)
!623 = !DILocation(line: 153, column: 20, scope: !415)
!624 = !DILocation(line: 153, column: 28, scope: !415)
!625 = !DILocation(line: 151, column: 26, scope: !415)
!626 = !{!516, !517, i64 132}
!627 = !DILocation(line: 154, column: 20, scope: !415)
!628 = !DILocation(line: 154, column: 32, scope: !415)
!629 = !{!516, !517, i64 136}
!630 = !DILocation(line: 155, column: 31, scope: !415)
!631 = !DILocation(line: 98, column: 19, scope: !415)
!632 = !DILocation(line: 155, column: 15, scope: !415)
!633 = !DILocation(line: 155, column: 21, scope: !415)
!634 = !{!516, !385, i64 144}
!635 = !DILocation(line: 156, column: 10, scope: !636)
!636 = distinct !DILexicalBlock(scope: !415, file: !1, line: 156, column: 9)
!637 = !DILocation(line: 156, column: 9, scope: !415)
!638 = !DILocation(line: 158, column: 12, scope: !415)
!639 = !DILocation(line: 158, column: 19, scope: !415)
!640 = !{!641, !385, i64 0}
!641 = !{!"access_sys_t", !385, i64 0, !517, i64 8, !386, i64 16, !517, i64 808, !385, i64 816}
!642 = !DILocation(line: 162, column: 66, scope: !415)
!643 = !DILocation(line: 161, column: 23, scope: !415)
!644 = !DILocation(line: 161, column: 12, scope: !415)
!645 = !DILocation(line: 161, column: 21, scope: !415)
!646 = !{!641, !517, i64 8}
!647 = !DILocation(line: 163, column: 25, scope: !648)
!648 = distinct !DILexicalBlock(scope: !415, file: !1, line: 163, column: 9)
!649 = !DILocation(line: 163, column: 9, scope: !415)
!650 = !DILocation(line: 165, column: 9, scope: !651)
!651 = distinct !DILexicalBlock(scope: !648, file: !1, line: 164, column: 5)
!652 = !DILocation(line: 166, column: 9, scope: !651)
!653 = !DILocation(line: 168, column: 30, scope: !654)
!654 = distinct !DILexicalBlock(scope: !648, file: !1, line: 168, column: 14)
!655 = !DILocation(line: 168, column: 14, scope: !648)
!656 = !DILocation(line: 170, column: 9, scope: !657)
!657 = distinct !DILexicalBlock(scope: !654, file: !1, line: 169, column: 5)
!658 = !DILocation(line: 171, column: 9, scope: !657)
!659 = !DILocation(line: 174, column: 20, scope: !415)
!660 = !DILocation(line: 103, column: 9, scope: !415)
!661 = !DILocation(line: 177, column: 5, scope: !446)
!662 = !DILocation(line: 135, column: 40, scope: !663, inlinedAt: !668)
!663 = distinct !DISubprogram(name: "vlc_input_title_New", scope: !211, file: !211, line: 133, type: !664, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !666)
!664 = !DISubroutineType(types: !665)
!665 = !{!209}
!666 = !{!667}
!667 = !DILocalVariable(name: "t", scope: !663, file: !211, line: 135, type: !209)
!668 = distinct !DILocation(line: 179, column: 46, scope: !444)
!669 = !DILocation(line: 135, column: 20, scope: !663, inlinedAt: !668)
!670 = !DILocation(line: 137, column: 8, scope: !663, inlinedAt: !668)
!671 = !DILocation(line: 137, column: 17, scope: !663, inlinedAt: !668)
!672 = !{!673, !385, i64 0}
!673 = !{!"", !385, i64 0, !518, i64 8, !520, i64 16, !520, i64 24, !517, i64 32, !385, i64 40}
!674 = !DILocation(line: 138, column: 8, scope: !663, inlinedAt: !668)
!675 = !DILocation(line: 138, column: 15, scope: !663, inlinedAt: !668)
!676 = !{!673, !518, i64 8}
!677 = !DILocation(line: 139, column: 8, scope: !663, inlinedAt: !668)
!678 = !DILocation(line: 142, column: 8, scope: !663, inlinedAt: !668)
!679 = !DILocation(line: 142, column: 18, scope: !663, inlinedAt: !668)
!680 = !{!673, !385, i64 40}
!681 = !DILocation(line: 139, column: 17, scope: !663, inlinedAt: !668)
!682 = !DILocation(line: 179, column: 28, scope: !444)
!683 = !DILocation(line: 179, column: 44, scope: !444)
!684 = !DILocation(line: 179, column: 24, scope: !444)
!685 = !DILocation(line: 181, column: 9, scope: !444)
!686 = !{!641, !385, i64 816}
!687 = !{!517, !517, i64 0}
!688 = !DILocation(line: 182, column: 9, scope: !444)
!689 = !DILocation(line: 184, column: 30, scope: !444)
!690 = !DILocation(line: 184, column: 23, scope: !444)
!691 = !DILocation(line: 184, column: 47, scope: !444)
!692 = !DILocation(line: 184, column: 45, scope: !444)
!693 = !DILocation(line: 184, column: 21, scope: !444)
!694 = !DILocation(line: 184, column: 71, scope: !444)
!695 = !DILocation(line: 184, column: 12, scope: !444)
!696 = !DILocation(line: 184, column: 19, scope: !444)
!697 = !{!673, !520, i64 24}
!698 = !DILocation(line: 177, column: 28, scope: !445)
!699 = !DILocation(line: 177, column: 19, scope: !445)
!700 = distinct !{!700, !661, !701}
!701 = !DILocation(line: 186, column: 5, scope: !446)
!702 = !DILocation(line: 443, column: 35, scope: !451, inlinedAt: !510)
!703 = !DILocation(line: 445, column: 37, scope: !451, inlinedAt: !510)
!704 = !DILocation(line: 445, column: 19, scope: !451, inlinedAt: !510)
!705 = !DILocation(line: 446, column: 5, scope: !451, inlinedAt: !510)
!706 = !DILocation(line: 448, column: 5, scope: !451, inlinedAt: !510)
!707 = !DILocation(line: 452, column: 57, scope: !708, inlinedAt: !510)
!708 = distinct !DILexicalBlock(scope: !451, file: !1, line: 452, column: 9)
!709 = !DILocation(line: 452, column: 9, scope: !708, inlinedAt: !510)
!710 = !DILocation(line: 453, column: 51, scope: !708, inlinedAt: !510)
!711 = !DILocation(line: 452, column: 9, scope: !451, inlinedAt: !510)
!712 = !DILocation(line: 455, column: 9, scope: !713, inlinedAt: !510)
!713 = distinct !DILexicalBlock(scope: !708, file: !1, line: 454, column: 5)
!714 = !DILocation(line: 456, column: 9, scope: !713, inlinedAt: !510)
!715 = !DILocation(line: 458, column: 5, scope: !451, inlinedAt: !510)
!716 = !DILocation(line: 460, column: 12, scope: !451, inlinedAt: !510)
!717 = !DILocalVariable(name: "_p", arg: 1, scope: !718, file: !44, line: 663, type: !253)
!718 = distinct !DISubprogram(name: "U16_AT", scope: !44, file: !44, line: 663, type: !719, scopeLine: 664, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!259, !253}
!721 = !{!717, !722}
!722 = !DILocalVariable(name: "p", scope: !718, file: !44, line: 665, type: !257)
!723 = !DILocation(line: 663, column: 45, scope: !718, inlinedAt: !724)
!724 = distinct !DILocation(line: 460, column: 12, scope: !451, inlinedAt: !510)
!725 = !DILocation(line: 665, column: 21, scope: !718, inlinedAt: !724)
!726 = !DILocation(line: 666, column: 25, scope: !718, inlinedAt: !724)
!727 = !DILocation(line: 666, column: 15, scope: !718, inlinedAt: !724)
!728 = !DILocation(line: 666, column: 30, scope: !718, inlinedAt: !724)
!729 = !DILocation(line: 666, column: 38, scope: !718, inlinedAt: !724)
!730 = !DILocation(line: 666, column: 36, scope: !718, inlinedAt: !724)
!731 = !DILocation(line: 461, column: 14, scope: !732, inlinedAt: !510)
!732 = distinct !DILexicalBlock(scope: !451, file: !1, line: 461, column: 9)
!733 = !DILocation(line: 461, column: 9, scope: !451, inlinedAt: !510)
!734 = !DILocation(line: 463, column: 9, scope: !735, inlinedAt: !510)
!735 = distinct !DILexicalBlock(scope: !732, file: !1, line: 462, column: 5)
!736 = !DILocation(line: 464, column: 9, scope: !735, inlinedAt: !510)
!737 = !DILocation(line: 467, column: 9, scope: !488, inlinedAt: !510)
!738 = !DILocation(line: 467, column: 73, scope: !488, inlinedAt: !510)
!739 = !DILocation(line: 468, column: 9, scope: !488, inlinedAt: !510)
!740 = !DILocation(line: 467, column: 9, scope: !451, inlinedAt: !510)
!741 = !DILocation(line: 470, column: 9, scope: !742, inlinedAt: !510)
!742 = distinct !DILexicalBlock(scope: !488, file: !1, line: 469, column: 5)
!743 = !DILocation(line: 471, column: 9, scope: !742, inlinedAt: !510)
!744 = !DILocation(line: 449, column: 15, scope: !451, inlinedAt: !510)
!745 = !DILocation(line: 474, column: 19, scope: !501, inlinedAt: !510)
!746 = !DILocation(line: 474, column: 5, scope: !502, inlinedAt: !510)
!747 = !DILocation(line: 476, column: 29, scope: !500, inlinedAt: !510)
!748 = !{!749, !386, i64 0}
!749 = !{!"", !386, i64 0, !750, i64 1}
!750 = !{!"msf_s", !386, i64 0, !386, i64 1, !386, i64 2}
!751 = !DILocation(line: 476, column: 66, scope: !500, inlinedAt: !510)
!752 = !DILocation(line: 476, column: 19, scope: !500, inlinedAt: !510)
!753 = !DILocation(line: 478, column: 14, scope: !500, inlinedAt: !510)
!754 = !{!749, !386, i64 3}
!755 = !{!749, !386, i64 2}
!756 = !{!749, !386, i64 1}
!757 = !DILocation(line: 477, column: 19, scope: !500, inlinedAt: !510)
!758 = !DILocation(line: 483, column: 21, scope: !759, inlinedAt: !510)
!759 = distinct !DILexicalBlock(scope: !500, file: !1, line: 483, column: 13)
!760 = !DILocation(line: 483, column: 13, scope: !500, inlinedAt: !510)
!761 = !DILocation(line: 484, column: 31, scope: !762, inlinedAt: !510)
!762 = distinct !DILexicalBlock(scope: !500, file: !1, line: 484, column: 13)
!763 = !DILocation(line: 484, column: 21, scope: !762, inlinedAt: !510)
!764 = !DILocation(line: 484, column: 13, scope: !500, inlinedAt: !510)
!765 = !DILocation(line: 486, column: 9, scope: !500, inlinedAt: !510)
!766 = !DILocation(line: 91, column: 40, scope: !767, inlinedAt: !772)
!767 = distinct !DISubprogram(name: "vlc_seekpoint_New", scope: !211, file: !211, line: 89, type: !768, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !770)
!768 = !DISubroutineType(types: !769)
!769 = !{!221}
!770 = !{!771}
!771 = !DILocalVariable(name: "point", scope: !767, file: !211, line: 91, type: !221)
!772 = distinct !DILocation(line: 489, column: 13, scope: !500, inlinedAt: !510)
!773 = !DILocation(line: 91, column: 18, scope: !767, inlinedAt: !772)
!774 = !DILocation(line: 94, column: 12, scope: !767, inlinedAt: !772)
!775 = !DILocation(line: 92, column: 26, scope: !767, inlinedAt: !772)
!776 = !DILocation(line: 94, column: 20, scope: !767, inlinedAt: !772)
!777 = !{!778, !517, i64 24}
!778 = !{!"seekpoint_t", !520, i64 0, !520, i64 8, !385, i64 16, !517, i64 24}
!779 = !DILocation(line: 95, column: 12, scope: !767, inlinedAt: !772)
!780 = !DILocation(line: 95, column: 21, scope: !767, inlinedAt: !772)
!781 = !{!778, !385, i64 16}
!782 = !DILocation(line: 481, column: 22, scope: !500, inlinedAt: !510)
!783 = !DILocation(line: 490, column: 47, scope: !500, inlinedAt: !510)
!784 = !DILocation(line: 490, column: 64, scope: !500, inlinedAt: !510)
!785 = !DILocation(line: 490, column: 40, scope: !500, inlinedAt: !510)
!786 = !DILocation(line: 490, column: 38, scope: !500, inlinedAt: !510)
!787 = !DILocation(line: 490, column: 69, scope: !500, inlinedAt: !510)
!788 = !DILocation(line: 490, column: 28, scope: !500, inlinedAt: !510)
!789 = !DILocation(line: 490, column: 12, scope: !500, inlinedAt: !510)
!790 = !DILocation(line: 490, column: 26, scope: !500, inlinedAt: !510)
!791 = !{!778, !520, i64 0}
!792 = !DILocation(line: 493, column: 9, scope: !793, inlinedAt: !510)
!793 = distinct !DILexicalBlock(scope: !794, file: !1, line: 493, column: 9)
!794 = distinct !DILexicalBlock(scope: !500, file: !1, line: 493, column: 9)
!795 = !{!673, !517, i64 32}
!796 = !DILocation(line: 493, column: 9, scope: !794, inlinedAt: !510)
!797 = !DILocation(line: 493, column: 9, scope: !798, inlinedAt: !510)
!798 = distinct !DILexicalBlock(scope: !794, file: !1, line: 493, column: 9)
!799 = !DILocation(line: 495, column: 5, scope: !501, inlinedAt: !510)
!800 = !DILocation(line: 474, column: 28, scope: !501, inlinedAt: !510)
!801 = distinct !{!801, !802, !803}
!802 = !DILocation(line: 474, column: 5, scope: !502)
!803 = !DILocation(line: 495, column: 5, scope: !502)
!804 = !DILocation(line: 498, column: 1, scope: !451, inlinedAt: !510)
!805 = !DILocation(line: 191, column: 9, scope: !806)
!806 = distinct !DILexicalBlock(scope: !511, file: !1, line: 190, column: 5)
!807 = !DILocation(line: 192, column: 5, scope: !806)
!808 = !DILocation(line: 195, column: 27, scope: !809)
!809 = distinct !DILexicalBlock(scope: !415, file: !1, line: 195, column: 9)
!810 = !DILocation(line: 195, column: 17, scope: !809)
!811 = !DILocation(line: 195, column: 9, scope: !415)
!812 = !DILocation(line: 197, column: 29, scope: !813)
!813 = distinct !DILexicalBlock(scope: !415, file: !1, line: 197, column: 9)
!814 = !DILocation(line: 197, column: 22, scope: !813)
!815 = !DILocation(line: 197, column: 45, scope: !813)
!816 = !DILocation(line: 197, column: 19, scope: !813)
!817 = !DILocation(line: 197, column: 9, scope: !415)
!818 = !DILocation(line: 200, column: 30, scope: !415)
!819 = !DILocation(line: 200, column: 41, scope: !415)
!820 = !DILocation(line: 200, column: 23, scope: !415)
!821 = !DILocation(line: 200, column: 12, scope: !415)
!822 = !DILocation(line: 200, column: 21, scope: !415)
!823 = !{!641, !517, i64 808}
!824 = !DILocation(line: 201, column: 19, scope: !825)
!825 = distinct !DILexicalBlock(scope: !415, file: !1, line: 201, column: 9)
!826 = !DILocation(line: 201, column: 9, scope: !415)
!827 = !DILocation(line: 204, column: 38, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !1, line: 202, column: 5)
!829 = !DILocation(line: 204, column: 15, scope: !828)
!830 = !DILocation(line: 204, column: 60, scope: !828)
!831 = !DILocation(line: 204, column: 74, scope: !828)
!832 = !DILocation(line: 203, column: 25, scope: !828)
!833 = !DILocation(line: 206, column: 5, scope: !828)
!834 = !DILocation(line: 210, column: 37, scope: !415)
!835 = !DILocation(line: 207, column: 28, scope: !415)
!836 = !DILocation(line: 208, column: 32, scope: !415)
!837 = !DILocation(line: 209, column: 52, scope: !415)
!838 = !DILocation(line: 209, column: 27, scope: !415)
!839 = !{!516, !520, i64 112}
!840 = !DILocation(line: 210, column: 48, scope: !415)
!841 = !DILocation(line: 210, column: 46, scope: !415)
!842 = !DILocation(line: 210, column: 78, scope: !415)
!843 = !DILocation(line: 210, column: 28, scope: !415)
!844 = !DILocation(line: 210, column: 26, scope: !415)
!845 = !{!516, !520, i64 120}
!846 = !DILocation(line: 213, column: 21, scope: !415)
!847 = !{!516, !385, i64 64}
!848 = !DILocation(line: 213, column: 5, scope: !415)
!849 = !DILocation(line: 214, column: 27, scope: !448)
!850 = !DILocation(line: 214, column: 27, scope: !851)
!851 = distinct !DILexicalBlock(scope: !448, file: !1, line: 214, column: 27)
!852 = !DILocation(line: 214, column: 25, scope: !415)
!853 = !DILocation(line: 216, column: 5, scope: !415)
!854 = !DILocation(line: 219, column: 5, scope: !415)
!855 = !DILocation(line: 220, column: 5, scope: !415)
!856 = !DILocation(line: 221, column: 5, scope: !415)
!857 = !DILocation(line: 222, column: 1, scope: !415)
!858 = distinct !DISubprogram(name: "Close", scope: !1, file: !1, line: 227, type: !859, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !48}
!861 = !{!862, !863, !864}
!862 = !DILocalVariable(name: "p_this", arg: 1, scope: !858, file: !1, line: 227, type: !48)
!863 = !DILocalVariable(name: "p_access", scope: !858, file: !1, line: 229, type: !117)
!864 = !DILocalVariable(name: "p_sys", scope: !858, file: !1, line: 230, type: !197)
!865 = !DILocation(line: 227, column: 34, scope: !858)
!866 = !DILocation(line: 229, column: 19, scope: !858)
!867 = !DILocation(line: 230, column: 37, scope: !858)
!868 = !DILocation(line: 230, column: 19, scope: !858)
!869 = !DILocation(line: 232, column: 33, scope: !858)
!870 = !DILocation(line: 232, column: 5, scope: !858)
!871 = !DILocation(line: 233, column: 11, scope: !858)
!872 = !DILocation(line: 233, column: 5, scope: !858)
!873 = !DILocation(line: 234, column: 1, scope: !858)
!874 = distinct !DISubprogram(name: "Block", scope: !1, file: !1, line: 327, type: !149, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DILocalVariable(name: "p_access", arg: 1, scope: !874, file: !1, line: 327, type: !117)
!877 = !DILocalVariable(name: "p_sys", scope: !874, file: !1, line: 329, type: !197)
!878 = !DILocalVariable(name: "i_blocks", scope: !874, file: !1, line: 330, type: !41)
!879 = !DILocalVariable(name: "p_block", scope: !874, file: !1, line: 331, type: !151)
!880 = !DILocalVariable(name: "i_read", scope: !874, file: !1, line: 332, type: !41)
!881 = !DILocalVariable(name: "t", scope: !882, file: !1, line: 386, type: !209)
!882 = distinct !DILexicalBlock(scope: !883, file: !1, line: 385, column: 5)
!883 = distinct !DILexicalBlock(scope: !884, file: !1, line: 384, column: 5)
!884 = distinct !DILexicalBlock(scope: !874, file: !1, line: 384, column: 5)
!885 = !DILocation(line: 327, column: 34, scope: !874)
!886 = !DILocation(line: 329, column: 37, scope: !874)
!887 = !DILocation(line: 329, column: 19, scope: !874)
!888 = !DILocation(line: 330, column: 9, scope: !874)
!889 = !DILocation(line: 335, column: 19, scope: !890)
!890 = distinct !DILexicalBlock(scope: !874, file: !1, line: 335, column: 9)
!891 = !DILocation(line: 335, column: 24, scope: !890)
!892 = !{!516, !518, i64 128}
!893 = !{i8 0, i8 2}
!894 = !DILocation(line: 335, column: 9, scope: !874)
!895 = !DILocation(line: 338, column: 19, scope: !874)
!896 = !DILocation(line: 338, column: 38, scope: !874)
!897 = !DILocation(line: 338, column: 63, scope: !874)
!898 = !DILocation(line: 338, column: 71, scope: !874)
!899 = !DILocation(line: 338, column: 31, scope: !874)
!900 = !DILocation(line: 338, column: 28, scope: !874)
!901 = !DILocation(line: 338, column: 5, scope: !874)
!902 = !DILocation(line: 340, column: 50, scope: !903)
!903 = distinct !DILexicalBlock(scope: !904, file: !1, line: 340, column: 13)
!904 = distinct !DILexicalBlock(scope: !874, file: !1, line: 339, column: 5)
!905 = !DILocation(line: 340, column: 40, scope: !903)
!906 = !DILocation(line: 340, column: 13, scope: !904)
!907 = !DILocation(line: 342, column: 34, scope: !908)
!908 = distinct !DILexicalBlock(scope: !903, file: !1, line: 341, column: 9)
!909 = !DILocation(line: 343, column: 13, scope: !908)
!910 = !DILocation(line: 346, column: 33, scope: !904)
!911 = !DILocation(line: 348, column: 31, scope: !904)
!912 = !DILocation(line: 349, column: 36, scope: !904)
!913 = !DILocation(line: 351, column: 13, scope: !904)
!914 = !DILocation(line: 351, column: 51, scope: !904)
!915 = !DILocation(line: 350, column: 31, scope: !904)
!916 = !DILocation(line: 352, column: 30, scope: !904)
!917 = distinct !{!917, !901, !918}
!918 = !DILocation(line: 353, column: 5, scope: !874)
!919 = !DILocation(line: 356, column: 25, scope: !920)
!920 = distinct !DILexicalBlock(scope: !874, file: !1, line: 356, column: 9)
!921 = !DILocation(line: 356, column: 36, scope: !920)
!922 = !DILocation(line: 359, column: 66, scope: !923)
!923 = distinct !DILexicalBlock(scope: !920, file: !1, line: 358, column: 5)
!924 = !DILocation(line: 356, column: 9, scope: !874)
!925 = !DILocation(line: 364, column: 22, scope: !926)
!926 = distinct !DILexicalBlock(scope: !874, file: !1, line: 364, column: 9)
!927 = !DILocation(line: 331, column: 14, scope: !874)
!928 = !DILocation(line: 364, column: 20, scope: !926)
!929 = !DILocation(line: 0, scope: !874)
!930 = !DILocation(line: 364, column: 9, scope: !874)
!931 = !DILocation(line: 366, column: 9, scope: !932)
!932 = distinct !DILexicalBlock(scope: !926, file: !1, line: 365, column: 5)
!933 = !DILocation(line: 368, column: 9, scope: !932)
!934 = !DILocation(line: 371, column: 57, scope: !935)
!935 = distinct !DILexicalBlock(scope: !874, file: !1, line: 371, column: 9)
!936 = !DILocation(line: 372, column: 20, scope: !935)
!937 = !DILocation(line: 372, column: 39, scope: !935)
!938 = !{!939, !385, i64 56}
!939 = !{!"block_t", !385, i64 0, !517, i64 8, !520, i64 16, !520, i64 24, !520, i64 32, !517, i64 40, !517, i64 44, !520, i64 48, !385, i64 56, !385, i64 64}
!940 = !DILocation(line: 371, column: 9, scope: !935)
!941 = !DILocation(line: 372, column: 70, scope: !935)
!942 = !DILocation(line: 371, column: 9, scope: !874)
!943 = !DILocation(line: 332, column: 9, scope: !874)
!944 = !DILocation(line: 384, column: 29, scope: !883)
!945 = !DILocation(line: 384, column: 5, scope: !884)
!946 = !DILocation(line: 374, column: 9, scope: !947)
!947 = distinct !DILexicalBlock(scope: !935, file: !1, line: 373, column: 5)
!948 = !DILocalVariable(name: "p_block", arg: 1, scope: !949, file: !154, line: 163, type: !151)
!949 = distinct !DISubprogram(name: "block_Release", scope: !154, file: !154, line: 163, type: !169, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !950)
!950 = !{!948}
!951 = !DILocation(line: 163, column: 44, scope: !949, inlinedAt: !952)
!952 = distinct !DILocation(line: 375, column: 9, scope: !947)
!953 = !DILocation(line: 165, column: 14, scope: !949, inlinedAt: !952)
!954 = !{!939, !385, i64 64}
!955 = !DILocation(line: 165, column: 5, scope: !949, inlinedAt: !952)
!956 = !DILocation(line: 378, column: 24, scope: !947)
!957 = !DILocation(line: 379, column: 24, scope: !947)
!958 = !DILocation(line: 379, column: 30, scope: !947)
!959 = !DILocation(line: 380, column: 9, scope: !947)
!960 = !DILocation(line: 386, column: 56, scope: !882)
!961 = !DILocation(line: 386, column: 28, scope: !882)
!962 = !DILocation(line: 386, column: 24, scope: !882)
!963 = !DILocation(line: 388, column: 16, scope: !964)
!964 = distinct !DILexicalBlock(scope: !882, file: !1, line: 388, column: 13)
!965 = !DILocation(line: 388, column: 28, scope: !964)
!966 = !DILocation(line: 388, column: 32, scope: !964)
!967 = !DILocation(line: 389, column: 28, scope: !964)
!968 = !DILocation(line: 389, column: 40, scope: !964)
!969 = !DILocation(line: 389, column: 44, scope: !964)
!970 = !DILocation(line: 389, column: 61, scope: !964)
!971 = !DILocation(line: 390, column: 28, scope: !964)
!972 = !DILocation(line: 390, column: 43, scope: !964)
!973 = !DILocation(line: 390, column: 36, scope: !964)
!974 = !DILocation(line: 390, column: 34, scope: !964)
!975 = !DILocation(line: 391, column: 16, scope: !964)
!976 = !DILocation(line: 391, column: 13, scope: !964)
!977 = !DILocation(line: 391, column: 57, scope: !964)
!978 = !DILocation(line: 390, column: 59, scope: !964)
!979 = !DILocation(line: 388, column: 13, scope: !882)
!980 = !DILocation(line: 393, column: 13, scope: !981)
!981 = distinct !DILexicalBlock(scope: !964, file: !1, line: 392, column: 9)
!982 = !DILocation(line: 394, column: 37, scope: !981)
!983 = !DILocation(line: 395, column: 39, scope: !981)
!984 = !DILocation(line: 396, column: 9, scope: !981)
!985 = !DILocation(line: 384, column: 47, scope: !883)
!986 = distinct !{!986, !945, !987}
!987 = !DILocation(line: 397, column: 5, scope: !884)
!988 = !DILocation(line: 400, column: 21, scope: !874)
!989 = !DILocation(line: 401, column: 38, scope: !874)
!990 = !{!939, !520, i64 48}
!991 = !DILocation(line: 401, column: 20, scope: !874)
!992 = !DILocation(line: 401, column: 26, scope: !874)
!993 = !DILocation(line: 403, column: 5, scope: !874)
!994 = !DILocation(line: 404, column: 1, scope: !874)
!995 = distinct !DISubprogram(name: "Control", scope: !1, file: !1, line: 239, type: !178, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1004, !1005}
!997 = !DILocalVariable(name: "p_access", arg: 1, scope: !995, file: !1, line: 239, type: !117)
!998 = !DILocalVariable(name: "i_query", arg: 2, scope: !995, file: !1, line: 239, type: !41)
!999 = !DILocalVariable(name: "args", arg: 3, scope: !995, file: !1, line: 239, type: !180)
!1000 = !DILocalVariable(name: "p_sys", scope: !995, file: !1, line: 241, type: !197)
!1001 = !DILocalVariable(name: "ppp_title", scope: !995, file: !1, line: 242, type: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!1004 = !DILocalVariable(name: "i", scope: !995, file: !1, line: 243, type: !41)
!1005 = !DILocalVariable(name: "t", scope: !1006, file: !1, line: 296, type: !209)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 295, column: 9)
!1007 = distinct !DILexicalBlock(scope: !995, file: !1, line: 246, column: 5)
!1008 = !DILocation(line: 239, column: 31, scope: !995)
!1009 = !DILocation(line: 239, column: 45, scope: !995)
!1010 = !DILocation(line: 239, column: 62, scope: !995)
!1011 = !DILocation(line: 241, column: 37, scope: !995)
!1012 = !DILocation(line: 241, column: 19, scope: !995)
!1013 = !DILocation(line: 245, column: 5, scope: !995)
!1014 = !DILocation(line: 252, column: 14, scope: !1007)
!1015 = !DILocation(line: 252, column: 36, scope: !1007)
!1016 = !{!518, !518, i64 0}
!1017 = !DILocation(line: 253, column: 13, scope: !1007)
!1018 = !DILocation(line: 258, column: 33, scope: !1007)
!1019 = !DILocalVariable(name: "p_obj", arg: 1, scope: !1020, file: !569, line: 294, type: !48)
!1020 = distinct !DISubprogram(name: "var_GetInteger", scope: !569, file: !569, line: 294, type: !1021, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1023)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!41, !48, !38}
!1023 = !{!1019, !1024, !1025}
!1024 = !DILocalVariable(name: "psz_name", arg: 2, scope: !1020, file: !569, line: 294, type: !38)
!1025 = !DILocalVariable(name: "val", scope: !1020, file: !569, line: 296, type: !79)
!1026 = !DILocation(line: 294, column: 49, scope: !1020, inlinedAt: !1027)
!1027 = distinct !DILocation(line: 258, column: 33, scope: !1007)
!1028 = !DILocation(line: 296, column: 5, scope: !1020, inlinedAt: !1027)
!1029 = !DILocation(line: 296, column: 17, scope: !1020, inlinedAt: !1027)
!1030 = !DILocation(line: 297, column: 10, scope: !1031, inlinedAt: !1027)
!1031 = distinct !DILexicalBlock(scope: !1020, file: !569, line: 297, column: 9)
!1032 = !DILocation(line: 297, column: 9, scope: !1020, inlinedAt: !1027)
!1033 = !DILocation(line: 301, column: 1, scope: !1020, inlinedAt: !1027)
!1034 = !DILocation(line: 258, column: 24, scope: !1007)
!1035 = !DILocation(line: 258, column: 72, scope: !1007)
!1036 = !DILocation(line: 257, column: 14, scope: !1007)
!1037 = !DILocation(line: 258, column: 22, scope: !1007)
!1038 = !{!520, !520, i64 0}
!1039 = !DILocation(line: 259, column: 13, scope: !1007)
!1040 = !DILocation(line: 266, column: 25, scope: !1007)
!1041 = !DILocation(line: 242, column: 22, scope: !995)
!1042 = !DILocation(line: 267, column: 44, scope: !1007)
!1043 = !DILocation(line: 267, column: 14, scope: !1007)
!1044 = !DILocation(line: 267, column: 35, scope: !1007)
!1045 = !DILocation(line: 270, column: 68, scope: !1007)
!1046 = !DILocation(line: 270, column: 61, scope: !1007)
!1047 = !DILocation(line: 270, column: 59, scope: !1007)
!1048 = !DILocation(line: 270, column: 26, scope: !1007)
!1049 = !DILocation(line: 270, column: 24, scope: !1007)
!1050 = !DILocation(line: 243, column: 9, scope: !995)
!1051 = !DILocation(line: 271, column: 36, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !1, line: 271, column: 13)
!1053 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 271, column: 13)
!1054 = !DILocation(line: 271, column: 27, scope: !1052)
!1055 = !DILocation(line: 271, column: 13, scope: !1053)
!1056 = !DILocation(line: 273, column: 62, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 272, column: 13)
!1058 = !DILocalVariable(name: "t", arg: 1, scope: !1059, file: !211, line: 163, type: !209)
!1059 = distinct !DISubprogram(name: "vlc_input_title_Duplicate", scope: !211, file: !211, line: 163, type: !1060, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1062)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!209, !209}
!1062 = !{!1058, !1063, !1064}
!1063 = !DILocalVariable(name: "dup", scope: !1059, file: !211, line: 165, type: !209)
!1064 = !DILocalVariable(name: "i", scope: !1059, file: !211, line: 166, type: !41)
!1065 = !DILocation(line: 163, column: 72, scope: !1059, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 273, column: 35, scope: !1057)
!1067 = !DILocation(line: 135, column: 40, scope: !663, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 165, column: 26, scope: !1059, inlinedAt: !1066)
!1069 = !DILocation(line: 135, column: 20, scope: !663, inlinedAt: !1068)
!1070 = !DILocation(line: 137, column: 8, scope: !663, inlinedAt: !1068)
!1071 = !DILocation(line: 137, column: 17, scope: !663, inlinedAt: !1068)
!1072 = !DILocation(line: 138, column: 8, scope: !663, inlinedAt: !1068)
!1073 = !DILocation(line: 138, column: 15, scope: !663, inlinedAt: !1068)
!1074 = !DILocation(line: 139, column: 8, scope: !663, inlinedAt: !1068)
!1075 = !DILocation(line: 142, column: 8, scope: !663, inlinedAt: !1068)
!1076 = !DILocation(line: 142, column: 18, scope: !663, inlinedAt: !1068)
!1077 = !DILocation(line: 139, column: 17, scope: !663, inlinedAt: !1068)
!1078 = !DILocation(line: 165, column: 20, scope: !1059, inlinedAt: !1066)
!1079 = !DILocation(line: 168, column: 12, scope: !1080, inlinedAt: !1066)
!1080 = distinct !DILexicalBlock(scope: !1059, file: !211, line: 168, column: 9)
!1081 = !DILocation(line: 168, column: 9, scope: !1080, inlinedAt: !1066)
!1082 = !DILocation(line: 168, column: 9, scope: !1059, inlinedAt: !1066)
!1083 = !DILocation(line: 168, column: 39, scope: !1080, inlinedAt: !1066)
!1084 = !DILocation(line: 168, column: 37, scope: !1080, inlinedAt: !1066)
!1085 = !DILocation(line: 168, column: 23, scope: !1080, inlinedAt: !1066)
!1086 = !DILocation(line: 169, column: 27, scope: !1059, inlinedAt: !1066)
!1087 = !DILocation(line: 169, column: 22, scope: !1059, inlinedAt: !1066)
!1088 = !DILocation(line: 170, column: 27, scope: !1059, inlinedAt: !1066)
!1089 = !DILocation(line: 170, column: 22, scope: !1059, inlinedAt: !1066)
!1090 = !DILocation(line: 172, column: 27, scope: !1059, inlinedAt: !1066)
!1091 = !DILocation(line: 172, column: 10, scope: !1059, inlinedAt: !1066)
!1092 = !DILocation(line: 172, column: 22, scope: !1059, inlinedAt: !1066)
!1093 = !DILocation(line: 173, column: 24, scope: !1094, inlinedAt: !1066)
!1094 = distinct !DILexicalBlock(scope: !1059, file: !211, line: 173, column: 9)
!1095 = !DILocation(line: 173, column: 9, scope: !1059, inlinedAt: !1066)
!1096 = !DILocation(line: 175, column: 49, scope: !1097, inlinedAt: !1066)
!1097 = distinct !DILexicalBlock(scope: !1094, file: !211, line: 174, column: 5)
!1098 = !DILocation(line: 175, column: 41, scope: !1097, inlinedAt: !1066)
!1099 = !DILocation(line: 175, column: 24, scope: !1097, inlinedAt: !1066)
!1100 = !DILocation(line: 166, column: 9, scope: !1059, inlinedAt: !1066)
!1101 = !DILocation(line: 178, column: 9, scope: !1102, inlinedAt: !1066)
!1102 = distinct !DILexicalBlock(scope: !1097, file: !211, line: 178, column: 9)
!1103 = !DILocation(line: 180, column: 61, scope: !1104, inlinedAt: !1066)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !211, line: 179, column: 9)
!1105 = distinct !DILexicalBlock(scope: !1102, file: !211, line: 178, column: 9)
!1106 = !DILocation(line: 180, column: 58, scope: !1104, inlinedAt: !1066)
!1107 = !DILocalVariable(name: "src", arg: 1, scope: !1108, file: !211, line: 106, type: !1111)
!1108 = distinct !DISubprogram(name: "vlc_seekpoint_Duplicate", scope: !211, file: !211, line: 106, type: !1109, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1113)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!221, !1111}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!1113 = !{!1107, !1114}
!1114 = !DILocalVariable(name: "point", scope: !1108, file: !211, line: 108, type: !221)
!1115 = !DILocation(line: 106, column: 72, scope: !1108, inlinedAt: !1116)
!1116 = distinct !DILocation(line: 180, column: 33, scope: !1104, inlinedAt: !1066)
!1117 = !DILocation(line: 91, column: 40, scope: !767, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 108, column: 26, scope: !1108, inlinedAt: !1116)
!1119 = !DILocation(line: 91, column: 18, scope: !767, inlinedAt: !1118)
!1120 = !DILocation(line: 94, column: 12, scope: !767, inlinedAt: !1118)
!1121 = !DILocation(line: 92, column: 26, scope: !767, inlinedAt: !1118)
!1122 = !DILocation(line: 94, column: 20, scope: !767, inlinedAt: !1118)
!1123 = !DILocation(line: 95, column: 12, scope: !767, inlinedAt: !1118)
!1124 = !DILocation(line: 95, column: 21, scope: !767, inlinedAt: !1118)
!1125 = !DILocation(line: 108, column: 18, scope: !1108, inlinedAt: !1116)
!1126 = !DILocation(line: 109, column: 14, scope: !1127, inlinedAt: !1116)
!1127 = distinct !DILexicalBlock(scope: !1108, file: !211, line: 109, column: 9)
!1128 = !DILocation(line: 109, column: 9, scope: !1127, inlinedAt: !1116)
!1129 = !DILocation(line: 109, column: 9, scope: !1108, inlinedAt: !1116)
!1130 = !DILocation(line: 109, column: 43, scope: !1127, inlinedAt: !1116)
!1131 = !DILocation(line: 109, column: 41, scope: !1127, inlinedAt: !1116)
!1132 = !DILocation(line: 178, column: 28, scope: !1105, inlinedAt: !1066)
!1133 = !DILocation(line: 109, column: 25, scope: !1127, inlinedAt: !1116)
!1134 = !DILocation(line: 111, column: 33, scope: !1108, inlinedAt: !1116)
!1135 = !DILocation(line: 111, column: 26, scope: !1108, inlinedAt: !1116)
!1136 = !DILocation(line: 180, column: 13, scope: !1104, inlinedAt: !1066)
!1137 = !DILocation(line: 180, column: 31, scope: !1104, inlinedAt: !1066)
!1138 = !DILocation(line: 178, column: 42, scope: !1105, inlinedAt: !1066)
!1139 = !DILocation(line: 178, column: 23, scope: !1105, inlinedAt: !1066)
!1140 = distinct !{!1140, !1141, !1142}
!1141 = !DILocation(line: 178, column: 9, scope: !1102)
!1142 = !DILocation(line: 181, column: 9, scope: !1102)
!1143 = !DILocation(line: 273, column: 18, scope: !1057)
!1144 = !DILocation(line: 273, column: 17, scope: !1057)
!1145 = !DILocation(line: 273, column: 33, scope: !1057)
!1146 = !DILocation(line: 271, column: 47, scope: !1052)
!1147 = distinct !{!1147, !1055, !1148}
!1148 = !DILocation(line: 274, column: 13, scope: !1053)
!1149 = !DILocation(line: 278, column: 17, scope: !1007)
!1150 = !DILocation(line: 279, column: 37, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 279, column: 17)
!1152 = !DILocation(line: 279, column: 19, scope: !1151)
!1153 = !DILocation(line: 279, column: 17, scope: !1007)
!1154 = !DILocation(line: 282, column: 32, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !1, line: 280, column: 13)
!1156 = !DILocation(line: 282, column: 41, scope: !1155)
!1157 = !DILocation(line: 284, column: 40, scope: !1155)
!1158 = !DILocation(line: 285, column: 32, scope: !1155)
!1159 = !DILocation(line: 285, column: 44, scope: !1155)
!1160 = !DILocation(line: 286, column: 41, scope: !1155)
!1161 = !DILocation(line: 286, column: 58, scope: !1155)
!1162 = !DILocation(line: 286, column: 32, scope: !1155)
!1163 = !DILocation(line: 286, column: 39, scope: !1155)
!1164 = !DILocation(line: 287, column: 32, scope: !1155)
!1165 = !DILocation(line: 287, column: 39, scope: !1155)
!1166 = !DILocation(line: 290, column: 42, scope: !1155)
!1167 = !DILocation(line: 290, column: 53, scope: !1155)
!1168 = !DILocation(line: 290, column: 35, scope: !1155)
!1169 = !DILocation(line: 290, column: 24, scope: !1155)
!1170 = !DILocation(line: 290, column: 33, scope: !1155)
!1171 = !DILocation(line: 291, column: 13, scope: !1155)
!1172 = !DILocation(line: 296, column: 60, scope: !1006)
!1173 = !DILocation(line: 296, column: 32, scope: !1006)
!1174 = !DILocation(line: 296, column: 28, scope: !1006)
!1175 = !DILocation(line: 297, column: 17, scope: !1006)
!1176 = !DILocation(line: 298, column: 20, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1006, file: !1, line: 298, column: 17)
!1178 = !DILocation(line: 298, column: 32, scope: !1177)
!1179 = !DILocation(line: 298, column: 17, scope: !1006)
!1180 = !DILocation(line: 300, column: 32, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1177, file: !1, line: 299, column: 13)
!1182 = !DILocation(line: 300, column: 41, scope: !1181)
!1183 = !DILocation(line: 301, column: 32, scope: !1181)
!1184 = !DILocation(line: 301, column: 44, scope: !1181)
!1185 = !DILocation(line: 303, column: 42, scope: !1181)
!1186 = !DILocation(line: 303, column: 69, scope: !1181)
!1187 = !DILocation(line: 303, column: 53, scope: !1181)
!1188 = !DILocation(line: 303, column: 35, scope: !1181)
!1189 = !DILocation(line: 304, column: 24, scope: !1181)
!1190 = !DILocation(line: 304, column: 21, scope: !1181)
!1191 = !DILocation(line: 304, column: 38, scope: !1181)
!1192 = !DILocation(line: 304, column: 52, scope: !1181)
!1193 = !DILocation(line: 303, column: 24, scope: !1181)
!1194 = !DILocation(line: 303, column: 33, scope: !1181)
!1195 = !DILocation(line: 307, column: 21, scope: !1181)
!1196 = !DILocation(line: 306, column: 67, scope: !1181)
!1197 = !DILocation(line: 306, column: 40, scope: !1181)
!1198 = !DILocation(line: 307, column: 65, scope: !1181)
!1199 = !DILocation(line: 306, column: 32, scope: !1181)
!1200 = !DILocation(line: 306, column: 38, scope: !1181)
!1201 = !DILocation(line: 308, column: 13, scope: !1181)
!1202 = !DILocation(line: 317, column: 13, scope: !1007)
!1203 = !DILocation(line: 318, column: 13, scope: !1007)
!1204 = !DILocation(line: 321, column: 5, scope: !995)
!1205 = !DILocation(line: 0, scope: !995)
!1206 = !DILocation(line: 322, column: 1, scope: !995)
!1207 = distinct !DISubprogram(name: "Seek", scope: !1, file: !1, line: 409, type: !173, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213}
!1209 = !DILocalVariable(name: "p_access", arg: 1, scope: !1207, file: !1, line: 409, type: !117)
!1210 = !DILocalVariable(name: "i_pos", arg: 2, scope: !1207, file: !1, line: 409, type: !175)
!1211 = !DILocalVariable(name: "p_sys", scope: !1207, file: !1, line: 411, type: !197)
!1212 = !DILocalVariable(name: "t", scope: !1207, file: !1, line: 412, type: !209)
!1213 = !DILocalVariable(name: "i_seekpoint", scope: !1207, file: !1, line: 413, type: !41)
!1214 = !DILocation(line: 409, column: 28, scope: !1207)
!1215 = !DILocation(line: 409, column: 47, scope: !1207)
!1216 = !DILocation(line: 411, column: 37, scope: !1207)
!1217 = !DILocation(line: 411, column: 19, scope: !1207)
!1218 = !DILocation(line: 412, column: 52, scope: !1207)
!1219 = !DILocation(line: 412, column: 24, scope: !1207)
!1220 = !DILocation(line: 412, column: 20, scope: !1207)
!1221 = !DILocation(line: 416, column: 20, scope: !1207)
!1222 = !DILocation(line: 416, column: 26, scope: !1207)
!1223 = !DILocation(line: 417, column: 29, scope: !1207)
!1224 = !DILocation(line: 418, column: 16, scope: !1207)
!1225 = !DILocation(line: 418, column: 49, scope: !1207)
!1226 = !DILocation(line: 418, column: 9, scope: !1207)
!1227 = !DILocation(line: 417, column: 23, scope: !1207)
!1228 = !DILocation(line: 417, column: 12, scope: !1207)
!1229 = !DILocation(line: 417, column: 21, scope: !1207)
!1230 = !DILocation(line: 413, column: 9, scope: !1207)
!1231 = !DILocation(line: 424, column: 24, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 424, column: 13)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !1, line: 422, column: 5)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !1, line: 421, column: 5)
!1235 = distinct !DILexicalBlock(scope: !1207, file: !1, line: 421, column: 5)
!1236 = !DILocation(line: 421, column: 10, scope: !1235)
!1237 = !DILocation(line: 0, scope: !1235)
!1238 = !DILocation(line: 421, column: 39, scope: !1234)
!1239 = !DILocation(line: 421, column: 5, scope: !1235)
!1240 = !DILocation(line: 423, column: 25, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 423, column: 13)
!1242 = !DILocation(line: 423, column: 29, scope: !1241)
!1243 = !DILocation(line: 423, column: 13, scope: !1233)
!1244 = !DILocation(line: 424, column: 21, scope: !1232)
!1245 = !DILocation(line: 424, column: 52, scope: !1232)
!1246 = !DILocation(line: 424, column: 19, scope: !1232)
!1247 = !DILocation(line: 424, column: 13, scope: !1233)
!1248 = distinct !{!1248, !1239, !1249}
!1249 = !DILocation(line: 425, column: 5, scope: !1235)
!1250 = !DILocation(line: 427, column: 39, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1207, file: !1, line: 427, column: 9)
!1252 = !DILocation(line: 427, column: 21, scope: !1251)
!1253 = !DILocation(line: 427, column: 9, scope: !1207)
!1254 = !DILocation(line: 429, column: 9, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1251, file: !1, line: 428, column: 5)
!1256 = !DILocation(line: 430, column: 24, scope: !1255)
!1257 = !DILocation(line: 430, column: 33, scope: !1255)
!1258 = !DILocation(line: 431, column: 36, scope: !1255)
!1259 = !DILocation(line: 432, column: 5, scope: !1255)
!1260 = !DILocation(line: 435, column: 20, scope: !1207)
!1261 = !DILocation(line: 435, column: 26, scope: !1207)
!1262 = !DILocation(line: 437, column: 5, scope: !1207)
!1263 = distinct !DISubprogram(name: "vlc_entry_copyright__1_1_0g", scope: !1, file: !1, line: 64, type: !1264, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !319)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!38}
!1266 = !DILocation(line: 64, column: 1, scope: !1263)
