; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rrdesc.10 = type { i32, i8*, i8, %struct.rrdesc.10* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.q_header = type { i16, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16 }
%struct.q_rr = type { %struct.js_string*, i16, i16, i32, i16, %struct.js_string* }
%struct.js_string = type { i8*, i32, i32, i32, i32, i32 }
%struct.rr_soa = type { %struct.js_string*, %struct.js_string*, i32, i32, i32, i32, i32 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.tm.81 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [9 x i8] c"%s%s%s%s\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"# Fatal error: \00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"Connection timed out\00", align 1
@.str.4 = private unnamed_addr constant [40 x i8] c"Usage: getzone zone_name zone_server_IP\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dlog_level", scope: !2, file: !3, line: 34, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, nameTableKind: None)
!3 = !DIFile(filename: "Decompress.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!4 = !{}
!5 = !{!6, !0, !14}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "rr_descs", scope: !2, file: !8, line: 40, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "./Compress_rrdescs.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1088, elements: !12)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !{!13}
!13 = !DISubrange(count: 17)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "rr_formats", scope: !2, file: !3, line: 31, type: !16, isLocal: false, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "rrdesc", file: !19, line: 25, baseType: !20)
!19 = !DIFile(filename: "./Compress_rrs.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rrdesc", file: !19, line: 20, size: 256, elements: !21)
!21 = !{!22, !24, !25, !26}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rr_num", scope: !20, file: !19, line: 21, baseType: !23, size: 32)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !20, file: !19, line: 22, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tocompress", scope: !20, file: !19, line: 23, baseType: !11, size: 8, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !19, line: 24, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "timestamp_type", scope: !30, file: !31, line: 29, type: !23, isLocal: false, isDefinition: true)
!30 = distinct !DICompileUnit(language: DW_LANG_C99, file: !31, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, globals: !33, nameTableKind: None)
!31 = !DIFile(filename: "timestamp.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!32 = !{!23}
!33 = !{!28}
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !35, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !36, retainedTypes: !73, globals: !91, nameTableKind: None)
!35 = !DIFile(filename: "getzone.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tcp")
!36 = !{!37, !50}
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !38, line: 24, baseType: !39, size: 32, elements: !40)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49}
!41 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!48 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!49 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 192, baseType: !39, size: 32, elements: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!53 = !DIEnumerator(name: "MSG_OOB", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "MSG_PEEK", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "MSG_CTRUNC", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "MSG_PROXY", value: 16, isUnsigned: true)
!58 = !DIEnumerator(name: "MSG_TRUNC", value: 32, isUnsigned: true)
!59 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64, isUnsigned: true)
!60 = !DIEnumerator(name: "MSG_EOR", value: 128, isUnsigned: true)
!61 = !DIEnumerator(name: "MSG_WAITALL", value: 256, isUnsigned: true)
!62 = !DIEnumerator(name: "MSG_FIN", value: 512, isUnsigned: true)
!63 = !DIEnumerator(name: "MSG_SYN", value: 1024, isUnsigned: true)
!64 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048, isUnsigned: true)
!65 = !DIEnumerator(name: "MSG_RST", value: 4096, isUnsigned: true)
!66 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192, isUnsigned: true)
!67 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384, isUnsigned: true)
!68 = !DIEnumerator(name: "MSG_MORE", value: 32768, isUnsigned: true)
!69 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536, isUnsigned: true)
!70 = !DIEnumerator(name: "MSG_BATCH", value: 262144, isUnsigned: true)
!71 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912, isUnsigned: true)
!72 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824, isUnsigned: true)
!73 = !{!74, !75, !79, !23, !89, !90}
!74 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !76, line: 30, baseType: !77)
!76 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !78, line: 51, baseType: !39)
!78 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !51, line: 170, size: 128, elements: !81)
!81 = !{!82, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !80, file: !51, line: 172, baseType: !83, size: 16)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !84, line: 28, baseType: !74)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !80, file: !51, line: 173, baseType: !86, size: 112, offset: 16)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 112, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 14)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !{!92, !94, !96}
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "no_cname_warnings", scope: !34, file: !35, line: 40, type: !23, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "csv2_tilde_handling", scope: !34, file: !35, line: 41, type: !23, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "dns_records_served", scope: !34, file: !35, line: 43, type: !23, isLocal: false, isDefinition: true)
!98 = distinct !DICompileUnit(language: DW_LANG_C99, file: !99, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !100, nameTableKind: None)
!99 = !DIFile(filename: "JsStr.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!100 = !{!90, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !103, line: 28, baseType: !104)
!103 = !DIFile(filename: "./JsStr.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 19, size: 256, elements: !105)
!105 = !{!106, !109, !110, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !104, file: !103, line: 20, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !104, file: !103, line: 21, baseType: !39, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !104, file: !103, line: 22, baseType: !39, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !104, file: !103, line: 23, baseType: !39, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !104, file: !103, line: 25, baseType: !23, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !104, file: !103, line: 26, baseType: !23, size: 32, offset: 192)
!114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !115, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !116, nameTableKind: None)
!115 = !DIFile(filename: "JsStrOS.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!116 = !{!90}
!117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !118, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!118 = !DIFile(filename: "JsStrCP.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !121, globals: !122, nameTableKind: None)
!120 = !DIFile(filename: "MaraHash.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/libs")
!121 = !{!39}
!122 = !{!123}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "mhash_mask", scope: !119, file: !120, line: 38, type: !125, isLocal: false, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 992, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 31)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !130, nameTableKind: None)
!129 = !DIFile(filename: "qual_timestamp.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/qual")
!130 = !{!131, !133, !163}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "num_tries", scope: !128, file: !129, line: 34, type: !23, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "qtime_lock", scope: !128, file: !129, line: 41, type: !135, isLocal: false, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !136, line: 128, baseType: !137)
!136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !136, line: 90, size: 320, elements: !138)
!138 = !{!139, !157, !161}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !137, file: !136, line: 125, baseType: !140, size: 320)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !136, line: 92, size: 320, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !149, !150}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !140, file: !136, line: 94, baseType: !23, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !140, file: !136, line: 95, baseType: !39, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !140, file: !136, line: 96, baseType: !23, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !140, file: !136, line: 98, baseType: !39, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !140, file: !136, line: 102, baseType: !23, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !140, file: !136, line: 104, baseType: !148, size: 16, offset: 160)
!148 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !140, file: !136, line: 105, baseType: !148, size: 16, offset: 176)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !140, file: !136, line: 106, baseType: !151, size: 128, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !136, line: 79, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !136, line: 75, size: 128, elements: !153)
!153 = !{!154, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !152, file: !136, line: 77, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !152, file: !136, line: 78, baseType: !155, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !137, file: !136, line: 126, baseType: !158, size: 320)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 320, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 40)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !137, file: !136, line: 127, baseType: !162, size: 64)
!162 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "the_time", scope: !128, file: !129, line: 33, type: !165, isLocal: false, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !166, line: 197, baseType: !162)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!168 = !DIFile(filename: "Queries.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !170, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!170 = !DIFile(filename: "Compress.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!171 = distinct !DICompileUnit(language: DW_LANG_C99, file: !172, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!172 = !DIFile(filename: "bobbit.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/dns")
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !175, globals: !190, nameTableKind: None)
!174 = !DIFile(filename: "ParseMaraRc.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !177, line: 62, baseType: !178)
!177 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!178 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !181, line: 28, baseType: !182)
!181 = !DIFile(filename: "./../libs/JsStr.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 19, size: 256, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !182, file: !181, line: 20, baseType: !107, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !182, file: !181, line: 21, baseType: !39, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !182, file: !181, line: 22, baseType: !39, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !182, file: !181, line: 23, baseType: !39, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !182, file: !181, line: 25, baseType: !23, size: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !182, file: !181, line: 26, baseType: !23, size: 32, offset: 192)
!190 = !{!191, !196, !201, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !261, !263, !290, !292, !294, !296, !298, !309, !312}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "keywords", scope: !173, file: !174, line: 36, type: !193, isLocal: false, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 3520, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 55)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "dkeywords", scope: !173, file: !174, line: 342, type: !198, isLocal: false, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 384, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 6)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "quotes", scope: !203, file: !174, line: 631, type: !179, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "parseline", scope: !174, file: !174, line: 628, type: !204, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !173, retainedNodes: !207)
!204 = !DISubroutineType(types: !205)
!205 = !{!23, !179, !179, !179, !179, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!208 = !DILocalVariable(name: "line", arg: 1, scope: !203, file: !174, line: 628, type: !179)
!209 = !DILocalVariable(name: "var", arg: 2, scope: !203, file: !174, line: 628, type: !179)
!210 = !DILocalVariable(name: "key", arg: 3, scope: !203, file: !174, line: 628, type: !179)
!211 = !DILocalVariable(name: "value", arg: 4, scope: !203, file: !174, line: 629, type: !179)
!212 = !DILocalVariable(name: "do_plus", arg: 5, scope: !203, file: !174, line: 629, type: !206)
!213 = !DILocalVariable(name: "quote1", scope: !203, file: !174, line: 635, type: !23)
!214 = !DILocalVariable(name: "quote2", scope: !203, file: !174, line: 635, type: !23)
!215 = !DILocalVariable(name: "quote3", scope: !203, file: !174, line: 635, type: !23)
!216 = !DILocalVariable(name: "quote4", scope: !203, file: !174, line: 635, type: !23)
!217 = !DILocalVariable(name: "varstart", scope: !203, file: !174, line: 637, type: !23)
!218 = !DILocalVariable(name: "varend", scope: !203, file: !174, line: 637, type: !23)
!219 = !DILocalVariable(name: "valstart", scope: !203, file: !174, line: 637, type: !23)
!220 = !DILocalVariable(name: "valend", scope: !203, file: !174, line: 637, type: !23)
!221 = !DILocalVariable(name: "equalp", scope: !203, file: !174, line: 640, type: !23)
!222 = !DILocalVariable(name: "hashp", scope: !203, file: !174, line: 640, type: !23)
!223 = !DILocalVariable(name: "tempp", scope: !203, file: !174, line: 641, type: !23)
!224 = !DILocalVariable(name: "ret", scope: !203, file: !174, line: 642, type: !23)
!225 = !DILocalVariable(name: "quote", scope: !203, file: !174, line: 643, type: !11)
!226 = !DILocalVariable(name: "plus", scope: !203, file: !174, line: 644, type: !11)
!227 = !DILocalVariable(name: "equal", scope: !203, file: !174, line: 645, type: !11)
!228 = !DILocalVariable(name: "hash", scope: !203, file: !174, line: 646, type: !11)
!229 = !DILocalVariable(name: "left", scope: !203, file: !174, line: 647, type: !11)
!230 = !DILocalVariable(name: "right", scope: !203, file: !174, line: 648, type: !11)
!231 = !DILocalVariable(name: "cleft", scope: !203, file: !174, line: 649, type: !11)
!232 = !DILocalVariable(name: "cright", scope: !203, file: !174, line: 650, type: !11)
!233 = !DILocalVariable(name: "bslash", scope: !203, file: !174, line: 651, type: !11)
!234 = !DILocalVariable(name: "q", scope: !235, file: !174, line: 918, type: !23)
!235 = distinct !DILexicalBlock(scope: !236, file: !174, line: 917, column: 22)
!236 = distinct !DILexicalBlock(scope: !237, file: !174, line: 917, column: 12)
!237 = distinct !DILexicalBlock(scope: !238, file: !174, line: 912, column: 38)
!238 = distinct !DILexicalBlock(scope: !203, file: !174, line: 912, column: 8)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "alphanumeric", scope: !203, file: !174, line: 631, type: !179, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "numbers", scope: !203, file: !174, line: 631, type: !179, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "equals", scope: !203, file: !174, line: 632, type: !179, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "plusq", scope: !203, file: !174, line: 632, type: !179, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "hashq", scope: !203, file: !174, line: 632, type: !179, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "bslashq", scope: !203, file: !174, line: 632, type: !179, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "allq", scope: !203, file: !174, line: 632, type: !179, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "leftq", scope: !203, file: !174, line: 633, type: !179, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "rightq", scope: !203, file: !174, line: 633, type: !179, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "cleftq", scope: !203, file: !174, line: 633, type: !179, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "crightq", scope: !203, file: !174, line: 633, type: !179, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "blankq", scope: !203, file: !174, line: 634, type: !179, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "line", scope: !265, file: !174, line: 1053, type: !179, isLocal: true, isDefinition: true)
!265 = distinct !DISubprogram(name: "read_mararc", scope: !174, file: !174, line: 1052, type: !266, scopeLine: 1052, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !173, retainedNodes: !268)
!266 = !DISubroutineType(types: !267)
!267 = !{!23, !179, !179, !206}
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !284}
!269 = !DILocalVariable(name: "fileloc", arg: 1, scope: !265, file: !174, line: 1052, type: !179)
!270 = !DILocalVariable(name: "errorstr", arg: 2, scope: !265, file: !174, line: 1052, type: !179)
!271 = !DILocalVariable(name: "errorret", arg: 3, scope: !265, file: !174, line: 1052, type: !206)
!272 = !DILocalVariable(name: "error", scope: !265, file: !174, line: 1059, type: !23)
!273 = !DILocalVariable(name: "linenum", scope: !265, file: !174, line: 1060, type: !23)
!274 = !DILocalVariable(name: "command", scope: !265, file: !174, line: 1060, type: !23)
!275 = !DILocalVariable(name: "tnum", scope: !265, file: !174, line: 1061, type: !23)
!276 = !DILocalVariable(name: "is_plus", scope: !265, file: !174, line: 1062, type: !23)
!277 = !DILocalVariable(name: "result", scope: !278, file: !174, line: 1150, type: !23)
!278 = distinct !DILexicalBlock(scope: !279, file: !174, line: 1149, column: 29)
!279 = distinct !DILexicalBlock(scope: !280, file: !174, line: 1149, column: 21)
!280 = distinct !DILexicalBlock(scope: !281, file: !174, line: 1138, column: 16)
!281 = distinct !DILexicalBlock(scope: !282, file: !174, line: 1130, column: 36)
!282 = distinct !DILexicalBlock(scope: !283, file: !174, line: 1130, column: 12)
!283 = distinct !DILexicalBlock(scope: !265, file: !174, line: 1119, column: 30)
!284 = !DILocalVariable(name: "result", scope: !285, file: !174, line: 1238, type: !23)
!285 = distinct !DILexicalBlock(scope: !286, file: !174, line: 1237, column: 29)
!286 = distinct !DILexicalBlock(scope: !287, file: !174, line: 1237, column: 21)
!287 = distinct !DILexicalBlock(scope: !288, file: !174, line: 1226, column: 16)
!288 = distinct !DILexicalBlock(scope: !289, file: !174, line: 1192, column: 41)
!289 = distinct !DILexicalBlock(scope: !282, file: !174, line: 1192, column: 17)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "var", scope: !265, file: !174, line: 1054, type: !179, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "key", scope: !265, file: !174, line: 1055, type: !179, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "value", scope: !265, file: !174, line: 1056, type: !179, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "tstr", scope: !265, file: !174, line: 1057, type: !179, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "file", scope: !265, file: !174, line: 1065, type: !300, isLocal: true, isDefinition: true)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_file", file: !181, line: 37, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 30, size: 192, elements: !303)
!303 = !{!304, !305, !306, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !302, file: !181, line: 31, baseType: !23, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "file_desc", scope: !302, file: !181, line: 32, baseType: !23, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !302, file: !181, line: 34, baseType: !179, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !302, file: !181, line: 35, baseType: !23, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !302, file: !181, line: 36, baseType: !23, size: 32, offset: 160)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "kvar", scope: !173, file: !174, line: 183, type: !311, isLocal: false, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 3520, elements: !194)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "dvar", scope: !173, file: !174, line: 349, type: !314, isLocal: false, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 384, elements: !199)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash", file: !317, line: 45, baseType: !318)
!317 = !DIFile(filename: "./../libs/MaraHash.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 41, size: 192, elements: !319)
!319 = !{!320, !321, !332}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !318, file: !317, line: 42, baseType: !23, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !318, file: !317, line: 43, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash_spot", file: !317, line: 30, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mhash_spot", file: !317, line: 25, size: 256, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !325, file: !317, line: 26, baseType: !179, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !325, file: !317, line: 27, baseType: !90, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !325, file: !317, line: 28, baseType: !23, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !317, line: 29, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "spots", scope: !318, file: !317, line: 44, baseType: !39, size: 32, offset: 128)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!334 = !DIFile(filename: "ParseCsv1.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !337, nameTableKind: None)
!336 = !DIFile(filename: "ParseIpAcl.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!337 = !{!338, !372, !374, !376}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "dotq", scope: !340, file: !336, line: 49, type: !343, isLocal: true, isDefinition: true)
!340 = distinct !DISubprogram(name: "ddip_ip_mask", scope: !336, file: !336, line: 43, type: !341, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !360)
!341 = !DISubroutineType(types: !342)
!342 = !{!23, !343, !353, !23}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !181, line: 28, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 19, size: 256, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !345, file: !181, line: 20, baseType: !107, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !345, file: !181, line: 21, baseType: !39, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !345, file: !181, line: 22, baseType: !39, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !345, file: !181, line: 23, baseType: !39, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !345, file: !181, line: 25, baseType: !23, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !345, file: !181, line: 26, baseType: !23, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipv4pair", file: !355, line: 172, baseType: !356)
!355 = !DIFile(filename: "./../MaraDns.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 169, size: 64, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !356, file: !355, line: 170, baseType: !77, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !356, file: !355, line: 171, baseType: !77, size: 32, offset: 32)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!361 = !DILocalVariable(name: "ddip", arg: 1, scope: !340, file: !336, line: 43, type: !343)
!362 = !DILocalVariable(name: "ips", arg: 2, scope: !340, file: !336, line: 43, type: !353)
!363 = !DILocalVariable(name: "offset", arg: 3, scope: !340, file: !336, line: 43, type: !23)
!364 = !DILocalVariable(name: "qr", scope: !340, file: !336, line: 44, type: !23)
!365 = !DILocalVariable(name: "counter", scope: !340, file: !336, line: 44, type: !23)
!366 = !DILocalVariable(name: "firstoffset", scope: !340, file: !336, line: 44, type: !23)
!367 = !DILocalVariable(name: "slashp", scope: !340, file: !336, line: 44, type: !23)
!368 = !DILocalVariable(name: "ret", scope: !340, file: !336, line: 45, type: !23)
!369 = !DILocalVariable(name: "ip_byte", scope: !340, file: !336, line: 47, type: !108)
!370 = !DILocalVariable(name: "dot", scope: !340, file: !336, line: 87, type: !11)
!371 = !DILocalVariable(name: "slash", scope: !340, file: !336, line: 88, type: !11)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "numdotq", scope: !340, file: !336, line: 50, type: !343, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "slashq", scope: !340, file: !336, line: 51, type: !343, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "masks", scope: !340, file: !336, line: 52, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1056, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 33)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!382 = !DIFile(filename: "Parse_ipv6.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, nameTableKind: None)
!384 = !DIFile(filename: "Csv2_read.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !387, retainedTypes: !388, nameTableKind: None)
!386 = !DIFile(filename: "Csv2_main.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!387 = !{!50}
!388 = !{!389, !23}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash", file: !317, line: 45, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 41, size: 192, elements: !392)
!392 = !{!393, !394, !415}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !391, file: !317, line: 42, baseType: !23, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !391, file: !317, line: 43, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash_spot", file: !317, line: 30, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mhash_spot", file: !317, line: 25, size: 256, elements: !399)
!399 = !{!400, !411, !412, !413}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !398, file: !317, line: 26, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !181, line: 28, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 19, size: 256, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !403, file: !181, line: 20, baseType: !107, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !403, file: !181, line: 21, baseType: !39, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !403, file: !181, line: 22, baseType: !39, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !403, file: !181, line: 23, baseType: !39, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !403, file: !181, line: 25, baseType: !23, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !403, file: !181, line: 26, baseType: !23, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !398, file: !317, line: 27, baseType: !90, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !398, file: !317, line: 28, baseType: !23, size: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !317, line: 29, baseType: !414, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "spots", scope: !391, file: !317, line: 44, baseType: !39, size: 32, offset: 128)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!417 = !DIFile(filename: "Csv2_parse.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!419 = !DIFile(filename: "Csv2_rr_soa.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!421 = !DIFile(filename: "Csv2_rr_aaaa.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!423 = !DIFile(filename: "Csv2_rr_a.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!425 = !DIFile(filename: "Csv2_rr_wks.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !428, nameTableKind: None)
!427 = !DIFile(filename: "Csv2_database.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!428 = !{!90, !23}
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!430 = !DIFile(filename: "Csv2_rr_txt.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!432 = !DIFile(filename: "Csv2_esc_txt.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/parse")
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !435, globals: !504, nameTableKind: None)
!434 = !DIFile(filename: "MaraBigHash.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!435 = !{!436, !10, !465}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash", file: !438, line: 45, baseType: !439)
!438 = !DIFile(filename: "./../libs/MaraHash.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 41, size: 192, elements: !440)
!440 = !{!441, !442, !464}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !439, file: !438, line: 42, baseType: !23, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !439, file: !438, line: 43, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "mhash_spot", file: !438, line: 30, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mhash_spot", file: !438, line: 25, size: 256, elements: !447)
!447 = !{!448, !460, !461, !462}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !446, file: !438, line: 26, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !451, line: 28, baseType: !452)
!451 = !DIFile(filename: "./../libs/JsStr.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 19, size: 256, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !452, file: !451, line: 20, baseType: !107, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !452, file: !451, line: 21, baseType: !39, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !452, file: !451, line: 22, baseType: !39, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !452, file: !451, line: 23, baseType: !39, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !452, file: !451, line: 25, baseType: !23, size: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !452, file: !451, line: 26, baseType: !23, size: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !446, file: !438, line: 27, baseType: !90, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !446, file: !438, line: 28, baseType: !23, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !438, line: 29, baseType: !463, size: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "spots", scope: !439, file: !438, line: 44, baseType: !39, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "rr", file: !467, line: 228, baseType: !468)
!467 = !DIFile(filename: "./../MaraDns.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rr", file: !467, line: 206, size: 768, elements: !469)
!469 = !{!470, !472, !473, !474, !476, !477, !478, !480, !481, !482, !494, !495, !496, !503}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !468, file: !467, line: 207, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !78, line: 40, baseType: !162)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !468, file: !467, line: 208, baseType: !77, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "authoritative", scope: !468, file: !467, line: 209, baseType: !77, size: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !467, line: 210, baseType: !475, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !468, file: !467, line: 212, baseType: !475, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !468, file: !467, line: 214, baseType: !449, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rr_type", scope: !468, file: !467, line: 217, baseType: !479, size: 16, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !78, line: 49, baseType: !74)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !468, file: !467, line: 218, baseType: !449, size: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !468, file: !467, line: 219, baseType: !449, size: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "zap", scope: !468, file: !467, line: 220, baseType: !483, size: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "fila", file: !467, line: 188, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fila", file: !467, line: 176, size: 384, elements: !486)
!486 = !{!487, !489, !490, !491, !492, !493}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "siguiente", scope: !485, file: !467, line: 177, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !485, file: !467, line: 178, baseType: !488, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !485, file: !467, line: 179, baseType: !108, size: 8, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "record", scope: !485, file: !467, line: 180, baseType: !90, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hash_point", scope: !485, file: !467, line: 182, baseType: !449, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nukable_hp", scope: !485, file: !467, line: 184, baseType: !11, size: 8, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "seen", scope: !468, file: !467, line: 222, baseType: !11, size: 8, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !468, file: !467, line: 224, baseType: !479, size: 16, offset: 592)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !468, file: !467, line: 226, baseType: !497, size: 64, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rr_list", file: !467, line: 231, size: 192, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rr_type", scope: !498, file: !467, line: 232, baseType: !479, size: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !498, file: !467, line: 233, baseType: !465, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !467, line: 234, baseType: !497, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !468, file: !467, line: 227, baseType: !11, size: 8, offset: 704)
!504 = !{!505}
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "cname_warnings_shown", scope: !433, file: !434, line: 52, type: !23, isLocal: false, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!508 = !DIFile(filename: "read_kvars.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !511, nameTableKind: None)
!510 = !DIFile(filename: "MaraAnyChain.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/server")
!511 = !{!90, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "rr_list", file: !467, line: 235, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rr_list", file: !467, line: 231, size: 192, elements: !515)
!515 = !{!516, !517, !559}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rr_type", scope: !514, file: !467, line: 232, baseType: !479, size: 16)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !514, file: !467, line: 233, baseType: !518, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "rr", file: !467, line: 228, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rr", file: !467, line: 206, size: 768, elements: !521)
!521 = !{!522, !523, !524, !525, !527, !528, !539, !540, !541, !542, !554, !555, !556, !558}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !520, file: !467, line: 207, baseType: !471, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !520, file: !467, line: 208, baseType: !77, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "authoritative", scope: !520, file: !467, line: 209, baseType: !77, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !467, line: 210, baseType: !526, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !520, file: !467, line: 212, baseType: !526, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !520, file: !467, line: 214, baseType: !529, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !451, line: 28, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 19, size: 256, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !531, file: !451, line: 20, baseType: !107, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !531, file: !451, line: 21, baseType: !39, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !531, file: !451, line: 22, baseType: !39, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !531, file: !451, line: 23, baseType: !39, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !531, file: !451, line: 25, baseType: !23, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !531, file: !451, line: 26, baseType: !23, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rr_type", scope: !520, file: !467, line: 217, baseType: !479, size: 16, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !520, file: !467, line: 218, baseType: !529, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !520, file: !467, line: 219, baseType: !529, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "zap", scope: !520, file: !467, line: 220, baseType: !543, size: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "fila", file: !467, line: 188, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fila", file: !467, line: 176, size: 384, elements: !546)
!546 = !{!547, !549, !550, !551, !552, !553}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "siguiente", scope: !545, file: !467, line: 177, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !545, file: !467, line: 178, baseType: !548, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !545, file: !467, line: 179, baseType: !108, size: 8, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "record", scope: !545, file: !467, line: 180, baseType: !90, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hash_point", scope: !545, file: !467, line: 182, baseType: !529, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nukable_hp", scope: !545, file: !467, line: 184, baseType: !11, size: 8, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "seen", scope: !520, file: !467, line: 222, baseType: !11, size: 8, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !520, file: !467, line: 224, baseType: !479, size: 16, offset: 592)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !520, file: !467, line: 226, baseType: !557, size: 64, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !520, file: !467, line: 227, baseType: !11, size: 8, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !467, line: 234, baseType: !557, size: 64, offset: 128)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !562, nameTableKind: None)
!561 = !DIFile(filename: "libtcp.c", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tcp")
!562 = !{!563, !565, !574, !576, !589}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "log_level", scope: !560, file: !561, line: 27, type: !23, isLocal: false, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "bind_addr_list", scope: !560, file: !561, line: 29, type: !567, isLocal: false, isDefinition: true)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipv4pair", file: !569, line: 172, baseType: !570)
!569 = !DIFile(filename: "./../MaraDns.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tcp")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 169, size: 64, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !570, file: !569, line: 170, baseType: !77, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !570, file: !569, line: 171, baseType: !77, size: 32, offset: 32)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "synthip_addr_list", scope: !560, file: !561, line: 30, type: !567, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "synth_soa_origin", scope: !560, file: !561, line: 34, type: !578, isLocal: false, isDefinition: true)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !580, line: 28, baseType: !581)
!580 = !DIFile(filename: "./../libs/JsStr.h", directory: "/root/llvm/codesample/39apps/maradns-1.4.05/tcp")
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 19, size: 256, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !581, file: !580, line: 20, baseType: !107, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !581, file: !580, line: 21, baseType: !39, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !581, file: !580, line: 22, baseType: !39, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !581, file: !580, line: 23, baseType: !39, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !581, file: !580, line: 25, baseType: !23, size: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !581, file: !580, line: 26, baseType: !23, size: 32, offset: 192)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "synth_soa_serial", scope: !560, file: !561, line: 35, type: !23, isLocal: false, isDefinition: true)
!591 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git c257efa2d375141bf09ac0e6170370eae4521829)"}
!592 = !{i32 2, !"Dwarf Version", i32 4}
!593 = !{i32 2, !"Debug Info Version", i32 3}
!594 = !{i32 1, !"wchar_size", i32 4}
!595 = !{i32 1, !"ThinLTO", i32 0}
!596 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!597 = distinct !DISubprogram(name: "harderror", scope: !35, file: !35, line: 45, type: !598, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !10}
!600 = !{!601}
!601 = !DILocalVariable(name: "why", arg: 1, scope: !597, file: !35, line: 45, type: !10)
!602 = !DILocation(line: 45, column: 22, scope: !597)
!603 = !DILocation(line: 46, column: 5, scope: !597)
!604 = !DILocation(line: 47, column: 5, scope: !597)
!605 = distinct !DISubprogram(name: "timeout", scope: !35, file: !35, line: 50, type: !606, scopeLine: 50, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !4)
!606 = !DISubroutineType(types: !607)
!607 = !{null}
!608 = !DILocation(line: 51, column: 5, scope: !605)
!609 = distinct !DISubprogram(name: "main", scope: !35, file: !35, line: 56, type: !610, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!23, !23, !89}
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !636, !647, !648, !649, !650, !651, !668, !678, !690, !691, !695, !697}
!613 = !DILocalVariable(name: "argc", arg: 1, scope: !609, file: !35, line: 56, type: !23)
!614 = !DILocalVariable(name: "argv", arg: 2, scope: !609, file: !35, line: 56, type: !89)
!615 = !DILocalVariable(name: "sock", scope: !609, file: !35, line: 57, type: !23)
!616 = !DILocalVariable(name: "preference", scope: !609, file: !35, line: 57, type: !23)
!617 = !DILocalVariable(name: "len_inet", scope: !609, file: !35, line: 58, type: !23)
!618 = !DILocalVariable(name: "length", scope: !609, file: !35, line: 58, type: !23)
!619 = !DILocalVariable(name: "place", scope: !609, file: !35, line: 58, type: !23)
!620 = !DILocalVariable(name: "result", scope: !609, file: !35, line: 58, type: !23)
!621 = !DILocalVariable(name: "soa_count", scope: !609, file: !35, line: 59, type: !23)
!622 = !DILocalVariable(name: "zone_server", scope: !609, file: !35, line: 60, type: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !76, line: 239, size: 128, elements: !624)
!624 = !{!625, !626, !628, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !623, file: !76, line: 241, baseType: !83, size: 16)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !623, file: !76, line: 242, baseType: !627, size: 16, offset: 16)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !76, line: 119, baseType: !479)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !623, file: !76, line: 243, baseType: !629, size: 32, offset: 32)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !76, line: 31, size: 32, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !629, file: !76, line: 33, baseType: !75, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !623, file: !76, line: 246, baseType: !633, size: 64, offset: 64)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 8)
!636 = !DILocalVariable(name: "send", scope: !609, file: !35, line: 61, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "js_string", file: !580, line: 28, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 19, size: 256, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !639, file: !580, line: 20, baseType: !107, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "unit_size", scope: !639, file: !580, line: 21, baseType: !39, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "unit_count", scope: !639, file: !580, line: 22, baseType: !39, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !639, file: !580, line: 23, baseType: !39, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !639, file: !580, line: 25, baseType: !23, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "is_good", scope: !639, file: !580, line: 26, baseType: !23, size: 32, offset: 192)
!647 = !DILocalVariable(name: "zone", scope: !609, file: !35, line: 61, type: !637)
!648 = !DILocalVariable(name: "get", scope: !609, file: !35, line: 61, type: !637)
!649 = !DILocalVariable(name: "expand", scope: !609, file: !35, line: 61, type: !637)
!650 = !DILocalVariable(name: "mxexpand", scope: !609, file: !35, line: 61, type: !637)
!651 = !DILocalVariable(name: "header", scope: !609, file: !35, line: 63, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "q_header", file: !569, line: 253, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 239, size: 352, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !653, file: !569, line: 240, baseType: !479, size: 16)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !653, file: !569, line: 241, baseType: !23, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !653, file: !569, line: 242, baseType: !23, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !653, file: !569, line: 243, baseType: !23, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !653, file: !569, line: 244, baseType: !23, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !653, file: !569, line: 245, baseType: !23, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !653, file: !569, line: 246, baseType: !23, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !653, file: !569, line: 247, baseType: !23, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !653, file: !569, line: 248, baseType: !23, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "qdcount", scope: !653, file: !569, line: 249, baseType: !479, size: 16, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ancount", scope: !653, file: !569, line: 250, baseType: !479, size: 16, offset: 304)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nscount", scope: !653, file: !569, line: 251, baseType: !479, size: 16, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "arcount", scope: !653, file: !569, line: 252, baseType: !479, size: 16, offset: 336)
!668 = !DILocalVariable(name: "rr", scope: !609, file: !35, line: 64, type: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "q_rr", file: !569, line: 270, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 263, size: 256, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !670, file: !569, line: 264, baseType: !637, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !569, line: 265, baseType: !479, size: 16, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !670, file: !569, line: 266, baseType: !479, size: 16, offset: 80)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !670, file: !569, line: 267, baseType: !77, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rdlength", scope: !670, file: !569, line: 268, baseType: !479, size: 16, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rdata", scope: !670, file: !569, line: 269, baseType: !637, size: 64, offset: 192)
!678 = !DILocalVariable(name: "soa", scope: !609, file: !35, line: 65, type: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "rr_soa", file: !569, line: 421, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 409, size: 320, elements: !681)
!681 = !{!682, !683, !684, !685, !687, !688, !689}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mname", scope: !680, file: !569, line: 410, baseType: !637, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rname", scope: !680, file: !569, line: 411, baseType: !637, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !680, file: !569, line: 412, baseType: !77, size: 32, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !680, file: !569, line: 413, baseType: !686, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !166, line: 196, baseType: !23)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !680, file: !569, line: 415, baseType: !686, size: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !680, file: !569, line: 417, baseType: !686, size: 32, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !680, file: !569, line: 420, baseType: !77, size: 32, offset: 256)
!690 = !DILocalVariable(name: "qclass", scope: !609, file: !35, line: 66, type: !23)
!691 = !DILocalVariable(name: "len", scope: !609, file: !35, line: 68, type: !692)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 2)
!695 = !DILocalVariable(name: "__v", scope: !696, file: !35, line: 88, type: !74)
!696 = distinct !DILexicalBlock(scope: !609, file: !35, line: 88, column: 28)
!697 = !DILocalVariable(name: "__x", scope: !696, file: !35, line: 88, type: !74)
!698 = !DILocation(line: 56, column: 14, scope: !609)
!699 = !DILocation(line: 56, column: 27, scope: !609)
!700 = !DILocation(line: 59, column: 9, scope: !609)
!701 = !DILocation(line: 60, column: 5, scope: !609)
!702 = !DILocation(line: 63, column: 5, scope: !609)
!703 = !DILocation(line: 64, column: 5, scope: !609)
!704 = !DILocation(line: 65, column: 5, scope: !609)
!705 = !DILocation(line: 66, column: 9, scope: !609)
!706 = !DILocation(line: 68, column: 5, scope: !609)
!707 = !DILocation(line: 68, column: 19, scope: !609)
!708 = !DILocation(line: 70, column: 34, scope: !709)
!709 = distinct !DILexicalBlock(scope: !609, file: !35, line: 70, column: 8)
!710 = !{!711, !711, i64 0}
!711 = !{!"any pointer", !712, i64 0}
!712 = !{!"omnipotent char", !713, i64 0}
!713 = !{!"Simple C/C++ TBAA"}
!714 = !DILocation(line: 70, column: 42, scope: !709)
!715 = !DILocation(line: 70, column: 47, scope: !709)
!716 = !DILocation(line: 70, column: 50, scope: !709)
!717 = !DILocation(line: 70, column: 58, scope: !709)
!718 = !DILocation(line: 70, column: 8, scope: !609)
!719 = !DILocation(line: 71, column: 9, scope: !720)
!720 = distinct !DILexicalBlock(scope: !709, file: !35, line: 70, column: 64)
!721 = !DILocation(line: 73, column: 13, scope: !722)
!722 = distinct !DILexicalBlock(scope: !609, file: !35, line: 73, column: 8)
!723 = !DILocation(line: 73, column: 18, scope: !722)
!724 = !DILocation(line: 73, column: 21, scope: !722)
!725 = !DILocation(line: 73, column: 29, scope: !722)
!726 = !DILocation(line: 73, column: 8, scope: !609)
!727 = !DILocation(line: 74, column: 9, scope: !728)
!728 = distinct !DILexicalBlock(scope: !722, file: !35, line: 73, column: 35)
!729 = !DILocalVariable(name: "__nptr", arg: 1, scope: !730, file: !731, line: 239, type: !734)
!730 = distinct !DISubprogram(name: "atoi", scope: !731, file: !731, line: 239, type: !732, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !736)
!731 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!732 = !DISubroutineType(types: !733)
!733 = !{!23, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!736 = !{!729}
!737 = !DILocation(line: 239, column: 1, scope: !730, inlinedAt: !738)
!738 = distinct !DILocation(line: 78, column: 21, scope: !739)
!739 = distinct !DILexicalBlock(scope: !609, file: !35, line: 78, column: 8)
!740 = !DILocation(line: 241, column: 16, scope: !730, inlinedAt: !738)
!741 = !DILocation(line: 241, column: 10, scope: !730, inlinedAt: !738)
!742 = !DILocation(line: 78, column: 35, scope: !739)
!743 = !DILocation(line: 78, column: 8, scope: !609)
!744 = !DILocation(line: 0, scope: !609)
!745 = !DILocation(line: 82, column: 5, scope: !609)
!746 = !DILocation(line: 83, column: 5, scope: !609)
!747 = !DILocation(line: 86, column: 5, scope: !609)
!748 = !DILocation(line: 87, column: 17, scope: !609)
!749 = !DILocation(line: 87, column: 28, scope: !609)
!750 = !{!751, !752, i64 0}
!751 = !{!"sockaddr_in", !752, i64 0, !752, i64 2, !753, i64 4, !712, i64 8}
!752 = !{!"short", !712, i64 0}
!753 = !{!"in_addr", !754, i64 0}
!754 = !{!"int", !712, i64 0}
!755 = !DILocation(line: 88, column: 17, scope: !609)
!756 = !DILocation(line: 88, column: 26, scope: !609)
!757 = !{!751, !752, i64 2}
!758 = !DILocation(line: 89, column: 45, scope: !609)
!759 = !DILocation(line: 89, column: 35, scope: !609)
!760 = !DILocation(line: 89, column: 26, scope: !609)
!761 = !DILocation(line: 89, column: 33, scope: !609)
!762 = !{!751, !754, i64 4}
!763 = !DILocation(line: 91, column: 36, scope: !764)
!764 = distinct !DILexicalBlock(scope: !609, file: !35, line: 91, column: 8)
!765 = !DILocation(line: 91, column: 8, scope: !609)
!766 = !DILocation(line: 92, column: 9, scope: !764)
!767 = !DILocation(line: 58, column: 9, scope: !609)
!768 = !DILocation(line: 97, column: 12, scope: !609)
!769 = !DILocation(line: 57, column: 9, scope: !609)
!770 = !DILocation(line: 98, column: 13, scope: !771)
!771 = distinct !DILexicalBlock(scope: !609, file: !35, line: 98, column: 8)
!772 = !DILocation(line: 98, column: 8, scope: !609)
!773 = !DILocation(line: 99, column: 9, scope: !771)
!774 = !DILocation(line: 102, column: 21, scope: !775)
!775 = distinct !DILexicalBlock(scope: !609, file: !35, line: 102, column: 8)
!776 = !DILocation(line: 102, column: 8, scope: !775)
!777 = !DILocation(line: 102, column: 63, scope: !775)
!778 = !DILocation(line: 102, column: 8, scope: !609)
!779 = !DILocation(line: 103, column: 9, scope: !775)
!780 = !DILocation(line: 106, column: 16, scope: !781)
!781 = distinct !DILexicalBlock(scope: !609, file: !35, line: 106, column: 8)
!782 = !DILocation(line: 61, column: 16, scope: !609)
!783 = !DILocation(line: 106, column: 34, scope: !781)
!784 = !DILocation(line: 106, column: 8, scope: !609)
!785 = !DILocation(line: 107, column: 9, scope: !781)
!786 = !DILocation(line: 110, column: 12, scope: !609)
!787 = !DILocation(line: 110, column: 15, scope: !609)
!788 = !{!789, !752, i64 0}
!789 = !{!"", !752, i64 0, !754, i64 4, !754, i64 8, !754, i64 12, !754, i64 16, !754, i64 20, !754, i64 24, !754, i64 28, !754, i64 32, !752, i64 36, !752, i64 38, !752, i64 40, !752, i64 42}
!790 = !DILocation(line: 111, column: 12, scope: !609)
!791 = !DILocation(line: 118, column: 12, scope: !609)
!792 = !DILocation(line: 119, column: 12, scope: !609)
!793 = !DILocation(line: 119, column: 20, scope: !609)
!794 = !DILocation(line: 112, column: 19, scope: !609)
!795 = !{!789, !752, i64 36}
!796 = !DILocation(line: 120, column: 12, scope: !609)
!797 = !DILocation(line: 120, column: 20, scope: !609)
!798 = !{!789, !752, i64 38}
!799 = !DILocation(line: 121, column: 12, scope: !609)
!800 = !DILocation(line: 121, column: 20, scope: !609)
!801 = !{!789, !752, i64 40}
!802 = !DILocation(line: 122, column: 12, scope: !609)
!803 = !DILocation(line: 122, column: 20, scope: !609)
!804 = !{!789, !752, i64 42}
!805 = !DILocation(line: 63, column: 14, scope: !609)
!806 = !DILocation(line: 124, column: 8, scope: !807)
!807 = distinct !DILexicalBlock(scope: !609, file: !35, line: 124, column: 8)
!808 = !DILocation(line: 124, column: 31, scope: !807)
!809 = !DILocation(line: 124, column: 8, scope: !609)
!810 = !DILocation(line: 125, column: 9, scope: !807)
!811 = !DILocation(line: 127, column: 16, scope: !812)
!812 = distinct !DILexicalBlock(scope: !609, file: !35, line: 127, column: 8)
!813 = !DILocation(line: 61, column: 23, scope: !609)
!814 = !DILocation(line: 127, column: 34, scope: !812)
!815 = !DILocation(line: 127, column: 8, scope: !609)
!816 = !DILocation(line: 128, column: 9, scope: !812)
!817 = !DILocation(line: 130, column: 8, scope: !818)
!818 = distinct !DILexicalBlock(scope: !609, file: !35, line: 130, column: 8)
!819 = !DILocation(line: 130, column: 29, scope: !818)
!820 = !DILocation(line: 130, column: 8, scope: !609)
!821 = !DILocation(line: 131, column: 9, scope: !818)
!822 = !DILocation(line: 133, column: 19, scope: !823)
!823 = distinct !DILexicalBlock(scope: !609, file: !35, line: 133, column: 8)
!824 = !DILocation(line: 133, column: 8, scope: !823)
!825 = !DILocation(line: 133, column: 33, scope: !823)
!826 = !DILocation(line: 133, column: 8, scope: !609)
!827 = !DILocation(line: 134, column: 9, scope: !823)
!828 = !DILocation(line: 137, column: 16, scope: !829)
!829 = distinct !DILexicalBlock(scope: !609, file: !35, line: 137, column: 8)
!830 = !{!831, !711, i64 0}
!831 = !{!"", !711, i64 0, !754, i64 8, !754, i64 12, !754, i64 16, !754, i64 20, !754, i64 24}
!832 = !DILocation(line: 137, column: 31, scope: !829)
!833 = !{!831, !754, i64 12}
!834 = !DILocation(line: 137, column: 23, scope: !829)
!835 = !DILocation(line: 137, column: 42, scope: !829)
!836 = !DILocation(line: 137, column: 8, scope: !829)
!837 = !{!712, !712, i64 0}
!838 = !DILocation(line: 137, column: 47, scope: !829)
!839 = !DILocation(line: 137, column: 8, scope: !609)
!840 = !DILocation(line: 138, column: 12, scope: !841)
!841 = distinct !DILexicalBlock(scope: !829, file: !35, line: 138, column: 12)
!842 = !DILocation(line: 138, column: 33, scope: !841)
!843 = !DILocation(line: 138, column: 12, scope: !829)
!844 = !DILocation(line: 139, column: 13, scope: !841)
!845 = !DILocation(line: 142, column: 8, scope: !846)
!846 = distinct !DILexicalBlock(scope: !609, file: !35, line: 142, column: 8)
!847 = !DILocation(line: 142, column: 29, scope: !846)
!848 = !DILocation(line: 142, column: 8, scope: !609)
!849 = !DILocation(line: 143, column: 9, scope: !846)
!850 = !DILocation(line: 146, column: 8, scope: !851)
!851 = distinct !DILexicalBlock(scope: !609, file: !35, line: 146, column: 8)
!852 = !DILocation(line: 146, column: 29, scope: !851)
!853 = !DILocation(line: 146, column: 8, scope: !609)
!854 = !DILocation(line: 147, column: 9, scope: !851)
!855 = !DILocation(line: 150, column: 8, scope: !856)
!856 = distinct !DILexicalBlock(scope: !609, file: !35, line: 150, column: 8)
!857 = !DILocation(line: 150, column: 31, scope: !856)
!858 = !DILocation(line: 150, column: 8, scope: !609)
!859 = !DILocation(line: 151, column: 9, scope: !856)
!860 = !DILocation(line: 152, column: 8, scope: !861)
!861 = distinct !DILexicalBlock(scope: !609, file: !35, line: 152, column: 8)
!862 = !DILocation(line: 152, column: 34, scope: !861)
!863 = !DILocation(line: 152, column: 8, scope: !609)
!864 = !DILocation(line: 153, column: 9, scope: !861)
!865 = !DILocation(line: 156, column: 21, scope: !609)
!866 = !DILocation(line: 156, column: 42, scope: !609)
!867 = !DILocation(line: 156, column: 14, scope: !609)
!868 = !DILocation(line: 156, column: 12, scope: !609)
!869 = !DILocation(line: 157, column: 14, scope: !609)
!870 = !DILocation(line: 157, column: 5, scope: !609)
!871 = !DILocation(line: 157, column: 12, scope: !609)
!872 = !DILocation(line: 158, column: 8, scope: !873)
!873 = distinct !DILexicalBlock(scope: !609, file: !35, line: 158, column: 8)
!874 = !DILocation(line: 158, column: 26, scope: !873)
!875 = !DILocation(line: 158, column: 8, scope: !609)
!876 = !DILocation(line: 159, column: 9, scope: !873)
!877 = !DILocation(line: 160, column: 25, scope: !878)
!878 = distinct !DILexicalBlock(scope: !609, file: !35, line: 160, column: 8)
!879 = !DILocation(line: 160, column: 38, scope: !878)
!880 = !DILocation(line: 160, column: 32, scope: !878)
!881 = !DILocation(line: 160, column: 8, scope: !878)
!882 = !DILocation(line: 160, column: 50, scope: !878)
!883 = !DILocation(line: 160, column: 8, scope: !609)
!884 = !DILocation(line: 161, column: 9, scope: !878)
!885 = !DILocation(line: 163, column: 19, scope: !886)
!886 = distinct !DILexicalBlock(scope: !609, file: !35, line: 163, column: 8)
!887 = !DILocation(line: 163, column: 12, scope: !886)
!888 = !DILocation(line: 163, column: 17, scope: !886)
!889 = !{!890, !711, i64 0}
!890 = !{!"", !711, i64 0, !752, i64 8, !752, i64 10, !754, i64 12, !752, i64 16, !711, i64 24}
!891 = !DILocation(line: 163, column: 37, scope: !886)
!892 = !DILocation(line: 163, column: 8, scope: !609)
!893 = !DILocation(line: 164, column: 9, scope: !886)
!894 = !DILocation(line: 165, column: 21, scope: !895)
!895 = distinct !DILexicalBlock(scope: !609, file: !35, line: 165, column: 8)
!896 = !DILocation(line: 165, column: 13, scope: !895)
!897 = !DILocation(line: 165, column: 19, scope: !895)
!898 = !{!899, !711, i64 0}
!899 = !{!"", !711, i64 0, !711, i64 8, !754, i64 16, !754, i64 20, !754, i64 24, !754, i64 28, !754, i64 32}
!900 = !DILocation(line: 165, column: 39, scope: !895)
!901 = !DILocation(line: 165, column: 8, scope: !609)
!902 = !DILocation(line: 166, column: 9, scope: !895)
!903 = !DILocation(line: 167, column: 21, scope: !904)
!904 = distinct !DILexicalBlock(scope: !609, file: !35, line: 167, column: 8)
!905 = !DILocation(line: 167, column: 13, scope: !904)
!906 = !DILocation(line: 167, column: 19, scope: !904)
!907 = !{!899, !711, i64 8}
!908 = !DILocation(line: 167, column: 39, scope: !904)
!909 = !DILocation(line: 167, column: 8, scope: !609)
!910 = !DILocation(line: 170, column: 11, scope: !609)
!911 = !DILocation(line: 170, column: 40, scope: !609)
!912 = !DILocation(line: 170, column: 5, scope: !609)
!913 = !DILocation(line: 168, column: 9, scope: !904)
!914 = !DILocation(line: 173, column: 20, scope: !915)
!915 = distinct !DILexicalBlock(scope: !609, file: !35, line: 170, column: 46)
!916 = !DILocation(line: 173, column: 27, scope: !915)
!917 = !DILocation(line: 173, column: 46, scope: !915)
!918 = !DILocation(line: 173, column: 43, scope: !915)
!919 = !DILocation(line: 58, column: 19, scope: !609)
!920 = !DILocation(line: 175, column: 19, scope: !921)
!921 = distinct !DILexicalBlock(scope: !915, file: !35, line: 175, column: 12)
!922 = !DILocation(line: 175, column: 12, scope: !915)
!923 = !DILocation(line: 176, column: 12, scope: !921)
!924 = !DILocation(line: 179, column: 36, scope: !925)
!925 = distinct !DILexicalBlock(scope: !915, file: !35, line: 179, column: 12)
!926 = !DILocation(line: 179, column: 19, scope: !925)
!927 = !DILocation(line: 61, column: 30, scope: !609)
!928 = !DILocation(line: 179, column: 44, scope: !925)
!929 = !DILocation(line: 179, column: 12, scope: !915)
!930 = !DILocation(line: 180, column: 13, scope: !925)
!931 = !DILocation(line: 181, column: 45, scope: !932)
!932 = distinct !DILexicalBlock(scope: !915, file: !35, line: 181, column: 12)
!933 = !DILocation(line: 181, column: 22, scope: !932)
!934 = !DILocation(line: 61, column: 36, scope: !609)
!935 = !DILocation(line: 181, column: 53, scope: !932)
!936 = !DILocation(line: 181, column: 12, scope: !915)
!937 = !DILocation(line: 182, column: 13, scope: !932)
!938 = !DILocation(line: 184, column: 37, scope: !939)
!939 = distinct !DILexicalBlock(scope: !915, file: !35, line: 184, column: 12)
!940 = !DILocation(line: 184, column: 44, scope: !939)
!941 = !DILocation(line: 184, column: 22, scope: !939)
!942 = !DILocation(line: 184, column: 65, scope: !939)
!943 = !DILocation(line: 184, column: 12, scope: !915)
!944 = !DILocation(line: 185, column: 13, scope: !939)
!945 = !DILocation(line: 187, column: 14, scope: !915)
!946 = !DILocation(line: 187, column: 25, scope: !915)
!947 = !DILocation(line: 190, column: 9, scope: !915)
!948 = !DILocation(line: 191, column: 12, scope: !949)
!949 = distinct !DILexicalBlock(scope: !915, file: !35, line: 191, column: 12)
!950 = !DILocation(line: 191, column: 40, scope: !949)
!951 = !DILocation(line: 191, column: 12, scope: !915)
!952 = !DILocation(line: 192, column: 13, scope: !953)
!953 = distinct !DILexicalBlock(scope: !949, file: !35, line: 191, column: 53)
!954 = !DILocation(line: 195, column: 12, scope: !955)
!955 = distinct !DILexicalBlock(scope: !915, file: !35, line: 195, column: 12)
!956 = !DILocation(line: 195, column: 37, scope: !955)
!957 = !DILocation(line: 195, column: 12, scope: !915)
!958 = !DILocation(line: 196, column: 13, scope: !955)
!959 = !DILocation(line: 199, column: 19, scope: !960)
!960 = distinct !DILexicalBlock(scope: !915, file: !35, line: 199, column: 12)
!961 = !{!789, !754, i64 32}
!962 = !DILocation(line: 199, column: 12, scope: !915)
!963 = !DILocation(line: 202, column: 21, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !35, line: 200, column: 34)
!965 = distinct !DILexicalBlock(scope: !960, file: !35, line: 199, column: 31)
!966 = !DILocation(line: 204, column: 21, scope: !964)
!967 = !DILocation(line: 206, column: 21, scope: !964)
!968 = !DILocation(line: 208, column: 21, scope: !964)
!969 = !DILocation(line: 210, column: 21, scope: !964)
!970 = !DILocation(line: 212, column: 21, scope: !964)
!971 = !DILocation(line: 58, column: 27, scope: !609)
!972 = !DILocation(line: 220, column: 19, scope: !973)
!973 = distinct !DILexicalBlock(scope: !915, file: !35, line: 220, column: 12)
!974 = !DILocation(line: 220, column: 27, scope: !973)
!975 = !DILocation(line: 220, column: 12, scope: !915)
!976 = !DILocation(line: 221, column: 22, scope: !977)
!977 = distinct !DILexicalBlock(scope: !973, file: !35, line: 220, column: 32)
!978 = !DILocation(line: 58, column: 34, scope: !609)
!979 = !DILocation(line: 222, column: 23, scope: !980)
!980 = distinct !DILexicalBlock(scope: !977, file: !35, line: 222, column: 16)
!981 = !DILocation(line: 222, column: 16, scope: !977)
!982 = !DILocation(line: 223, column: 17, scope: !980)
!983 = !DILocation(line: 225, column: 19, scope: !977)
!984 = !DILocation(line: 226, column: 27, scope: !977)
!985 = !DILocation(line: 227, column: 13, scope: !977)
!986 = !DILocation(line: 0, scope: !915)
!987 = !DILocation(line: 231, column: 22, scope: !915)
!988 = !DILocation(line: 231, column: 30, scope: !915)
!989 = !DILocation(line: 231, column: 9, scope: !915)
!990 = !DILocation(line: 64, column: 10, scope: !609)
!991 = !DILocation(line: 232, column: 22, scope: !992)
!992 = distinct !DILexicalBlock(scope: !915, file: !35, line: 231, column: 35)
!993 = !DILocation(line: 233, column: 23, scope: !994)
!994 = distinct !DILexicalBlock(scope: !992, file: !35, line: 233, column: 16)
!995 = !DILocation(line: 233, column: 16, scope: !992)
!996 = !DILocation(line: 234, column: 17, scope: !994)
!997 = !DILocation(line: 235, column: 19, scope: !992)
!998 = !DILocation(line: 236, column: 13, scope: !992)
!999 = !DILocation(line: 241, column: 36, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !992, file: !35, line: 241, column: 16)
!1001 = !DILocation(line: 241, column: 42, scope: !1000)
!1002 = !DILocation(line: 241, column: 53, scope: !1000)
!1003 = !DILocation(line: 241, column: 23, scope: !1000)
!1004 = !DILocation(line: 241, column: 61, scope: !1000)
!1005 = !DILocation(line: 241, column: 16, scope: !992)
!1006 = !DILocation(line: 242, column: 17, scope: !1000)
!1007 = !DILocation(line: 243, column: 27, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !992, file: !35, line: 243, column: 16)
!1009 = !DILocation(line: 243, column: 16, scope: !1008)
!1010 = !DILocation(line: 243, column: 37, scope: !1008)
!1011 = !DILocation(line: 243, column: 16, scope: !992)
!1012 = !DILocation(line: 244, column: 17, scope: !1008)
!1013 = !DILocation(line: 245, column: 35, scope: !992)
!1014 = !{!831, !754, i64 20}
!1015 = !DILocation(line: 245, column: 18, scope: !992)
!1016 = !DILocation(line: 245, column: 27, scope: !992)
!1017 = !DILocation(line: 247, column: 16, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !992, file: !35, line: 247, column: 16)
!1019 = !DILocation(line: 0, scope: !992)
!1020 = !DILocation(line: 249, column: 31, scope: !992)
!1021 = !DILocation(line: 249, column: 39, scope: !992)
!1022 = !DILocation(line: 249, column: 58, scope: !992)
!1023 = !DILocation(line: 249, column: 50, scope: !992)
!1024 = !DILocation(line: 249, column: 13, scope: !992)
!1025 = !DILocation(line: 250, column: 17, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !992, file: !35, line: 249, column: 70)
!1027 = !DILocation(line: 251, column: 20, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1026, file: !35, line: 251, column: 20)
!1029 = !DILocation(line: 255, column: 17, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !992, file: !35, line: 254, column: 16)
!1031 = !DILocation(line: 256, column: 42, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !992, file: !35, line: 256, column: 16)
!1033 = !{!890, !752, i64 16}
!1034 = !DILocation(line: 256, column: 33, scope: !1032)
!1035 = !DILocation(line: 256, column: 52, scope: !1032)
!1036 = !DILocation(line: 256, column: 23, scope: !1032)
!1037 = !DILocation(line: 256, column: 60, scope: !1032)
!1038 = !DILocation(line: 256, column: 16, scope: !992)
!1039 = !DILocation(line: 257, column: 17, scope: !1032)
!1040 = !DILocation(line: 258, column: 46, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !992, file: !35, line: 258, column: 16)
!1042 = !DILocation(line: 258, column: 43, scope: !1041)
!1043 = !DILocation(line: 258, column: 16, scope: !1041)
!1044 = !DILocation(line: 258, column: 56, scope: !1041)
!1045 = !DILocation(line: 258, column: 16, scope: !992)
!1046 = !DILocation(line: 259, column: 17, scope: !1041)
!1047 = !DILocation(line: 260, column: 23, scope: !992)
!1048 = !{!890, !752, i64 8}
!1049 = !DILocation(line: 260, column: 13, scope: !992)
!1050 = !DILocation(line: 262, column: 30, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !992, file: !35, line: 260, column: 29)
!1052 = !DILocation(line: 263, column: 34, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1051, file: !35, line: 263, column: 24)
!1054 = !DILocation(line: 263, column: 24, scope: !1051)
!1055 = !DILocation(line: 264, column: 25, scope: !1053)
!1056 = !DILocation(line: 65, column: 12, scope: !609)
!1057 = !DILocation(line: 268, column: 24, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1051, file: !35, line: 268, column: 24)
!1059 = !DILocation(line: 268, column: 45, scope: !1058)
!1060 = !DILocation(line: 268, column: 24, scope: !1051)
!1061 = !DILocation(line: 270, column: 43, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1051, file: !35, line: 270, column: 24)
!1063 = !DILocation(line: 270, column: 24, scope: !1062)
!1064 = !DILocation(line: 270, column: 56, scope: !1062)
!1065 = !DILocation(line: 270, column: 24, scope: !1051)
!1066 = !DILocation(line: 272, column: 44, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1051, file: !35, line: 272, column: 24)
!1068 = !DILocation(line: 272, column: 24, scope: !1067)
!1069 = !DILocation(line: 272, column: 56, scope: !1067)
!1070 = !DILocation(line: 272, column: 24, scope: !1051)
!1071 = !DILocation(line: 274, column: 28, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1051, file: !35, line: 274, column: 24)
!1073 = !DILocation(line: 274, column: 35, scope: !1072)
!1074 = !DILocation(line: 274, column: 46, scope: !1072)
!1075 = !DILocation(line: 274, column: 24, scope: !1051)
!1076 = !DILocation(line: 276, column: 44, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1051, file: !35, line: 276, column: 24)
!1078 = !DILocation(line: 276, column: 24, scope: !1077)
!1079 = !DILocation(line: 276, column: 51, scope: !1077)
!1080 = !DILocation(line: 276, column: 24, scope: !1051)
!1081 = !DILocation(line: 278, column: 40, scope: !1051)
!1082 = !DILocation(line: 278, column: 21, scope: !1051)
!1083 = !DILocation(line: 279, column: 37, scope: !1051)
!1084 = !{!890, !754, i64 12}
!1085 = !DILocation(line: 279, column: 21, scope: !1051)
!1086 = !DILocation(line: 280, column: 27, scope: !1051)
!1087 = !DILocation(line: 280, column: 34, scope: !1051)
!1088 = !DILocation(line: 280, column: 42, scope: !1051)
!1089 = !DILocation(line: 281, column: 41, scope: !1051)
!1090 = !DILocation(line: 281, column: 21, scope: !1051)
!1091 = !DILocation(line: 282, column: 41, scope: !1051)
!1092 = !DILocation(line: 282, column: 21, scope: !1051)
!1093 = !DILocation(line: 283, column: 52, scope: !1051)
!1094 = !{!899, !754, i64 16}
!1095 = !DILocation(line: 283, column: 68, scope: !1051)
!1096 = !{!899, !754, i64 20}
!1097 = !DILocation(line: 284, column: 37, scope: !1051)
!1098 = !{!899, !754, i64 24}
!1099 = !DILocation(line: 284, column: 52, scope: !1051)
!1100 = !{!899, !754, i64 28}
!1101 = !DILocation(line: 285, column: 32, scope: !1051)
!1102 = !{!899, !754, i64 32}
!1103 = !DILocation(line: 283, column: 21, scope: !1051)
!1104 = !DILocation(line: 286, column: 21, scope: !1051)
!1105 = !DILocation(line: 288, column: 29, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1051, file: !35, line: 288, column: 24)
