; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rlimit = type { i64, i64 }
%struct.msghdr = type { i8*, i32, %struct.iovec*, i64, i8*, i64, i32 }
%struct.iovec = type { i8*, i64 }
%union.anon = type { %struct.sockaddr_storage }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.sockaddr = type { i16, [14 x i8] }

@.str = private unnamed_addr constant [10 x i8] c"/dev/null\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.2 = private unnamed_addr constant [18 x i8] c"VLC_ROOTWRAP_SOCK\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"SUDO_UID\00", align 1
@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [45 x i8] c"Cannot determine unprivileged user for VLC!\0A\00", align 1
@specialMalloc = external thread_local global i8, align 1

; Function Attrs: nounwind uwtable
define dso_local i32 @main(i32, i8**) #0 !dbg !100 {
  %3 = alloca [2 x i32], align 4
  %4 = alloca [21 x i8], align 16
  %5 = alloca %struct.rlimit, align 8

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !4, line: 24, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!13 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!14 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!15 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !17, line: 31, baseType: !5, size: 32, elements: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!19 = !DIEnumerator(name: "RLIMIT_CPU", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "RLIMIT_DATA", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "RLIMIT_STACK", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "RLIMIT_CORE", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7, isUnsigned: true)
!26 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "RLIMIT_AS", value: 9, isUnsigned: true)
!28 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6, isUnsigned: true)
!29 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11, isUnsigned: true)
!32 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12, isUnsigned: true)
!33 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13, isUnsigned: true)
!34 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14, isUnsigned: true)
!35 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15, isUnsigned: true)
!36 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16, isUnsigned: true)
!37 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 40, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!41 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!46 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!48 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!50 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!51 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!52 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!53 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!54 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!55 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!56 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!57 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!58 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!59 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!60 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!61 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!62 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!63 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!64 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!65 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!66 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 322, baseType: !5, size: 32, elements: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!69 = !{!70, !71}
!70 = !DIEnumerator(name: "SCM_RIGHTS", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "SCM_CREDENTIALS", value: 2, isUnsigned: true)
!72 = !{!73, !74, !75, !78, !83, !90}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 62, baseType: !77)
!76 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !68, line: 265, size: 128, elements: !80)
!80 = !{!81, !82, !84, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !79, file: !68, line: 267, baseType: !75, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !79, file: !68, line: 272, baseType: !83, size: 32, offset: 64)
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !79, file: !68, line: 273, baseType: !83, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !79, file: !68, line: 275, baseType: !86, offset: 128)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, elements: !88)
!87 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !{!89}
!89 = !DISubrange(count: -1)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!93 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!94 = !{i32 2, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{i32 1, !"wchar_size", i32 4}
!97 = !{i32 7, !"PIC Level", i32 2}
!98 = !{i32 1, !"ThinLTO", i32 0}
!99 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!100 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 183, type: !101, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!83, !83, !90}
!103 = !{!104, !105, !106, !110, !115, !118, !122, !129, !132}
!104 = !DILocalVariable(name: "argc", arg: 1, scope: !100, file: !1, line: 183, type: !83)
!105 = !DILocalVariable(name: "argv", arg: 2, scope: !100, file: !1, line: 183, type: !90)
!106 = !DILocalVariable(name: "pair", scope: !100, file: !1, line: 186, type: !107)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 2)
!110 = !DILocalVariable(name: "pid", scope: !100, file: !1, line: 193, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !112, line: 98, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !114, line: 133, baseType: !83)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!115 = !DILocalVariable(name: "null", scope: !116, file: !1, line: 201, type: !83)
!116 = distinct !DILexicalBlock(scope: !117, file: !1, line: 200, column: 9)
!117 = distinct !DILexicalBlock(scope: !100, file: !1, line: 195, column: 5)
!118 = !DILocalVariable(name: "buf", scope: !100, file: !1, line: 219, type: !119)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 168, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 21)
!122 = !DILocalVariable(name: "rlim", scope: !100, file: !1, line: 225, type: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !17, line: 139, size: 128, elements: !124)
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !123, file: !17, line: 142, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !17, line: 133, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim64_t", file: !114, line: 137, baseType: !77)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !123, file: !17, line: 144, baseType: !126, size: 64, offset: 64)
!129 = !DILocalVariable(name: "uid", scope: !100, file: !1, line: 230, type: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !112, line: 80, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !114, line: 125, baseType: !5)
!132 = !DILocalVariable(name: "sudo", scope: !133, file: !1, line: 233, type: !135)
!133 = distinct !DILexicalBlock(scope: !134, file: !1, line: 232, column: 5)
!134 = distinct !DILexicalBlock(scope: !100, file: !1, line: 231, column: 9)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!137 = !DILocation(line: 183, column: 15, scope: !100)
!138 = !DILocation(line: 183, column: 27, scope: !100)
!139 = !DILocation(line: 186, column: 5, scope: !100)
!140 = !DILocation(line: 186, column: 9, scope: !100)
!141 = !DILocation(line: 188, column: 47, scope: !142)
!142 = distinct !DILexicalBlock(scope: !100, file: !1, line: 188, column: 9)
!143 = !DILocation(line: 188, column: 9, scope: !142)
!144 = !DILocation(line: 188, column: 9, scope: !100)
!145 = !DILocation(line: 190, column: 9, scope: !146)
!146 = distinct !DILexicalBlock(scope: !100, file: !1, line: 190, column: 9)
!147 = !{!148, !148, i64 0}
!148 = !{!"int", !149, i64 0}
!149 = !{!"omnipotent char", !150, i64 0}
!150 = !{!"Simple C/C++ TBAA"}
!151 = !DILocation(line: 190, column: 17, scope: !146)
!152 = !DILocation(line: 190, column: 9, scope: !100)
!153 = !DILocation(line: 193, column: 17, scope: !100)
!154 = !DILocation(line: 193, column: 11, scope: !100)
!155 = !DILocation(line: 194, column: 5, scope: !100)
!156 = !DILocation(line: 201, column: 24, scope: !116)
!157 = !DILocation(line: 201, column: 17, scope: !116)
!158 = !DILocation(line: 202, column: 22, scope: !159)
!159 = distinct !DILexicalBlock(scope: !116, file: !1, line: 202, column: 17)
!160 = !DILocation(line: 202, column: 17, scope: !116)
!161 = !DILocation(line: 204, column: 17, scope: !162)
!162 = distinct !DILexicalBlock(scope: !159, file: !1, line: 203, column: 13)
!163 = !DILocation(line: 205, column: 17, scope: !162)
!164 = !DILocation(line: 206, column: 17, scope: !162)
!165 = !DILocation(line: 207, column: 17, scope: !162)
!166 = !DILocation(line: 208, column: 13, scope: !162)
!167 = !DILocation(line: 209, column: 20, scope: !116)
!168 = !DILocation(line: 209, column: 13, scope: !116)
!169 = !DILocation(line: 210, column: 13, scope: !116)
!170 = !DILocation(line: 211, column: 26, scope: !116)
!171 = !DILocation(line: 211, column: 13, scope: !116)
!172 = !DILocation(line: 212, column: 13, scope: !116)
!173 = !DILocation(line: 216, column: 12, scope: !100)
!174 = !DILocation(line: 216, column: 5, scope: !100)
!175 = !DILocation(line: 217, column: 13, scope: !100)
!176 = !DILocation(line: 219, column: 10, scope: !100)
!177 = !DILocation(line: 220, column: 5, scope: !100)
!178 = !DILocation(line: 221, column: 5, scope: !100)
!179 = !DILocation(line: 226, column: 37, scope: !100)
!180 = !DILocation(line: 226, column: 71, scope: !100)
!181 = !DILocation(line: 226, column: 26, scope: !100)
!182 = !DILocation(line: 226, column: 35, scope: !100)
!183 = !{!184, !185, i64 0}
!184 = !{!"rlimit", !185, i64 0, !185, i64 8}
!185 = !{!"long", !149, i64 0}
!186 = !DILocation(line: 226, column: 10, scope: !100)
!187 = !DILocation(line: 226, column: 19, scope: !100)
!188 = !{!184, !185, i64 8}
!189 = !DILocation(line: 225, column: 19, scope: !100)
!190 = !DILocation(line: 227, column: 5, scope: !100)
!191 = !DILocation(line: 230, column: 17, scope: !100)
!192 = !DILocation(line: 230, column: 11, scope: !100)
!193 = !DILocation(line: 231, column: 13, scope: !134)
!194 = !DILocation(line: 231, column: 9, scope: !100)
!195 = !DILocation(line: 233, column: 28, scope: !133)
!196 = !DILocation(line: 233, column: 21, scope: !133)
!197 = !DILocation(line: 234, column: 13, scope: !198)
!198 = distinct !DILexicalBlock(scope: !133, file: !1, line: 234, column: 13)
!199 = !DILocation(line: 234, column: 13, scope: !133)
!200 = !DILocalVariable(name: "__nptr", arg: 1, scope: !201, file: !202, line: 239, type: !135)
!201 = distinct !DISubprogram(name: "atoi", scope: !202, file: !202, line: 239, type: !203, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !205)
!202 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!203 = !DISubroutineType(types: !204)
!204 = !{!83, !135}
!205 = !{!200}
!206 = !DILocation(line: 239, column: 1, scope: !201, inlinedAt: !207)
!207 = distinct !DILocation(line: 235, column: 19, scope: !198)
!208 = !DILocation(line: 241, column: 16, scope: !201, inlinedAt: !207)
!209 = !DILocation(line: 241, column: 10, scope: !201, inlinedAt: !207)
!210 = !DILocation(line: 237, column: 13, scope: !211)
!211 = distinct !DILexicalBlock(scope: !100, file: !1, line: 237, column: 9)
!212 = !DILocation(line: 237, column: 9, scope: !100)
!213 = !DILocation(line: 239, column: 9, scope: !214)
!214 = distinct !DILexicalBlock(scope: !211, file: !1, line: 238, column: 5)
!215 = !{!216, !216, i64 0}
!216 = !{!"any pointer", !149, i64 0}
!217 = !DILocation(line: 240, column: 9, scope: !214)
!218 = !DILocation(line: 242, column: 5, scope: !100)
!219 = !DILocation(line: 244, column: 10, scope: !220)
!220 = distinct !DILexicalBlock(scope: !100, file: !1, line: 244, column: 9)
!221 = !DILocation(line: 244, column: 9, scope: !100)
!222 = !DILocation(line: 245, column: 9, scope: !220)
!223 = !DILocation(line: 249, column: 17, scope: !224)
!224 = distinct !DILexicalBlock(scope: !100, file: !1, line: 249, column: 9)
!225 = !DILocation(line: 249, column: 9, scope: !224)
!226 = !DILocation(line: 249, column: 26, scope: !224)
!227 = !DILocation(line: 249, column: 9, scope: !100)
!228 = !DILocation(line: 251, column: 30, scope: !100)
!229 = !DILocation(line: 251, column: 5, scope: !100)
!230 = !DILocation(line: 251, column: 53, scope: !100)
!231 = !{!149, !149, i64 0}
!232 = !DILocation(line: 254, column: 17, scope: !233)
!233 = distinct !DILexicalBlock(scope: !100, file: !1, line: 254, column: 9)
!234 = !DILocation(line: 254, column: 9, scope: !233)
!235 = !DILocation(line: 254, column: 9, scope: !100)
!236 = !DILocation(line: 255, column: 17, scope: !233)
!237 = !DILocation(line: 255, column: 9, scope: !233)
!238 = !DILocation(line: 258, column: 12, scope: !100)
!239 = !DILocation(line: 258, column: 5, scope: !100)
!240 = !DILocation(line: 259, column: 9, scope: !241)
!241 = distinct !DILexicalBlock(scope: !100, file: !1, line: 259, column: 9)
!242 = !DILocation(line: 259, column: 17, scope: !241)
!243 = !DILocation(line: 259, column: 9, scope: !100)
!244 = !DILocation(line: 260, column: 9, scope: !241)
!245 = !DILocation(line: 262, column: 1, scope: !100)
!246 = distinct !DISubprogram(name: "rootprocess", scope: !1, file: !1, line: 107, type: !247, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !83}
!249 = !{!250, !251, !315, !317, !318, !319}
!250 = !DILocalVariable(name: "fd", arg: 1, scope: !246, file: !1, line: 107, type: !83)
!251 = !DILocalVariable(name: "addr", scope: !246, file: !1, line: 117, type: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !246, file: !1, line: 109, size: 1024, elements: !253)
!253 = !{!254, !264, !273, !291}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !252, file: !1, line: 111, baseType: !255, size: 128)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !68, line: 170, size: 128, elements: !256)
!256 = !{!257, !260}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !255, file: !68, line: 172, baseType: !258, size: 16)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !259, line: 28, baseType: !73)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !255, file: !68, line: 173, baseType: !261, size: 112, offset: 16)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 112, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 14)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !252, file: !1, line: 112, baseType: !265, size: 1024)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !68, line: 183, size: 1024, elements: !266)
!266 = !{!267, !268, !272}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !265, file: !68, line: 185, baseType: !258, size: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !265, file: !68, line: 186, baseType: !269, size: 944, offset: 16)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 944, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 118)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !265, file: !68, line: 187, baseType: !77, size: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !252, file: !1, line: 113, baseType: !274, size: 128)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !39, line: 239, size: 128, elements: !275)
!275 = !{!276, !277, !281, !287}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !274, file: !39, line: 241, baseType: !258, size: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !274, file: !39, line: 242, baseType: !278, size: 16, offset: 16)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !39, line: 119, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !280, line: 49, baseType: !73)
!280 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !274, file: !39, line: 243, baseType: !282, size: 32, offset: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !39, line: 31, size: 32, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !282, file: !39, line: 33, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !39, line: 30, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !280, line: 51, baseType: !5)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !274, file: !39, line: 246, baseType: !288, size: 64, offset: 64)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 64, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 8)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !252, file: !1, line: 115, baseType: !292, size: 224)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !39, line: 254, size: 224, elements: !293)
!293 = !{!294, !295, !296, !297, !314}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !292, file: !39, line: 256, baseType: !258, size: 16)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !292, file: !39, line: 257, baseType: !278, size: 16, offset: 16)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !292, file: !39, line: 258, baseType: !286, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !292, file: !39, line: 259, baseType: !298, size: 128, offset: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !39, line: 211, size: 128, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !298, file: !39, line: 220, baseType: !301, size: 128)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !39, line: 213, size: 128, elements: !302)
!302 = !{!303, !308, !310}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !301, file: !39, line: 215, baseType: !304, size: 128)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 128, elements: !306)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !280, line: 48, baseType: !87)
!306 = !{!307}
!307 = !DISubrange(count: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !301, file: !39, line: 217, baseType: !309, size: 128)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !289)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !301, file: !39, line: 218, baseType: !311, size: 128)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 4)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !292, file: !39, line: 260, baseType: !286, size: 32, offset: 192)
!315 = !DILocalVariable(name: "len", scope: !316, file: !1, line: 121, type: !5)
!316 = distinct !DILexicalBlock(scope: !246, file: !1, line: 120, column: 5)
!317 = !DILocalVariable(name: "sock", scope: !316, file: !1, line: 122, type: !83)
!318 = !DILocalVariable(name: "family", scope: !316, file: !1, line: 123, type: !83)
!319 = !DILocalVariable(name: "val", scope: !320, file: !1, line: 160, type: !322)
!320 = distinct !DILexicalBlock(scope: !321, file: !1, line: 159, column: 9)
!321 = distinct !DILexicalBlock(scope: !316, file: !1, line: 158, column: 13)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!323 = !DILocalVariable(name: "buf", scope: !324, file: !1, line: 80, type: !352)
!324 = distinct !DISubprogram(name: "send_fd", scope: !1, file: !1, line: 75, type: !325, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !327)
!325 = !DISubroutineType(types: !326)
!326 = !{!83, !83, !83}
!327 = !{!328, !329, !330, !349, !350, !323, !351}
!328 = !DILocalVariable(name: "p", arg: 1, scope: !324, file: !1, line: 75, type: !83)
!329 = !DILocalVariable(name: "fd", arg: 2, scope: !324, file: !1, line: 75, type: !83)
!330 = !DILocalVariable(name: "hdr", scope: !324, file: !1, line: 77, type: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !68, line: 247, size: 448, elements: !332)
!332 = !{!333, !334, !338, !345, !346, !347, !348}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !331, file: !68, line: 249, baseType: !74, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !331, file: !68, line: 250, baseType: !335, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !336, line: 277, baseType: !337)
!336 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !114, line: 189, baseType: !5)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !331, file: !68, line: 252, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !341, line: 43, size: 128, elements: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "")
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !340, file: !341, line: 45, baseType: !74, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !340, file: !341, line: 46, baseType: !75, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !331, file: !68, line: 253, baseType: !75, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !331, file: !68, line: 255, baseType: !74, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !331, file: !68, line: 256, baseType: !75, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !331, file: !68, line: 261, baseType: !83, size: 32, offset: 384)
!349 = !DILocalVariable(name: "iov", scope: !324, file: !1, line: 78, type: !340)
!350 = !DILocalVariable(name: "cmsg", scope: !324, file: !1, line: 79, type: !78)
!351 = !DILocalVariable(name: "val", scope: !324, file: !1, line: 81, type: !83)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 192, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 24)
!355 = !DILocation(line: 80, column: 10, scope: !324, inlinedAt: !356)
!356 = distinct !DILocation(line: 169, column: 17, scope: !357)
!357 = distinct !DILexicalBlock(scope: !358, file: !1, line: 168, column: 13)
!358 = distinct !DILexicalBlock(scope: !320, file: !1, line: 167, column: 17)
!359 = !DILocation(line: 107, column: 30, scope: !246)
!360 = !DILocation(line: 109, column: 5, scope: !246)
!361 = !DILocation(line: 67, column: 33, scope: !362, inlinedAt: !366)
!362 = distinct !DISubprogram(name: "send_err", scope: !1, file: !1, line: 67, type: !325, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !363)
!363 = !{!364, !365}
!364 = !DILocalVariable(name: "fd", arg: 1, scope: !362, file: !1, line: 67, type: !83)
!365 = !DILocalVariable(name: "err", arg: 2, scope: !362, file: !1, line: 67, type: !83)
!366 = distinct !DILocation(line: 142, column: 25, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !1, line: 142, column: 25)
!368 = distinct !DILexicalBlock(scope: !369, file: !1, line: 141, column: 17)
!369 = distinct !DILexicalBlock(scope: !370, file: !1, line: 140, column: 21)
!370 = distinct !DILexicalBlock(scope: !316, file: !1, line: 126, column: 9)
!371 = !DILocation(line: 67, column: 33, scope: !362, inlinedAt: !372)
!372 = distinct !DILocation(line: 130, column: 25, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !1, line: 130, column: 25)
!374 = distinct !DILexicalBlock(scope: !375, file: !1, line: 129, column: 17)
!375 = distinct !DILexicalBlock(scope: !370, file: !1, line: 128, column: 21)
!376 = !DILocation(line: 67, column: 33, scope: !362, inlinedAt: !377)
!377 = distinct !DILocation(line: 152, column: 21, scope: !378)
!378 = distinct !DILexicalBlock(scope: !370, file: !1, line: 152, column: 21)
!379 = !DILocation(line: 119, column: 12, scope: !246)
!380 = !DILocation(line: 119, column: 53, scope: !246)
!381 = !DILocation(line: 119, column: 5, scope: !246)
!382 = !DILocation(line: 125, column: 25, scope: !316)
!383 = !DILocation(line: 125, column: 9, scope: !316)
!384 = !DILocation(line: 128, column: 48, scope: !375)
!385 = !DILocalVariable(name: "port", arg: 1, scope: !386, file: !1, line: 60, type: !279)
!386 = distinct !DISubprogram(name: "is_allowed_port", scope: !1, file: !1, line: 60, type: !387, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!83, !279}
!389 = !{!385, !390, !392}
!390 = !DILocalVariable(name: "__v", scope: !391, file: !1, line: 62, type: !73)
!391 = distinct !DILexicalBlock(scope: !386, file: !1, line: 62, column: 12)
!392 = !DILocalVariable(name: "__x", scope: !391, file: !1, line: 62, type: !73)
!393 = !DILocation(line: 60, column: 45, scope: !386, inlinedAt: !394)
!394 = distinct !DILocation(line: 128, column: 22, scope: !375)
!395 = !DILocation(line: 62, column: 12, scope: !391, inlinedAt: !394)
!396 = !DILocation(line: 62, column: 12, scope: !397, inlinedAt: !394)
!397 = distinct !DILexicalBlock(scope: !391, file: !1, line: 62, column: 12)
!398 = !{i32 -2146566602}
!399 = !DILocation(line: 63, column: 25, scope: !386, inlinedAt: !394)
!400 = !DILocation(line: 67, column: 41, scope: !362, inlinedAt: !372)
!401 = !DILocation(line: 69, column: 12, scope: !362, inlinedAt: !372)
!402 = !DILocation(line: 69, column: 45, scope: !362, inlinedAt: !372)
