; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.anon = type { %union.pthread_mutex_t, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.__sigset_t = type { [16 x i64] }
%struct.libvlc_instance_t = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }

@.str = private unnamed_addr constant [19 x i8] c"DESKTOP_STARTUP_ID\00", align 1
@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [215 x i8] c"VLC is not supposed to be run as root. Sorry.\0AIf you need to use real-time priorities and/or privileged TCP ports\0Ayou can use %s-wrapper (make sure it is Set-UID root and\0Acannot be run by non-trusted users first).\0A\00", align 1

!29 = distinct !DISubprogram(name: "setenv", scope: !3, file: !3, line: 133, type: !30, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !34)
!30 = !DISubroutineType(types: !31)
!31 = !{!11, !32, !32, !11}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!34 = !{!35, !36, !37, !38}
!35 = !DILocalVariable(name: "name", arg: 1, scope: !29, file: !3, line: 133, type: !32)
!36 = !DILocalVariable(name: "value", arg: 2, scope: !29, file: !3, line: 133, type: !32)
!37 = !DILocalVariable(name: "overwrite", arg: 3, scope: !29, file: !3, line: 133, type: !11)
!38 = !DILocalVariable(name: "sym", scope: !39, file: !3, line: 140, type: !40)
!39 = distinct !DILexicalBlock(scope: !29, file: !3, line: 140, column: 12)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "counter", scope: !43, file: !3, line: 147, type: !26, isLocal: true, isDefinition: true)
!43 = distinct !DISubprogram(name: "unsetenv", scope: !3, file: !3, line: 143, type: !44, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !46)
!44 = !DISubroutineType(types: !45)
!45 = !{!11, !32}
!46 = !{!47, !48}
!47 = !DILocalVariable(name: "name", arg: 1, scope: !43, file: !3, line: 143, type: !32)
!48 = !DILocalVariable(name: "sym", scope: !49, file: !3, line: 150, type: !50)
!49 = distinct !DILexicalBlock(scope: !43, file: !3, line: 150, column: 12)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "counter", scope: !53, file: !3, line: 171, type: !26, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "srand", scope: !3, file: !3, line: 168, type: !54, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !26}
!56 = !{!57}
!57 = !DILocalVariable(name: "seed", arg: 1, scope: !53, file: !3, line: 168, type: !26)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "counter", scope: !60, file: !3, line: 181, type: !26, isLocal: true, isDefinition: true)
!60 = distinct !DISubprogram(name: "rand", scope: !3, file: !3, line: 176, type: !61, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{!11}
!63 = !{!64}
!64 = !DILocalVariable(name: "ret", scope: !60, file: !3, line: 178, type: !11)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "counter", scope: !67, file: !3, line: 215, type: !26, isLocal: true, isDefinition: true)
!67 = distinct !DISubprogram(name: "signal", scope: !3, file: !3, line: 206, type: !68, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !70)
!68 = !DISubroutineType(types: !69)
!69 = !{!6, !11, !8}
!70 = !{!71, !72, !73}
!71 = !DILocalVariable(name: "signum", arg: 1, scope: !67, file: !3, line: 206, type: !11)
!72 = !DILocalVariable(name: "handler", arg: 2, scope: !67, file: !3, line: 206, type: !8)
!73 = !DILocalVariable(name: "sym", scope: !74, file: !3, line: 217, type: !75)
!74 = distinct !DILexicalBlock(scope: !67, file: !3, line: 217, column: 12)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!6, !11, !6}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "counter", scope: !67, file: !3, line: 219, type: !26, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "counter", scope: !82, file: !3, line: 230, type: !26, isLocal: true, isDefinition: true)
!82 = distinct !DISubprogram(name: "sigaction", scope: !3, file: !3, line: 223, type: !83, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !187)
!83 = !DISubroutineType(types: !84)
!84 = !{!11, !11, !85, !186}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !88, line: 24, size: 1216, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "")
!89 = !{!90, !171, !181, !182}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !87, file: !88, line: 35, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !87, file: !88, line: 28, size: 64, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !91, file: !88, line: 31, baseType: !6, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !91, file: !88, line: 33, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !11, !98, !12}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !100, line: 133, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 62, size: 1024, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !101, file: !100, line: 64, baseType: !11, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !101, file: !100, line: 65, baseType: !11, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !101, file: !100, line: 67, baseType: !11, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !101, file: !100, line: 132, baseType: !107, size: 896, offset: 128)
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !101, file: !100, line: 69, size: 896, elements: !108)
!108 = !{!109, !113, !121, !132, !138, !149, !160, !165}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !107, file: !100, line: 71, baseType: !110, size: 896)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 896, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 28)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !107, file: !100, line: 78, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !100, line: 74, size: 64, elements: !115)
!115 = !{!116, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !114, file: !100, line: 76, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !118, line: 133, baseType: !11)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !114, file: !100, line: 77, baseType: !120, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !118, line: 125, baseType: !26)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !107, file: !100, line: 86, baseType: !122, size: 128)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !100, line: 81, size: 128, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !122, file: !100, line: 83, baseType: !11, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !122, file: !100, line: 84, baseType: !11, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !122, file: !100, line: 85, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !100, line: 36, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !100, line: 32, size: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !128, file: !100, line: 34, baseType: !11, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !128, file: !100, line: 35, baseType: !12, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !107, file: !100, line: 94, baseType: !133, size: 128)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !100, line: 89, size: 128, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !133, file: !100, line: 91, baseType: !117, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !133, file: !100, line: 92, baseType: !120, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !133, file: !100, line: 93, baseType: !127, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !107, file: !100, line: 104, baseType: !139, size: 256)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !100, line: 97, size: 256, elements: !140)
!140 = !{!141, !142, !143, !144, !148}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !139, file: !100, line: 99, baseType: !117, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !139, file: !100, line: 100, baseType: !120, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !139, file: !100, line: 101, baseType: !11, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !139, file: !100, line: 102, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !100, line: 58, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !118, line: 135, baseType: !147)
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !139, file: !100, line: 103, baseType: !145, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !107, file: !100, line: 116, baseType: !150, size: 256)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !100, line: 107, size: 256, elements: !151)
!151 = !{!152, !153, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !150, file: !100, line: 109, baseType: !12, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !150, file: !100, line: 110, baseType: !154, size: 16, offset: 64)
!154 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !150, file: !100, line: 115, baseType: !156, size: 128, offset: 128)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !150, file: !100, line: 111, size: 128, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !156, file: !100, line: 113, baseType: !12, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !156, file: !100, line: 114, baseType: !12, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !107, file: !100, line: 123, baseType: !161, size: 128)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !100, line: 119, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !161, file: !100, line: 121, baseType: !147, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !161, file: !100, line: 122, baseType: !11, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !107, file: !100, line: 131, baseType: !166, size: 128)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !100, line: 126, size: 128, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !166, file: !100, line: 128, baseType: !12, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !166, file: !100, line: 129, baseType: !11, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !166, file: !100, line: 130, baseType: !26, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !87, file: !88, line: 43, baseType: !172, size: 1024, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !173, line: 30, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 27, size: 1024, elements: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !174, file: !173, line: 29, baseType: !177, size: 1024)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 1024, elements: !179)
!178 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !87, file: !88, line: 46, baseType: !11, size: 32, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !87, file: !88, line: 49, baseType: !183, size: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(name: "signum", arg: 1, scope: !82, file: !3, line: 223, type: !11)
!189 = !DILocalVariable(name: "act", arg: 2, scope: !82, file: !3, line: 223, type: !85)
!190 = !DILocalVariable(name: "old", arg: 3, scope: !82, file: !3, line: 223, type: !186)
!191 = !DILocalVariable(name: "sym", scope: !192, file: !3, line: 232, type: !193)
!192 = distinct !DILexicalBlock(scope: !82, file: !3, line: 232, column: 12)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!11, !11, !196, !197}
!196 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!197 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !186)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "counter", scope: !82, file: !3, line: 234, type: !26, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "counter", scope: !202, file: !3, line: 250, type: !26, isLocal: true, isDefinition: true)
!202 = distinct !DISubprogram(name: "setlocale", scope: !3, file: !3, line: 246, type: !203, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !205)
!203 = !DISubroutineType(types: !204)
!204 = !{!19, !11, !32}
!205 = !{!206, !207, !208}
!206 = !DILocalVariable(name: "cat", arg: 1, scope: !202, file: !3, line: 246, type: !11)
!207 = !DILocalVariable(name: "locale", arg: 2, scope: !202, file: !3, line: 246, type: !32)
!208 = !DILocalVariable(name: "sym", scope: !209, file: !3, line: 253, type: !210)
!209 = distinct !DILexicalBlock(scope: !202, file: !3, line: 253, column: 12)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "counter", scope: !213, file: !3, line: 271, type: !26, isLocal: true, isDefinition: true)
!213 = distinct !DISubprogram(name: "XSetErrorHandler", scope: !3, file: !3, line: 263, type: !214, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !238)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !218}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorHandler", file: !217, line: 1843, baseType: !218)
!217 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!11, !221, !224}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !217, line: 487, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !217, line: 255, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorEvent", file: !217, line: 932, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 924, size: 320, elements: !227)
!227 = !{!228, !229, !230, !233, !234, !236, !237}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !217, line: 925, baseType: !11, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !226, file: !217, line: 926, baseType: !221, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "resourceid", scope: !226, file: !217, line: 927, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !232, line: 66, baseType: !178)
!232 = !DIFile(filename: "/usr/include/X11/X.h", directory: "")
!233 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !226, file: !217, line: 928, baseType: !178, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "error_code", scope: !226, file: !217, line: 929, baseType: !235, size: 8, offset: 256)
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "request_code", scope: !226, file: !217, line: 930, baseType: !235, size: 8, offset: 264)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !226, file: !217, line: 931, baseType: !235, size: 8, offset: 272)
!238 = !{!239, !240, !243, !248}
!239 = !DILocalVariable(name: "handler", arg: 1, scope: !213, file: !3, line: 263, type: !218)
!240 = !DILocalVariable(name: "ret", scope: !241, file: !3, line: 268, type: !218)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 267, column: 5)
!242 = distinct !DILexicalBlock(scope: !213, file: !3, line: 266, column: 9)
!243 = !DILocalVariable(name: "sym", scope: !244, file: !3, line: 272, type: !245)
!244 = distinct !DILexicalBlock(scope: !241, file: !3, line: 272, column: 15)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!216, !216}
!248 = !DILocalVariable(name: "sym", scope: !249, file: !3, line: 276, type: !245)
!249 = distinct !DILexicalBlock(scope: !213, file: !3, line: 276, column: 12)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "counter", scope: !252, file: !3, line: 286, type: !26, isLocal: true, isDefinition: true)
!252 = distinct !DISubprogram(name: "XSetIOErrorHandler", scope: !3, file: !3, line: 279, type: !253, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !259)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "XIOErrorHandler", file: !217, line: 1853, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!11, !221}
!259 = !{!260, !261, !264, !269}
!260 = !DILocalVariable(name: "handler", arg: 1, scope: !252, file: !3, line: 279, type: !256)
!261 = !DILocalVariable(name: "ret", scope: !262, file: !3, line: 283, type: !256)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 282, column: 5)
!263 = distinct !DILexicalBlock(scope: !252, file: !3, line: 281, column: 9)
!264 = !DILocalVariable(name: "sym", scope: !265, file: !3, line: 287, type: !266)
!265 = distinct !DILexicalBlock(scope: !262, file: !3, line: 287, column: 15)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!255, !255}
!269 = !DILocalVariable(name: "sym", scope: !270, file: !3, line: 291, type: !266)
!270 = distinct !DILexicalBlock(scope: !252, file: !3, line: 291, column: 12)
!271 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "prng", scope: !2, file: !3, line: 166, type: !274, isLocal: true, isDefinition: true)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 162, size: 384, elements: !275)
!275 = !{!276, !303}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !274, file: !3, line: 164, baseType: !277, size: 320)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !278, line: 128, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !278, line: 90, size: 320, elements: !280)
!280 = !{!281, !298, !302}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !279, file: !278, line: 125, baseType: !282, size: 320)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !278, line: 92, size: 320, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !282, file: !278, line: 94, baseType: !11, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !282, file: !278, line: 95, baseType: !26, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !282, file: !278, line: 96, baseType: !11, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !282, file: !278, line: 98, baseType: !26, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !282, file: !278, line: 102, baseType: !11, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !282, file: !278, line: 104, baseType: !154, size: 16, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !282, file: !278, line: 105, baseType: !154, size: 16, offset: 176)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !282, file: !278, line: 106, baseType: !292, size: 128, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !278, line: 79, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !278, line: 75, size: 128, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !293, file: !278, line: 77, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !293, file: !278, line: 78, baseType: !296, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !279, file: !278, line: 126, baseType: !299, size: 320)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 320, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 40)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !279, file: !278, line: 127, baseType: !147, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !274, file: !3, line: 165, baseType: !26, size: 32, offset: 320)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "xlib_lock", scope: !2, file: !3, line: 261, type: !277, isLocal: true, isDefinition: true)
!306 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !309, nameTableKind: None)
!308 = !DIFile(filename: "vlc.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/bin")
!309 = !{!310}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "sigs", scope: !312, file: !308, line: 124, type: !342, isLocal: true, isDefinition: true)
!312 = distinct !DISubprogram(name: "main", scope: !308, file: !308, line: 63, type: !313, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !307, retainedNodes: !316)
!313 = !DISubroutineType(types: !314)
!314 = !{!11, !11, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!316 = !{!317, !318, !319, !326, !328, !329, !333, !334, !335, !340}
!317 = !DILocalVariable(name: "i_argc", arg: 1, scope: !312, file: !308, line: 63, type: !11)
!318 = !DILocalVariable(name: "ppsz_argv", arg: 2, scope: !312, file: !308, line: 63, type: !315)
!319 = !DILocalVariable(name: "set", scope: !312, file: !308, line: 135, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !321, line: 37, baseType: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "")
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !173, line: 30, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 27, size: 1024, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !323, file: !173, line: 29, baseType: !177, size: 1024)
!326 = !DILocalVariable(name: "i", scope: !327, file: !308, line: 137, type: !26)
!327 = distinct !DILexicalBlock(scope: !312, file: !308, line: 137, column: 5)
!328 = !DILocalVariable(name: "__vla_expr0", scope: !312, type: !178, flags: DIFlagArtificial)
!329 = !DILocalVariable(name: "argv", scope: !312, file: !308, line: 153, type: !330)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: !328)
!333 = !DILocalVariable(name: "argc", scope: !312, file: !308, line: 154, type: !11)
!334 = !DILocalVariable(name: "i", scope: !312, file: !308, line: 164, type: !11)
!335 = !DILocalVariable(name: "vlc", scope: !312, file: !308, line: 181, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_instance_t", file: !338, line: 44, baseType: !339)
!338 = !DIFile(filename: "../include/vlc/libvlc_structures.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/bin")
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_instance_t", file: !338, line: 44, flags: DIFlagFwdDecl)
!340 = !DILocalVariable(name: "i", scope: !341, file: !308, line: 200, type: !11)
!341 = distinct !DILexicalBlock(scope: !312, file: !308, line: 200, column: 5)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 192, elements: !344)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!344 = !{!345}
!345 = !DISubrange(count: 6)
!346 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!347 = !{i32 2, !"Dwarf Version", i32 4}
!348 = !{i32 2, !"Debug Info Version", i32 3}
!349 = !{i32 1, !"wchar_size", i32 4}
!350 = !{i32 7, !"PIC Level", i32 2}
!351 = !{i32 1, !"ThinLTO", i32 0}
!352 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!353 = !DILocation(line: 63, column: 15, scope: !312)
!354 = !DILocation(line: 63, column: 35, scope: !312)
!355 = !DILocation(line: 70, column: 5, scope: !312)
!356 = !DILocation(line: 72, column: 5, scope: !312)
!357 = !DILocation(line: 86, column: 5, scope: !312)
!358 = !DILocation(line: 90, column: 9, scope: !359)
!359 = distinct !DILexicalBlock(scope: !312, file: !308, line: 90, column: 9)
!360 = !DILocation(line: 90, column: 20, scope: !359)
!361 = !DILocation(line: 90, column: 9, scope: !312)
!362 = !DILocation(line: 92, column: 9, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !308, line: 91, column: 5)
!364 = !{!365, !365, i64 0}
!365 = !{!"any pointer", !366, i64 0}
!366 = !{!"omnipotent char", !367, i64 0}
!367 = !{!"Simple C/C++ TBAA"}
!368 = !DILocation(line: 96, column: 9, scope: !363)
!369 = !DILocation(line: 100, column: 5, scope: !312)
!370 = !DILocation(line: 104, column: 5, scope: !312)
!371 = !DILocation(line: 135, column: 5, scope: !312)
!372 = !DILocation(line: 135, column: 14, scope: !312)
!373 = !DILocation(line: 136, column: 5, scope: !312)
!374 = !DILocation(line: 137, column: 19, scope: !327)
!375 = !DILocation(line: 138, column: 9, scope: !376)
!376 = distinct !DILexicalBlock(scope: !327, file: !308, line: 137, column: 5)
!377 = !DILocation(line: 148, column: 5, scope: !312)
!378 = !DILocation(line: 149, column: 5, scope: !312)
!379 = !DILocation(line: 150, column: 5, scope: !312)
!380 = !DILocation(line: 153, column: 29, scope: !312)
!381 = !DILocation(line: 153, column: 5, scope: !312)
!382 = !DILocation(line: 0, scope: !312)
!383 = !DILocation(line: 153, column: 17, scope: !312)
!384 = !DILocation(line: 154, column: 9, scope: !312)
!385 = !DILocation(line: 156, column: 18, scope: !312)
!386 = !DILocation(line: 158, column: 20, scope: !312)
!387 = !DILocation(line: 158, column: 5, scope: !312)
!388 = !DILocation(line: 158, column: 18, scope: !312)
!389 = !DILocation(line: 161, column: 20, scope: !312)
!390 = !DILocation(line: 161, column: 5, scope: !312)
!391 = !DILocation(line: 161, column: 18, scope: !312)
!392 = !DILocation(line: 164, column: 9, scope: !312)
!393 = !DILocation(line: 173, column: 14, scope: !394)
!394 = distinct !DILexicalBlock(scope: !395, file: !308, line: 173, column: 5)
!395 = distinct !DILexicalBlock(scope: !312, file: !308, line: 173, column: 5)
!396 = !DILocation(line: 173, column: 5, scope: !395)
!397 = !DILocation(line: 174, column: 41, scope: !398)
!398 = distinct !DILexicalBlock(scope: !394, file: !308, line: 174, column: 13)
!399 = !DILocation(line: 174, column: 29, scope: !398)
!400 = !DILocation(line: 174, column: 14, scope: !398)
!401 = !DILocation(line: 174, column: 27, scope: !398)
!402 = !DILocation(line: 174, column: 56, scope: !398)
!403 = !DILocation(line: 174, column: 13, scope: !394)
!404 = !DILocation(line: 207, column: 1, scope: !312)
!405 = !DILocation(line: 174, column: 23, scope: !398)
!406 = !DILocation(line: 173, column: 25, scope: !394)
!407 = distinct !{!407, !396, !408}
!408 = !DILocation(line: 175, column: 20, scope: !395)
!409 = !DILocation(line: 176, column: 5, scope: !312)
!410 = !DILocation(line: 176, column: 16, scope: !312)
!411 = !DILocation(line: 178, column: 5, scope: !312)
!412 = !DILocation(line: 181, column: 30, scope: !312)
!413 = !DILocation(line: 181, column: 24, scope: !312)
!414 = !DILocation(line: 183, column: 13, scope: !415)
!415 = distinct !DILexicalBlock(scope: !312, file: !308, line: 183, column: 9)
!416 = !DILocation(line: 183, column: 9, scope: !312)
!417 = !DILocation(line: 185, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !415, file: !308, line: 184, column: 5)
!419 = !DILocation(line: 187, column: 13, scope: !420)
!420 = distinct !DILexicalBlock(scope: !418, file: !308, line: 187, column: 13)
!421 = !DILocation(line: 187, column: 13, scope: !418)
!422 = !DILocation(line: 188, column: 13, scope: !420)
!423 = !DILocation(line: 190, column: 9, scope: !418)
!424 = !DILocation(line: 192, column: 13, scope: !425)
!425 = distinct !DILexicalBlock(scope: !418, file: !308, line: 192, column: 13)
!426 = !DILocation(line: 192, column: 41, scope: !425)
!427 = !DILocation(line: 192, column: 13, scope: !418)
!428 = !DILocation(line: 194, column: 13, scope: !429)
!429 = distinct !DILexicalBlock(scope: !425, file: !308, line: 193, column: 9)
!430 = !DILocation(line: 195, column: 13, scope: !429)
!431 = !DILocation(line: 196, column: 9, scope: !429)
!432 = !DILocation(line: 197, column: 9, scope: !418)
!433 = !DILocation(line: 198, column: 5, scope: !418)
!434 = !DILocation(line: 201, column: 21, scope: !435)
!435 = distinct !DILexicalBlock(scope: !341, file: !308, line: 200, column: 5)
!436 = !DILocation(line: 206, column: 5, scope: !312)
!437 = !DILocation(line: 200, column: 14, scope: !341)
!438 = !DILocation(line: 201, column: 9, scope: !435)
!439 = !DILocation(line: 200, column: 32, scope: !435)
!440 = !DILocation(line: 200, column: 23, scope: !435)
!441 = !DILocation(line: 200, column: 5, scope: !341)
!442 = distinct !{!442, !441, !443}
!443 = !DILocation(line: 201, column: 28, scope: !341)
!444 = distinct !DISubprogram(name: "vlc_enable_override", scope: !3, file: !3, line: 53, type: !184, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!445 = !DILocation(line: 55, column: 14, scope: !444)
!446 = !DILocation(line: 56, column: 5, scope: !444)
!447 = !DILocation(line: 57, column: 1, scope: !444)
!448 = distinct !DISubprogram(name: "vlc_reset_override", scope: !3, file: !3, line: 48, type: !184, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!449 = !DILocation(line: 50, column: 14, scope: !448)
!450 = !DILocation(line: 51, column: 1, scope: !448)
!451 = !DILocation(line: 123, column: 19, scope: !16)
!452 = !DILocation(line: 125, column: 9, scope: !453)
!453 = distinct !DILexicalBlock(scope: !16, file: !3, line: 125, column: 9)
!454 = !DILocation(line: 125, column: 9, scope: !16)
!455 = !DILocation(line: 127, column: 9, scope: !456)
!456 = distinct !DILexicalBlock(scope: !457, file: !3, line: 127, column: 9)
!457 = distinct !DILexicalBlock(scope: !453, file: !3, line: 126, column: 5)
!458 = !DILocation(line: 128, column: 9, scope: !457)
!459 = !DILocalVariable(name: "name", arg: 1, scope: !460, file: !3, line: 93, type: !32)
!460 = distinct !DISubprogram(name: "getsym", scope: !3, file: !3, line: 93, type: !461, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{!12, !32}
!463 = !{!459, !464}
!464 = !DILocalVariable(name: "sym", scope: !460, file: !3, line: 95, type: !12)
!465 = !DILocation(line: 93, column: 34, scope: !460, inlinedAt: !466)
!466 = distinct !DILocation(line: 130, column: 12, scope: !24)
!467 = !DILocation(line: 95, column: 17, scope: !460, inlinedAt: !466)
!468 = !DILocation(line: 95, column: 11, scope: !460, inlinedAt: !466)
!469 = !DILocation(line: 96, column: 13, scope: !470, inlinedAt: !466)
!470 = distinct !DILexicalBlock(scope: !460, file: !3, line: 96, column: 9)
!471 = !DILocation(line: 96, column: 9, scope: !460, inlinedAt: !466)
!472 = !DILocation(line: 98, column: 9, scope: !473, inlinedAt: !466)
!473 = distinct !DILexicalBlock(scope: !470, file: !3, line: 97, column: 5)
!474 = !DILocation(line: 100, column: 9, scope: !473, inlinedAt: !466)
!475 = !DILocation(line: 130, column: 12, scope: !24)
!476 = !DILocation(line: 130, column: 5, scope: !16)
!477 = !DILocation(line: 0, scope: !16)
!478 = !DILocation(line: 131, column: 1, scope: !16)
!479 = distinct !DISubprogram(name: "logbug", scope: !3, file: !3, line: 83, type: !480, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !483)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482, !32, !32, !32, null}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!483 = !{!484, !485, !486, !487, !488}
!484 = !DILocalVariable(name: "pc", arg: 1, scope: !479, file: !3, line: 83, type: !482)
!485 = !DILocalVariable(name: "level", arg: 2, scope: !479, file: !3, line: 83, type: !32)
!486 = !DILocalVariable(name: "func", arg: 3, scope: !479, file: !3, line: 83, type: !32)
!487 = !DILocalVariable(name: "fmt", arg: 4, scope: !479, file: !3, line: 84, type: !32)
!488 = !DILocalVariable(name: "ap", scope: !479, file: !3, line: 86, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !490, line: 79, baseType: !491)
!490 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !492, line: 48, baseType: !493)
!492 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stdarg.h", directory: "/root/llvm")
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 86, baseType: !494)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 192, elements: !501)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 86, size: 192, elements: !496)
!496 = !{!497, !498, !499, !500}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !495, file: !3, line: 86, baseType: !26, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !495, file: !3, line: 86, baseType: !26, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !495, file: !3, line: 86, baseType: !12, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !495, file: !3, line: 86, baseType: !12, size: 64, offset: 128)
!501 = !{!502}
!502 = !DISubrange(count: 1)
!503 = !DILocation(line: 83, column: 31, scope: !479)
!504 = !DILocation(line: 83, column: 47, scope: !479)
!505 = !DILocation(line: 83, column: 66, scope: !479)
!506 = !DILocation(line: 84, column: 33, scope: !479)
!507 = !DILocation(line: 86, column: 5, scope: !479)
!508 = !DILocation(line: 86, column: 13, scope: !479)
!509 = !DILocation(line: 88, column: 5, scope: !479)
!510 = !DILocalVariable(name: "pc", arg: 1, scope: !511, file: !3, line: 59, type: !482)
!511 = distinct !DISubprogram(name: "vlogbug", scope: !3, file: !3, line: 59, type: !512, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !515)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !482, !32, !32, !32, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!515 = !{!510, !516, !517, !518, !519}
!516 = !DILocalVariable(name: "level", arg: 2, scope: !511, file: !3, line: 59, type: !32)
!517 = !DILocalVariable(name: "func", arg: 3, scope: !511, file: !3, line: 59, type: !32)
!518 = !DILocalVariable(name: "fmt", arg: 4, scope: !511, file: !3, line: 60, type: !32)
!519 = !DILocalVariable(name: "ap", arg: 5, scope: !511, file: !3, line: 60, type: !514)
!520 = !DILocation(line: 59, column: 32, scope: !511, inlinedAt: !521)
!521 = distinct !DILocation(line: 89, column: 5, scope: !479)
!522 = !DILocation(line: 59, column: 48, scope: !511, inlinedAt: !521)
!523 = !DILocation(line: 59, column: 67, scope: !511, inlinedAt: !521)
!524 = !DILocation(line: 60, column: 34, scope: !511, inlinedAt: !521)
!525 = !DILocation(line: 68, column: 16, scope: !511, inlinedAt: !521)
!526 = !DILocation(line: 68, column: 5, scope: !511, inlinedAt: !521)
!527 = !DILocation(line: 69, column: 9, scope: !528, inlinedAt: !521)
!528 = distinct !DILexicalBlock(scope: !511, file: !3, line: 69, column: 9)
!529 = !{!530, !530, i64 0}
!530 = !{!"int", !366, i64 0}
!531 = !DILocation(line: 69, column: 13, scope: !528, inlinedAt: !521)
!532 = !DILocation(line: 69, column: 9, scope: !511, inlinedAt: !521)
!533 = !DILocation(line: 60, column: 47, scope: !511, inlinedAt: !521)
!534 = !DILocation(line: 71, column: 14, scope: !535, inlinedAt: !521)
!535 = distinct !DILexicalBlock(scope: !528, file: !3, line: 70, column: 5)
!536 = !DILocation(line: 72, column: 9, scope: !535, inlinedAt: !521)
!537 = !DILocation(line: 73, column: 19, scope: !535, inlinedAt: !521)
!538 = !DILocalVariable(name: "__stream", arg: 1, scope: !539, file: !540, line: 124, type: !543)
!539 = distinct !DISubprogram(name: "vfprintf", scope: !540, file: !540, line: 124, type: !541, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !598)
!540 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio2.h", directory: "")
!541 = !DISubroutineType(types: !542)
!542 = !{!11, !543, !597, !514}
!543 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !490, line: 48, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !547, line: 241, size: 1728, elements: !548)
!547 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !569, !570, !571, !572, !574, !576, !578, !580, !583, !585, !586, !587, !588, !589, !592, !593}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !546, file: !547, line: 242, baseType: !11, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !546, file: !547, line: 247, baseType: !19, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !546, file: !547, line: 248, baseType: !19, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !546, file: !547, line: 249, baseType: !19, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !546, file: !547, line: 250, baseType: !19, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !546, file: !547, line: 251, baseType: !19, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !546, file: !547, line: 252, baseType: !19, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !546, file: !547, line: 253, baseType: !19, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !546, file: !547, line: 254, baseType: !19, size: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !546, file: !547, line: 256, baseType: !19, size: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !546, file: !547, line: 257, baseType: !19, size: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !546, file: !547, line: 258, baseType: !19, size: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !546, file: !547, line: 260, baseType: !562, size: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !547, line: 156, size: 192, elements: !564)
!564 = !{!565, !566, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !563, file: !547, line: 157, baseType: !562, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !563, file: !547, line: 158, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !563, file: !547, line: 162, baseType: !11, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !546, file: !547, line: 262, baseType: !567, size: 64, offset: 832)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !546, file: !547, line: 264, baseType: !11, size: 32, offset: 896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !546, file: !547, line: 268, baseType: !11, size: 32, offset: 928)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !546, file: !547, line: 270, baseType: !573, size: 64, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 131, baseType: !147)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !546, file: !547, line: 274, baseType: !575, size: 16, offset: 1024)
!575 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !546, file: !547, line: 275, baseType: !577, size: 8, offset: 1040)
!577 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !546, file: !547, line: 276, baseType: !579, size: 8, offset: 1048)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !501)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !546, file: !547, line: 280, baseType: !581, size: 64, offset: 1088)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !547, line: 150, baseType: null)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !546, file: !547, line: 289, baseType: !584, size: 64, offset: 1152)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !118, line: 132, baseType: !147)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !546, file: !547, line: 297, baseType: !12, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !546, file: !547, line: 298, baseType: !12, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !546, file: !547, line: 299, baseType: !12, size: 64, offset: 1344)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !546, file: !547, line: 300, baseType: !12, size: 64, offset: 1408)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !546, file: !547, line: 302, baseType: !590, size: 64, offset: 1472)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !591, line: 62, baseType: !178)
!591 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !546, file: !547, line: 303, baseType: !11, size: 32, offset: 1536)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !546, file: !547, line: 305, baseType: !594, size: 160, offset: 1568)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 20)
!597 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !32)
!598 = !{!538, !599, !600}
!599 = !DILocalVariable(name: "__fmt", arg: 2, scope: !539, file: !540, line: 125, type: !597)
!600 = !DILocalVariable(name: "__ap", arg: 3, scope: !539, file: !540, line: 125, type: !514)
!601 = !DILocation(line: 124, column: 28, scope: !539, inlinedAt: !602)
!602 = distinct !DILocation(line: 73, column: 9, scope: !535, inlinedAt: !521)
!603 = !DILocation(line: 125, column: 27, scope: !539, inlinedAt: !602)
!604 = !DILocation(line: 125, column: 45, scope: !539, inlinedAt: !602)
!605 = !DILocation(line: 127, column: 10, scope: !539, inlinedAt: !602)
!606 = !DILocation(line: 74, column: 23, scope: !535, inlinedAt: !521)
!607 = !DILocation(line: 74, column: 9, scope: !535, inlinedAt: !521)
!608 = !DILocation(line: 75, column: 17, scope: !535, inlinedAt: !521)
!609 = !DILocation(line: 75, column: 9, scope: !535, inlinedAt: !521)
!610 = !DILocation(line: 79, column: 5, scope: !535, inlinedAt: !521)
!611 = !DILocation(line: 80, column: 18, scope: !511, inlinedAt: !521)
!612 = !DILocation(line: 80, column: 5, scope: !511, inlinedAt: !521)
!613 = !DILocation(line: 90, column: 5, scope: !479)
!614 = !DILocation(line: 91, column: 1, scope: !479)
!615 = !DILocation(line: 133, column: 25, scope: !29)
!616 = !DILocation(line: 133, column: 43, scope: !29)
!617 = !DILocation(line: 133, column: 54, scope: !29)
!618 = !DILocation(line: 135, column: 9, scope: !619)
!619 = distinct !DILexicalBlock(scope: !29, file: !3, line: 135, column: 9)
!620 = !DILocation(line: 135, column: 9, scope: !29)
!621 = !DILocation(line: 137, column: 9, scope: !622)
!622 = distinct !DILexicalBlock(scope: !623, file: !3, line: 137, column: 9)
!623 = distinct !DILexicalBlock(scope: !619, file: !3, line: 136, column: 5)
!624 = !DILocation(line: 138, column: 9, scope: !623)
!625 = !DILocation(line: 93, column: 34, scope: !460, inlinedAt: !626)
!626 = distinct !DILocation(line: 140, column: 12, scope: !39)
!627 = !DILocation(line: 95, column: 17, scope: !460, inlinedAt: !626)
!628 = !DILocation(line: 95, column: 11, scope: !460, inlinedAt: !626)
!629 = !DILocation(line: 96, column: 13, scope: !470, inlinedAt: !626)
!630 = !DILocation(line: 96, column: 9, scope: !460, inlinedAt: !626)
!631 = !DILocation(line: 98, column: 9, scope: !473, inlinedAt: !626)
!632 = !DILocation(line: 100, column: 9, scope: !473, inlinedAt: !626)
!633 = !DILocation(line: 140, column: 12, scope: !39)
!634 = !DILocation(line: 140, column: 5, scope: !29)
!635 = !DILocation(line: 0, scope: !29)
!636 = !DILocation(line: 141, column: 1, scope: !29)
!637 = !DILocation(line: 143, column: 27, scope: !43)
!638 = !DILocation(line: 145, column: 9, scope: !639)
!639 = distinct !DILexicalBlock(scope: !43, file: !3, line: 145, column: 9)
!640 = !DILocation(line: 145, column: 9, scope: !43)
!641 = !DILocation(line: 147, column: 9, scope: !642)
!642 = distinct !DILexicalBlock(scope: !643, file: !3, line: 147, column: 9)
!643 = distinct !DILexicalBlock(scope: !639, file: !3, line: 146, column: 5)
!644 = !DILocation(line: 148, column: 9, scope: !643)
!645 = !DILocation(line: 93, column: 34, scope: !460, inlinedAt: !646)
!646 = distinct !DILocation(line: 150, column: 12, scope: !49)
!647 = !DILocation(line: 95, column: 17, scope: !460, inlinedAt: !646)
!648 = !DILocation(line: 95, column: 11, scope: !460, inlinedAt: !646)
!649 = !DILocation(line: 96, column: 13, scope: !470, inlinedAt: !646)
!650 = !DILocation(line: 96, column: 9, scope: !460, inlinedAt: !646)
!651 = !DILocation(line: 98, column: 9, scope: !473, inlinedAt: !646)
!652 = !DILocation(line: 100, column: 9, scope: !473, inlinedAt: !646)
!653 = !DILocation(line: 150, column: 12, scope: !49)
