; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.module_t = type opaque
%struct.module_config_t = type { i32, i8*, i8*, i8, i8*, i8*, %union.module_value_t, %union.module_value_t, %union.module_value_t, %union.module_nvalue_t, %union.module_nvalue_t, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i8*, i8**, i32*, i8**, i32, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)**, i8**, i32, i8, i8, i8, i8, i8*, i8, i8, i8, i8 }
%union.module_value_t = type { i8* }
%union.module_nvalue_t = type { i32 }
%struct.vlc_object_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t* }
%struct.libvlc_int_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.hotkey* }
%struct.hotkey = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.demux_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.module_t*, i8*, i8*, i8*, %struct.stream_t*, %struct.es_out_t*, i32 (%struct.demux_t*)*, i32 (%struct.demux_t*, i32, %struct.__va_list_tag*)*, %struct.anon.5, %struct.demux_sys_t*, %struct.input_thread_t* }

!36 = !DIEnumerator(name: "VLC_CONFIG_VOLATILE", value: 4100, isUnsigned: true)
!37 = !DIEnumerator(name: "VLC_CONFIG_PERSISTENT", value: 4101, isUnsigned: true)
!38 = !DIEnumerator(name: "VLC_CONFIG_RESTART", value: 4102, isUnsigned: true)
!39 = !DIEnumerator(name: "VLC_CONFIG_PRIVATE", value: 4103, isUnsigned: true)
!40 = !DIEnumerator(name: "VLC_CONFIG_REMOVED", value: 4104, isUnsigned: true)
!41 = !DIEnumerator(name: "VLC_CONFIG_CAPABILITY", value: 4105, isUnsigned: true)
!42 = !DIEnumerator(name: "VLC_CONFIG_SHORTCUT", value: 4106, isUnsigned: true)
!43 = !DIEnumerator(name: "VLC_CONFIG_OLDNAME", value: 4107, isUnsigned: true)
!44 = !DIEnumerator(name: "VLC_CONFIG_SAFE", value: 4108, isUnsigned: true)
!45 = !DIEnumerator(name: "VLC_CONFIG_DESC", value: 4109, isUnsigned: true)
!46 = !DIEnumerator(name: "VLC_CONFIG_LIST", value: 4110, isUnsigned: true)
!47 = !DIEnumerator(name: "VLC_CONFIG_ADD_ACTION", value: 4111, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 24, baseType: !16, size: 32, elements: !50)
!49 = !DIFile(filename: "./mpls.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "BD_MPLS_STREAM_TYPE_PLAY_ITEM", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BD_MPLS_STREAM_TYPE_SUB_PATH", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BD_MPLS_STREAM_TYPE_IN_MUX_SUB_PATH", value: 3, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "es_out_query_e", file: !55, line: 37, baseType: !16, size: 32, elements: !56)
!55 = !DIFile(filename: "../../../include/vlc_es_out.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!57 = !DIEnumerator(name: "ES_OUT_SET_ES", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "ES_OUT_RESTART_ES", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "ES_OUT_SET_ES_DEFAULT", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "ES_OUT_SET_ES_STATE", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "ES_OUT_GET_ES_STATE", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "ES_OUT_SET_GROUP", value: 5, isUnsigned: true)
!63 = !DIEnumerator(name: "ES_OUT_SET_PCR", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "ES_OUT_SET_GROUP_PCR", value: 7, isUnsigned: true)
!65 = !DIEnumerator(name: "ES_OUT_RESET_PCR", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "ES_OUT_SET_ES_FMT", value: 9, isUnsigned: true)
!67 = !DIEnumerator(name: "ES_OUT_SET_NEXT_DISPLAY_TIME", value: 10, isUnsigned: true)
!68 = !DIEnumerator(name: "ES_OUT_SET_GROUP_META", value: 11, isUnsigned: true)
!69 = !DIEnumerator(name: "ES_OUT_SET_GROUP_EPG", value: 12, isUnsigned: true)
!70 = !DIEnumerator(name: "ES_OUT_DEL_GROUP", value: 13, isUnsigned: true)
!71 = !DIEnumerator(name: "ES_OUT_SET_ES_SCRAMBLED_STATE", value: 14, isUnsigned: true)
!72 = !DIEnumerator(name: "ES_OUT_GET_EMPTY", value: 15, isUnsigned: true)
!73 = !DIEnumerator(name: "ES_OUT_SET_META", value: 16, isUnsigned: true)
!74 = !DIEnumerator(name: "ES_OUT_GET_PCR_SYSTEM", value: 17, isUnsigned: true)
!75 = !DIEnumerator(name: "ES_OUT_MODIFY_PCR_SYSTEM", value: 18, isUnsigned: true)
!76 = !DIEnumerator(name: "ES_OUT_PRIVATE_START", value: 65536, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stream_query_e", file: !78, line: 87, baseType: !16, size: 32, elements: !79)
!78 = !DIFile(filename: "../../../include/vlc_stream.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88}
!80 = !DIEnumerator(name: "STREAM_CAN_SEEK", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "STREAM_CAN_FASTSEEK", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "STREAM_SET_POSITION", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "STREAM_GET_POSITION", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "STREAM_GET_SIZE", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "STREAM_CONTROL_ACCESS", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "STREAM_UPDATE_SIZE", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "STREAM_GET_CONTENT_TYPE", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "STREAM_SET_RECORD_STATE", value: 8, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 151, baseType: !16, size: 32, elements: !90)
!90 = !{!91, !92, !93}
!91 = !DIEnumerator(name: "BD_MPLS_MARK_TYPE_RESUME", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "BD_MPLS_MARK_TYPE_BOOKMARK", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "BD_MPLS_MARK_TYPE_SKIP", value: 2, isUnsigned: true)
!94 = !{!8, !95, !96, !139, !169, !404, !617, !619, !101, !621, !622, !153, !623, !10, !624, !150, !591, !581, !592, !213, !280}
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_callback_t", file: !97, line: 490, baseType: !98)
!97 = !DIFile(filename: "../../../include/vlc_common.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!95, !101, !8, !130, !130, !139}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !97, line: 177, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !104, line: 60, size: 320, elements: !105)
!104 = !DIFile(filename: "../../../include/vlc_objects.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!105 = !{!106, !107, !108, !109, !111, !112, !129}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !103, file: !104, line: 62, baseType: !8, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !103, file: !104, line: 62, baseType: !6, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !103, file: !104, line: 62, baseType: !95, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !103, file: !104, line: 62, baseType: !110, size: 8, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !103, file: !104, line: 62, baseType: !11, size: 8, offset: 168)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !103, file: !104, line: 62, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !97, line: 178, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !116, line: 38, size: 384, elements: !117)
!116 = !DIFile(filename: "../../../include/vlc_main.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !115, file: !116, line: 40, baseType: !8, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !115, file: !116, line: 40, baseType: !6, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !115, file: !116, line: 40, baseType: !95, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !115, file: !116, line: 40, baseType: !110, size: 8, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !115, file: !116, line: 40, baseType: !11, size: 8, offset: 168)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !115, file: !116, line: 40, baseType: !113, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !115, file: !116, line: 40, baseType: !101, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !115, file: !116, line: 43, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "hotkey", file: !116, line: 31, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !103, file: !104, line: 62, baseType: !101, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_value_t", file: !97, line: 432, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !97, line: 417, size: 64, elements: !132)
!132 = !{!133, !134, !135, !137, !138, !140, !141, !151, !156, !162}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_int", scope: !131, file: !97, line: 419, baseType: !95, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b_bool", scope: !131, file: !97, line: 420, baseType: !11, size: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "f_float", scope: !131, file: !97, line: 421, baseType: !136, size: 32)
!136 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "psz_string", scope: !131, file: !97, line: 422, baseType: !6, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "p_address", scope: !131, file: !97, line: 423, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "p_object", scope: !131, file: !97, line: 424, baseType: !101, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "p_list", scope: !131, file: !97, line: 425, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_list_t", file: !97, line: 176, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_list_t", file: !97, line: 437, size: 192, elements: !145)
!145 = !{!146, !147, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !144, file: !97, line: 439, baseType: !95, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "p_values", scope: !144, file: !97, line: 440, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pi_types", scope: !144, file: !97, line: 441, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_time", scope: !131, file: !97, line: 426, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtime_t", file: !97, line: 131, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !154, line: 197, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!155 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !131, file: !97, line: 427, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !97, line: 427, size: 64, elements: !158)
!158 = !{!159, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !157, file: !97, line: 427, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !154, line: 196, baseType: !95)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !157, file: !97, line: 427, baseType: !160, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !131, file: !97, line: 430, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !167)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !165, line: 48, baseType: !166)
!165 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!166 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!167 = !{!168}
!168 = !DISubrange(count: 8)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "demux_t", file: !97, line: 224, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "demux_t", file: !172, line: 41, size: 1088, elements: !173)
!172 = !DIFile(filename: "../../../include/vlc_demux.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !185, !186, !187, !188, !259, !432, !436, !440, !446, !616}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !171, file: !172, line: 43, baseType: !8, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !171, file: !172, line: 43, baseType: !6, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !171, file: !172, line: 43, baseType: !95, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !171, file: !172, line: 43, baseType: !110, size: 8, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !171, file: !172, line: 43, baseType: !11, size: 8, offset: 168)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !171, file: !172, line: 43, baseType: !113, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !171, file: !172, line: 43, baseType: !101, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !171, file: !172, line: 46, baseType: !182, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_t", file: !97, line: 208, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_t", file: !97, line: 208, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "psz_access", scope: !171, file: !172, line: 49, baseType: !6, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "psz_demux", scope: !171, file: !172, line: 50, baseType: !6, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !171, file: !172, line: 51, baseType: !6, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !171, file: !172, line: 54, baseType: !189, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_t", file: !97, line: 222, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream_t", file: !78, line: 52, size: 1024, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !208, !215, !226, !230, !234, !238}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !191, file: !78, line: 54, baseType: !8, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !191, file: !78, line: 54, baseType: !6, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !191, file: !78, line: 54, baseType: !95, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !191, file: !78, line: 54, baseType: !110, size: 8, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !191, file: !78, line: 54, baseType: !11, size: 8, offset: 168)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !191, file: !78, line: 54, baseType: !113, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !191, file: !78, line: 54, baseType: !101, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !191, file: !78, line: 55, baseType: !11, size: 8, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !191, file: !78, line: 58, baseType: !182, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !191, file: !78, line: 61, baseType: !6, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "p_source", scope: !191, file: !78, line: 64, baseType: !189, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !191, file: !78, line: 67, baseType: !205, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!95, !189, !139, !16}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peek", scope: !191, file: !78, line: 68, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!95, !189, !212, !16}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !191, file: !78, line: 69, baseType: !216, size: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!95, !189, !95, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 153, size: 192, elements: !221)
!221 = !{!222, !223, !224, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !220, file: !3, line: 153, baseType: !16, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !220, file: !3, line: 153, baseType: !16, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !220, file: !3, line: 153, baseType: !139, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !220, file: !3, line: 153, baseType: !139, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destroy", scope: !191, file: !78, line: 72, baseType: !227, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !189}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !191, file: !78, line: 75, baseType: !231, size: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_sys_t", file: !97, line: 223, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "stream_sys_t", file: !97, line: 223, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "p_text", scope: !191, file: !78, line: 78, baseType: !235, size: 64, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_text_t", file: !78, line: 46, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "stream_text_t", file: !78, line: 46, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !191, file: !78, line: 81, baseType: !239, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_t", file: !97, line: 216, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_t", file: !242, line: 266, size: 448, elements: !243)
!242 = !DIFile(filename: "../../../include/vlc_input.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !241, file: !242, line: 268, baseType: !8, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !241, file: !242, line: 268, baseType: !6, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !241, file: !242, line: 268, baseType: !95, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !241, file: !242, line: 268, baseType: !110, size: 8, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !241, file: !242, line: 268, baseType: !11, size: 8, offset: 168)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !241, file: !242, line: 268, baseType: !113, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !241, file: !242, line: 268, baseType: !101, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !241, file: !242, line: 270, baseType: !11, size: 8, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !241, file: !242, line: 271, baseType: !11, size: 8, offset: 328)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_preparsing", scope: !241, file: !242, line: 272, baseType: !11, size: 8, offset: 336)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "b_dead", scope: !241, file: !242, line: 273, baseType: !11, size: 8, offset: 344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !241, file: !242, line: 277, baseType: !256, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_private_t", file: !242, line: 254, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_private_t", file: !242, line: 254, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !171, file: !172, line: 57, baseType: !260, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_out_t", file: !97, line: 226, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "es_out_t", file: !55, line: 96, size: 384, elements: !263)
!263 = !{!264, !387, !414, !418, !422, !426}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pf_add", scope: !262, file: !55, line: 98, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !260, !271}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_out_id_t", file: !97, line: 227, baseType: !270)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "es_out_id_t", file: !97, line: 227, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_format_t", file: !97, line: 239, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "es_format_t", file: !275, line: 228, size: 2816, elements: !276)
!275 = !DIFile(filename: "../../../include/vlc_es.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!276 = !{!277, !278, !281, !282, !283, !284, !285, !286, !287, !288, !295, !308, !320, !356, !381, !382, !383, !384, !385, !386}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_cat", scope: !274, file: !275, line: 230, baseType: !95, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_codec", scope: !274, file: !275, line: 231, baseType: !279, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_fourcc_t", file: !97, line: 138, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !165, line: 51, baseType: !16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_fourcc", scope: !274, file: !275, line: 232, baseType: !279, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !274, file: !275, line: 234, baseType: !95, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_group", scope: !274, file: !275, line: 237, baseType: !95, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_priority", scope: !274, file: !275, line: 241, baseType: !95, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !274, file: !275, line: 247, baseType: !6, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !274, file: !275, line: 248, baseType: !6, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra_languages", scope: !274, file: !275, line: 249, baseType: !95, size: 32, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra_languages", scope: !274, file: !275, line: 250, baseType: !289, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "extra_languages_t", file: !275, line: 223, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extra_languages_t", file: !275, line: 219, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !291, file: !275, line: 221, baseType: !6, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !291, file: !275, line: 222, baseType: !6, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "audio", scope: !274, file: !275, line: 252, baseType: !296, size: 288, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_format_t", file: !97, line: 236, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audio_format_t", file: !275, line: 67, size: 288, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_format", scope: !297, file: !275, line: 69, baseType: !279, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !297, file: !275, line: 70, baseType: !16, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_physical_channels", scope: !297, file: !275, line: 74, baseType: !280, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_channels", scope: !297, file: !275, line: 78, baseType: !280, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_per_frame", scope: !297, file: !275, line: 82, baseType: !16, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_length", scope: !297, file: !275, line: 85, baseType: !16, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitspersample", scope: !297, file: !275, line: 93, baseType: !16, size: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_blockalign", scope: !297, file: !275, line: 94, baseType: !16, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_channels", scope: !297, file: !275, line: 95, baseType: !164, size: 8, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "audio_replay_gain", scope: !274, file: !275, line: 253, baseType: !309, size: 192, offset: 736)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_replay_gain_t", file: !275, line: 62, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 51, size: 192, elements: !311)
!311 = !{!312, !316, !318, !319}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pb_peak", scope: !310, file: !275, line: 54, baseType: !313, size: 16)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 16, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 2)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peak", scope: !310, file: !275, line: 56, baseType: !317, size: 64, offset: 32)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !314)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pb_gain", scope: !310, file: !275, line: 59, baseType: !313, size: 16, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gain", scope: !310, file: !275, line: 61, baseType: !317, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "video", scope: !274, file: !275, line: 254, baseType: !321, size: 768, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_format_t", file: !97, line: 237, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_format_t", file: !275, line: 101, size: 768, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma", scope: !322, file: !275, line: 103, baseType: !279, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !322, file: !275, line: 105, baseType: !16, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !322, file: !275, line: 106, baseType: !16, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_offset", scope: !322, file: !275, line: 107, baseType: !16, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_offset", scope: !322, file: !275, line: 108, baseType: !16, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_width", scope: !322, file: !275, line: 109, baseType: !16, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_height", scope: !322, file: !275, line: 110, baseType: !16, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_per_pixel", scope: !322, file: !275, line: 112, baseType: !16, size: 32, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_num", scope: !322, file: !275, line: 114, baseType: !16, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_den", scope: !322, file: !275, line: 115, baseType: !16, size: 32, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate", scope: !322, file: !275, line: 117, baseType: !16, size: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate_base", scope: !322, file: !275, line: 118, baseType: !16, size: 32, offset: 352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_rmask", scope: !322, file: !275, line: 120, baseType: !280, size: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_gmask", scope: !322, file: !275, line: 120, baseType: !280, size: 32, offset: 416)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_bmask", scope: !322, file: !275, line: 120, baseType: !280, size: 32, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_rrshift", scope: !322, file: !275, line: 121, baseType: !95, size: 32, offset: 480)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_lrshift", scope: !322, file: !275, line: 121, baseType: !95, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_rgshift", scope: !322, file: !275, line: 122, baseType: !95, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_lgshift", scope: !322, file: !275, line: 122, baseType: !95, size: 32, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_rbshift", scope: !322, file: !275, line: 123, baseType: !95, size: 32, offset: 608)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_lbshift", scope: !322, file: !275, line: 123, baseType: !95, size: 32, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_palette", scope: !322, file: !275, line: 124, baseType: !346, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_palette_t", file: !97, line: 240, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_palette_t", file: !275, line: 39, size: 8224, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_entries", scope: !348, file: !275, line: 41, baseType: !95, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !348, file: !275, line: 42, baseType: !352, size: 8192, offset: 32)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 8192, elements: !353)
!353 = !{!354, !355}
!354 = !DISubrange(count: 256)
!355 = !DISubrange(count: 4)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !274, file: !275, line: 255, baseType: !357, size: 832, offset: 1728)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "subs_format_t", file: !97, line: 238, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subs_format_t", file: !275, line: 184, size: 832, elements: !359)
!359 = !{!360, !361, !362, !363, !372, !376}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "psz_encoding", scope: !358, file: !275, line: 188, baseType: !6, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_origin", scope: !358, file: !275, line: 191, baseType: !95, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_origin", scope: !358, file: !275, line: 192, baseType: !95, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "spu", scope: !358, file: !275, line: 203, baseType: !364, size: 608, offset: 128)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !275, line: 194, size: 608, elements: !365)
!365 = !{!366, !370, !371}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !364, file: !275, line: 197, baseType: !367, size: 544)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 544, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 17)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_width", scope: !364, file: !275, line: 200, baseType: !95, size: 32, offset: 544)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_height", scope: !364, file: !275, line: 202, baseType: !95, size: 32, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !358, file: !275, line: 208, baseType: !373, size: 32, offset: 736)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !275, line: 205, size: 32, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !373, file: !275, line: 207, baseType: !95, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "teletext", scope: !358, file: !275, line: 213, baseType: !377, size: 64, offset: 768)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !275, line: 209, size: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_magazine", scope: !377, file: !275, line: 211, baseType: !95, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_page", scope: !377, file: !275, line: 212, baseType: !95, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !274, file: !275, line: 257, baseType: !16, size: 32, offset: 2560)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile", scope: !274, file: !275, line: 258, baseType: !95, size: 32, offset: 2592)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_level", scope: !274, file: !275, line: 259, baseType: !95, size: 32, offset: 2624)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b_packetized", scope: !274, file: !275, line: 261, baseType: !11, size: 8, offset: 2656)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra", scope: !274, file: !275, line: 262, baseType: !95, size: 32, offset: 2688)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra", scope: !274, file: !275, line: 263, baseType: !139, size: 64, offset: 2752)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pf_send", scope: !262, file: !55, line: 99, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!95, !260, !268, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_t", file: !97, line: 330, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_t", file: !394, line: 103, size: 576, elements: !395)
!394 = !DIFile(filename: "../../../include/vlc_block.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !407, !409}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !393, file: !394, line: 105, baseType: !391, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !393, file: !394, line: 107, baseType: !280, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !393, file: !394, line: 109, baseType: !152, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !393, file: !394, line: 110, baseType: !152, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !393, file: !394, line: 111, baseType: !152, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_samples", scope: !393, file: !394, line: 113, baseType: !16, size: 32, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !393, file: !394, line: 114, baseType: !95, size: 32, offset: 352)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_buffer", scope: !393, file: !394, line: 116, baseType: !404, size: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !405, line: 62, baseType: !406)
!405 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!406 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "p_buffer", scope: !393, file: !394, line: 117, baseType: !408, size: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !393, file: !394, line: 120, baseType: !410, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_free_t", file: !394, line: 101, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !391}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pf_del", scope: !262, file: !55, line: 100, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !260, !268}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !262, file: !55, line: 101, baseType: !419, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!95, !260, !95, !219}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destroy", scope: !262, file: !55, line: 102, baseType: !423, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !260}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !262, file: !55, line: 104, baseType: !427, size: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_out_sys_t", file: !97, line: 228, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "es_out_sys_t", file: !3, line: 1250, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "p_demux", scope: !429, file: !3, line: 1252, baseType: !169, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pf_demux", scope: !171, file: !172, line: 60, baseType: !433, size: 64, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!95, !169}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !171, file: !172, line: 61, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!95, !169, !95, !219}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !171, file: !172, line: 72, baseType: !441, size: 96, offset: 832)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !172, line: 65, size: 96, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_update", scope: !441, file: !172, line: 67, baseType: !16, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_title", scope: !441, file: !172, line: 70, baseType: !95, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !441, file: !172, line: 71, baseType: !95, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !171, file: !172, line: 73, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "demux_sys_t", file: !97, line: 225, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "demux_sys_t", file: !3, line: 84, size: 1216, elements: !450)
!450 = !{!451, !452, !453, !454, !533, !534, !578, !579, !600, !601, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "psz_base", scope: !449, file: !3, line: 86, baseType: !6, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_shortname", scope: !449, file: !3, line: 87, baseType: !11, size: 8, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_mpls", scope: !449, file: !3, line: 90, baseType: !95, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pp_mpls", scope: !449, file: !3, line: 91, baseType: !455, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_mpls_t", file: !49, line: 179, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 167, size: 384, elements: !459)
!459 = !{!460, !461, !462, !514, !515, !523, !524}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !458, file: !49, line: 169, baseType: !95, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_play_item", scope: !458, file: !49, line: 171, baseType: !95, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "p_play_item", scope: !458, file: !49, line: 172, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_mpls_play_item_t", file: !49, line: 126, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 104, size: 576, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !478, !479, !481, !482, !483, !484}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_connection", scope: !465, file: !49, line: 106, baseType: !95, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_in_time", scope: !465, file: !49, line: 107, baseType: !153, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_out_time", scope: !465, file: !49, line: 108, baseType: !153, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_still", scope: !465, file: !49, line: 109, baseType: !95, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_still_time", scope: !465, file: !49, line: 110, baseType: !95, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "clpi", scope: !465, file: !49, line: 113, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_mpls_clpi_t", file: !49, line: 102, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 98, size: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !474, file: !49, line: 100, baseType: !95, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_stc_id", scope: !474, file: !49, line: 101, baseType: !95, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_clpi", scope: !465, file: !49, line: 116, baseType: !95, size: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "p_clpi", scope: !465, file: !49, line: 117, baseType: !480, size: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_angle_different_audio", scope: !465, file: !49, line: 118, baseType: !11, size: 8, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_angle_seamless", scope: !465, file: !49, line: 119, baseType: !11, size: 8, offset: 456)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_stream", scope: !465, file: !49, line: 123, baseType: !95, size: 32, offset: 480)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "p_stream", scope: !465, file: !49, line: 124, baseType: !485, size: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_mpls_stream_t", file: !49, line: 80, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 52, size: 256, elements: !488)
!488 = !{!489, !490, !491, !509, !510, !513}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !487, file: !49, line: 55, baseType: !95, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_class", scope: !487, file: !49, line: 56, baseType: !95, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, scope: !487, file: !49, line: 57, baseType: !492, size: 96, offset: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !487, file: !49, line: 57, size: 96, elements: !493)
!493 = !{!494, !498, !504}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "play_item", scope: !492, file: !49, line: 62, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !492, file: !49, line: 59, size: 32, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_pid", scope: !495, file: !49, line: 61, baseType: !95, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sub_path", scope: !492, file: !49, line: 68, baseType: !499, size: 96)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !492, file: !49, line: 63, size: 96, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_path_id", scope: !499, file: !49, line: 65, baseType: !95, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_clip_id", scope: !499, file: !49, line: 66, baseType: !95, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_pid", scope: !499, file: !49, line: 67, baseType: !95, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "in_mux_sub_path", scope: !492, file: !49, line: 73, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !492, file: !49, line: 69, size: 64, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_path_id", scope: !505, file: !49, line: 71, baseType: !95, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_pid", scope: !505, file: !49, line: 72, baseType: !95, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_stream_type", scope: !487, file: !49, line: 77, baseType: !95, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !487, file: !49, line: 78, baseType: !511, size: 32, offset: 192)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !512)
!512 = !{!355}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_charset", scope: !487, file: !49, line: 79, baseType: !95, size: 32, offset: 224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_path", scope: !458, file: !49, line: 174, baseType: !95, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "p_sub_path", scope: !458, file: !49, line: 175, baseType: !516, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_mpls_sub_path_t", file: !49, line: 148, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 139, size: 96, elements: !519)
!519 = !{!520, !521, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !518, file: !49, line: 141, baseType: !95, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat", scope: !518, file: !49, line: 142, baseType: !11, size: 8, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_item", scope: !518, file: !49, line: 144, baseType: !95, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_mark", scope: !458, file: !49, line: 177, baseType: !95, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "p_mark", scope: !458, file: !49, line: 178, baseType: !525, size: 64, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_mpls_mark_t", file: !49, line: 164, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 158, size: 192, elements: !528)
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !527, file: !49, line: 160, baseType: !95, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_play_item_id", scope: !527, file: !49, line: 161, baseType: !95, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_time", scope: !527, file: !49, line: 162, baseType: !153, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_entry_es_pid", scope: !527, file: !49, line: 163, baseType: !95, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_clpi", scope: !449, file: !3, line: 94, baseType: !95, size: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pp_clpi", scope: !449, file: !3, line: 95, baseType: !535, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_clpi_t", file: !538, line: 72, baseType: !539)
!538 = !DIFile(filename: "./clpi.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 59, size: 384, elements: !540)
!540 = !{!541, !542, !543, !552, !553, !554, !561, !562}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !539, file: !538, line: 61, baseType: !95, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_stc", scope: !539, file: !538, line: 63, baseType: !95, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "p_stc", scope: !539, file: !538, line: 64, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_clpi_stc_t", file: !538, line: 30, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 24, size: 256, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_pcr_pid", scope: !546, file: !538, line: 26, baseType: !95, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet", scope: !546, file: !538, line: 27, baseType: !153, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !546, file: !538, line: 28, baseType: !153, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !546, file: !538, line: 29, baseType: !153, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_pmt_pid", scope: !539, file: !538, line: 66, baseType: !95, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_stream", scope: !539, file: !538, line: 67, baseType: !95, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "p_stream", scope: !539, file: !538, line: 68, baseType: !555, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_clpi_stream_t", file: !538, line: 37, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 33, size: 64, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_pid", scope: !557, file: !538, line: 35, baseType: !95, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !557, file: !538, line: 36, baseType: !95, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_ep_map", scope: !539, file: !538, line: 70, baseType: !95, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "p_ep_map", scope: !539, file: !538, line: 71, baseType: !563, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_clpi_ep_map_t", file: !538, line: 54, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 47, size: 192, elements: !566)
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_pid", scope: !565, file: !538, line: 49, baseType: !95, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !565, file: !538, line: 50, baseType: !95, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_ep", scope: !565, file: !538, line: 52, baseType: !95, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "p_ep", scope: !565, file: !538, line: 53, baseType: !571, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "bd_clpi_ep_t", file: !538, line: 45, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 40, size: 192, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_angle_point", scope: !573, file: !538, line: 42, baseType: !11, size: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet", scope: !573, file: !538, line: 43, baseType: !153, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !573, file: !538, line: 44, baseType: !153, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_title", scope: !449, file: !3, line: 98, baseType: !95, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pp_title", scope: !449, file: !3, line: 99, baseType: !580, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_title_t", file: !242, line: 131, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 118, size: 384, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !583, file: !242, line: 120, baseType: !6, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_menu", scope: !583, file: !242, line: 122, baseType: !11, size: 8, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !583, file: !242, line: 124, baseType: !153, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !583, file: !242, line: 125, baseType: !153, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !583, file: !242, line: 128, baseType: !95, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "seekpoint", scope: !583, file: !242, line: 129, baseType: !591, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "seekpoint_t", file: !97, line: 230, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seekpoint_t", file: !242, line: 81, size: 256, elements: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_byte_offset", scope: !594, file: !242, line: 83, baseType: !153, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset", scope: !594, file: !242, line: 84, baseType: !153, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !594, file: !242, line: 85, baseType: !6, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_level", scope: !594, file: !242, line: 86, baseType: !95, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !449, file: !3, line: 102, baseType: !260, size: 64, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "p_clpi", scope: !449, file: !3, line: 105, baseType: !602, size: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_clpi_ep", scope: !449, file: !3, line: 106, baseType: !95, size: 32, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "p_parser", scope: !449, file: !3, line: 107, baseType: !189, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "p_m2ts", scope: !449, file: !3, line: 108, baseType: !189, size: 64, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_play_item", scope: !449, file: !3, line: 109, baseType: !95, size: 32, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet", scope: !449, file: !3, line: 110, baseType: !95, size: 32, offset: 800)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet_start", scope: !449, file: !3, line: 111, baseType: !95, size: 32, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet_stop", scope: !449, file: !3, line: 112, baseType: !95, size: 32, offset: 864)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet_headers", scope: !449, file: !3, line: 113, baseType: !95, size: 32, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_atc_initial", scope: !449, file: !3, line: 114, baseType: !153, size: 64, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_atc_current", scope: !449, file: !3, line: 115, baseType: !153, size: 64, offset: 1024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_atc_wrap", scope: !449, file: !3, line: 116, baseType: !153, size: 64, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_atc_last", scope: !449, file: !3, line: 117, baseType: !153, size: 64, offset: 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !171, file: !172, line: 76, baseType: !239, size: 64, offset: 1024)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!625 = !{!0, !626}
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "ppsz_name_short", scope: !2, file: !3, line: 993, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 3)
!631 = !{!632, !633, !634, !671, !672}
!632 = !DILocalVariable(name: "psz_path", arg: 1, scope: !2, file: !3, line: 956, type: !8)
!633 = !DILocalVariable(name: "pb_shortname", arg: 2, scope: !2, file: !3, line: 956, type: !10)
!634 = !DILocalVariable(name: "s", scope: !2, file: !3, line: 958, type: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !636, line: 46, size: 1152, elements: !637)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!637 = !{!638, !641, !643, !645, !647, !649, !651, !652, !653, !655, !657, !659, !667, !668, !669}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !635, file: !636, line: 48, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !640, line: 124, baseType: !406)
!640 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !635, file: !636, line: 53, baseType: !642, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !640, line: 127, baseType: !406)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !635, file: !636, line: 61, baseType: !644, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !640, line: 130, baseType: !406)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !635, file: !636, line: 62, baseType: !646, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !640, line: 129, baseType: !16)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !635, file: !636, line: 64, baseType: !648, size: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !640, line: 125, baseType: !16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !635, file: !636, line: 65, baseType: !650, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !640, line: 126, baseType: !16)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !635, file: !636, line: 67, baseType: !95, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !635, file: !636, line: 69, baseType: !639, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !635, file: !636, line: 74, baseType: !654, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !640, line: 131, baseType: !155)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !635, file: !636, line: 78, baseType: !656, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !640, line: 153, baseType: !155)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !635, file: !636, line: 80, baseType: !658, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !640, line: 158, baseType: !155)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !635, file: !636, line: 91, baseType: !660, size: 128, offset: 576)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !661, line: 120, size: 128, elements: !662)
!661 = !DIFile(filename: "/usr/include/time.h", directory: "")
!662 = !{!663, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !660, file: !661, line: 122, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !640, line: 139, baseType: !155)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !660, file: !661, line: 123, baseType: !666, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !640, line: 175, baseType: !155)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !635, file: !636, line: 92, baseType: !660, size: 128, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !635, file: !636, line: 93, baseType: !660, size: 128, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !635, file: !636, line: 106, baseType: !670, size: 192, offset: 960)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 192, elements: !629)
!671 = !DILocalVariable(name: "psz_tmp", scope: !2, file: !3, line: 959, type: !6)
!672 = !DILocalVariable(name: "psz_base", scope: !2, file: !3, line: 962, type: !6)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "i_mask", scope: !675, file: !676, line: 61, type: !711, isLocal: true, isDefinition: true)
!675 = distinct !DISubprogram(name: "bs_read", scope: !676, file: !676, line: 59, type: !677, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !706)
!676 = !DIFile(filename: "../../../include/vlc_bits.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!677 = !DISubroutineType(types: !678)
!678 = !{!280, !679, !95}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !676, line: 39, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !676, line: 32, size: 256, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !681, file: !676, line: 34, baseType: !408, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !681, file: !676, line: 35, baseType: !408, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !681, file: !676, line: 36, baseType: !408, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !681, file: !676, line: 38, baseType: !687, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !154, line: 109, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !640, line: 172, baseType: !155)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !691, globals: !705, nameTableKind: None)
!690 = !DIFile(filename: "mpls.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!691 = !{!48, !692, !697}
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 91, baseType: !16, size: 32, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIEnumerator(name: "BD_MPLS_PLAY_ITEM_STILL_NONE", value: 0, isUnsigned: true)
!695 = !DIEnumerator(name: "BD_MPLS_PLAY_ITEM_STILL_FINITE", value: 1, isUnsigned: true)
!696 = !DIEnumerator(name: "BD_MPLS_PLAY_ITEM_STILL_INFINITE", value: 2, isUnsigned: true)
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 30, baseType: !16, size: 32, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704}
!699 = !DIEnumerator(name: "BD_MPLS_STREAM_CLASS_PRIMARY_VIDEO", value: 0, isUnsigned: true)
!700 = !DIEnumerator(name: "BD_MPLS_STREAM_CLASS_PRIMARY_AUDIO", value: 1, isUnsigned: true)
!701 = !DIEnumerator(name: "BD_MPLS_STREAM_CLASS_PG", value: 2, isUnsigned: true)
!702 = !DIEnumerator(name: "BD_MPLS_STREAM_CLASS_IG", value: 3, isUnsigned: true)
!703 = !DIEnumerator(name: "BD_MPLS_STREAM_CLASS_SECONDARY_AUDIO", value: 4, isUnsigned: true)
!704 = !DIEnumerator(name: "BD_MPLS_STREAM_CLASS_SECONDARY_PIP_PG", value: 5, isUnsigned: true)
!705 = !{!673}
!706 = !{!707, !708, !709, !710}
!707 = !DILocalVariable(name: "s", arg: 1, scope: !675, file: !676, line: 59, type: !679)
!708 = !DILocalVariable(name: "i_count", arg: 2, scope: !675, file: !676, line: 59, type: !95)
!709 = !DILocalVariable(name: "i_shr", scope: !675, file: !676, line: 71, type: !95)
!710 = !DILocalVariable(name: "i_result", scope: !675, file: !676, line: 72, type: !280)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 1056, elements: !713)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!713 = !{!714}
!714 = !DISubrange(count: 33)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "i_mask", scope: !717, file: !676, line: 61, type: !711, isLocal: true, isDefinition: true)
!717 = distinct !DISubprogram(name: "bs_read", scope: !676, file: !676, line: 59, type: !718, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !728, retainedNodes: !733)
!718 = !DISubroutineType(types: !719)
!719 = !{!280, !720, !95}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !676, line: 39, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !676, line: 32, size: 256, elements: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !722, file: !676, line: 34, baseType: !408, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !722, file: !676, line: 35, baseType: !408, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !722, file: !676, line: 36, baseType: !408, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !722, file: !676, line: 38, baseType: !687, size: 64, offset: 192)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !730, retainedTypes: !731, globals: !732, nameTableKind: None)
!729 = !DIFile(filename: "clpi.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!730 = !{}
!731 = !{!153}
!732 = !{!715}
!733 = !{!734, !735, !736, !737}
!734 = !DILocalVariable(name: "s", arg: 1, scope: !717, file: !676, line: 59, type: !720)
!735 = !DILocalVariable(name: "i_count", arg: 2, scope: !717, file: !676, line: 59, type: !95)
!736 = !DILocalVariable(name: "i_shr", scope: !717, file: !676, line: 71, type: !95)
!737 = !DILocalVariable(name: "i_result", scope: !717, file: !676, line: 72, type: !280)
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !730, nameTableKind: None)
!739 = !DIFile(filename: "strlcpy.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/compat")
!740 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!741 = !{i32 2, !"Dwarf Version", i32 4}
!742 = !{i32 2, !"Debug Info Version", i32 3}
!743 = !{i32 1, !"wchar_size", i32 4}
!744 = !{i32 7, !"PIC Level", i32 2}
!745 = !{i32 1, !"ThinLTO", i32 0}
!746 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!747 = distinct !DISubprogram(name: "vlc_entry__1_1_0g", scope: !3, file: !3, line: 60, type: !748, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !750)
!748 = !DISubroutineType(types: !749)
!749 = !{!95, !182}
!750 = !{!751, !752, !801}
!751 = !DILocalVariable(name: "p_module", arg: 1, scope: !747, file: !3, line: 60, type: !182)
!752 = !DILocalVariable(name: "p_config", scope: !747, file: !3, line: 60, type: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_config_t", file: !97, line: 209, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_config_t", file: !756, line: 150, size: 1408, elements: !757)
!756 = !DIFile(filename: "../../../include/vlc_configuration.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!757 = !{!758, !759, !760, !761, !762, !763, !764, !771, !772, !773, !779, !780, !781, !782, !784, !785, !786, !787, !788, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !755, file: !756, line: 152, baseType: !95, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "psz_type", scope: !755, file: !756, line: 153, baseType: !6, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !755, file: !756, line: 154, baseType: !6, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_short", scope: !755, file: !756, line: 155, baseType: !7, size: 8, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "psz_text", scope: !755, file: !756, line: 156, baseType: !6, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "psz_longtext", scope: !755, file: !756, line: 157, baseType: !6, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !755, file: !756, line: 158, baseType: !765, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_value_t", file: !756, line: 142, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !756, line: 137, size: 64, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "psz", scope: !766, file: !756, line: 139, baseType: !6, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !766, file: !756, line: 140, baseType: !95, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !766, file: !756, line: 141, baseType: !136, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !755, file: !756, line: 159, baseType: !765, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !755, file: !756, line: 160, baseType: !765, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !755, file: !756, line: 161, baseType: !774, size: 32, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_nvalue_t", file: !756, line: 148, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !756, line: 144, size: 32, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !775, file: !756, line: 146, baseType: !95, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !775, file: !756, line: 147, baseType: !136, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !755, file: !756, line: 162, baseType: !774, size: 32, offset: 608)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pf_callback", scope: !755, file: !756, line: 165, baseType: !96, size: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "p_callback_data", scope: !755, file: !756, line: 166, baseType: !139, size: 64, offset: 704)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list", scope: !755, file: !756, line: 169, baseType: !783, size: 64, offset: 768)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pi_list", scope: !755, file: !756, line: 170, baseType: !150, size: 64, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list_text", scope: !755, file: !756, line: 171, baseType: !783, size: 64, offset: 896)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_list", scope: !755, file: !756, line: 172, baseType: !95, size: 32, offset: 960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pf_update_list", scope: !755, file: !756, line: 173, baseType: !96, size: 64, offset: 1024)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ppf_action", scope: !755, file: !756, line: 176, baseType: !789, size: 64, offset: 1088)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_action_text", scope: !755, file: !756, line: 177, baseType: !783, size: 64, offset: 1152)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_action", scope: !755, file: !756, line: 178, baseType: !95, size: 32, offset: 1216)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "b_dirty", scope: !755, file: !756, line: 181, baseType: !11, size: 8, offset: 1248)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "b_advanced", scope: !755, file: !756, line: 182, baseType: !11, size: 8, offset: 1256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "b_internal", scope: !755, file: !756, line: 183, baseType: !11, size: 8, offset: 1264)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "b_restart", scope: !755, file: !756, line: 184, baseType: !11, size: 8, offset: 1272)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "psz_oldname", scope: !755, file: !756, line: 188, baseType: !6, size: 64, offset: 1280)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "b_removed", scope: !755, file: !756, line: 189, baseType: !11, size: 8, offset: 1344)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "b_autosave", scope: !755, file: !756, line: 192, baseType: !11, size: 8, offset: 1352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "b_unsaveable", scope: !755, file: !756, line: 193, baseType: !11, size: 8, offset: 1360)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "b_safe", scope: !755, file: !756, line: 195, baseType: !11, size: 8, offset: 1368)
!801 = !DILocalVariable(name: "p_submodule", scope: !802, file: !3, line: 60, type: !182)
!802 = distinct !DILexicalBlock(scope: !747, file: !3, line: 60, column: 1)
!803 = !DILocation(line: 60, column: 1, scope: !747)
!804 = !{!805, !805, i64 0}
!805 = !{!"any pointer", !806, i64 0}
!806 = !{!"omnipotent char", !807, i64 0}
!807 = !{!"Simple C/C++ TBAA"}
!808 = !DILocation(line: 60, column: 1, scope: !809)
!809 = distinct !DILexicalBlock(scope: !747, file: !3, line: 60, column: 1)
!810 = !DILocation(line: 60, column: 1, scope: !802)
!811 = !DILocation(line: 61, column: 5, scope: !812)
!812 = distinct !DILexicalBlock(scope: !802, file: !3, line: 61, column: 5)
!813 = !DILocation(line: 61, column: 5, scope: !802)
!814 = !DILocation(line: 62, column: 5, scope: !815)
!815 = distinct !DILexicalBlock(scope: !802, file: !3, line: 62, column: 5)
!816 = !DILocation(line: 62, column: 5, scope: !802)
!817 = !DILocation(line: 63, column: 5, scope: !802)
!818 = !DILocation(line: 64, column: 5, scope: !802)
!819 = !DILocation(line: 65, column: 5, scope: !802)
!820 = !DILocation(line: 65, column: 5, scope: !821)
!821 = distinct !DILexicalBlock(scope: !802, file: !3, line: 65, column: 5)
!822 = !DILocation(line: 67, column: 5, scope: !823)
!823 = distinct !DILexicalBlock(scope: !802, file: !3, line: 67, column: 5)
!824 = !DILocation(line: 67, column: 5, scope: !802)
!825 = !DILocation(line: 68, column: 5, scope: !826)
!826 = distinct !DILexicalBlock(scope: !802, file: !3, line: 68, column: 5)
!827 = !DILocation(line: 68, column: 5, scope: !802)
!828 = !DILocation(line: 69, column: 5, scope: !829)
!829 = distinct !DILexicalBlock(scope: !802, file: !3, line: 69, column: 5)
!830 = !DILocation(line: 69, column: 5, scope: !802)
!831 = !DILocation(line: 70, column: 5, scope: !832)
!832 = distinct !DILexicalBlock(scope: !802, file: !3, line: 70, column: 5)
!833 = !DILocation(line: 71, column: 1, scope: !747)
!834 = distinct !DISubprogram(name: "Open", scope: !3, file: !3, line: 151, type: !835, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!95, !101}
!837 = !{!838, !839, !840, !841, !844, !845, !847, !848, !850, !851, !853, !854, !855}
!838 = !DILocalVariable(name: "p_this", arg: 1, scope: !834, file: !3, line: 151, type: !101)
!839 = !DILocalVariable(name: "p_demux", scope: !834, file: !3, line: 153, type: !169)
!840 = !DILocalVariable(name: "p_sys", scope: !834, file: !3, line: 154, type: !447)
!841 = !DILocalVariable(name: "__s1_len", scope: !842, file: !3, line: 157, type: !404)
!842 = distinct !DILexicalBlock(scope: !843, file: !3, line: 157, column: 9)
!843 = distinct !DILexicalBlock(scope: !834, file: !3, line: 156, column: 9)
!844 = !DILocalVariable(name: "__s2_len", scope: !842, file: !3, line: 157, type: !404)
!845 = !DILocalVariable(name: "__s2", scope: !846, file: !3, line: 157, type: !619)
!846 = distinct !DILexicalBlock(scope: !842, file: !3, line: 157, column: 9)
!847 = !DILocalVariable(name: "__result", scope: !846, file: !3, line: 157, type: !95)
!848 = !DILocalVariable(name: "__s1_len", scope: !849, file: !3, line: 158, type: !404)
!849 = distinct !DILexicalBlock(scope: !843, file: !3, line: 158, column: 9)
!850 = !DILocalVariable(name: "__s2_len", scope: !849, file: !3, line: 158, type: !404)
!851 = !DILocalVariable(name: "__s2", scope: !852, file: !3, line: 158, type: !619)
!852 = distinct !DILexicalBlock(scope: !849, file: !3, line: 158, column: 9)
!853 = !DILocalVariable(name: "__result", scope: !852, file: !3, line: 158, type: !95)
!854 = !DILocalVariable(name: "b_shortname", scope: !834, file: !3, line: 162, type: !11)
!855 = !DILocalVariable(name: "psz_base", scope: !834, file: !3, line: 163, type: !6)
!856 = !DILocation(line: 151, column: 32, scope: !834)
!857 = !DILocation(line: 153, column: 28, scope: !834)
!858 = !DILocation(line: 153, column: 18, scope: !834)
!859 = !DILocation(line: 156, column: 19, scope: !843)
!860 = !{!861, !805, i64 48}
!861 = !{!"demux_t", !805, i64 0, !805, i64 8, !862, i64 16, !863, i64 20, !863, i64 21, !805, i64 24, !805, i64 32, !805, i64 40, !805, i64 48, !805, i64 56, !805, i64 64, !805, i64 72, !805, i64 80, !805, i64 88, !805, i64 96, !864, i64 104, !805, i64 120, !805, i64 128}
!862 = !{!"int", !806, i64 0}
!863 = !{!"_Bool", !806, i64 0}
!864 = !{!"", !862, i64 0, !862, i64 4, !862, i64 8}
!865 = !DILocation(line: 156, column: 9, scope: !843)
!866 = !{!806, !806, i64 0}
!867 = !DILocation(line: 156, column: 30, scope: !843)
!868 = !DILocation(line: 157, column: 9, scope: !842)
!869 = !DILocation(line: 157, column: 9, scope: !846)
!870 = !DILocation(line: 157, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !846, file: !3, line: 157, column: 9)
!872 = !DILocation(line: 157, column: 9, scope: !873)
!873 = distinct !DILexicalBlock(scope: !871, file: !3, line: 157, column: 9)
!874 = !DILocation(line: 157, column: 9, scope: !875)
!875 = distinct !DILexicalBlock(scope: !873, file: !3, line: 157, column: 9)
!876 = !DILocation(line: 157, column: 9, scope: !877)
!877 = distinct !DILexicalBlock(scope: !875, file: !3, line: 157, column: 9)
!878 = !DILocation(line: 157, column: 9, scope: !879)
!879 = distinct !DILexicalBlock(scope: !877, file: !3, line: 157, column: 9)
!880 = !DILocation(line: 0, scope: !846)
!881 = !DILocation(line: 157, column: 45, scope: !843)
!882 = !DILocation(line: 158, column: 9, scope: !849)
!883 = !DILocation(line: 158, column: 9, scope: !843)
!884 = !DILocation(line: 156, column: 9, scope: !834)
!885 = !DILocation(line: 163, column: 45, scope: !834)
!886 = !{!861, !805, i64 64}
!887 = !DILocation(line: 956, column: 40, scope: !2, inlinedAt: !888)
!888 = distinct !DILocation(line: 163, column: 22, scope: !834)
!889 = !DILocation(line: 958, column: 5, scope: !2, inlinedAt: !888)
!890 = !DILocation(line: 959, column: 5, scope: !2, inlinedAt: !888)
!891 = !DILocation(line: 962, column: 22, scope: !2, inlinedAt: !888)
!892 = !DILocation(line: 962, column: 11, scope: !2, inlinedAt: !888)
!893 = !DILocation(line: 963, column: 10, scope: !894, inlinedAt: !888)
!894 = distinct !DILexicalBlock(scope: !2, file: !3, line: 963, column: 9)
!895 = !DILocation(line: 963, column: 9, scope: !2, inlinedAt: !888)
!896 = !DILocation(line: 967, column: 12, scope: !2, inlinedAt: !888)
!897 = !DILocation(line: 967, column: 22, scope: !2, inlinedAt: !888)
!898 = !DILocation(line: 967, column: 34, scope: !2, inlinedAt: !888)
!899 = !DILocation(line: 967, column: 50, scope: !2, inlinedAt: !888)
!900 = !DILocation(line: 967, column: 25, scope: !2, inlinedAt: !888)
!901 = !DILocation(line: 967, column: 54, scope: !2, inlinedAt: !888)
!902 = !DILocation(line: 967, column: 5, scope: !2, inlinedAt: !888)
!903 = !DILocation(line: 968, column: 38, scope: !2, inlinedAt: !888)
!904 = distinct !{!904, !905, !906}
!905 = !DILocation(line: 967, column: 5, scope: !2)
!906 = !DILocation(line: 968, column: 40, scope: !2)
!907 = !DILocation(line: 958, column: 17, scope: !2, inlinedAt: !888)
!908 = !DILocation(line: 971, column: 9, scope: !909, inlinedAt: !888)
!909 = distinct !DILexicalBlock(scope: !2, file: !3, line: 971, column: 9)
!910 = !DILocation(line: 971, column: 34, scope: !909, inlinedAt: !888)
!911 = !DILocation(line: 971, column: 38, scope: !909, inlinedAt: !888)
!912 = !{!913, !862, i64 24}
!913 = !{!"stat", !914, i64 0, !914, i64 8, !914, i64 16, !862, i64 24, !862, i64 28, !862, i64 32, !862, i64 36, !914, i64 40, !914, i64 48, !914, i64 56, !914, i64 64, !915, i64 72, !915, i64 88, !915, i64 104, !806, i64 120}
!914 = !{!"long", !806, i64 0}
!915 = !{!"timespec", !914, i64 0, !914, i64 8}
!916 = !DILocation(line: 971, column: 9, scope: !2, inlinedAt: !888)
!917 = !DILocation(line: 959, column: 11, scope: !2, inlinedAt: !888)
!918 = !DILocation(line: 975, column: 9, scope: !919, inlinedAt: !888)
!919 = distinct !DILexicalBlock(scope: !2, file: !3, line: 975, column: 9)
!920 = !DILocation(line: 975, column: 51, scope: !919, inlinedAt: !888)
!921 = !DILocation(line: 975, column: 9, scope: !2, inlinedAt: !888)
!922 = !DILocation(line: 977, column: 20, scope: !923, inlinedAt: !888)
!923 = distinct !DILexicalBlock(scope: !2, file: !3, line: 977, column: 9)
!924 = !DILocation(line: 977, column: 10, scope: !923, inlinedAt: !888)
!925 = !DILocation(line: 977, column: 34, scope: !923, inlinedAt: !888)
!926 = !DILocation(line: 977, column: 37, scope: !923, inlinedAt: !888)
!927 = !DILocation(line: 977, column: 9, scope: !2, inlinedAt: !888)
!928 = !DILocation(line: 979, column: 9, scope: !929, inlinedAt: !888)
!929 = distinct !DILexicalBlock(scope: !923, file: !3, line: 978, column: 5)
!930 = !DILocation(line: 980, column: 20, scope: !929, inlinedAt: !888)
!931 = !DILocation(line: 981, column: 5, scope: !929, inlinedAt: !888)
!932 = !DILocation(line: 984, column: 15, scope: !933, inlinedAt: !888)
!933 = distinct !DILexicalBlock(scope: !923, file: !3, line: 983, column: 5)
!934 = !DILocation(line: 984, column: 9, scope: !933, inlinedAt: !888)
!935 = !DILocation(line: 0, scope: !2, inlinedAt: !888)
!936 = !DILocation(line: 999, column: 9, scope: !937, inlinedAt: !888)
!937 = distinct !DILexicalBlock(scope: !2, file: !3, line: 999, column: 9)
!938 = !DILocation(line: 999, column: 9, scope: !2, inlinedAt: !888)
!939 = !DILocation(line: 1001, column: 13, scope: !940, inlinedAt: !888)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 1001, column: 13)
!941 = distinct !DILexicalBlock(scope: !937, file: !3, line: 1000, column: 5)
!942 = !DILocation(line: 1001, column: 13, scope: !941, inlinedAt: !888)
!943 = !DILocation(line: 1008, column: 5, scope: !2, inlinedAt: !888)
!944 = !DILocation(line: 1009, column: 5, scope: !2, inlinedAt: !888)
!945 = !DILocation(line: 1010, column: 1, scope: !2, inlinedAt: !888)
!946 = !DILocation(line: 163, column: 11, scope: !834)
!947 = !DILocation(line: 164, column: 9, scope: !834)
!948 = !DILocation(line: 164, column: 10, scope: !949)
!949 = distinct !DILexicalBlock(scope: !834, file: !3, line: 164, column: 9)
!950 = !DILocation(line: 167, column: 5, scope: !834)
!951 = !DILocation(line: 170, column: 30, scope: !834)
!952 = !DILocation(line: 170, column: 20, scope: !834)
!953 = !{!861, !805, i64 120}
!954 = !DILocation(line: 171, column: 10, scope: !955)
!955 = distinct !DILexicalBlock(scope: !834, file: !3, line: 171, column: 9)
!956 = !DILocation(line: 171, column: 9, scope: !834)
!957 = !DILocation(line: 154, column: 18, scope: !834)
!958 = !DILocation(line: 173, column: 12, scope: !834)
!959 = !DILocation(line: 173, column: 21, scope: !834)
!960 = !{!961, !805, i64 0}
!961 = !{!"demux_sys_t", !805, i64 0, !863, i64 8, !862, i64 12, !805, i64 16, !862, i64 24, !805, i64 32, !862, i64 40, !805, i64 48, !805, i64 56, !805, i64 64, !862, i64 72, !805, i64 80, !805, i64 88, !862, i64 96, !862, i64 100, !862, i64 104, !862, i64 108, !862, i64 112, !914, i64 120, !914, i64 128, !914, i64 136, !914, i64 144}
!962 = !DILocation(line: 162, column: 10, scope: !834)
!963 = !DILocation(line: 174, column: 12, scope: !834)
!964 = !DILocation(line: 174, column: 24, scope: !834)
!965 = !{!961, !863, i64 8}
!966 = !DILocation(line: 175, column: 5, scope: !967)
!967 = distinct !DILexicalBlock(scope: !834, file: !3, line: 175, column: 5)
!968 = !DILocation(line: 176, column: 5, scope: !969)
!969 = distinct !DILexicalBlock(scope: !834, file: !3, line: 176, column: 5)
!970 = !{!961, !805, i64 32}
!971 = !DILocation(line: 177, column: 5, scope: !972)
!972 = distinct !DILexicalBlock(scope: !834, file: !3, line: 177, column: 5)
!973 = !{!961, !862, i64 40}
!974 = !{!961, !805, i64 48}
!975 = !DILocation(line: 178, column: 14, scope: !834)
!976 = !DILocation(line: 178, column: 19, scope: !834)
!977 = !DILocation(line: 178, column: 27, scope: !834)
!978 = !{!861, !862, i64 108}
!979 = !DILocation(line: 179, column: 12, scope: !834)
!980 = !DILocation(line: 179, column: 19, scope: !834)
!981 = !{!961, !805, i64 64}
!982 = !DILocation(line: 180, column: 12, scope: !834)
!983 = !DILocation(line: 180, column: 22, scope: !834)
!984 = !{!961, !862, i64 72}
!985 = !DILocation(line: 181, column: 12, scope: !834)
!986 = !DILocation(line: 183, column: 12, scope: !834)
!987 = !DILocation(line: 182, column: 19, scope: !834)
!988 = !DILocalVariable(name: "p_demux", arg: 1, scope: !989, file: !3, line: 1333, type: !169)
!989 = distinct !DISubprogram(name: "EsOutNew", scope: !3, file: !3, line: 1333, type: !990, scopeLine: 1334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !992)
!990 = !DISubroutineType(types: !991)
!991 = !{!260, !169}
!992 = !{!988, !993, !994}
!993 = !DILocalVariable(name: "p_out", scope: !989, file: !3, line: 1335, type: !260)
!994 = !DILocalVariable(name: "p_sys", scope: !989, file: !3, line: 1336, type: !427)
!995 = !DILocation(line: 1333, column: 37, scope: !989, inlinedAt: !996)
!996 = distinct !DILocation(line: 188, column: 20, scope: !834)
!997 = !DILocation(line: 184, column: 21, scope: !834)
!998 = !DILocation(line: 1335, column: 23, scope: !989, inlinedAt: !996)
!999 = !DILocation(line: 1335, column: 15, scope: !989, inlinedAt: !996)
!1000 = !DILocation(line: 1338, column: 10, scope: !1001, inlinedAt: !996)
!1001 = distinct !DILexicalBlock(scope: !989, file: !3, line: 1338, column: 9)
!1002 = !DILocation(line: 1338, column: 9, scope: !989, inlinedAt: !996)
!1003 = !DILocation(line: 1341, column: 12, scope: !989, inlinedAt: !996)
!1004 = !DILocation(line: 1341, column: 23, scope: !989, inlinedAt: !996)
!1005 = !{!1006, !805, i64 0}
!1006 = !{!"es_out_t", !805, i64 0, !805, i64 8, !805, i64 16, !805, i64 24, !805, i64 32, !805, i64 40}
!1007 = !DILocation(line: 1342, column: 12, scope: !989, inlinedAt: !996)
!1008 = !DILocation(line: 1342, column: 23, scope: !989, inlinedAt: !996)
!1009 = !{!1006, !805, i64 8}
!1010 = !DILocation(line: 1343, column: 12, scope: !989, inlinedAt: !996)
!1011 = !DILocation(line: 1343, column: 23, scope: !989, inlinedAt: !996)
!1012 = !{!1006, !805, i64 16}
!1013 = !DILocation(line: 1344, column: 12, scope: !989, inlinedAt: !996)
!1014 = !DILocation(line: 1344, column: 23, scope: !989, inlinedAt: !996)
!1015 = !{!1006, !805, i64 24}
!1016 = !DILocation(line: 1345, column: 12, scope: !989, inlinedAt: !996)
!1017 = !DILocation(line: 1345, column: 23, scope: !989, inlinedAt: !996)
!1018 = !{!1006, !805, i64 32}
!1019 = !DILocation(line: 1347, column: 28, scope: !989, inlinedAt: !996)
!1020 = !DILocation(line: 1347, column: 12, scope: !989, inlinedAt: !996)
!1021 = !DILocation(line: 1347, column: 18, scope: !989, inlinedAt: !996)
!1022 = !{!1006, !805, i64 40}
!1023 = !DILocation(line: 1348, column: 10, scope: !1024, inlinedAt: !996)
!1024 = distinct !DILexicalBlock(scope: !989, file: !3, line: 1348, column: 9)
!1025 = !DILocation(line: 1348, column: 9, scope: !989, inlinedAt: !996)
!1026 = !DILocation(line: 1350, column: 9, scope: !1027, inlinedAt: !996)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 1349, column: 5)
!1028 = !DILocation(line: 1351, column: 9, scope: !1027, inlinedAt: !996)
!1029 = !DILocation(line: 188, column: 12, scope: !834)
!1030 = !DILocation(line: 188, column: 18, scope: !834)
!1031 = !{!961, !805, i64 56}
!1032 = !DILocation(line: 189, column: 9, scope: !834)
!1033 = !DILocation(line: 1336, column: 19, scope: !989, inlinedAt: !996)
!1034 = !DILocation(line: 1353, column: 20, scope: !989, inlinedAt: !996)
!1035 = !{!1036, !805, i64 0}
!1036 = !{!"es_out_sys_t", !805, i64 0}
!1037 = !DILocation(line: 192, column: 14, scope: !834)
!1038 = !DILocation(line: 192, column: 25, scope: !834)
!1039 = !{!861, !805, i64 96}
!1040 = !DILocation(line: 193, column: 14, scope: !834)
!1041 = !DILocation(line: 193, column: 23, scope: !834)
!1042 = !{!861, !805, i64 88}
!1043 = !DILocalVariable(name: "p_demux", arg: 1, scope: !1044, file: !3, line: 1243, type: !169)
!1044 = distinct !DISubprogram(name: "LoadClip", scope: !3, file: !3, line: 1243, type: !434, scopeLine: 1244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !1045)
!1045 = !{!1043}
!1046 = !DILocation(line: 1243, column: 31, scope: !1044, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 196, column: 5, scope: !834)
!1048 = !DILocation(line: 1246, column: 27, scope: !1044, inlinedAt: !1047)
!1049 = !DILocation(line: 1246, column: 34, scope: !1044, inlinedAt: !1047)
!1050 = !DILocation(line: 1246, column: 18, scope: !1044, inlinedAt: !1047)
!1051 = !DILocation(line: 1245, column: 12, scope: !1044, inlinedAt: !1047)
!1052 = !DILocalVariable(name: "p_demux", arg: 1, scope: !1053, file: !3, line: 1238, type: !169)
!1053 = distinct !DISubprogram(name: "LoadPlaylist", scope: !3, file: !3, line: 1238, type: !434, scopeLine: 1239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !1054)
!1054 = !{!1052}
!1055 = !DILocation(line: 1238, column: 35, scope: !1053, inlinedAt: !1056)
!1056 = distinct !DILocation(line: 197, column: 5, scope: !834)
!1057 = !DILocation(line: 1241, column: 27, scope: !1053, inlinedAt: !1056)
!1058 = !DILocation(line: 1241, column: 34, scope: !1053, inlinedAt: !1056)
!1059 = !{i8 0, i8 2}
!1060 = !DILocation(line: 1241, column: 18, scope: !1053, inlinedAt: !1056)
!1061 = !DILocation(line: 1240, column: 12, scope: !1053, inlinedAt: !1056)
!1062 = !DILocalVariable(name: "p_demux", arg: 1, scope: !1063, file: !3, line: 929, type: !169)
!1063 = distinct !DISubprogram(name: "ReorderPlaylist", scope: !3, file: !3, line: 929, type: !1064, scopeLine: 930, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !1066)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !169}
!1066 = !{!1062, !1067}
!1067 = !DILocalVariable(name: "p_sys", scope: !1063, file: !3, line: 931, type: !447)
!1068 = !DILocation(line: 929, column: 39, scope: !1063, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 201, column: 5, scope: !834)
!1070 = !DILocation(line: 931, column: 35, scope: !1063, inlinedAt: !1069)
!1071 = !DILocation(line: 931, column: 18, scope: !1063, inlinedAt: !1069)
!1072 = !DILocation(line: 932, column: 19, scope: !1063, inlinedAt: !1069)
!1073 = !{!961, !805, i64 16}
!1074 = !DILocation(line: 932, column: 35, scope: !1063, inlinedAt: !1069)
!1075 = !{!961, !862, i64 12}
!1076 = !DILocation(line: 932, column: 28, scope: !1063, inlinedAt: !1069)
!1077 = !DILocation(line: 932, column: 5, scope: !1063, inlinedAt: !1069)
!1078 = !DILocation(line: 204, column: 5, scope: !834)
!1079 = !DILocalVariable(name: "p_obj", arg: 1, scope: !1080, file: !1081, line: 205, type: !101)
!1080 = distinct !DISubprogram(name: "var_SetBool", scope: !1081, file: !1081, line: 205, type: !1082, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !1084)
!1081 = !DIFile(filename: "../../../include/vlc_variables.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/bd")
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!95, !101, !8, !11}
