; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@time_t_max = internal global i64 0, align 8, !dbg !0
@time_t_min = internal global i64 0, align 8, !dbg !12
@tz_strings = internal global [4 x i8*] [i8* null, i8* getelementptr inbounds ([8 x i8], [8 x i8]* @.str, i32 0, i32 0), i8* getelementptr inbounds ([9 x i8], [9 x i8]* @.str.1, i32 0, i32 0), i8* getelementptr inbounds ([47 x i8], [47 x i8]* @.str.2, i32 0, i32 0)], align 16, !dbg !14
@.str.3 = private unnamed_addr constant [26 x i8] c"TZ=PST8PDT,M4.1.0,M10.5.0\00", align 1
@.str = private unnamed_addr constant [8 x i8] c"TZ=GMT0\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"TZ=JST-9\00", align 1
@.str.2 = private unnamed_addr constant [47 x i8] c"TZ=EST+3EDT+2,M10.1.0/00:00:00,M2.3.0/00:00:00\00", align 1
@specialMalloc = external thread_local global i8, align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main() #0 !dbg !28 {
  %1 = alloca i32, align 4
  %2 = alloca i64, align 8
  %3 = alloca i64, align 8
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  store i32 0, i32* %1, align 4
  call void @llvm.dbg.declare(metadata i64* %2, metadata !32, metadata !DIExpression()), !dbg !33
  call void @llvm.dbg.declare(metadata i64* %3, metadata !34, metadata !DIExpression()), !dbg !35

!76 = distinct !DILexicalBlock(scope: !71, file: !3, line: 225, column: 5)
!77 = !DILocation(line: 226, column: 11, scope: !75)
!78 = !DILocation(line: 226, column: 11, scope: !76)
!79 = !DILocation(line: 227, column: 21, scope: !75)
!80 = !DILocation(line: 227, column: 10, scope: !75)
!81 = !DILocation(line: 227, column: 2, scope: !75)
!82 = !DILocation(line: 229, column: 14, scope: !83)
!83 = distinct !DILexicalBlock(scope: !76, file: !3, line: 229, column: 7)
!84 = !DILocation(line: 229, column: 12, scope: !83)
!85 = !DILocation(line: 229, column: 19, scope: !86)
!86 = distinct !DILexicalBlock(scope: !83, file: !3, line: 229, column: 7)
!87 = !DILocation(line: 229, column: 24, scope: !86)
!88 = !DILocation(line: 229, column: 37, scope: !86)
!89 = !DILocation(line: 229, column: 35, scope: !86)
!90 = !DILocation(line: 229, column: 21, scope: !86)
!91 = !DILocation(line: 229, column: 7, scope: !83)
!92 = !DILocation(line: 230, column: 21, scope: !93)
!93 = distinct !DILexicalBlock(scope: !86, file: !3, line: 230, column: 6)
!94 = !DILocation(line: 230, column: 8, scope: !93)
!95 = !DILocation(line: 230, column: 6, scope: !86)
!96 = !DILocation(line: 231, column: 4, scope: !93)
!97 = !DILocation(line: 230, column: 22, scope: !93)
!98 = !DILocation(line: 229, column: 49, scope: !86)
!99 = !DILocation(line: 229, column: 46, scope: !86)
!100 = !DILocation(line: 229, column: 7, scope: !86)
!101 = distinct !{!101, !91, !102}
!102 = !DILocation(line: 231, column: 11, scope: !83)
!103 = !DILocation(line: 232, column: 14, scope: !104)
!104 = distinct !DILexicalBlock(scope: !76, file: !3, line: 232, column: 11)
!105 = !DILocation(line: 233, column: 7, scope: !104)
!106 = !DILocation(line: 233, column: 10, scope: !104)
!107 = !DILocation(line: 234, column: 7, scope: !104)
!108 = !DILocation(line: 234, column: 10, scope: !104)
!109 = !DILocation(line: 232, column: 11, scope: !76)
!110 = !DILocation(line: 235, column: 2, scope: !104)
!111 = !DILocation(line: 237, column: 14, scope: !112)
!112 = distinct !DILexicalBlock(scope: !76, file: !3, line: 237, column: 7)
!113 = !DILocation(line: 237, column: 12, scope: !112)
!114 = !DILocation(line: 238, column: 22, scope: !115)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 238, column: 6)
!116 = distinct !DILexicalBlock(scope: !112, file: !3, line: 237, column: 7)
!117 = !DILocation(line: 238, column: 8, scope: !115)
!118 = !DILocation(line: 238, column: 6, scope: !116)
!119 = !DILocation(line: 239, column: 4, scope: !115)
!120 = !DILocation(line: 240, column: 25, scope: !121)
!121 = distinct !DILexicalBlock(scope: !115, file: !3, line: 240, column: 11)
!122 = !DILocation(line: 240, column: 23, scope: !121)
!123 = !DILocation(line: 240, column: 11, scope: !115)
!124 = !DILocation(line: 241, column: 4, scope: !121)
!125 = !DILocation(line: 238, column: 23, scope: !115)
!126 = !DILocation(line: 237, column: 23, scope: !116)
!127 = !DILocation(line: 237, column: 7, scope: !116)
!128 = distinct !{!128, !129, !130}
!129 = !DILocation(line: 237, column: 7, scope: !112)
!130 = !DILocation(line: 241, column: 4, scope: !112)
!131 = !DILocation(line: 242, column: 13, scope: !132)
!132 = distinct !DILexicalBlock(scope: !76, file: !3, line: 242, column: 11)
!133 = !DILocation(line: 242, column: 11, scope: !76)
!134 = !DILocation(line: 243, column: 2, scope: !132)
!135 = !DILocation(line: 244, column: 5, scope: !76)
!136 = !DILocation(line: 224, column: 31, scope: !71)
!137 = !DILocation(line: 224, column: 3, scope: !71)
!138 = distinct !{!138, !73, !139}
!139 = !DILocation(line: 244, column: 5, scope: !68)
!140 = !DILocation(line: 245, column: 13, scope: !28)
!141 = !DILocation(line: 245, column: 29, scope: !28)
!142 = !DILocation(line: 245, column: 32, scope: !28)
!143 = !DILocation(line: 245, column: 54, scope: !28)
!144 = !DILocation(line: 245, column: 57, scope: !28)
!145 = !DILocation(line: 0, scope: !28)
!146 = !DILocation(line: 245, column: 10, scope: !28)
!147 = !DILocation(line: 245, column: 3, scope: !28)
!148 = !DILocation(line: 246, column: 1, scope: !28)
!149 = distinct !DISubprogram(name: "mktime_test", scope: !3, file: !3, line: 122, type: !150, scopeLine: 124, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!150 = !DISubroutineType(types: !151)
!151 = !{!31, !6}
!152 = !DILocalVariable(name: "now", arg: 1, scope: !149, file: !3, line: 123, type: !6)
!153 = !DILocation(line: 123, column: 13, scope: !149)
!154 = !DILocation(line: 125, column: 25, scope: !149)
!155 = !DILocation(line: 125, column: 11, scope: !149)
!156 = !DILocation(line: 126, column: 4, scope: !149)
!157 = !DILocation(line: 126, column: 31, scope: !149)
!158 = !DILocation(line: 126, column: 44, scope: !149)
!159 = !DILocation(line: 126, column: 42, scope: !149)
!160 = !DILocation(line: 126, column: 7, scope: !149)
!161 = !DILocation(line: 127, column: 4, scope: !149)
!162 = !DILocation(line: 127, column: 31, scope: !149)
!163 = !DILocation(line: 127, column: 44, scope: !149)
!164 = !DILocation(line: 127, column: 42, scope: !149)
!165 = !DILocation(line: 127, column: 7, scope: !149)
!166 = !DILocation(line: 0, scope: !149)
!167 = !DILocation(line: 125, column: 3, scope: !149)
!168 = distinct !DISubprogram(name: "bigtime_test", scope: !3, file: !3, line: 147, type: !169, scopeLine: 149, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!169 = !DISubroutineType(types: !170)
!170 = !{!31, !31}
!171 = !DILocalVariable(name: "j", arg: 1, scope: !168, file: !3, line: 148, type: !31)
!172 = !DILocation(line: 148, column: 10, scope: !168)
!173 = !DILocalVariable(name: "tm", scope: !168, file: !3, line: 150, type: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !7, line: 133, size: 448, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !174, file: !7, line: 135, baseType: !31, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !174, file: !7, line: 136, baseType: !31, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !174, file: !7, line: 137, baseType: !31, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !174, file: !7, line: 138, baseType: !31, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !174, file: !7, line: 139, baseType: !31, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !174, file: !7, line: 140, baseType: !31, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !174, file: !7, line: 141, baseType: !31, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !174, file: !7, line: 142, baseType: !31, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !174, file: !7, line: 143, baseType: !31, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !174, file: !7, line: 146, baseType: !10, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !174, file: !7, line: 147, baseType: !187, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!189 = !DILocation(line: 150, column: 13, scope: !168)
!190 = !DILocalVariable(name: "now", scope: !168, file: !3, line: 151, type: !6)
!191 = !DILocation(line: 151, column: 10, scope: !168)
!192 = !DILocation(line: 152, column: 78, scope: !168)
!193 = !DILocation(line: 152, column: 69, scope: !168)
!194 = !DILocation(line: 152, column: 76, scope: !168)
!195 = !DILocation(line: 152, column: 57, scope: !168)
!196 = !DILocation(line: 152, column: 64, scope: !168)
!197 = !DILocation(line: 152, column: 44, scope: !168)
!198 = !DILocation(line: 152, column: 52, scope: !168)
!199 = !DILocation(line: 152, column: 31, scope: !168)
!200 = !DILocation(line: 152, column: 39, scope: !168)
!201 = !DILocation(line: 152, column: 19, scope: !168)
!202 = !DILocation(line: 152, column: 26, scope: !168)
!203 = !DILocation(line: 152, column: 6, scope: !168)
!204 = !DILocation(line: 152, column: 14, scope: !168)
!205 = !DILocation(line: 153, column: 9, scope: !168)
!206 = !DILocation(line: 153, column: 7, scope: !168)
!207 = !DILocation(line: 154, column: 7, scope: !208)
!208 = distinct !DILexicalBlock(scope: !168, file: !3, line: 154, column: 7)
!209 = !DILocation(line: 154, column: 11, scope: !208)
!210 = !DILocation(line: 154, column: 7, scope: !168)
!211 = !DILocalVariable(name: "lt", scope: !212, file: !3, line: 156, type: !213)
!212 = distinct !DILexicalBlock(scope: !208, file: !3, line: 155, column: 5)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!214 = !DILocation(line: 156, column: 18, scope: !212)
!215 = !DILocation(line: 156, column: 23, scope: !212)
!216 = !DILocation(line: 157, column: 14, scope: !217)
!217 = distinct !DILexicalBlock(scope: !212, file: !3, line: 157, column: 11)
!218 = !DILocation(line: 158, column: 7, scope: !217)
!219 = !DILocation(line: 158, column: 10, scope: !217)
!220 = !DILocation(line: 158, column: 14, scope: !217)
!221 = !DILocation(line: 158, column: 28, scope: !217)
!222 = !DILocation(line: 158, column: 22, scope: !217)
!223 = !DILocation(line: 159, column: 7, scope: !217)
!224 = !DILocation(line: 159, column: 10, scope: !217)
!225 = !DILocation(line: 159, column: 14, scope: !217)
!226 = !DILocation(line: 159, column: 27, scope: !217)
!227 = !DILocation(line: 159, column: 21, scope: !217)
!228 = !DILocation(line: 160, column: 7, scope: !217)
!229 = !DILocation(line: 160, column: 10, scope: !217)
!230 = !DILocation(line: 160, column: 14, scope: !217)
!231 = !DILocation(line: 160, column: 28, scope: !217)
!232 = !DILocation(line: 160, column: 22, scope: !217)
!233 = !DILocation(line: 161, column: 7, scope: !217)
!234 = !DILocation(line: 161, column: 10, scope: !217)
!235 = !DILocation(line: 161, column: 14, scope: !217)
!236 = !DILocation(line: 161, column: 28, scope: !217)
!237 = !DILocation(line: 161, column: 22, scope: !217)
!238 = !DILocation(line: 162, column: 7, scope: !217)
!239 = !DILocation(line: 162, column: 10, scope: !217)
!240 = !DILocation(line: 162, column: 14, scope: !217)
!241 = !DILocation(line: 162, column: 27, scope: !217)
!242 = !DILocation(line: 162, column: 21, scope: !217)
!243 = !DILocation(line: 163, column: 7, scope: !217)
!244 = !DILocation(line: 163, column: 10, scope: !217)
!245 = !DILocation(line: 163, column: 14, scope: !217)
!246 = !DILocation(line: 163, column: 27, scope: !217)
!247 = !DILocation(line: 163, column: 21, scope: !217)
!248 = !DILocation(line: 164, column: 7, scope: !217)
!249 = !DILocation(line: 164, column: 10, scope: !217)
!250 = !DILocation(line: 164, column: 14, scope: !217)
!251 = !DILocation(line: 164, column: 28, scope: !217)
!252 = !DILocation(line: 164, column: 22, scope: !217)
!253 = !DILocation(line: 165, column: 7, scope: !217)
!254 = !DILocation(line: 165, column: 10, scope: !217)
