; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.module_t = type opaque
%struct.module_config_t = type { i32, i8*, i8*, i8, i8*, i8*, %union.module_value_t, %union.module_value_t, %union.module_value_t, %union.module_nvalue_t, %union.module_nvalue_t, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i8*, i8**, i32*, i8**, i32, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)**, i8**, i32, i8, i8, i8, i8, i8*, i8, i8, i8, i8 }
%union.module_value_t = type { i8* }
%union.module_nvalue_t = type { i32 }
%struct.vlc_object_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t* }
%struct.libvlc_int_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.hotkey* }
%struct.hotkey = type opaque
%struct.access_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.module_t*, i8*, i8*, i8*, i64 (%struct.access_t*, i8*, i64)*, %struct.block_t* (%struct.access_t*)*, i32 (%struct.access_t*, i64)*, i32 (%struct.access_t*, i32, %struct.__va_list_tag*)*, %struct.anon.0, %union.module_nvalue_t*, %struct.input_thread_t* }
%struct.block_t = type { %struct.block_t*, i32, i64, i64, i64, i32, i32, i64, i8*, void (%struct.block_t*)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon.0 = type { i32, i64, i64, i8, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !37, nameTableKind: None)
!1 = !DIFile(filename: "mms.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vlc_module_properties", file: !4, line: 37, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "../../../include/vlc_plugin.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!7 = !DIEnumerator(name: "VLC_SUBMODULE_CREATE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "VLC_CONFIG_CREATE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "VLC_MODULE_CPU_REQUIREMENT", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "VLC_MODULE_SHORTCUT", value: 257, isUnsigned: true)
!11 = !DIEnumerator(name: "VLC_MODULE_CAPABILITY", value: 258, isUnsigned: true)
!12 = !DIEnumerator(name: "VLC_MODULE_SCORE", value: 259, isUnsigned: true)
!13 = !DIEnumerator(name: "VLC_MODULE_CB_OPEN", value: 260, isUnsigned: true)
!14 = !DIEnumerator(name: "VLC_MODULE_CB_CLOSE", value: 261, isUnsigned: true)
!15 = !DIEnumerator(name: "VLC_MODULE_NO_UNLOAD", value: 262, isUnsigned: true)
!16 = !DIEnumerator(name: "VLC_MODULE_NAME", value: 263, isUnsigned: true)
!17 = !DIEnumerator(name: "VLC_MODULE_SHORTNAME", value: 264, isUnsigned: true)
!18 = !DIEnumerator(name: "VLC_MODULE_DESCRIPTION", value: 265, isUnsigned: true)
!19 = !DIEnumerator(name: "VLC_MODULE_HELP", value: 266, isUnsigned: true)
!20 = !DIEnumerator(name: "VLC_MODULE_TEXTDOMAIN", value: 267, isUnsigned: true)
!21 = !DIEnumerator(name: "VLC_CONFIG_NAME", value: 4096, isUnsigned: true)
!22 = !DIEnumerator(name: "VLC_CONFIG_VALUE", value: 4097, isUnsigned: true)
!23 = !DIEnumerator(name: "VLC_CONFIG_RANGE", value: 4098, isUnsigned: true)
!24 = !DIEnumerator(name: "VLC_CONFIG_ADVANCED", value: 4099, isUnsigned: true)
!25 = !DIEnumerator(name: "VLC_CONFIG_VOLATILE", value: 4100, isUnsigned: true)
!26 = !DIEnumerator(name: "VLC_CONFIG_PERSISTENT", value: 4101, isUnsigned: true)
!27 = !DIEnumerator(name: "VLC_CONFIG_RESTART", value: 4102, isUnsigned: true)
!28 = !DIEnumerator(name: "VLC_CONFIG_PRIVATE", value: 4103, isUnsigned: true)
!29 = !DIEnumerator(name: "VLC_CONFIG_REMOVED", value: 4104, isUnsigned: true)
!30 = !DIEnumerator(name: "VLC_CONFIG_CAPABILITY", value: 4105, isUnsigned: true)
!31 = !DIEnumerator(name: "VLC_CONFIG_SHORTCUT", value: 4106, isUnsigned: true)
!32 = !DIEnumerator(name: "VLC_CONFIG_OLDNAME", value: 4107, isUnsigned: true)
!33 = !DIEnumerator(name: "VLC_CONFIG_SAFE", value: 4108, isUnsigned: true)
!34 = !DIEnumerator(name: "VLC_CONFIG_DESC", value: 4109, isUnsigned: true)
!35 = !DIEnumerator(name: "VLC_CONFIG_LIST", value: 4110, isUnsigned: true)
!36 = !DIEnumerator(name: "VLC_CONFIG_ADD_ACTION", value: 4111, isUnsigned: true)
!37 = !{!38, !41, !42, !87, !117, !47, !144, !206, !208}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_callback_t", file: !43, line: 490, baseType: !44)
!43 = !DIFile(filename: "../../../include/vlc_common.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!41, !47, !38, !78, !78, !87}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !43, line: 177, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !50, line: 60, size: 320, elements: !51)
!50 = !DIFile(filename: "../../../include/vlc_objects.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!51 = !{!52, !53, !55, !56, !59, !60, !77}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !49, file: !50, line: 62, baseType: !38, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !49, file: !50, line: 62, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !49, file: !50, line: 62, baseType: !41, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !49, file: !50, line: 62, baseType: !57, size: 8, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !49, file: !50, line: 62, baseType: !58, size: 8, offset: 168)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !49, file: !50, line: 62, baseType: !61, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !43, line: 178, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !64, line: 38, size: 384, elements: !65)
!64 = !DIFile(filename: "../../../include/vlc_main.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !63, file: !64, line: 40, baseType: !38, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !63, file: !64, line: 40, baseType: !54, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !63, file: !64, line: 40, baseType: !41, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !63, file: !64, line: 40, baseType: !57, size: 8, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !63, file: !64, line: 40, baseType: !58, size: 8, offset: 168)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !63, file: !64, line: 40, baseType: !61, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !63, file: !64, line: 40, baseType: !47, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !63, file: !64, line: 43, baseType: !74, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "hotkey", file: !64, line: 31, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !49, file: !50, line: 62, baseType: !47, size: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_value_t", file: !43, line: 432, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !43, line: 417, size: 64, elements: !80)
!80 = !{!81, !82, !83, !85, !86, !88, !89, !99, !104, !110}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_int", scope: !79, file: !43, line: 419, baseType: !41, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "b_bool", scope: !79, file: !43, line: 420, baseType: !58, size: 8)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "f_float", scope: !79, file: !43, line: 421, baseType: !84, size: 32)
!84 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "psz_string", scope: !79, file: !43, line: 422, baseType: !54, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "p_address", scope: !79, file: !43, line: 423, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "p_object", scope: !79, file: !43, line: 424, baseType: !47, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "p_list", scope: !79, file: !43, line: 425, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_list_t", file: !43, line: 176, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_list_t", file: !43, line: 437, size: 192, elements: !93)
!93 = !{!94, !95, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !92, file: !43, line: 439, baseType: !41, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "p_values", scope: !92, file: !43, line: 440, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pi_types", scope: !92, file: !43, line: 441, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_time", scope: !79, file: !43, line: 426, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtime_t", file: !43, line: 131, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !102, line: 197, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !79, file: !43, line: 427, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !79, file: !43, line: 427, size: 64, elements: !106)
!106 = !{!107, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !105, file: !43, line: 427, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !102, line: 196, baseType: !41)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !105, file: !43, line: 427, baseType: !108, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !79, file: !43, line: 430, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !115)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !113, line: 48, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!114 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !{!116}
!116 = !DISubrange(count: 8)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_t", file: !43, line: 220, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_t", file: !120, line: 74, size: 1280, elements: !121)
!120 = !DIFile(filename: "../../../include/vlc_access.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !133, !134, !135, !136, !147, !171, !176, !187, !196, !202}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !119, file: !120, line: 76, baseType: !38, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !119, file: !120, line: 76, baseType: !54, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !119, file: !120, line: 76, baseType: !41, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !119, file: !120, line: 76, baseType: !57, size: 8, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !119, file: !120, line: 76, baseType: !58, size: 8, offset: 168)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !119, file: !120, line: 76, baseType: !61, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !119, file: !120, line: 76, baseType: !47, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !119, file: !120, line: 79, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_t", file: !43, line: 208, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_t", file: !43, line: 208, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "psz_access", scope: !119, file: !120, line: 82, baseType: !54, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !119, file: !120, line: 84, baseType: !54, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "psz_demux", scope: !119, file: !120, line: 89, baseType: !54, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !119, file: !120, line: 93, baseType: !137, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !117, !143, !144}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !102, line: 109, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !142, line: 172, baseType: !103)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 62, baseType: !146)
!145 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!146 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pf_block", scope: !119, file: !120, line: 94, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !117}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_t", file: !43, line: 330, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_t", file: !154, line: 103, size: 576, elements: !155)
!154 = !DIFile(filename: "../../../include/vlc_block.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!155 = !{!156, !157, !159, !160, !161, !162, !163, !164, !165, !166}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !153, file: !154, line: 105, baseType: !151, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !153, file: !154, line: 107, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !113, line: 51, baseType: !5)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !153, file: !154, line: 109, baseType: !100, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !153, file: !154, line: 110, baseType: !100, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !153, file: !154, line: 111, baseType: !100, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_samples", scope: !153, file: !154, line: 113, baseType: !5, size: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !153, file: !154, line: 114, baseType: !41, size: 32, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_buffer", scope: !153, file: !154, line: 116, baseType: !144, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "p_buffer", scope: !153, file: !154, line: 117, baseType: !143, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !153, file: !154, line: 120, baseType: !167, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_free_t", file: !154, line: 101, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !151}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pf_seek", scope: !119, file: !120, line: 98, baseType: !172, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!41, !117, !175}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !113, line: 55, baseType: !146)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !119, file: !120, line: 102, baseType: !177, size: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!41, !117, !41, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 112, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !181, file: !1, line: 112, baseType: !5, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !181, file: !1, line: 112, baseType: !5, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !181, file: !1, line: 112, baseType: !87, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !181, file: !1, line: 112, baseType: !87, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !119, file: !120, line: 116, baseType: !188, size: 320, offset: 832)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !120, line: 105, size: 320, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_update", scope: !188, file: !120, line: 107, baseType: !5, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !188, file: !120, line: 110, baseType: !175, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_pos", scope: !188, file: !120, line: 111, baseType: !175, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !188, file: !120, line: 112, baseType: !58, size: 8, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_title", scope: !188, file: !120, line: 114, baseType: !41, size: 32, offset: 224)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !188, file: !120, line: 115, baseType: !41, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !119, file: !120, line: 117, baseType: !197, size: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_sys_t", file: !43, line: 221, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_sys_t", file: !1, line: 102, size: 32, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_proto", scope: !199, file: !1, line: 104, baseType: !41, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !119, file: !120, line: 120, baseType: !203, size: 64, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_t", file: !43, line: 216, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_t", file: !43, line: 216, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !212, retainedTypes: !254, nameTableKind: None)
!211 = !DIFile(filename: "mmsh.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!212 = !{!213, !225}
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !214, line: 24, baseType: !5, size: 32, elements: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!218 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!219 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!220 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!221 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!222 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!223 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!224 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 40, baseType: !5, size: 32, elements: !227)
!226 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!228 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!229 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!232 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!234 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!235 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!236 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!237 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!238 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!239 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!240 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!241 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!242 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!243 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!244 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!245 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!246 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!247 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!248 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!249 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!250 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!251 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!252 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!253 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!254 = !{!255, !87, !54, !41, !278, !279, !280, !101, !58, !281, !283, !158, !144, !206, !208, !38}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !43, line: 177, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !50, line: 60, size: 320, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !277}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !257, file: !50, line: 62, baseType: !38, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !257, file: !50, line: 62, baseType: !54, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !257, file: !50, line: 62, baseType: !41, size: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !257, file: !50, line: 62, baseType: !57, size: 8, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !257, file: !50, line: 62, baseType: !58, size: 8, offset: 168)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !257, file: !50, line: 62, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !43, line: 178, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !64, line: 38, size: 384, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !267, file: !64, line: 40, baseType: !38, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !267, file: !64, line: 40, baseType: !54, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !267, file: !64, line: 40, baseType: !41, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !267, file: !64, line: 40, baseType: !57, size: 8, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !267, file: !64, line: 40, baseType: !58, size: 8, offset: 168)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !267, file: !64, line: 40, baseType: !265, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !267, file: !64, line: 40, baseType: !255, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !267, file: !64, line: 43, baseType: !74, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !257, file: !50, line: 62, baseType: !255, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !113, line: 49, baseType: !284)
!284 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !212, retainedTypes: !287, nameTableKind: None)
!286 = !DIFile(filename: "mmstu.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!287 = !{!288, !87, !144, !206, !208, !38, !175, !54, !41, !278, !279, !280, !101, !58, !158, !281, !283, !311, !312}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !43, line: 177, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !50, line: 60, size: 320, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !310}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !290, file: !50, line: 62, baseType: !38, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !290, file: !50, line: 62, baseType: !54, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !290, file: !50, line: 62, baseType: !41, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !290, file: !50, line: 62, baseType: !57, size: 8, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !290, file: !50, line: 62, baseType: !58, size: 8, offset: 168)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !290, file: !50, line: 62, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !43, line: 178, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !64, line: 38, size: 384, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !300, file: !64, line: 40, baseType: !38, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !300, file: !64, line: 40, baseType: !54, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !300, file: !64, line: 40, baseType: !41, size: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !300, file: !64, line: 40, baseType: !57, size: 8, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !300, file: !64, line: 40, baseType: !58, size: 8, offset: 168)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !300, file: !64, line: 40, baseType: !298, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !300, file: !64, line: 40, baseType: !288, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !300, file: !64, line: 43, baseType: !74, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !290, file: !50, line: 62, baseType: !288, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !314, line: 170, size: 128, elements: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!315 = !{!316, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !313, file: !314, line: 172, baseType: !317, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !318, line: 28, baseType: !284)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !313, file: !314, line: 173, baseType: !320, size: 112, offset: 16)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 112, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 14)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !325, retainedTypes: !326, nameTableKind: None)
!324 = !DIFile(filename: "buffer.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!325 = !{}
!326 = !{!87, !281, !283}
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !325, retainedTypes: !329, globals: !330, nameTableKind: None)
!328 = !DIFile(filename: "asf.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!329 = !{!87}
!330 = !{!331, !342, !344, !346, !348, !350, !352, !354}
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "asf_object_header_guid", scope: !327, file: !333, line: 78, type: !334, isLocal: true, isDefinition: true)
!333 = !DIFile(filename: "./asf.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "guid_t", file: !333, line: 61, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "guid_s", file: !333, line: 55, size: 128, elements: !337)
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !336, file: !333, line: 57, baseType: !158, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !336, file: !333, line: 58, baseType: !283, size: 16, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !336, file: !333, line: 59, baseType: !283, size: 16, offset: 48)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !336, file: !333, line: 60, baseType: !111, size: 64, offset: 64)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "asf_object_file_properties_guid", scope: !327, file: !333, line: 86, type: !334, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "asf_object_header_extension_guid", scope: !327, file: !333, line: 142, type: !334, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "asf_object_extended_stream_properties_guid", scope: !327, file: !333, line: 134, type: !334, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "asf_object_stream_properties_guid", scope: !327, file: !333, line: 94, type: !334, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "asf_object_stream_type_video", scope: !327, file: !333, line: 110, type: !334, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "asf_object_stream_type_audio", scope: !327, file: !333, line: 102, type: !334, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "asf_object_bitrate_properties_guid", scope: !327, file: !333, line: 118, type: !334, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !325, nameTableKind: None)
!357 = !DIFile(filename: "strlcpy.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/compat")
!358 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!359 = !{i32 2, !"Dwarf Version", i32 4}
!360 = !{i32 2, !"Debug Info Version", i32 3}
!361 = !{i32 1, !"wchar_size", i32 4}
!362 = !{i32 7, !"PIC Level", i32 2}
!363 = !{i32 1, !"ThinLTO", i32 0}
!364 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!365 = distinct !DISubprogram(name: "vlc_entry__1_1_0g", scope: !1, file: !1, line: 72, type: !366, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !368)
!366 = !DISubroutineType(types: !367)
!367 = !{!41, !130}
!368 = !{!369, !370, !418}
!369 = !DILocalVariable(name: "p_module", arg: 1, scope: !365, file: !1, line: 72, type: !130)
!370 = !DILocalVariable(name: "p_config", scope: !365, file: !1, line: 72, type: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_config_t", file: !43, line: 209, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_config_t", file: !374, line: 150, size: 1408, elements: !375)
!374 = !DIFile(filename: "../../../include/vlc_configuration.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!375 = !{!376, !377, !378, !379, !380, !381, !382, !389, !390, !391, !397, !398, !399, !400, !401, !402, !403, !404, !405, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !373, file: !374, line: 152, baseType: !41, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "psz_type", scope: !373, file: !374, line: 153, baseType: !54, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !373, file: !374, line: 154, baseType: !54, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_short", scope: !373, file: !374, line: 155, baseType: !40, size: 8, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "psz_text", scope: !373, file: !374, line: 156, baseType: !54, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "psz_longtext", scope: !373, file: !374, line: 157, baseType: !54, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !373, file: !374, line: 158, baseType: !383, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_value_t", file: !374, line: 142, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !374, line: 137, size: 64, elements: !385)
!385 = !{!386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "psz", scope: !384, file: !374, line: 139, baseType: !54, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !384, file: !374, line: 140, baseType: !41, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !384, file: !374, line: 141, baseType: !84, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !373, file: !374, line: 159, baseType: !383, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !373, file: !374, line: 160, baseType: !383, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !373, file: !374, line: 161, baseType: !392, size: 32, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_nvalue_t", file: !374, line: 148, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !374, line: 144, size: 32, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !393, file: !374, line: 146, baseType: !41, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !393, file: !374, line: 147, baseType: !84, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !373, file: !374, line: 162, baseType: !392, size: 32, offset: 608)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pf_callback", scope: !373, file: !374, line: 165, baseType: !42, size: 64, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "p_callback_data", scope: !373, file: !374, line: 166, baseType: !87, size: 64, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list", scope: !373, file: !374, line: 169, baseType: !278, size: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pi_list", scope: !373, file: !374, line: 170, baseType: !98, size: 64, offset: 832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list_text", scope: !373, file: !374, line: 171, baseType: !278, size: 64, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_list", scope: !373, file: !374, line: 172, baseType: !41, size: 32, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pf_update_list", scope: !373, file: !374, line: 173, baseType: !42, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ppf_action", scope: !373, file: !374, line: 176, baseType: !406, size: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_action_text", scope: !373, file: !374, line: 177, baseType: !278, size: 64, offset: 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_action", scope: !373, file: !374, line: 178, baseType: !41, size: 32, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b_dirty", scope: !373, file: !374, line: 181, baseType: !58, size: 8, offset: 1248)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_advanced", scope: !373, file: !374, line: 182, baseType: !58, size: 8, offset: 1256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_internal", scope: !373, file: !374, line: 183, baseType: !58, size: 8, offset: 1264)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b_restart", scope: !373, file: !374, line: 184, baseType: !58, size: 8, offset: 1272)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "psz_oldname", scope: !373, file: !374, line: 188, baseType: !54, size: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_removed", scope: !373, file: !374, line: 189, baseType: !58, size: 8, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_autosave", scope: !373, file: !374, line: 192, baseType: !58, size: 8, offset: 1352)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_unsaveable", scope: !373, file: !374, line: 193, baseType: !58, size: 8, offset: 1360)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_safe", scope: !373, file: !374, line: 195, baseType: !58, size: 8, offset: 1368)
!418 = !DILocalVariable(name: "p_submodule", scope: !419, file: !1, line: 72, type: !130)
!419 = distinct !DILexicalBlock(scope: !365, file: !1, line: 72, column: 1)
!420 = !DILocation(line: 72, column: 1, scope: !365)
!421 = !{!422, !422, i64 0}
!422 = !{!"any pointer", !423, i64 0}
!423 = !{!"omnipotent char", !424, i64 0}
!424 = !{!"Simple C/C++ TBAA"}
!425 = !DILocation(line: 72, column: 1, scope: !426)
!426 = distinct !DILexicalBlock(scope: !365, file: !1, line: 72, column: 1)
!427 = !DILocation(line: 72, column: 1, scope: !419)
!428 = !DILocation(line: 73, column: 5, scope: !429)
!429 = distinct !DILexicalBlock(scope: !419, file: !1, line: 73, column: 5)
!430 = !DILocation(line: 73, column: 5, scope: !419)
!431 = !DILocation(line: 74, column: 5, scope: !432)
!432 = distinct !DILexicalBlock(scope: !419, file: !1, line: 74, column: 5)
!433 = !DILocation(line: 74, column: 5, scope: !419)
!434 = !DILocation(line: 75, column: 5, scope: !435)
!435 = distinct !DILexicalBlock(scope: !419, file: !1, line: 75, column: 5)
!436 = !DILocation(line: 75, column: 5, scope: !419)
!437 = !DILocation(line: 76, column: 5, scope: !419)
!438 = !DILocation(line: 77, column: 5, scope: !419)
!439 = !DILocation(line: 79, column: 5, scope: !419)
!440 = !DILocation(line: 79, column: 5, scope: !441)
!441 = distinct !DILexicalBlock(scope: !419, file: !1, line: 79, column: 5)
!442 = !DILocation(line: 82, column: 5, scope: !419)
!443 = !DILocation(line: 82, column: 5, scope: !444)
!444 = distinct !DILexicalBlock(scope: !419, file: !1, line: 82, column: 5)
!445 = !DILocation(line: 85, column: 5, scope: !419)
!446 = !DILocation(line: 85, column: 5, scope: !447)
!447 = distinct !DILexicalBlock(scope: !419, file: !1, line: 85, column: 5)
!448 = !DILocation(line: 86, column: 5, scope: !419)
!449 = !DILocation(line: 88, column: 5, scope: !419)
!450 = !DILocation(line: 91, column: 5, scope: !451)
!451 = distinct !DILexicalBlock(scope: !419, file: !1, line: 91, column: 5)
!452 = !DILocation(line: 91, column: 5, scope: !419)
!453 = !DILocation(line: 92, column: 5, scope: !454)
!454 = distinct !DILexicalBlock(scope: !419, file: !1, line: 92, column: 5)
!455 = !DILocation(line: 92, column: 5, scope: !419)
!456 = !DILocation(line: 93, column: 5, scope: !457)
!457 = distinct !DILexicalBlock(scope: !419, file: !1, line: 93, column: 5)
!458 = !DILocation(line: 93, column: 5, scope: !419)
!459 = !DILocation(line: 94, column: 5, scope: !460)
!460 = distinct !DILexicalBlock(scope: !419, file: !1, line: 94, column: 5)
!461 = !DILocation(line: 94, column: 5, scope: !419)
!462 = !DILocation(line: 95, column: 5, scope: !463)
!463 = distinct !DILexicalBlock(scope: !419, file: !1, line: 95, column: 5)
!464 = !DILocation(line: 95, column: 5, scope: !419)
!465 = !DILocation(line: 96, column: 5, scope: !466)
!466 = distinct !DILexicalBlock(scope: !419, file: !1, line: 96, column: 5)
!467 = !DILocation(line: 97, column: 1, scope: !365)
!468 = distinct !DISubprogram(name: "Open", scope: !1, file: !1, line: 110, type: !469, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{!41, !47}
!471 = !{!472, !473, !474, !479, !480, !482, !483, !486, !487, !489, !490, !493, !494, !496, !497, !499, !500, !502}
!472 = !DILocalVariable(name: "p_this", arg: 1, scope: !468, file: !1, line: 110, type: !47)
!473 = !DILocalVariable(name: "p_access", scope: !468, file: !1, line: 112, type: !117)
!474 = !DILocalVariable(name: "__s1_len", scope: !475, file: !1, line: 124, type: !144)
!475 = distinct !DILexicalBlock(scope: !476, file: !1, line: 124, column: 14)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 124, column: 13)
!477 = distinct !DILexicalBlock(scope: !478, file: !1, line: 123, column: 5)
!478 = distinct !DILexicalBlock(scope: !468, file: !1, line: 122, column: 9)
!479 = !DILocalVariable(name: "__s2_len", scope: !475, file: !1, line: 124, type: !144)
!480 = !DILocalVariable(name: "__s2", scope: !481, file: !1, line: 124, type: !208)
!481 = distinct !DILexicalBlock(scope: !475, file: !1, line: 124, column: 14)
!482 = !DILocalVariable(name: "__result", scope: !481, file: !1, line: 124, type: !41)
!483 = !DILocalVariable(name: "__s1_len", scope: !484, file: !1, line: 128, type: !144)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 128, column: 19)
!485 = distinct !DILexicalBlock(scope: !476, file: !1, line: 128, column: 18)
!486 = !DILocalVariable(name: "__s2_len", scope: !484, file: !1, line: 128, type: !144)
!487 = !DILocalVariable(name: "__s2", scope: !488, file: !1, line: 128, type: !208)
!488 = distinct !DILexicalBlock(scope: !484, file: !1, line: 128, column: 19)
!489 = !DILocalVariable(name: "__result", scope: !488, file: !1, line: 128, type: !41)
!490 = !DILocalVariable(name: "__s1_len", scope: !491, file: !1, line: 132, type: !144)
!491 = distinct !DILexicalBlock(scope: !492, file: !1, line: 132, column: 19)
!492 = distinct !DILexicalBlock(scope: !485, file: !1, line: 132, column: 18)
!493 = !DILocalVariable(name: "__s2_len", scope: !491, file: !1, line: 132, type: !144)
!494 = !DILocalVariable(name: "__s2", scope: !495, file: !1, line: 132, type: !208)
!495 = distinct !DILexicalBlock(scope: !491, file: !1, line: 132, column: 19)
!496 = !DILocalVariable(name: "__result", scope: !495, file: !1, line: 132, type: !41)
!497 = !DILocalVariable(name: "__s1_len", scope: !498, file: !1, line: 133, type: !144)
!498 = distinct !DILexicalBlock(scope: !492, file: !1, line: 133, column: 19)
!499 = !DILocalVariable(name: "__s2_len", scope: !498, file: !1, line: 133, type: !144)
!500 = !DILocalVariable(name: "__s2", scope: !501, file: !1, line: 133, type: !208)
!501 = distinct !DILexicalBlock(scope: !498, file: !1, line: 133, column: 19)
!502 = !DILocalVariable(name: "__result", scope: !501, file: !1, line: 133, type: !41)
!503 = !DILocation(line: 110, column: 32, scope: !468)
!504 = !DILocation(line: 112, column: 26, scope: !468)
!505 = !DILocation(line: 112, column: 15, scope: !468)
!506 = !DILocation(line: 115, column: 5, scope: !468)
!507 = !DILocation(line: 116, column: 5, scope: !468)
!508 = !DILocation(line: 119, column: 5, scope: !468)
!509 = !DILocation(line: 122, column: 20, scope: !478)
!510 = !{!511, !422, i64 48}
!511 = !{!"access_t", !422, i64 0, !422, i64 8, !512, i64 16, !513, i64 20, !513, i64 21, !422, i64 24, !422, i64 32, !422, i64 40, !422, i64 48, !422, i64 56, !422, i64 64, !422, i64 72, !422, i64 80, !422, i64 88, !422, i64 96, !514, i64 104, !422, i64 144, !422, i64 152}
!512 = !{!"int", !423, i64 0}
!513 = !{!"_Bool", !423, i64 0}
!514 = !{!"", !512, i64 0, !515, i64 8, !515, i64 16, !513, i64 24, !512, i64 28, !512, i64 32}
!515 = !{!"long", !423, i64 0}
!516 = !DILocation(line: 122, column: 9, scope: !478)
!517 = !{!423, !423, i64 0}
!518 = !DILocation(line: 122, column: 9, scope: !468)
!519 = !DILocation(line: 124, column: 14, scope: !476)
!520 = !DILocation(line: 124, column: 13, scope: !477)
!521 = !DILocation(line: 126, column: 21, scope: !522)
!522 = distinct !DILexicalBlock(scope: !476, file: !1, line: 125, column: 9)
!523 = !DILocation(line: 126, column: 13, scope: !522)
!524 = !DILocation(line: 128, column: 19, scope: !485)
!525 = !DILocation(line: 128, column: 18, scope: !476)
!526 = !DILocation(line: 130, column: 21, scope: !527)
!527 = distinct !DILexicalBlock(scope: !485, file: !1, line: 129, column: 9)
!528 = !DILocation(line: 130, column: 13, scope: !527)
!529 = !DILocation(line: 132, column: 19, scope: !492)
!530 = !DILocation(line: 132, column: 62, scope: !492)
!531 = !DILocation(line: 133, column: 19, scope: !492)
!532 = !DILocation(line: 132, column: 18, scope: !485)
!533 = !DILocation(line: 135, column: 21, scope: !534)
!534 = distinct !DILexicalBlock(scope: !492, file: !1, line: 134, column: 9)
!535 = !DILocation(line: 135, column: 13, scope: !534)
!536 = !DILocation(line: 139, column: 9, scope: !537)
!537 = distinct !DILexicalBlock(scope: !468, file: !1, line: 139, column: 9)
!538 = !DILocation(line: 139, column: 9, scope: !468)
!539 = !DILocation(line: 141, column: 23, scope: !540)
!540 = distinct !DILexicalBlock(scope: !541, file: !1, line: 141, column: 13)
!541 = distinct !DILexicalBlock(scope: !537, file: !1, line: 140, column: 5)
!542 = !{!511, !513, i64 20}
!543 = !{i8 0, i8 2}
!544 = !DILocation(line: 141, column: 13, scope: !541)
!545 = !DILocation(line: 145, column: 17, scope: !541)
!546 = !DILocation(line: 145, column: 9, scope: !541)
!547 = !DILocation(line: 0, scope: !468)
!548 = !DILocation(line: 148, column: 1, scope: !468)
!549 = distinct !DISubprogram(name: "Close", scope: !1, file: !1, line: 153, type: !550, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !47}
!552 = !{!553, !554, !555}
!553 = !DILocalVariable(name: "p_this", arg: 1, scope: !549, file: !1, line: 153, type: !47)
!554 = !DILocalVariable(name: "p_access", scope: !549, file: !1, line: 155, type: !117)
!555 = !DILocalVariable(name: "p_sys", scope: !549, file: !1, line: 156, type: !197)
!556 = !DILocation(line: 153, column: 34, scope: !549)
!557 = !DILocation(line: 155, column: 30, scope: !549)
!558 = !DILocation(line: 155, column: 19, scope: !549)
!559 = !DILocation(line: 156, column: 37, scope: !549)
!560 = !{!511, !422, i64 144}
!561 = !DILocation(line: 156, column: 19, scope: !549)
!562 = !DILocation(line: 158, column: 18, scope: !563)
!563 = distinct !DILexicalBlock(scope: !549, file: !1, line: 158, column: 9)
!564 = !{!565, !512, i64 0}
!565 = !{!"access_sys_t", !512, i64 0}
!566 = !DILocation(line: 158, column: 45, scope: !563)
!567 = !DILocation(line: 161, column: 10, scope: !568)
!568 = distinct !DILexicalBlock(scope: !563, file: !1, line: 160, column: 5)
!569 = !DILocation(line: 162, column: 5, scope: !568)
!570 = !DILocation(line: 165, column: 10, scope: !571)
!571 = distinct !DILexicalBlock(scope: !572, file: !1, line: 164, column: 5)
!572 = distinct !DILexicalBlock(scope: !563, file: !1, line: 163, column: 14)
!573 = !DILocation(line: 166, column: 5, scope: !571)
!574 = !DILocation(line: 167, column: 1, scope: !549)
!575 = distinct !DISubprogram(name: "vlc_entry_copyright__1_1_0g", scope: !1, file: !1, line: 97, type: !576, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !325)
!576 = !DISubroutineType(types: !577)
!577 = !{!38}
!578 = !DILocation(line: 97, column: 1, scope: !575)
!579 = distinct !DISubprogram(name: "vlc_entry_license__1_1_0g", scope: !1, file: !1, line: 97, type: !576, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !325)
!580 = !DILocation(line: 97, column: 1, scope: !579)
!581 = distinct !DISubprogram(name: "MMSHOpen", scope: !211, file: !211, line: 76, type: !582, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !210, retainedNodes: !731)
!582 = !DISubroutineType(types: !583)
!583 = !{!41, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_t", file: !43, line: 220, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_t", file: !120, line: 74, size: 1280, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !603, !625, !629, !640, !649, !710}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !586, file: !120, line: 76, baseType: !38, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !586, file: !120, line: 76, baseType: !54, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !586, file: !120, line: 76, baseType: !41, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !586, file: !120, line: 76, baseType: !57, size: 8, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !586, file: !120, line: 76, baseType: !58, size: 8, offset: 168)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !586, file: !120, line: 76, baseType: !265, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !586, file: !120, line: 76, baseType: !255, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !586, file: !120, line: 79, baseType: !130, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "psz_access", scope: !586, file: !120, line: 82, baseType: !54, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !586, file: !120, line: 84, baseType: !54, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "psz_demux", scope: !586, file: !120, line: 89, baseType: !54, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !586, file: !120, line: 93, baseType: !600, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!140, !584, !143, !144}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pf_block", scope: !586, file: !120, line: 94, baseType: !604, size: 64, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!607, !584}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_t", file: !43, line: 330, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_t", file: !154, line: 103, size: 576, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !609, file: !154, line: 105, baseType: !607, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !609, file: !154, line: 107, baseType: !158, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !609, file: !154, line: 109, baseType: !100, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !609, file: !154, line: 110, baseType: !100, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !609, file: !154, line: 111, baseType: !100, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_samples", scope: !609, file: !154, line: 113, baseType: !5, size: 32, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !609, file: !154, line: 114, baseType: !41, size: 32, offset: 352)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_buffer", scope: !609, file: !154, line: 116, baseType: !144, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "p_buffer", scope: !609, file: !154, line: 117, baseType: !143, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !609, file: !154, line: 120, baseType: !621, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_free_t", file: !154, line: 101, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !607}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pf_seek", scope: !586, file: !120, line: 98, baseType: !626, size: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!41, !584, !175}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !586, file: !120, line: 102, baseType: !630, size: 64, offset: 768)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!41, !584, !41, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !211, size: 192, elements: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !634, file: !211, baseType: !5, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !634, file: !211, baseType: !5, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !634, file: !211, baseType: !87, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !634, file: !211, baseType: !87, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !586, file: !120, line: 116, baseType: !641, size: 320, offset: 832)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !586, file: !120, line: 105, size: 320, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_update", scope: !641, file: !120, line: 107, baseType: !5, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !641, file: !120, line: 110, baseType: !175, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_pos", scope: !641, file: !120, line: 111, baseType: !175, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !641, file: !120, line: 112, baseType: !58, size: 8, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_title", scope: !641, file: !120, line: 114, baseType: !41, size: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !641, file: !120, line: 115, baseType: !41, size: 32, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !586, file: !120, line: 117, baseType: !650, size: 64, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_sys_t", file: !43, line: 221, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_sys_t", file: !653, line: 43, size: 538496, elements: !654)
!653 = !DIFile(filename: "./mmsh.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!654 = !{!655, !656, !657, !670, !671, !672, !673, !677, !678, !679, !680, !681, !682, !683, !684, !685, !702}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_proto", scope: !652, file: !653, line: 45, baseType: !41, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !652, file: !653, line: 47, baseType: !41, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !652, file: !653, line: 48, baseType: !658, size: 512, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_url_t", file: !43, line: 321, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_url_t", file: !660, line: 33, size: 512, elements: !661)
!660 = !DIFile(filename: "../../../include/vlc_url.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "psz_protocol", scope: !659, file: !660, line: 35, baseType: !54, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "psz_username", scope: !659, file: !660, line: 36, baseType: !54, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "psz_password", scope: !659, file: !660, line: 37, baseType: !54, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "psz_host", scope: !659, file: !660, line: 38, baseType: !54, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_port", scope: !659, file: !660, line: 39, baseType: !41, size: 32, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !659, file: !660, line: 41, baseType: !54, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "psz_option", scope: !659, file: !660, line: 43, baseType: !54, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "psz_buffer", scope: !659, file: !660, line: 45, baseType: !54, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "b_proxy", scope: !652, file: !653, line: 50, baseType: !58, size: 8, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !652, file: !653, line: 51, baseType: !658, size: 512, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_request_context", scope: !652, file: !653, line: 53, baseType: !41, size: 32, offset: 1152)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !652, file: !653, line: 55, baseType: !674, size: 524296, offset: 1184)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 524296, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 65537)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "b_broadcast", scope: !652, file: !653, line: 57, baseType: !58, size: 8, offset: 525480)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "p_header", scope: !652, file: !653, line: 59, baseType: !143, size: 64, offset: 525504)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_header", scope: !652, file: !653, line: 60, baseType: !41, size: 32, offset: 525568)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "p_packet", scope: !652, file: !653, line: 62, baseType: !143, size: 64, offset: 525632)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet_sequence", scope: !652, file: !653, line: 63, baseType: !158, size: 32, offset: 525696)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet_used", scope: !652, file: !653, line: 64, baseType: !5, size: 32, offset: 525728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_packet_length", scope: !652, file: !653, line: 65, baseType: !5, size: 32, offset: 525760)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !652, file: !653, line: 67, baseType: !175, size: 64, offset: 525824)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "asfh", scope: !652, file: !653, line: 69, baseType: !686, size: 12480, offset: 525888)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "asf_header_t", file: !333, line: 53, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 45, size: 12480, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_file_size", scope: !687, file: !333, line: 47, baseType: !101, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_data_packets_count", scope: !687, file: !333, line: 48, baseType: !101, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_min_data_packet_size", scope: !687, file: !333, line: 49, baseType: !108, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !687, file: !333, line: 51, baseType: !693, size: 12288, offset: 160)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 12288, elements: !700)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "asf_stream_t", file: !333, line: 43, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 38, size: 96, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_cat", scope: !695, file: !333, line: 40, baseType: !41, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !695, file: !333, line: 41, baseType: !41, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_selected", scope: !695, file: !333, line: 42, baseType: !41, size: 32, offset: 64)
!700 = !{!701}
!701 = !DISubrange(count: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !652, file: !653, line: 70, baseType: !703, size: 128, offset: 538368)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "guid_t", file: !333, line: 61, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "guid_s", file: !333, line: 55, size: 128, elements: !705)
!705 = !{!706, !707, !708, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !704, file: !333, line: 57, baseType: !158, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !704, file: !333, line: 58, baseType: !283, size: 16, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !704, file: !333, line: 59, baseType: !283, size: 16, offset: 48)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !704, file: !333, line: 60, baseType: !111, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !586, file: !120, line: 120, baseType: !711, size: 64, offset: 1216)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_t", file: !43, line: 216, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_t", file: !714, line: 266, size: 448, elements: !715)
!714 = !DIFile(filename: "../../../include/vlc_input.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !713, file: !714, line: 268, baseType: !38, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !713, file: !714, line: 268, baseType: !54, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !713, file: !714, line: 268, baseType: !41, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !713, file: !714, line: 268, baseType: !57, size: 8, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !713, file: !714, line: 268, baseType: !58, size: 8, offset: 168)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !713, file: !714, line: 268, baseType: !265, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !713, file: !714, line: 268, baseType: !255, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !713, file: !714, line: 270, baseType: !58, size: 8, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !713, file: !714, line: 271, baseType: !58, size: 8, offset: 328)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "b_preparsing", scope: !713, file: !714, line: 272, baseType: !58, size: 8, offset: 336)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "b_dead", scope: !713, file: !714, line: 273, baseType: !58, size: 8, offset: 344)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !713, file: !714, line: 277, baseType: !728, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_private_t", file: !714, line: 254, baseType: !730)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_private_t", file: !714, line: 254, flags: DIFlagFwdDecl)
!731 = !{!732, !733, !734, !735, !736, !739, !742, !745, !1010}
!732 = !DILocalVariable(name: "p_access", arg: 1, scope: !581, file: !211, line: 76, type: !584)
!733 = !DILocalVariable(name: "p_sys", scope: !581, file: !211, line: 78, type: !650)
!734 = !DILocalVariable(name: "psz_location", scope: !581, file: !211, line: 79, type: !54)
!735 = !DILocalVariable(name: "psz_proxy", scope: !581, file: !211, line: 80, type: !54)
!736 = !DILocalVariable(name: "psz_http_proxy", scope: !737, file: !211, line: 96, type: !54)
!737 = distinct !DILexicalBlock(scope: !738, file: !211, line: 95, column: 5)
!738 = distinct !DILexicalBlock(scope: !581, file: !211, line: 94, column: 9)
!739 = !DILocalVariable(name: "http_proxy", scope: !740, file: !211, line: 113, type: !38)
!740 = distinct !DILexicalBlock(scope: !741, file: !211, line: 112, column: 5)
!741 = distinct !DILexicalBlock(scope: !581, file: !211, line: 104, column: 9)
!742 = !DILocalVariable(name: "p_input", scope: !743, file: !211, line: 158, type: !711)
!743 = distinct !DILexicalBlock(scope: !744, file: !211, line: 155, column: 5)
!744 = distinct !DILexicalBlock(scope: !581, file: !211, line: 154, column: 9)
!745 = !DILocalVariable(name: "p_new_loc", scope: !743, file: !211, line: 159, type: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_item_t", file: !43, line: 218, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_item_t", file: !749, line: 54, size: 2560, elements: !750)
!749 = !DIFile(filename: "../../../include/vlc_input_item.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!750 = !{!751, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !792, !793, !909, !961, !962, !966, !967, !988, !1006, !1007, !1008, !1009}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vlc_gc_data", scope: !748, file: !749, line: 56, baseType: !752, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "gc_object_t", file: !43, line: 574, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gc_object_t", file: !43, line: 569, size: 192, elements: !754)
!754 = !{!755, !761, !763}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !753, file: !43, line: 571, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_spinlock_t", file: !757, line: 279, baseType: !758)
!757 = !DIFile(filename: "../../../include/vlc_threads.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_spinlock_t", file: !759, line: 234, baseType: !760)
!759 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!760 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !753, file: !43, line: 572, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !113, line: 122, baseType: !146)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destructor", scope: !753, file: !43, line: 573, baseType: !764, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !748, file: !749, line: 57, baseType: !41, size: 32, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !748, file: !749, line: 59, baseType: !54, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "psz_uri", scope: !748, file: !749, line: 60, baseType: !54, size: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_options", scope: !748, file: !749, line: 62, baseType: !41, size: 32, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_options", scope: !748, file: !749, line: 63, baseType: !278, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "optflagv", scope: !748, file: !749, line: 64, baseType: !143, size: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "optflagc", scope: !748, file: !749, line: 65, baseType: !5, size: 32, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !748, file: !749, line: 67, baseType: !100, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_categories", scope: !748, file: !749, line: 70, baseType: !41, size: 32, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pp_categories", scope: !748, file: !749, line: 71, baseType: !778, size: 64, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "info_category_t", file: !43, line: 232, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_category_t", file: !749, line: 47, size: 192, elements: !782)
!782 = !{!783, !784, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !781, file: !749, line: 49, baseType: !54, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_infos", scope: !781, file: !749, line: 50, baseType: !41, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pp_infos", scope: !781, file: !749, line: 51, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_t", file: !749, line: 41, size: 128, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !788, file: !749, line: 43, baseType: !54, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "psz_value", scope: !788, file: !749, line: 44, baseType: !54, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_es", scope: !748, file: !749, line: 73, baseType: !41, size: 32, offset: 832)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "es", scope: !748, file: !749, line: 74, baseType: !794, size: 64, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_format_t", file: !43, line: 239, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "es_format_t", file: !798, line: 228, size: 2816, elements: !799)
!798 = !DIFile(filename: "../../../include/vlc_es.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!799 = !{!800, !801, !803, !804, !805, !806, !807, !808, !809, !810, !817, !830, !842, !878, !903, !904, !905, !906, !907, !908}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_cat", scope: !797, file: !798, line: 230, baseType: !41, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_codec", scope: !797, file: !798, line: 231, baseType: !802, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_fourcc_t", file: !43, line: 138, baseType: !158)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_fourcc", scope: !797, file: !798, line: 232, baseType: !802, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !797, file: !798, line: 234, baseType: !41, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_group", scope: !797, file: !798, line: 237, baseType: !41, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_priority", scope: !797, file: !798, line: 241, baseType: !41, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !797, file: !798, line: 247, baseType: !54, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !797, file: !798, line: 248, baseType: !54, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra_languages", scope: !797, file: !798, line: 249, baseType: !41, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra_languages", scope: !797, file: !798, line: 250, baseType: !811, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "extra_languages_t", file: !798, line: 223, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extra_languages_t", file: !798, line: 219, size: 128, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !813, file: !798, line: 221, baseType: !54, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !813, file: !798, line: 222, baseType: !54, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "audio", scope: !797, file: !798, line: 252, baseType: !818, size: 288, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_format_t", file: !43, line: 236, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audio_format_t", file: !798, line: 67, size: 288, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_format", scope: !819, file: !798, line: 69, baseType: !802, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !819, file: !798, line: 70, baseType: !5, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_physical_channels", scope: !819, file: !798, line: 74, baseType: !158, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_channels", scope: !819, file: !798, line: 78, baseType: !158, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_per_frame", scope: !819, file: !798, line: 82, baseType: !5, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_length", scope: !819, file: !798, line: 85, baseType: !5, size: 32, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitspersample", scope: !819, file: !798, line: 93, baseType: !5, size: 32, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_blockalign", scope: !819, file: !798, line: 94, baseType: !5, size: 32, offset: 224)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_channels", scope: !819, file: !798, line: 95, baseType: !112, size: 8, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "audio_replay_gain", scope: !797, file: !798, line: 253, baseType: !831, size: 192, offset: 736)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_replay_gain_t", file: !798, line: 62, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !798, line: 51, size: 192, elements: !833)
!833 = !{!834, !838, !840, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pb_peak", scope: !832, file: !798, line: 54, baseType: !835, size: 16)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 2)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peak", scope: !832, file: !798, line: 56, baseType: !839, size: 64, offset: 32)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !836)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pb_gain", scope: !832, file: !798, line: 59, baseType: !835, size: 16, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gain", scope: !832, file: !798, line: 61, baseType: !839, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "video", scope: !797, file: !798, line: 254, baseType: !843, size: 768, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_format_t", file: !43, line: 237, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_format_t", file: !798, line: 101, size: 768, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma", scope: !844, file: !798, line: 103, baseType: !802, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !844, file: !798, line: 105, baseType: !5, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !844, file: !798, line: 106, baseType: !5, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_offset", scope: !844, file: !798, line: 107, baseType: !5, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_offset", scope: !844, file: !798, line: 108, baseType: !5, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_width", scope: !844, file: !798, line: 109, baseType: !5, size: 32, offset: 160)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_height", scope: !844, file: !798, line: 110, baseType: !5, size: 32, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_per_pixel", scope: !844, file: !798, line: 112, baseType: !5, size: 32, offset: 224)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_num", scope: !844, file: !798, line: 114, baseType: !5, size: 32, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_den", scope: !844, file: !798, line: 115, baseType: !5, size: 32, offset: 288)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate", scope: !844, file: !798, line: 117, baseType: !5, size: 32, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate_base", scope: !844, file: !798, line: 118, baseType: !5, size: 32, offset: 352)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_rmask", scope: !844, file: !798, line: 120, baseType: !158, size: 32, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "i_gmask", scope: !844, file: !798, line: 120, baseType: !158, size: 32, offset: 416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "i_bmask", scope: !844, file: !798, line: 120, baseType: !158, size: 32, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "i_rrshift", scope: !844, file: !798, line: 121, baseType: !41, size: 32, offset: 480)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i_lrshift", scope: !844, file: !798, line: 121, baseType: !41, size: 32, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_rgshift", scope: !844, file: !798, line: 122, baseType: !41, size: 32, offset: 544)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_lgshift", scope: !844, file: !798, line: 122, baseType: !41, size: 32, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_rbshift", scope: !844, file: !798, line: 123, baseType: !41, size: 32, offset: 608)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_lbshift", scope: !844, file: !798, line: 123, baseType: !41, size: 32, offset: 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "p_palette", scope: !844, file: !798, line: 124, baseType: !868, size: 64, offset: 704)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_palette_t", file: !43, line: 240, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_palette_t", file: !798, line: 39, size: 8224, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_entries", scope: !870, file: !798, line: 41, baseType: !41, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !870, file: !798, line: 42, baseType: !874, size: 8192, offset: 32)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 8192, elements: !875)
!875 = !{!876, !877}
!876 = !DISubrange(count: 256)
!877 = !DISubrange(count: 4)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !797, file: !798, line: 255, baseType: !879, size: 832, offset: 1728)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "subs_format_t", file: !43, line: 238, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subs_format_t", file: !798, line: 184, size: 832, elements: !881)
!881 = !{!882, !883, !884, !885, !894, !898}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "psz_encoding", scope: !880, file: !798, line: 188, baseType: !54, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_origin", scope: !880, file: !798, line: 191, baseType: !41, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_origin", scope: !880, file: !798, line: 192, baseType: !41, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "spu", scope: !880, file: !798, line: 203, baseType: !886, size: 608, offset: 128)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !880, file: !798, line: 194, size: 608, elements: !887)
!887 = !{!888, !892, !893}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !886, file: !798, line: 197, baseType: !889, size: 544)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 544, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 17)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_width", scope: !886, file: !798, line: 200, baseType: !41, size: 32, offset: 544)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_height", scope: !886, file: !798, line: 202, baseType: !41, size: 32, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !880, file: !798, line: 208, baseType: !895, size: 32, offset: 736)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !880, file: !798, line: 205, size: 32, elements: !896)
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !895, file: !798, line: 207, baseType: !41, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "teletext", scope: !880, file: !798, line: 213, baseType: !899, size: 64, offset: 768)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !880, file: !798, line: 209, size: 64, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_magazine", scope: !899, file: !798, line: 211, baseType: !41, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i_page", scope: !899, file: !798, line: 212, baseType: !41, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !797, file: !798, line: 257, baseType: !5, size: 32, offset: 2560)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile", scope: !797, file: !798, line: 258, baseType: !41, size: 32, offset: 2592)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "i_level", scope: !797, file: !798, line: 259, baseType: !41, size: 32, offset: 2624)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "b_packetized", scope: !797, file: !798, line: 261, baseType: !58, size: 8, offset: 2656)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra", scope: !797, file: !798, line: 262, baseType: !41, size: 32, offset: 2688)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra", scope: !797, file: !798, line: 263, baseType: !87, size: 64, offset: 2752)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "p_stats", scope: !748, file: !749, line: 76, baseType: !910, size: 64, offset: 960)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_stats_t", file: !43, line: 390, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_stats_t", file: !749, line: 274, size: 960, elements: !913)
!913 = !{!914, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !912, file: !749, line: 276, baseType: !915, size: 320)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_mutex_t", file: !757, line: 102, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !759, line: 128, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !759, line: 90, size: 320, elements: !918)
!918 = !{!919, !937, !941}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !917, file: !759, line: 125, baseType: !920, size: 320)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !759, line: 92, size: 320, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !929, !930}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !920, file: !759, line: 94, baseType: !41, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !920, file: !759, line: 95, baseType: !5, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !920, file: !759, line: 96, baseType: !41, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !920, file: !759, line: 98, baseType: !5, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !920, file: !759, line: 102, baseType: !41, size: 32, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !920, file: !759, line: 104, baseType: !928, size: 16, offset: 160)
!928 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !920, file: !759, line: 105, baseType: !928, size: 16, offset: 176)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !920, file: !759, line: 106, baseType: !931, size: 128, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !759, line: 79, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !759, line: 75, size: 128, elements: !933)
!933 = !{!934, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !932, file: !759, line: 77, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !932, file: !759, line: 78, baseType: !935, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !917, file: !759, line: 126, baseType: !938, size: 320)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 320, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 40)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !917, file: !759, line: 127, baseType: !103, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_read_packets", scope: !912, file: !749, line: 279, baseType: !41, size: 32, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "i_read_bytes", scope: !912, file: !749, line: 280, baseType: !41, size: 32, offset: 352)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "f_input_bitrate", scope: !912, file: !749, line: 281, baseType: !84, size: 32, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "f_average_input_bitrate", scope: !912, file: !749, line: 282, baseType: !84, size: 32, offset: 416)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_read_packets", scope: !912, file: !749, line: 285, baseType: !41, size: 32, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_read_bytes", scope: !912, file: !749, line: 286, baseType: !41, size: 32, offset: 480)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "f_demux_bitrate", scope: !912, file: !749, line: 287, baseType: !84, size: 32, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "f_average_demux_bitrate", scope: !912, file: !749, line: 288, baseType: !84, size: 32, offset: 544)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_corrupted", scope: !912, file: !749, line: 289, baseType: !41, size: 32, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i_demux_discontinuity", scope: !912, file: !749, line: 290, baseType: !41, size: 32, offset: 608)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "i_decoded_audio", scope: !912, file: !749, line: 293, baseType: !41, size: 32, offset: 640)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "i_decoded_video", scope: !912, file: !749, line: 294, baseType: !41, size: 32, offset: 672)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "i_displayed_pictures", scope: !912, file: !749, line: 297, baseType: !41, size: 32, offset: 704)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "i_lost_pictures", scope: !912, file: !749, line: 298, baseType: !41, size: 32, offset: 736)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "i_sent_packets", scope: !912, file: !749, line: 301, baseType: !41, size: 32, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "i_sent_bytes", scope: !912, file: !749, line: 302, baseType: !41, size: 32, offset: 800)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "f_send_bitrate", scope: !912, file: !749, line: 303, baseType: !84, size: 32, offset: 832)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "i_played_abuffers", scope: !912, file: !749, line: 306, baseType: !41, size: 32, offset: 864)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_lost_abuffers", scope: !912, file: !749, line: 307, baseType: !41, size: 32, offset: 896)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_played", scope: !748, file: !749, line: 77, baseType: !41, size: 32, offset: 1024)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "p_meta", scope: !748, file: !749, line: 79, baseType: !963, size: 64, offset: 1088)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_meta_t", file: !43, line: 384, baseType: !965)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_meta_t", file: !43, line: 384, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "i_epg", scope: !748, file: !749, line: 81, baseType: !41, size: 32, offset: 1152)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pp_epg", scope: !748, file: !749, line: 82, baseType: !968, size: 64, offset: 1216)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_epg_t", file: !971, line: 50, baseType: !972)
!971 = !DIFile(filename: "../../../include/vlc_epg.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/mms")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !971, line: 43, size: 256, elements: !973)
!973 = !{!974, !975, !985, !986}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !972, file: !971, line: 45, baseType: !54, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "p_current", scope: !972, file: !971, line: 46, baseType: !976, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_epg_event_t", file: !971, line: 41, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !971, line: 32, size: 320, elements: !979)
!979 = !{!980, !981, !982, !983, !984}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !978, file: !971, line: 34, baseType: !101, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !978, file: !971, line: 35, baseType: !41, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !978, file: !971, line: 37, baseType: !54, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "psz_short_description", scope: !978, file: !971, line: 38, baseType: !54, size: 64, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !978, file: !971, line: 39, baseType: !54, size: 64, offset: 256)
