; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.zip = type { i8*, %struct._IO_FILE*, %struct.zip_error, i32, i32, i8*, %struct.zip_cdir*, i8*, i32, i64, i64, %struct.zip_entry*, i32, i32, %struct.zip_file** }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.zip_error = type { i32, i32, i8* }
%struct.zip_cdir = type { %struct.zip_dirent*, i32, i32, i32, i8*, i16 }
%struct.zip_dirent = type { i16, i16, i16, i16, i64, i32, i32, i32, i8*, i16, i8*, i16, i8*, i16, i16, i16, i32, i32 }
%struct.zip_entry = type { i32, %struct.zip_source*, i8*, i8*, i32, i8*, i32 }
%struct.zip_file = type { %struct.zip*, %struct.zip_error, i32, %struct.zip_source* }
%struct.zip_source = type { %struct.zip_source*, %union.anon, i8*, i32, i32 }
%union.anon = type { i64 (i8*, i8*, i64, i32)* }
%struct.filelist = type { i32, i8* }
%struct.zip_stat = type { i64, i8*, i64, i64, i64, i64, i32, i16, i16, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "last_mod", scope: !2, file: !3, line: 359, type: !16, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_zip_dirent_torrent_normalize", scope: !3, file: !3, line: 356, type: !4, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !38)
!3 = !DIFile(filename: "zip_dirent.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_dirent", file: !8, line: 231, size: 704, elements: !9)
!8 = !DIFile(filename: "./zipint.h", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!9 = !{!10, !12, !13, !14, !15, !21, !23, !24, !25, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "version_madeby", scope: !7, file: !8, line: 232, baseType: !11, size: 16)
!11 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "version_needed", scope: !7, file: !8, line: 233, baseType: !11, size: 16, offset: 16)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "bitflags", scope: !7, file: !8, line: 234, baseType: !11, size: 16, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !7, file: !8, line: 235, baseType: !11, size: 16, offset: 48)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod", scope: !7, file: !8, line: 236, baseType: !16, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !17, line: 75, baseType: !18)
!17 = !DIFile(filename: "/usr/include/time.h", directory: "")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !19, line: 139, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!20 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !7, file: !8, line: 237, baseType: !22, size: 32, offset: 128)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !7, file: !8, line: 238, baseType: !22, size: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp_size", scope: !7, file: !8, line: 239, baseType: !22, size: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !7, file: !8, line: 240, baseType: !26, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "filename_len", scope: !7, file: !8, line: 241, baseType: !11, size: 16, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "extrafield", scope: !7, file: !8, line: 242, baseType: !26, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "extrafield_len", scope: !7, file: !8, line: 243, baseType: !11, size: 16, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !7, file: !8, line: 244, baseType: !26, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !7, file: !8, line: 245, baseType: !11, size: 16, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "disk_number", scope: !7, file: !8, line: 246, baseType: !11, size: 16, offset: 592)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "int_attrib", scope: !7, file: !8, line: 247, baseType: !11, size: 16, offset: 608)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ext_attrib", scope: !7, file: !8, line: 248, baseType: !22, size: 32, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !7, file: !8, line: 249, baseType: !22, size: 32, offset: 672)
!37 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !39, globals: !51, nameTableKind: None)
!38 = !{}
!39 = !{!6, !40, !41, !11, !26}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_cdir", file: !8, line: 254, size: 320, elements: !43)
!43 = !{!44, !45, !47, !48, !49, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !42, file: !8, line: 255, baseType: !6, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nentry", scope: !42, file: !8, line: 256, baseType: !46, size: 32, offset: 64)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !8, line: 258, baseType: !22, size: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !42, file: !8, line: 259, baseType: !22, size: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !42, file: !8, line: 260, baseType: !26, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !42, file: !8, line: 261, baseType: !11, size: 16, offset: 256)
!51 = !{!52, !0}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "torrenttime", scope: !2, file: !3, line: 358, type: !54, isLocal: true, isDefinition: true)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !17, line: 133, size: 448, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !54, file: !17, line: 135, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !54, file: !17, line: 136, baseType: !46, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !54, file: !17, line: 137, baseType: !46, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !54, file: !17, line: 138, baseType: !46, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !54, file: !17, line: 139, baseType: !46, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !54, file: !17, line: 140, baseType: !46, size: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !54, file: !17, line: 141, baseType: !46, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !54, file: !17, line: 142, baseType: !46, size: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !54, file: !17, line: 143, baseType: !46, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !54, file: !17, line: 146, baseType: !20, size: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !54, file: !17, line: 147, baseType: !67, size: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "_zip_err_str", scope: !71, file: !72, line: 10, type: !82, isLocal: false, isDefinition: true)
!71 = distinct !DICompileUnit(language: DW_LANG_C99, file: !72, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, globals: !73, nameTableKind: None)
!72 = !DIFile(filename: "zip_err_str.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!73 = !{!69, !74, !77}
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "_zip_nerr_str", scope: !71, file: !72, line: 41, type: !76, isLocal: false, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "_zip_err_type", scope: !71, file: !72, line: 47, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 896, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 28)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 1792, elements: !80)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "crc", scope: !86, file: !87, line: 52, type: !152, isLocal: true, isDefinition: true)
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !111, globals: !151, nameTableKind: None)
!87 = !DIFile(filename: "zip_source_pkware.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!88 = !{!89, !98, !104}
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zip_source_cmd", file: !90, line: 165, baseType: !22, size: 32, elements: !91)
!90 = !DIFile(filename: "./zip.h", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!91 = !{!92, !93, !94, !95, !96, !97}
!92 = !DIEnumerator(name: "ZIP_SOURCE_OPEN", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "ZIP_SOURCE_READ", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "ZIP_SOURCE_CLOSE", value: 2, isUnsigned: true)
!95 = !DIEnumerator(name: "ZIP_SOURCE_STAT", value: 3, isUnsigned: true)
!96 = !DIEnumerator(name: "ZIP_SOURCE_ERROR", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "ZIP_SOURCE_FREE", value: 5, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zip_les", file: !8, line: 180, baseType: !22, size: 32, elements: !99)
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "ZIP_LES_NONE", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "ZIP_LES_UPPER", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "ZIP_LES_LOWER", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "ZIP_LES_INVAL", value: 3, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zip_state", file: !8, line: 175, baseType: !22, size: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110}
!106 = !DIEnumerator(name: "ZIP_ST_UNCHANGED", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "ZIP_ST_DELETED", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "ZIP_ST_REPLACED", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "ZIP_ST_ADDED", value: 3, isUnsigned: true)
!110 = !DIEnumerator(name: "ZIP_ST_RENAMED", value: 4, isUnsigned: true)
!111 = !{!40, !112, !127, !132, !133, !136}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trad_pkware", file: !87, line: 41, size: 160, elements: !114)
!114 = !{!115, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !113, file: !87, line: 42, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 2)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !113, file: !87, line: 44, baseType: !120, size: 96, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 96, elements: !125)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint32_t", file: !122, line: 36, baseType: !123)
!122 = !DIFile(filename: "./zipconf.h", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !124, line: 51, baseType: !22)
!124 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!125 = !{!126}
!126 = !DISubrange(count: 3)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint8_t", file: !122, line: 22, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !124, line: 48, baseType: !131)
!131 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint64_t", file: !122, line: 43, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !124, line: 55, baseType: !135)
!135 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_stat", file: !90, line: 186, size: 512, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !149, !150}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !137, file: !90, line: 187, baseType: !133, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !90, line: 188, baseType: !67, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !137, file: !90, line: 189, baseType: !133, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !137, file: !90, line: 190, baseType: !133, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !137, file: !90, line: 191, baseType: !133, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !137, file: !90, line: 192, baseType: !16, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !137, file: !90, line: 193, baseType: !121, size: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !137, file: !90, line: 194, baseType: !147, size: 16, offset: 416)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_uint16_t", file: !122, line: 29, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !124, line: 49, baseType: !11)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_method", scope: !137, file: !90, line: 195, baseType: !147, size: 16, offset: 432)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !90, line: 196, baseType: !121, size: 32, offset: 448)
!151 = !{!84}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLongf", file: !155, line: 382, baseType: !156)
!155 = !DIFile(filename: "/usr/include/zconf.h", directory: "")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !155, line: 371, baseType: !135)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!158 = !DIFile(filename: "zip_add.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!159 = !{!104, !89, !98}
!160 = !{!40}
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !163, nameTableKind: None)
!162 = !DIFile(filename: "zip_add_dir.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!163 = !{!40, !26}
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !166, nameTableKind: None)
!165 = !DIFile(filename: "zip_close.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!166 = !{!40, !167, !172, !20, !26, !174}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filelist", file: !165, line: 63, size: 128, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !168, file: !165, line: 64, baseType: !46, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !165, line: 65, baseType: !67, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 62, baseType: !135)
!173 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!177 = !DIFile(filename: "zip_delete.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!179 = !DIFile(filename: "zip_entry_free.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !182, nameTableKind: None)
!181 = !DIFile(filename: "zip_entry_new.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_entry", file: !8, line: 279, size: 448, elements: !185)
!185 = !{!186, !187, !211, !212, !213, !214, !215}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !184, file: !8, line: 280, baseType: !104, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !184, file: !8, line: 281, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_source", file: !8, line: 266, size: 256, elements: !190)
!190 = !{!191, !192, !208, !209, !210}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !189, file: !8, line: 267, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !189, file: !8, line: 271, baseType: !193, size: 64, offset: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !8, line: 268, size: 64, elements: !194)
!194 = !{!195, !203}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !193, file: !8, line: 269, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_callback", file: !90, line: 203, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !40, !40, !133, !89}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_int64_t", file: !122, line: 39, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !202, line: 197, baseType: !20)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !193, file: !8, line: 270, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_layered_callback", file: !8, line: 140, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!200, !188, !40, !40, !133, !89}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !189, file: !8, line: 272, baseType: !40, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "error_source", scope: !189, file: !8, line: 273, baseType: !98, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "is_open", scope: !189, file: !8, line: 274, baseType: !46, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ch_filename", scope: !184, file: !8, line: 282, baseType: !26, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra", scope: !184, file: !8, line: 283, baseType: !26, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra_len", scope: !184, file: !8, line: 284, baseType: !46, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment", scope: !184, file: !8, line: 285, baseType: !26, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment_len", scope: !184, file: !8, line: 286, baseType: !46, size: 32, offset: 384)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, nameTableKind: None)
!217 = !DIFile(filename: "zip_error.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!218 = !{!89, !98}
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!220 = !DIFile(filename: "zip_error_clear.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!222 = !DIFile(filename: "zip_error_get.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, nameTableKind: None)
!224 = !DIFile(filename: "zip_error_get_sys_type.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !163, nameTableKind: None)
!226 = !DIFile(filename: "zip_error_strerror.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, nameTableKind: None)
!228 = !DIFile(filename: "zip_error_to_str.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!229 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!230 = !DIFile(filename: "zip_fclose.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!232 = !DIFile(filename: "zip_fdopen.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!234 = !DIFile(filename: "zip_file_error_clear.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!236 = !DIFile(filename: "zip_file_error_get.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!238 = !DIFile(filename: "zip_file_get_offset.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!240 = !DIFile(filename: "zip_file_strerror.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, nameTableKind: None)
!242 = !DIFile(filename: "zip_filerange_crc.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!244 = !DIFile(filename: "zip_fopen.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!246 = !DIFile(filename: "zip_fopen_encrypted.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!248 = !DIFile(filename: "zip_fopen_index.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !251, nameTableKind: None)
!250 = !DIFile(filename: "zip_fopen_index_encrypted.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!251 = !{!40, !252, !388}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_file", file: !8, line: 222, size: 320, elements: !254)
!254 = !{!255, !389, !390, !391}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "za", scope: !253, file: !8, line: 223, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip", file: !8, line: 198, size: 896, elements: !258)
!258 = !{!259, !260, !314, !320, !321, !322, !323, !354, !355, !356, !357, !358, !385, !386, !387}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "zn", scope: !257, file: !8, line: 199, baseType: !26, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "zp", scope: !257, file: !8, line: 200, baseType: !261, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !263, line: 48, baseType: !264)
!263 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !265, line: 241, size: 1728, elements: !266)
!265 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !287, !288, !289, !290, !292, !293, !295, !299, !302, !304, !305, !306, !307, !308, !309, !310}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !264, file: !265, line: 242, baseType: !46, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !264, file: !265, line: 247, baseType: !26, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !264, file: !265, line: 248, baseType: !26, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !264, file: !265, line: 249, baseType: !26, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !264, file: !265, line: 250, baseType: !26, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !264, file: !265, line: 251, baseType: !26, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !264, file: !265, line: 252, baseType: !26, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !264, file: !265, line: 253, baseType: !26, size: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !264, file: !265, line: 254, baseType: !26, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !264, file: !265, line: 256, baseType: !26, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !264, file: !265, line: 257, baseType: !26, size: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !264, file: !265, line: 258, baseType: !26, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !264, file: !265, line: 260, baseType: !280, size: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !265, line: 156, size: 192, elements: !282)
!282 = !{!283, !284, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !281, file: !265, line: 157, baseType: !280, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !281, file: !265, line: 158, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !281, file: !265, line: 162, baseType: !46, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !264, file: !265, line: 262, baseType: !285, size: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !264, file: !265, line: 264, baseType: !46, size: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !264, file: !265, line: 268, baseType: !46, size: 32, offset: 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !264, file: !265, line: 270, baseType: !291, size: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !19, line: 131, baseType: !20)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !264, file: !265, line: 274, baseType: !11, size: 16, offset: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !264, file: !265, line: 275, baseType: !294, size: 8, offset: 1040)
!294 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !264, file: !265, line: 276, baseType: !296, size: 8, offset: 1048)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 1)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !264, file: !265, line: 280, baseType: !300, size: 64, offset: 1088)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !265, line: 150, baseType: null)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !264, file: !265, line: 289, baseType: !303, size: 64, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !19, line: 132, baseType: !20)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !264, file: !265, line: 297, baseType: !40, size: 64, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !264, file: !265, line: 298, baseType: !40, size: 64, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !264, file: !265, line: 299, baseType: !40, size: 64, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !264, file: !265, line: 300, baseType: !40, size: 64, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !264, file: !265, line: 302, baseType: !172, size: 64, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !264, file: !265, line: 303, baseType: !46, size: 32, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !264, file: !265, line: 305, baseType: !311, size: 160, offset: 1568)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 20)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !257, file: !8, line: 201, baseType: !315, size: 128, offset: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_error", file: !8, line: 190, size: 128, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "zip_err", scope: !315, file: !8, line: 191, baseType: !46, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sys_err", scope: !315, file: !8, line: 192, baseType: !46, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !315, file: !8, line: 193, baseType: !26, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !8, line: 203, baseType: !22, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ch_flags", scope: !257, file: !8, line: 204, baseType: !22, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "default_password", scope: !257, file: !8, line: 206, baseType: !26, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cdir", scope: !257, file: !8, line: 208, baseType: !324, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_cdir", file: !8, line: 254, size: 320, elements: !326)
!326 = !{!327, !349, !350, !351, !352, !353}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !325, file: !8, line: 255, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_dirent", file: !8, line: 231, size: 704, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "version_madeby", scope: !329, file: !8, line: 232, baseType: !11, size: 16)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "version_needed", scope: !329, file: !8, line: 233, baseType: !11, size: 16, offset: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bitflags", scope: !329, file: !8, line: 234, baseType: !11, size: 16, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !329, file: !8, line: 235, baseType: !11, size: 16, offset: 48)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod", scope: !329, file: !8, line: 236, baseType: !16, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !329, file: !8, line: 237, baseType: !22, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !329, file: !8, line: 238, baseType: !22, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp_size", scope: !329, file: !8, line: 239, baseType: !22, size: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !329, file: !8, line: 240, baseType: !26, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "filename_len", scope: !329, file: !8, line: 241, baseType: !11, size: 16, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "extrafield", scope: !329, file: !8, line: 242, baseType: !26, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "extrafield_len", scope: !329, file: !8, line: 243, baseType: !11, size: 16, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !329, file: !8, line: 244, baseType: !26, size: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !329, file: !8, line: 245, baseType: !11, size: 16, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "disk_number", scope: !329, file: !8, line: 246, baseType: !11, size: 16, offset: 592)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "int_attrib", scope: !329, file: !8, line: 247, baseType: !11, size: 16, offset: 608)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ext_attrib", scope: !329, file: !8, line: 248, baseType: !22, size: 32, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !329, file: !8, line: 249, baseType: !22, size: 32, offset: 672)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nentry", scope: !325, file: !8, line: 256, baseType: !46, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !325, file: !8, line: 258, baseType: !22, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !325, file: !8, line: 259, baseType: !22, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !325, file: !8, line: 260, baseType: !26, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !325, file: !8, line: 261, baseType: !11, size: 16, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment", scope: !257, file: !8, line: 209, baseType: !26, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment_len", scope: !257, file: !8, line: 210, baseType: !46, size: 32, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nentry", scope: !257, file: !8, line: 212, baseType: !133, size: 64, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nentry_alloc", scope: !257, file: !8, line: 213, baseType: !133, size: 64, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !257, file: !8, line: 214, baseType: !359, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_entry", file: !8, line: 279, size: 448, elements: !361)
!361 = !{!362, !363, !380, !381, !382, !383, !384}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !360, file: !8, line: 280, baseType: !104, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !360, file: !8, line: 281, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_source", file: !8, line: 266, size: 256, elements: !366)
!366 = !{!367, !368, !377, !378, !379}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !365, file: !8, line: 267, baseType: !364, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !365, file: !8, line: 271, baseType: !369, size: 64, offset: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !8, line: 268, size: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !369, file: !8, line: 269, baseType: !196, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !369, file: !8, line: 270, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_layered_callback", file: !8, line: 140, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!200, !364, !40, !40, !133, !89}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !365, file: !8, line: 272, baseType: !40, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "error_source", scope: !365, file: !8, line: 273, baseType: !98, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "is_open", scope: !365, file: !8, line: 274, baseType: !46, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ch_filename", scope: !360, file: !8, line: 282, baseType: !26, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra", scope: !360, file: !8, line: 283, baseType: !26, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra_len", scope: !360, file: !8, line: 284, baseType: !46, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment", scope: !360, file: !8, line: 285, baseType: !26, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment_len", scope: !360, file: !8, line: 286, baseType: !46, size: 32, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nfile", scope: !257, file: !8, line: 215, baseType: !46, size: 32, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nfile_alloc", scope: !257, file: !8, line: 216, baseType: !46, size: 32, offset: 800)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !257, file: !8, line: 217, baseType: !388, size: 64, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !253, file: !8, line: 224, baseType: !315, size: 128, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !253, file: !8, line: 225, baseType: !46, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !253, file: !8, line: 226, baseType: !364, size: 64, offset: 256)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!393 = !DIFile(filename: "zip_fread.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!395 = !DIFile(filename: "zip_free.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!397 = !DIFile(filename: "zip_get_archive_comment.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!399 = !DIFile(filename: "zip_get_archive_flag.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, nameTableKind: None)
!401 = !DIFile(filename: "zip_get_compression_implementation.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, nameTableKind: None)
!403 = !DIFile(filename: "zip_get_encryption_implementation.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!405 = !DIFile(filename: "zip_get_file_comment.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!407 = !DIFile(filename: "zip_get_file_extra.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!409 = !DIFile(filename: "zip_get_num_entries.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!411 = !DIFile(filename: "zip_get_num_files.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!413 = !DIFile(filename: "zip_get_name.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !160, nameTableKind: None)
!415 = !DIFile(filename: "zip_memdup.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!417 = !DIFile(filename: "zip_name_locate.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !420, nameTableKind: None)
!419 = !DIFile(filename: "zip_new.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip", file: !8, line: 198, size: 896, elements: !423)
!423 = !{!424, !425, !466, !472, !473, !474, !475, !506, !507, !508, !509, !510, !537, !538, !539}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "zn", scope: !422, file: !8, line: 199, baseType: !26, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "zp", scope: !422, file: !8, line: 200, baseType: !426, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !263, line: 48, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !265, line: 241, size: 1728, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !428, file: !265, line: 242, baseType: !46, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !428, file: !265, line: 247, baseType: !26, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !428, file: !265, line: 248, baseType: !26, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !428, file: !265, line: 249, baseType: !26, size: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !428, file: !265, line: 250, baseType: !26, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !428, file: !265, line: 251, baseType: !26, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !428, file: !265, line: 252, baseType: !26, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !428, file: !265, line: 253, baseType: !26, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !428, file: !265, line: 254, baseType: !26, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !428, file: !265, line: 256, baseType: !26, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !428, file: !265, line: 257, baseType: !26, size: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !428, file: !265, line: 258, baseType: !26, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !428, file: !265, line: 260, baseType: !443, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !265, line: 156, size: 192, elements: !445)
!445 = !{!446, !447, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !444, file: !265, line: 157, baseType: !443, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !444, file: !265, line: 158, baseType: !448, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !444, file: !265, line: 162, baseType: !46, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !428, file: !265, line: 262, baseType: !448, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !428, file: !265, line: 264, baseType: !46, size: 32, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !428, file: !265, line: 268, baseType: !46, size: 32, offset: 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !428, file: !265, line: 270, baseType: !291, size: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !428, file: !265, line: 274, baseType: !11, size: 16, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !428, file: !265, line: 275, baseType: !294, size: 8, offset: 1040)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !428, file: !265, line: 276, baseType: !296, size: 8, offset: 1048)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !428, file: !265, line: 280, baseType: !300, size: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !428, file: !265, line: 289, baseType: !303, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !428, file: !265, line: 297, baseType: !40, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !428, file: !265, line: 298, baseType: !40, size: 64, offset: 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !428, file: !265, line: 299, baseType: !40, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !428, file: !265, line: 300, baseType: !40, size: 64, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !428, file: !265, line: 302, baseType: !172, size: 64, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !428, file: !265, line: 303, baseType: !46, size: 32, offset: 1536)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !428, file: !265, line: 305, baseType: !311, size: 160, offset: 1568)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !422, file: !8, line: 201, baseType: !467, size: 128, offset: 128)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_error", file: !8, line: 190, size: 128, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "zip_err", scope: !467, file: !8, line: 191, baseType: !46, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sys_err", scope: !467, file: !8, line: 192, baseType: !46, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !467, file: !8, line: 193, baseType: !26, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !422, file: !8, line: 203, baseType: !22, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ch_flags", scope: !422, file: !8, line: 204, baseType: !22, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "default_password", scope: !422, file: !8, line: 206, baseType: !26, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cdir", scope: !422, file: !8, line: 208, baseType: !476, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_cdir", file: !8, line: 254, size: 320, elements: !478)
!478 = !{!479, !501, !502, !503, !504, !505}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !477, file: !8, line: 255, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_dirent", file: !8, line: 231, size: 704, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "version_madeby", scope: !481, file: !8, line: 232, baseType: !11, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "version_needed", scope: !481, file: !8, line: 233, baseType: !11, size: 16, offset: 16)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bitflags", scope: !481, file: !8, line: 234, baseType: !11, size: 16, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !481, file: !8, line: 235, baseType: !11, size: 16, offset: 48)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod", scope: !481, file: !8, line: 236, baseType: !16, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !481, file: !8, line: 237, baseType: !22, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !481, file: !8, line: 238, baseType: !22, size: 32, offset: 160)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "uncomp_size", scope: !481, file: !8, line: 239, baseType: !22, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !481, file: !8, line: 240, baseType: !26, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "filename_len", scope: !481, file: !8, line: 241, baseType: !11, size: 16, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "extrafield", scope: !481, file: !8, line: 242, baseType: !26, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "extrafield_len", scope: !481, file: !8, line: 243, baseType: !11, size: 16, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !481, file: !8, line: 244, baseType: !26, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !481, file: !8, line: 245, baseType: !11, size: 16, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "disk_number", scope: !481, file: !8, line: 246, baseType: !11, size: 16, offset: 592)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "int_attrib", scope: !481, file: !8, line: 247, baseType: !11, size: 16, offset: 608)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ext_attrib", scope: !481, file: !8, line: 248, baseType: !22, size: 32, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !481, file: !8, line: 249, baseType: !22, size: 32, offset: 672)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nentry", scope: !477, file: !8, line: 256, baseType: !46, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !477, file: !8, line: 258, baseType: !22, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !477, file: !8, line: 259, baseType: !22, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !477, file: !8, line: 260, baseType: !26, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !477, file: !8, line: 261, baseType: !11, size: 16, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment", scope: !422, file: !8, line: 209, baseType: !26, size: 64, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment_len", scope: !422, file: !8, line: 210, baseType: !46, size: 32, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nentry", scope: !422, file: !8, line: 212, baseType: !133, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nentry_alloc", scope: !422, file: !8, line: 213, baseType: !133, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !422, file: !8, line: 214, baseType: !511, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_entry", file: !8, line: 279, size: 448, elements: !513)
!513 = !{!514, !515, !532, !533, !534, !535, !536}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !512, file: !8, line: 280, baseType: !104, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !512, file: !8, line: 281, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_source", file: !8, line: 266, size: 256, elements: !518)
!518 = !{!519, !520, !529, !530, !531}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !517, file: !8, line: 267, baseType: !516, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !517, file: !8, line: 271, baseType: !521, size: 64, offset: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !8, line: 268, size: 64, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !521, file: !8, line: 269, baseType: !196, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !521, file: !8, line: 270, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_layered_callback", file: !8, line: 140, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!200, !516, !40, !40, !133, !89}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !517, file: !8, line: 272, baseType: !40, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "error_source", scope: !517, file: !8, line: 273, baseType: !98, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "is_open", scope: !517, file: !8, line: 274, baseType: !46, size: 32, offset: 224)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ch_filename", scope: !512, file: !8, line: 282, baseType: !26, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra", scope: !512, file: !8, line: 283, baseType: !26, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra_len", scope: !512, file: !8, line: 284, baseType: !46, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment", scope: !512, file: !8, line: 285, baseType: !26, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment_len", scope: !512, file: !8, line: 286, baseType: !46, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nfile", scope: !422, file: !8, line: 215, baseType: !46, size: 32, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nfile_alloc", scope: !422, file: !8, line: 216, baseType: !46, size: 32, offset: 800)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !422, file: !8, line: 217, baseType: !540, size: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_file", file: !8, line: 222, size: 320, elements: !543)
!543 = !{!544, !545, !546, !547}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "za", scope: !542, file: !8, line: 223, baseType: !421, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !542, file: !8, line: 224, baseType: !467, size: 128, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !542, file: !8, line: 225, baseType: !46, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !542, file: !8, line: 226, baseType: !516, size: 64, offset: 256)
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !550, nameTableKind: None)
!549 = !DIFile(filename: "zip_open.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!550 = !{!40, !551, !577, !578, !172, !26, !135}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_entry", file: !8, line: 279, size: 448, elements: !553)
!553 = !{!554, !555, !572, !573, !574, !575, !576}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !552, file: !8, line: 280, baseType: !104, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !552, file: !8, line: 281, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_source", file: !8, line: 266, size: 256, elements: !558)
!558 = !{!559, !560, !569, !570, !571}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !557, file: !8, line: 267, baseType: !556, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !557, file: !8, line: 271, baseType: !561, size: 64, offset: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !8, line: 268, size: 64, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !561, file: !8, line: 269, baseType: !196, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !561, file: !8, line: 270, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_source_layered_callback", file: !8, line: 140, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!200, !556, !40, !40, !133, !89}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !557, file: !8, line: 272, baseType: !40, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "error_source", scope: !557, file: !8, line: 273, baseType: !98, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "is_open", scope: !557, file: !8, line: 274, baseType: !46, size: 32, offset: 224)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ch_filename", scope: !552, file: !8, line: 282, baseType: !26, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra", scope: !552, file: !8, line: 283, baseType: !26, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ch_extra_len", scope: !552, file: !8, line: 284, baseType: !46, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment", scope: !552, file: !8, line: 285, baseType: !26, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ch_comment_len", scope: !552, file: !8, line: 286, baseType: !46, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!581 = !DIFile(filename: "zip_rename.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!583 = !DIFile(filename: "zip_replace.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !163, nameTableKind: None)
!585 = !DIFile(filename: "zip_set_archive_comment.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, nameTableKind: None)
!587 = !DIFile(filename: "zip_set_archive_flag.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !160, nameTableKind: None)
!589 = !DIFile(filename: "zip_set_default_password.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !163, nameTableKind: None)
!591 = !DIFile(filename: "zip_set_file_comment.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !163, nameTableKind: None)
!593 = !DIFile(filename: "zip_set_file_extra.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !596, nameTableKind: None)
!595 = !DIFile(filename: "zip_source_buffer.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!596 = !{!40, !597, !67, !26, !605, !618}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "read_data", file: !595, line: 41, size: 320, elements: !599)
!599 = !{!600, !601, !602, !603, !604}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !598, file: !595, line: 42, baseType: !67, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !598, file: !595, line: 42, baseType: !67, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !598, file: !595, line: 42, baseType: !67, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !598, file: !595, line: 43, baseType: !16, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "freep", scope: !598, file: !595, line: 44, baseType: !46, size: 32, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_stat", file: !90, line: 186, size: 512, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !606, file: !90, line: 187, baseType: !133, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !606, file: !90, line: 188, baseType: !67, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !606, file: !90, line: 189, baseType: !133, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !90, line: 190, baseType: !133, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !606, file: !90, line: 191, baseType: !133, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !606, file: !90, line: 192, baseType: !16, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !606, file: !90, line: 193, baseType: !121, size: 32, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !606, file: !90, line: 194, baseType: !147, size: 16, offset: 416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_method", scope: !606, file: !90, line: 195, baseType: !147, size: 16, offset: 432)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !606, file: !90, line: 196, baseType: !121, size: 32, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, retainedTypes: !160, nameTableKind: None)
!620 = !DIFile(filename: "zip_source_close.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !623, nameTableKind: None)
!622 = !DIFile(filename: "zip_source_crc.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!623 = !{!40, !624, !632}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crc", file: !622, line: 41, size: 256, elements: !626)
!626 = !{!627, !628, !629, !630, !631}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !625, file: !622, line: 42, baseType: !46, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !625, file: !622, line: 43, baseType: !46, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !625, file: !622, line: 44, baseType: !116, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !622, line: 45, baseType: !133, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !625, file: !622, line: 46, baseType: !121, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_stat", file: !90, line: 186, size: 512, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !633, file: !90, line: 187, baseType: !133, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !90, line: 188, baseType: !67, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !633, file: !90, line: 189, baseType: !133, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !633, file: !90, line: 190, baseType: !133, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !633, file: !90, line: 191, baseType: !133, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !633, file: !90, line: 192, baseType: !16, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !633, file: !90, line: 193, baseType: !121, size: 32, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !633, file: !90, line: 194, baseType: !147, size: 16, offset: 416)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_method", scope: !633, file: !90, line: 195, baseType: !147, size: 16, offset: 432)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !90, line: 196, baseType: !121, size: 32, offset: 448)
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !647, nameTableKind: None)
!646 = !DIFile(filename: "zip_source_deflate.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!647 = !{!40, !648, !46, !695, !665}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deflate", file: !646, line: 41, size: 66624, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !659}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !649, file: !646, line: 42, baseType: !116, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !649, file: !646, line: 44, baseType: !46, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mem_level", scope: !649, file: !646, line: 45, baseType: !46, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !649, file: !646, line: 46, baseType: !133, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !649, file: !646, line: 47, baseType: !656, size: 65536, offset: 192)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 65536, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 8192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "zstr", scope: !649, file: !646, line: 48, baseType: !660, size: 896, offset: 65728)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !661, line: 104, baseType: !662)
!661 = !DIFile(filename: "/usr/include/zlib.h", directory: "")
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !661, line: 85, size: 896, elements: !663)
!663 = !{!664, !668, !670, !671, !672, !673, !674, !675, !680, !686, !691, !692, !693, !694}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !662, file: !661, line: 86, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !155, line: 377, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !155, line: 368, baseType: !131)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !662, file: !661, line: 87, baseType: !669, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !155, line: 370, baseType: !22)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !662, file: !661, line: 88, baseType: !156, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !662, file: !661, line: 90, baseType: !665, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !662, file: !661, line: 91, baseType: !669, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !662, file: !661, line: 92, baseType: !156, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !662, file: !661, line: 94, baseType: !26, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !662, file: !661, line: 95, baseType: !676, size: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !661, line: 1742, size: 32, elements: !678)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !677, file: !661, line: 1742, baseType: !46, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !662, file: !661, line: 97, baseType: !681, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !661, line: 80, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !685, !669, !669}
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !155, line: 386, baseType: !40)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !662, file: !661, line: 98, baseType: !687, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !661, line: 81, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !685, !685}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !662, file: !661, line: 99, baseType: !685, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !662, file: !661, line: 101, baseType: !46, size: 32, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !662, file: !661, line: 102, baseType: !156, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !662, file: !661, line: 103, baseType: !156, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_stat", file: !90, line: 186, size: 512, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !696, file: !90, line: 187, baseType: !133, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !696, file: !90, line: 188, baseType: !67, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !696, file: !90, line: 189, baseType: !133, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !696, file: !90, line: 190, baseType: !133, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !696, file: !90, line: 191, baseType: !133, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !696, file: !90, line: 192, baseType: !16, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !696, file: !90, line: 193, baseType: !121, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !696, file: !90, line: 194, baseType: !147, size: 16, offset: 416)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_method", scope: !696, file: !90, line: 195, baseType: !147, size: 16, offset: 432)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !696, file: !90, line: 196, baseType: !121, size: 32, offset: 448)
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, retainedTypes: !160, nameTableKind: None)
!709 = !DIFile(filename: "zip_source_error.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !160, nameTableKind: None)
!711 = !DIFile(filename: "zip_source_file.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !88, retainedTypes: !714, nameTableKind: None)
!713 = !DIFile(filename: "zip_source_filep.c", directory: "/root/llvm/codesample/39apps/libzip-0.10/lib")
!714 = !{!40, !715, !26, !778, !780}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "read_file", file: !713, line: 44, size: 960, elements: !717)
!717 = !{!718, !719, !760, !761, !774, !775, !776, !777}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !716, file: !713, line: 45, baseType: !26, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !716, file: !713, line: 46, baseType: !720, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !263, line: 48, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !265, line: 241, size: 1728, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !722, file: !265, line: 242, baseType: !46, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !722, file: !265, line: 247, baseType: !26, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !722, file: !265, line: 248, baseType: !26, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !722, file: !265, line: 249, baseType: !26, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !722, file: !265, line: 250, baseType: !26, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !722, file: !265, line: 251, baseType: !26, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !722, file: !265, line: 252, baseType: !26, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !722, file: !265, line: 253, baseType: !26, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !722, file: !265, line: 254, baseType: !26, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !722, file: !265, line: 256, baseType: !26, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !722, file: !265, line: 257, baseType: !26, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !722, file: !265, line: 258, baseType: !26, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !722, file: !265, line: 260, baseType: !737, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !265, line: 156, size: 192, elements: !739)
!739 = !{!740, !741, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !738, file: !265, line: 157, baseType: !737, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !738, file: !265, line: 158, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !738, file: !265, line: 162, baseType: !46, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !722, file: !265, line: 262, baseType: !742, size: 64, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !722, file: !265, line: 264, baseType: !46, size: 32, offset: 896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !722, file: !265, line: 268, baseType: !46, size: 32, offset: 928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !722, file: !265, line: 270, baseType: !291, size: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !722, file: !265, line: 274, baseType: !11, size: 16, offset: 1024)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !722, file: !265, line: 275, baseType: !294, size: 8, offset: 1040)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !722, file: !265, line: 276, baseType: !296, size: 8, offset: 1048)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !722, file: !265, line: 280, baseType: !300, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !722, file: !265, line: 289, baseType: !303, size: 64, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !722, file: !265, line: 297, baseType: !40, size: 64, offset: 1216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !722, file: !265, line: 298, baseType: !40, size: 64, offset: 1280)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !722, file: !265, line: 299, baseType: !40, size: 64, offset: 1344)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !722, file: !265, line: 300, baseType: !40, size: 64, offset: 1408)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !722, file: !265, line: 302, baseType: !172, size: 64, offset: 1472)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !722, file: !265, line: 303, baseType: !46, size: 32, offset: 1536)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !722, file: !265, line: 305, baseType: !311, size: 160, offset: 1568)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "closep", scope: !716, file: !713, line: 47, baseType: !46, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !716, file: !713, line: 48, baseType: !762, size: 512, offset: 192)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zip_stat", file: !90, line: 186, size: 512, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !762, file: !90, line: 187, baseType: !133, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !90, line: 188, baseType: !67, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !762, file: !90, line: 189, baseType: !133, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !762, file: !90, line: 190, baseType: !133, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "comp_size", scope: !762, file: !90, line: 191, baseType: !133, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !762, file: !90, line: 192, baseType: !16, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !762, file: !90, line: 193, baseType: !121, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "comp_method", scope: !762, file: !90, line: 194, baseType: !147, size: 16, offset: 416)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "encryption_method", scope: !762, file: !90, line: 195, baseType: !147, size: 16, offset: 432)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !762, file: !90, line: 196, baseType: !121, size: 32, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !716, file: !713, line: 50, baseType: !133, size: 64, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !716, file: !713, line: 51, baseType: !200, size: 64, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !716, file: !713, line: 52, baseType: !200, size: 64, offset: 832)
