; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.module_nvalue_t = type { i32 }
%struct.module_t = type opaque
%struct.module_config_t = type { i32, i8*, i8*, i8, i8*, i8*, %union.module_value_t, %union.module_value_t, %union.module_value_t, %union.module_nvalue_t, %union.module_nvalue_t, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i8*, i8**, i32*, i8**, i32, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)**, i8**, i32, i8, i8, i8, i8, i8*, i8, i8, i8, i8 }
%union.module_value_t = type { i8* }
%struct.vlc_object_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t* }
%struct.libvlc_int_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.hotkey* }
%struct.hotkey = type opaque
%struct.demux_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.module_t*, i8*, i8*, i8*, %struct.stream_t*, %struct.es_out_t*, i32 (%struct.demux_t*)*, i32 (%struct.demux_t*, i32, %struct.__va_list_tag*)*, %struct.anon.3, %struct.demux_sys_t*, %struct.input_thread_t* }

!257 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!258 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !260, line: 24, baseType: !11, size: 32, elements: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270}
!262 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!265 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!266 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!267 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!268 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!269 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!270 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 39, baseType: !11, size: 32, elements: !273)
!272 = !DIFile(filename: "../../../libs/srtp/srtp.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!273 = !{!274, !275, !276}
!274 = !DIEnumerator(name: "SRTP_ENCR_NULL", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "SRTP_ENCR_AES_CM", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "SRTP_ENCR_AES_F8", value: 2, isUnsigned: true)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 47, baseType: !11, size: 32, elements: !278)
!278 = !{!279, !280}
!279 = !DIEnumerator(name: "SRTP_AUTH_NULL", value: 0, isUnsigned: true)
!280 = !DIEnumerator(name: "SRTP_AUTH_HMAC_SHA1", value: 1, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 54, baseType: !11, size: 32, elements: !81)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 25, baseType: !11, size: 32, elements: !12)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "es_out_query_e", file: !284, line: 37, baseType: !11, size: 32, elements: !285)
!284 = !DIFile(filename: "../../../include/vlc_es_out.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!286 = !DIEnumerator(name: "ES_OUT_SET_ES", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "ES_OUT_RESTART_ES", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "ES_OUT_SET_ES_DEFAULT", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "ES_OUT_SET_ES_STATE", value: 3, isUnsigned: true)
!290 = !DIEnumerator(name: "ES_OUT_GET_ES_STATE", value: 4, isUnsigned: true)
!291 = !DIEnumerator(name: "ES_OUT_SET_GROUP", value: 5, isUnsigned: true)
!292 = !DIEnumerator(name: "ES_OUT_SET_PCR", value: 6, isUnsigned: true)
!293 = !DIEnumerator(name: "ES_OUT_SET_GROUP_PCR", value: 7, isUnsigned: true)
!294 = !DIEnumerator(name: "ES_OUT_RESET_PCR", value: 8, isUnsigned: true)
!295 = !DIEnumerator(name: "ES_OUT_SET_ES_FMT", value: 9, isUnsigned: true)
!296 = !DIEnumerator(name: "ES_OUT_SET_NEXT_DISPLAY_TIME", value: 10, isUnsigned: true)
!297 = !DIEnumerator(name: "ES_OUT_SET_GROUP_META", value: 11, isUnsigned: true)
!298 = !DIEnumerator(name: "ES_OUT_SET_GROUP_EPG", value: 12, isUnsigned: true)
!299 = !DIEnumerator(name: "ES_OUT_DEL_GROUP", value: 13, isUnsigned: true)
!300 = !DIEnumerator(name: "ES_OUT_SET_ES_SCRAMBLED_STATE", value: 14, isUnsigned: true)
!301 = !DIEnumerator(name: "ES_OUT_GET_EMPTY", value: 15, isUnsigned: true)
!302 = !DIEnumerator(name: "ES_OUT_SET_META", value: 16, isUnsigned: true)
!303 = !DIEnumerator(name: "ES_OUT_GET_PCR_SYSTEM", value: 17, isUnsigned: true)
!304 = !DIEnumerator(name: "ES_OUT_MODIFY_PCR_SYSTEM", value: 18, isUnsigned: true)
!305 = !DIEnumerator(name: "ES_OUT_PRIVATE_START", value: 65536, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "es_format_category_e", file: !307, line: 268, baseType: !11, size: 32, elements: !308)
!307 = !DIFile(filename: "../../../include/vlc_es.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!308 = !{!309, !310, !311, !312, !313}
!309 = !DIEnumerator(name: "UNKNOWN_ES", value: 0, isUnsigned: true)
!310 = !DIEnumerator(name: "VIDEO_ES", value: 1, isUnsigned: true)
!311 = !DIEnumerator(name: "AUDIO_ES", value: 2, isUnsigned: true)
!312 = !DIEnumerator(name: "SPU_ES", value: 3, isUnsigned: true)
!313 = !DIEnumerator(name: "NAV_ES", value: 4, isUnsigned: true)
!314 = !{!315, !6, !318, !181, !323, !391, !394, !396, !398, !714, !330, !375, !715, !481, !492, !418}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_callback_t", file: !319, line: 490, baseType: !320)
!319 = !DIFile(filename: "../../../include/vlc_common.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!6, !323, !315, !353, !353, !181}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !319, line: 177, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !326, line: 60, size: 320, elements: !327)
!326 = !DIFile(filename: "../../../include/vlc_objects.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!327 = !{!328, !329, !331, !332, !334, !335, !352}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !325, file: !326, line: 62, baseType: !315, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !325, file: !326, line: 62, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !325, file: !326, line: 62, baseType: !6, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !325, file: !326, line: 62, baseType: !333, size: 8, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !190)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !325, file: !326, line: 62, baseType: !190, size: 8, offset: 168)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !325, file: !326, line: 62, baseType: !336, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !319, line: 178, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !339, line: 38, size: 384, elements: !340)
!339 = !DIFile(filename: "../../../include/vlc_main.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !338, file: !339, line: 40, baseType: !315, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !338, file: !339, line: 40, baseType: !330, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !338, file: !339, line: 40, baseType: !6, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !338, file: !339, line: 40, baseType: !333, size: 8, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !338, file: !339, line: 40, baseType: !190, size: 8, offset: 168)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !338, file: !339, line: 40, baseType: !336, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !338, file: !339, line: 40, baseType: !323, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !338, file: !339, line: 43, baseType: !349, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "hotkey", file: !339, line: 31, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !325, file: !326, line: 62, baseType: !323, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_value_t", file: !319, line: 432, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !319, line: 417, size: 64, elements: !355)
!355 = !{!356, !357, !358, !360, !361, !362, !363, !373, !378, !384}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_int", scope: !354, file: !319, line: 419, baseType: !6, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b_bool", scope: !354, file: !319, line: 420, baseType: !190, size: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "f_float", scope: !354, file: !319, line: 421, baseType: !359, size: 32)
!359 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "psz_string", scope: !354, file: !319, line: 422, baseType: !330, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "p_address", scope: !354, file: !319, line: 423, baseType: !181, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "p_object", scope: !354, file: !319, line: 424, baseType: !323, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "p_list", scope: !354, file: !319, line: 425, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_list_t", file: !319, line: 176, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_list_t", file: !319, line: 437, size: 192, elements: !367)
!367 = !{!368, !369, !371}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !366, file: !319, line: 439, baseType: !6, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "p_values", scope: !366, file: !319, line: 440, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pi_types", scope: !366, file: !319, line: 441, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_time", scope: !354, file: !319, line: 426, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtime_t", file: !319, line: 131, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !376, line: 197, baseType: !377)
!376 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!377 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !354, file: !319, line: 427, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !319, line: 427, size: 64, elements: !380)
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !379, file: !319, line: 427, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !376, line: 196, baseType: !6)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !379, file: !319, line: 427, baseType: !382, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !354, file: !319, line: 430, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 64, elements: !389)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !387, line: 48, baseType: !388)
!387 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!388 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!389 = !{!390}
!390 = !DISubrange(count: 8)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !392, line: 62, baseType: !393)
!392 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!393 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "demux_t", file: !319, line: 224, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "demux_t", file: !401, line: 41, size: 1088, elements: !402)
!401 = !DIFile(filename: "../../../include/vlc_demux.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !414, !415, !416, !417, !472, !639, !643, !647, !653, !713}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !400, file: !401, line: 43, baseType: !315, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !400, file: !401, line: 43, baseType: !330, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !400, file: !401, line: 43, baseType: !6, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !400, file: !401, line: 43, baseType: !333, size: 8, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !400, file: !401, line: 43, baseType: !190, size: 8, offset: 168)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !400, file: !401, line: 43, baseType: !336, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !400, file: !401, line: 43, baseType: !323, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !400, file: !401, line: 46, baseType: !411, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_t", file: !319, line: 208, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_t", file: !319, line: 208, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "psz_access", scope: !400, file: !401, line: 49, baseType: !330, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "psz_demux", scope: !400, file: !401, line: 50, baseType: !330, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !400, file: !401, line: 51, baseType: !330, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !400, file: !401, line: 54, baseType: !418, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_t", file: !319, line: 222, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream_t", file: !421, line: 52, size: 1024, elements: !422)
!421 = !DIFile(filename: "../../../include/vlc_stream.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !438, !445, !456, !460, !464, !468}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !420, file: !421, line: 54, baseType: !315, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !420, file: !421, line: 54, baseType: !330, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !420, file: !421, line: 54, baseType: !6, size: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !420, file: !421, line: 54, baseType: !333, size: 8, offset: 160)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !420, file: !421, line: 54, baseType: !190, size: 8, offset: 168)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !420, file: !421, line: 54, baseType: !336, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !420, file: !421, line: 54, baseType: !323, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !420, file: !421, line: 55, baseType: !190, size: 8, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !420, file: !421, line: 58, baseType: !411, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !420, file: !421, line: 61, baseType: !330, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "p_source", scope: !420, file: !421, line: 64, baseType: !418, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !420, file: !421, line: 67, baseType: !435, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!6, !418, !181, !11}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peek", scope: !420, file: !421, line: 68, baseType: !439, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!6, !418, !442, !11}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !420, file: !421, line: 69, baseType: !446, size: 64, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!6, !418, !6, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !195, line: 125, size: 192, elements: !451)
!451 = !{!452, !453, !454, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !450, file: !195, line: 125, baseType: !11, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !450, file: !195, line: 125, baseType: !11, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !450, file: !195, line: 125, baseType: !181, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !450, file: !195, line: 125, baseType: !181, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destroy", scope: !420, file: !421, line: 72, baseType: !457, size: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !418}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !420, file: !421, line: 75, baseType: !461, size: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_sys_t", file: !319, line: 223, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "stream_sys_t", file: !319, line: 223, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "p_text", scope: !420, file: !421, line: 78, baseType: !465, size: 64, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_text_t", file: !421, line: 46, baseType: !467)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "stream_text_t", file: !421, line: 46, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !420, file: !421, line: 81, baseType: !469, size: 64, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_t", file: !319, line: 216, baseType: !471)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_t", file: !319, line: 216, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !400, file: !401, line: 57, baseType: !473, size: 64, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_out_t", file: !319, line: 226, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "es_out_t", file: !284, line: 96, size: 384, elements: !476)
!476 = !{!477, !599, !623, !627, !631, !635}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pf_add", scope: !475, file: !284, line: 98, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !473, !484}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_out_id_t", file: !319, line: 227, baseType: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "es_out_id_t", file: !319, line: 227, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_format_t", file: !319, line: 239, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "es_format_t", file: !307, line: 228, size: 2816, elements: !488)
!488 = !{!489, !490, !493, !494, !495, !496, !497, !498, !499, !500, !507, !520, !532, !568, !593, !594, !595, !596, !597, !598}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_cat", scope: !487, file: !307, line: 230, baseType: !6, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_codec", scope: !487, file: !307, line: 231, baseType: !491, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_fourcc_t", file: !319, line: 138, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !387, line: 51, baseType: !11)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_fourcc", scope: !487, file: !307, line: 232, baseType: !491, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !487, file: !307, line: 234, baseType: !6, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_group", scope: !487, file: !307, line: 237, baseType: !6, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_priority", scope: !487, file: !307, line: 241, baseType: !6, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !487, file: !307, line: 247, baseType: !330, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !487, file: !307, line: 248, baseType: !330, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra_languages", scope: !487, file: !307, line: 249, baseType: !6, size: 32, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra_languages", scope: !487, file: !307, line: 250, baseType: !501, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "extra_languages_t", file: !307, line: 223, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extra_languages_t", file: !307, line: 219, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "psz_language", scope: !503, file: !307, line: 221, baseType: !330, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "psz_description", scope: !503, file: !307, line: 222, baseType: !330, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "audio", scope: !487, file: !307, line: 252, baseType: !508, size: 288, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_format_t", file: !319, line: 236, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audio_format_t", file: !307, line: 67, size: 288, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_format", scope: !509, file: !307, line: 69, baseType: !491, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !509, file: !307, line: 70, baseType: !11, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_physical_channels", scope: !509, file: !307, line: 74, baseType: !492, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_channels", scope: !509, file: !307, line: 78, baseType: !492, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_per_frame", scope: !509, file: !307, line: 82, baseType: !11, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_length", scope: !509, file: !307, line: 85, baseType: !11, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitspersample", scope: !509, file: !307, line: 93, baseType: !11, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_blockalign", scope: !509, file: !307, line: 94, baseType: !11, size: 32, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_channels", scope: !509, file: !307, line: 95, baseType: !386, size: 8, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "audio_replay_gain", scope: !487, file: !307, line: 253, baseType: !521, size: 192, offset: 736)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_replay_gain_t", file: !307, line: 62, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 51, size: 192, elements: !523)
!523 = !{!524, !528, !530, !531}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pb_peak", scope: !522, file: !307, line: 54, baseType: !525, size: 16)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 16, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 2)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peak", scope: !522, file: !307, line: 56, baseType: !529, size: 64, offset: 32)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 64, elements: !526)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pb_gain", scope: !522, file: !307, line: 59, baseType: !525, size: 16, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gain", scope: !522, file: !307, line: 61, baseType: !529, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "video", scope: !487, file: !307, line: 254, baseType: !533, size: 768, offset: 960)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_format_t", file: !319, line: 237, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_format_t", file: !307, line: 101, size: 768, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma", scope: !534, file: !307, line: 103, baseType: !491, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !534, file: !307, line: 105, baseType: !11, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !534, file: !307, line: 106, baseType: !11, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_offset", scope: !534, file: !307, line: 107, baseType: !11, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_offset", scope: !534, file: !307, line: 108, baseType: !11, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_width", scope: !534, file: !307, line: 109, baseType: !11, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_visible_height", scope: !534, file: !307, line: 110, baseType: !11, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_per_pixel", scope: !534, file: !307, line: 112, baseType: !11, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_num", scope: !534, file: !307, line: 114, baseType: !11, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_den", scope: !534, file: !307, line: 115, baseType: !11, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate", scope: !534, file: !307, line: 117, baseType: !11, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_rate_base", scope: !534, file: !307, line: 118, baseType: !11, size: 32, offset: 352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_rmask", scope: !534, file: !307, line: 120, baseType: !492, size: 32, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_gmask", scope: !534, file: !307, line: 120, baseType: !492, size: 32, offset: 416)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_bmask", scope: !534, file: !307, line: 120, baseType: !492, size: 32, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_rrshift", scope: !534, file: !307, line: 121, baseType: !6, size: 32, offset: 480)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_lrshift", scope: !534, file: !307, line: 121, baseType: !6, size: 32, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_rgshift", scope: !534, file: !307, line: 122, baseType: !6, size: 32, offset: 544)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_lgshift", scope: !534, file: !307, line: 122, baseType: !6, size: 32, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_rbshift", scope: !534, file: !307, line: 123, baseType: !6, size: 32, offset: 608)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_lbshift", scope: !534, file: !307, line: 123, baseType: !6, size: 32, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "p_palette", scope: !534, file: !307, line: 124, baseType: !558, size: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_palette_t", file: !319, line: 240, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_palette_t", file: !307, line: 39, size: 8224, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_entries", scope: !560, file: !307, line: 41, baseType: !6, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !560, file: !307, line: 42, baseType: !564, size: 8192, offset: 32)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 8192, elements: !565)
!565 = !{!566, !567}
!566 = !DISubrange(count: 256)
!567 = !DISubrange(count: 4)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !487, file: !307, line: 255, baseType: !569, size: 832, offset: 1728)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "subs_format_t", file: !319, line: 238, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subs_format_t", file: !307, line: 184, size: 832, elements: !571)
!571 = !{!572, !573, !574, !575, !584, !588}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "psz_encoding", scope: !570, file: !307, line: 188, baseType: !330, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_x_origin", scope: !570, file: !307, line: 191, baseType: !6, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_y_origin", scope: !570, file: !307, line: 192, baseType: !6, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "spu", scope: !570, file: !307, line: 203, baseType: !576, size: 608, offset: 128)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !307, line: 194, size: 608, elements: !577)
!577 = !{!578, !582, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !576, file: !307, line: 197, baseType: !579, size: 544)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 544, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 17)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_width", scope: !576, file: !307, line: 200, baseType: !6, size: 32, offset: 544)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_original_frame_height", scope: !576, file: !307, line: 202, baseType: !6, size: 32, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !570, file: !307, line: 208, baseType: !585, size: 32, offset: 736)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !307, line: 205, size: 32, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !585, file: !307, line: 207, baseType: !6, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "teletext", scope: !570, file: !307, line: 213, baseType: !589, size: 64, offset: 768)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !307, line: 209, size: 64, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_magazine", scope: !589, file: !307, line: 211, baseType: !6, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_page", scope: !589, file: !307, line: 212, baseType: !6, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !487, file: !307, line: 257, baseType: !11, size: 32, offset: 2560)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile", scope: !487, file: !307, line: 258, baseType: !6, size: 32, offset: 2592)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_level", scope: !487, file: !307, line: 259, baseType: !6, size: 32, offset: 2624)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "b_packetized", scope: !487, file: !307, line: 261, baseType: !190, size: 8, offset: 2656)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_extra", scope: !487, file: !307, line: 262, baseType: !6, size: 32, offset: 2688)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "p_extra", scope: !487, file: !307, line: 263, baseType: !181, size: 64, offset: 2752)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pf_send", scope: !475, file: !284, line: 99, baseType: !600, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!6, !473, !481, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_t", file: !319, line: 330, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_t", file: !606, line: 103, size: 576, elements: !607)
!606 = !DIFile(filename: "../../../include/vlc_block.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !618}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !605, file: !606, line: 105, baseType: !603, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !605, file: !606, line: 107, baseType: !492, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !605, file: !606, line: 109, baseType: !374, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !605, file: !606, line: 110, baseType: !374, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !605, file: !606, line: 111, baseType: !374, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_samples", scope: !605, file: !606, line: 113, baseType: !11, size: 32, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !605, file: !606, line: 114, baseType: !6, size: 32, offset: 352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_buffer", scope: !605, file: !606, line: 116, baseType: !391, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "p_buffer", scope: !605, file: !606, line: 117, baseType: !617, size: 64, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !605, file: !606, line: 120, baseType: !619, size: 64, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_free_t", file: !606, line: 101, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !603}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pf_del", scope: !475, file: !284, line: 100, baseType: !624, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !473, !481}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !475, file: !284, line: 101, baseType: !628, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!6, !473, !6, !449}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destroy", scope: !475, file: !284, line: 102, baseType: !632, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !473}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !475, file: !284, line: 104, baseType: !636, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "es_out_sys_t", file: !319, line: 228, baseType: !638)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "es_out_sys_t", file: !319, line: 228, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pf_demux", scope: !400, file: !401, line: 60, baseType: !640, size: 64, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!6, !398}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !400, file: !401, line: 61, baseType: !644, size: 64, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!6, !398, !6, !449}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !400, file: !401, line: 72, baseType: !648, size: 96, offset: 832)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !401, line: 65, size: 96, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_update", scope: !648, file: !401, line: 67, baseType: !11, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_title", scope: !648, file: !401, line: 70, baseType: !6, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !648, file: !401, line: 71, baseType: !6, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !400, file: !401, line: 73, baseType: !654, size: 64, offset: 960)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "demux_sys_t", file: !319, line: 225, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "demux_sys_t", file: !657, line: 52, size: 832, elements: !658)
!657 = !DIFile(filename: "./rtp.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!658 = !{!659, !663, !666, !667, !668, !672, !676, !704, !705, !706, !709, !710, !711, !712}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !656, file: !657, line: 54, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtp_session_t", file: !657, line: 24, baseType: !662)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtp_session_t", file: !657, line: 24, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "srtp", scope: !656, file: !657, line: 56, baseType: !664, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "srtp_session_t", file: !657, line: 56, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !656, file: !657, line: 58, baseType: !6, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rtcp_fd", scope: !656, file: !657, line: 59, baseType: !6, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !656, file: !657, line: 60, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_thread_t", file: !670, line: 101, baseType: !671)
!670 = !DIFile(filename: "../../../include/vlc_threads.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !193, line: 60, baseType: !393)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !656, file: !657, line: 61, baseType: !673, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_timer_t", file: !670, line: 109, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_timer", file: !670, line: 109, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !656, file: !657, line: 62, baseType: !677, size: 320, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_mutex_t", file: !670, line: 102, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !193, line: 128, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !193, line: 90, size: 320, elements: !680)
!680 = !{!681, !699, !703}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !679, file: !193, line: 125, baseType: !682, size: 320)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !193, line: 92, size: 320, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !691, !692}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !682, file: !193, line: 94, baseType: !6, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !682, file: !193, line: 95, baseType: !11, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !682, file: !193, line: 96, baseType: !6, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !682, file: !193, line: 98, baseType: !11, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !682, file: !193, line: 102, baseType: !6, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !682, file: !193, line: 104, baseType: !690, size: 16, offset: 160)
!690 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !682, file: !193, line: 105, baseType: !690, size: 16, offset: 176)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !682, file: !193, line: 106, baseType: !693, size: 128, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !193, line: 79, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !193, line: 75, size: 128, elements: !695)
!695 = !{!696, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !694, file: !193, line: 77, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !694, file: !193, line: 78, baseType: !697, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !679, file: !193, line: 126, baseType: !700, size: 320)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 320, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 40)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !679, file: !193, line: 127, baseType: !377, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !656, file: !657, line: 64, baseType: !374, size: 64, offset: 640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !656, file: !657, line: 65, baseType: !11, size: 32, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "max_dropout", scope: !656, file: !657, line: 66, baseType: !707, size: 16, offset: 736)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !387, line: 49, baseType: !708)
!708 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "max_misorder", scope: !656, file: !657, line: 67, baseType: !707, size: 16, offset: 752)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "max_src", scope: !656, file: !657, line: 68, baseType: !386, size: 8, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "framed_rtp", scope: !656, file: !657, line: 69, baseType: !190, size: 8, offset: 776)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ready", scope: !656, file: !657, line: 70, baseType: !190, size: 8, offset: 784)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !400, file: !401, line: 76, baseType: !469, size: 64, offset: 1024)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !191, retainedTypes: !718, nameTableKind: None)
!717 = !DIFile(filename: "input.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!718 = !{!181, !719, !673, !722, !443, !707, !745}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !721, line: 742, flags: DIFlagFwdDecl)
!721 = !DIFile(filename: "/usr/include/pthread.h", directory: "")
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !319, line: 177, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !326, line: 60, size: 320, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !744}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !724, file: !326, line: 62, baseType: !315, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !724, file: !326, line: 62, baseType: !330, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !724, file: !326, line: 62, baseType: !6, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !724, file: !326, line: 62, baseType: !333, size: 8, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !724, file: !326, line: 62, baseType: !190, size: 8, offset: 168)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !724, file: !326, line: 62, baseType: !732, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !319, line: 178, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !339, line: 38, size: 384, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !734, file: !339, line: 40, baseType: !315, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !734, file: !339, line: 40, baseType: !330, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !734, file: !339, line: 40, baseType: !6, size: 32, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !734, file: !339, line: 40, baseType: !333, size: 8, offset: 160)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !734, file: !339, line: 40, baseType: !190, size: 8, offset: 168)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !734, file: !339, line: 40, baseType: !732, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !734, file: !339, line: 40, baseType: !722, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !734, file: !339, line: 43, baseType: !349, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !724, file: !326, line: 62, baseType: !722, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_t", file: !319, line: 330, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_t", file: !606, line: 103, size: 576, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !747, file: !606, line: 105, baseType: !745, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !747, file: !606, line: 107, baseType: !492, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !747, file: !606, line: 109, baseType: !374, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !747, file: !606, line: 110, baseType: !374, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !747, file: !606, line: 111, baseType: !374, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_samples", scope: !747, file: !606, line: 113, baseType: !11, size: 32, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !747, file: !606, line: 114, baseType: !6, size: 32, offset: 352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_buffer", scope: !747, file: !606, line: 116, baseType: !391, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "p_buffer", scope: !747, file: !606, line: 117, baseType: !617, size: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !747, file: !606, line: 120, baseType: !759, size: 64, offset: 512)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_free_t", file: !606, line: 101, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !745}
!763 = distinct !DICompileUnit(language: DW_LANG_C99, file: !764, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !191, retainedTypes: !765, nameTableKind: None)
!764 = !DIFile(filename: "session.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!765 = !{!181, !766, !789, !443, !707, !492, !382}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !319, line: 177, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !326, line: 60, size: 320, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !788}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !768, file: !326, line: 62, baseType: !315, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !768, file: !326, line: 62, baseType: !330, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !768, file: !326, line: 62, baseType: !6, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !768, file: !326, line: 62, baseType: !333, size: 8, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !768, file: !326, line: 62, baseType: !190, size: 8, offset: 168)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !768, file: !326, line: 62, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !319, line: 178, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !339, line: 38, size: 384, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !778, file: !339, line: 40, baseType: !315, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !778, file: !339, line: 40, baseType: !330, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !778, file: !339, line: 40, baseType: !6, size: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !778, file: !339, line: 40, baseType: !333, size: 8, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !778, file: !339, line: 40, baseType: !190, size: 8, offset: 168)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !778, file: !339, line: 40, baseType: !776, size: 64, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !778, file: !339, line: 40, baseType: !766, size: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !778, file: !339, line: 43, baseType: !349, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !768, file: !326, line: 62, baseType: !766, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !376, line: 195, baseType: !690)
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !191, nameTableKind: None)
!791 = !DIFile(filename: "strlcpy.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/compat")
!792 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!793 = !{i32 2, !"Dwarf Version", i32 4}
!794 = !{i32 2, !"Debug Info Version", i32 3}
!795 = !{i32 1, !"wchar_size", i32 4}
!796 = !{i32 7, !"PIC Level", i32 2}
!797 = !{i32 1, !"ThinLTO", i32 0}
!798 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!799 = distinct !DISubprogram(name: "vlc_entry__1_1_0g", scope: !195, file: !195, line: 86, type: !800, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !802)
!800 = !DISubroutineType(types: !801)
!801 = !{!6, !411}
!802 = !{!803, !804, !852}
!803 = !DILocalVariable(name: "p_module", arg: 1, scope: !799, file: !195, line: 86, type: !411)
!804 = !DILocalVariable(name: "p_config", scope: !799, file: !195, line: 86, type: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_config_t", file: !319, line: 209, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_config_t", file: !808, line: 150, size: 1408, elements: !809)
!808 = !DIFile(filename: "../../../include/vlc_configuration.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!809 = !{!810, !811, !812, !813, !814, !815, !816, !823, !824, !825, !831, !832, !833, !834, !835, !836, !837, !838, !839, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !807, file: !808, line: 152, baseType: !6, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "psz_type", scope: !807, file: !808, line: 153, baseType: !330, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !807, file: !808, line: 154, baseType: !330, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_short", scope: !807, file: !808, line: 155, baseType: !317, size: 8, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "psz_text", scope: !807, file: !808, line: 156, baseType: !330, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "psz_longtext", scope: !807, file: !808, line: 157, baseType: !330, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !807, file: !808, line: 158, baseType: !817, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_value_t", file: !808, line: 142, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !808, line: 137, size: 64, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "psz", scope: !818, file: !808, line: 139, baseType: !330, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !818, file: !808, line: 140, baseType: !6, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !818, file: !808, line: 141, baseType: !359, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !807, file: !808, line: 159, baseType: !817, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !807, file: !808, line: 160, baseType: !817, size: 64, offset: 512)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !807, file: !808, line: 161, baseType: !826, size: 32, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_nvalue_t", file: !808, line: 148, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !808, line: 144, size: 32, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !827, file: !808, line: 146, baseType: !6, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !827, file: !808, line: 147, baseType: !359, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !807, file: !808, line: 162, baseType: !826, size: 32, offset: 608)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pf_callback", scope: !807, file: !808, line: 165, baseType: !318, size: 64, offset: 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "p_callback_data", scope: !807, file: !808, line: 166, baseType: !181, size: 64, offset: 704)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list", scope: !807, file: !808, line: 169, baseType: !714, size: 64, offset: 768)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pi_list", scope: !807, file: !808, line: 170, baseType: !372, size: 64, offset: 832)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list_text", scope: !807, file: !808, line: 171, baseType: !714, size: 64, offset: 896)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i_list", scope: !807, file: !808, line: 172, baseType: !6, size: 32, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pf_update_list", scope: !807, file: !808, line: 173, baseType: !318, size: 64, offset: 1024)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ppf_action", scope: !807, file: !808, line: 176, baseType: !840, size: 64, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_action_text", scope: !807, file: !808, line: 177, baseType: !714, size: 64, offset: 1152)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_action", scope: !807, file: !808, line: 178, baseType: !6, size: 32, offset: 1216)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "b_dirty", scope: !807, file: !808, line: 181, baseType: !190, size: 8, offset: 1248)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "b_advanced", scope: !807, file: !808, line: 182, baseType: !190, size: 8, offset: 1256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "b_internal", scope: !807, file: !808, line: 183, baseType: !190, size: 8, offset: 1264)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "b_restart", scope: !807, file: !808, line: 184, baseType: !190, size: 8, offset: 1272)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "psz_oldname", scope: !807, file: !808, line: 188, baseType: !330, size: 64, offset: 1280)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "b_removed", scope: !807, file: !808, line: 189, baseType: !190, size: 8, offset: 1344)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "b_autosave", scope: !807, file: !808, line: 192, baseType: !190, size: 8, offset: 1352)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "b_unsaveable", scope: !807, file: !808, line: 193, baseType: !190, size: 8, offset: 1360)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "b_safe", scope: !807, file: !808, line: 195, baseType: !190, size: 8, offset: 1368)
!852 = !DILocalVariable(name: "p_submodule", scope: !853, file: !195, line: 86, type: !411)
!853 = distinct !DILexicalBlock(scope: !799, file: !195, line: 86, column: 1)
!854 = !DILocation(line: 86, column: 1, scope: !799)
!855 = !{!856, !856, i64 0}
!856 = !{!"any pointer", !857, i64 0}
!857 = !{!"omnipotent char", !858, i64 0}
!858 = !{!"Simple C/C++ TBAA"}
!859 = !DILocation(line: 86, column: 1, scope: !860)
!860 = distinct !DILexicalBlock(scope: !799, file: !195, line: 86, column: 1)
!861 = !DILocation(line: 86, column: 1, scope: !853)
!862 = !DILocation(line: 87, column: 5, scope: !863)
!863 = distinct !DILexicalBlock(scope: !853, file: !195, line: 87, column: 5)
!864 = !DILocation(line: 87, column: 5, scope: !853)
!865 = !DILocation(line: 88, column: 5, scope: !866)
!866 = distinct !DILexicalBlock(scope: !853, file: !195, line: 88, column: 5)
!867 = !DILocation(line: 88, column: 5, scope: !853)
!868 = !DILocation(line: 89, column: 5, scope: !853)
!869 = !DILocation(line: 90, column: 5, scope: !853)
!870 = !DILocation(line: 91, column: 5, scope: !871)
!871 = distinct !DILexicalBlock(scope: !853, file: !195, line: 91, column: 5)
!872 = !DILocation(line: 91, column: 5, scope: !853)
!873 = !DILocation(line: 92, column: 5, scope: !874)
!874 = distinct !DILexicalBlock(scope: !853, file: !195, line: 92, column: 5)
!875 = !DILocation(line: 92, column: 5, scope: !853)
!876 = !DILocation(line: 94, column: 5, scope: !853)
!877 = !DILocation(line: 94, column: 5, scope: !878)
!878 = distinct !DILexicalBlock(scope: !853, file: !195, line: 94, column: 5)
!879 = !DILocation(line: 96, column: 9, scope: !853)
!880 = !DILocation(line: 97, column: 9, scope: !853)
!881 = !DILocation(line: 98, column: 5, scope: !853)
!882 = !DILocation(line: 100, column: 9, scope: !853)
!883 = !DILocation(line: 101, column: 9, scope: !853)
!884 = !DILocation(line: 103, column: 5, scope: !853)
!885 = !DILocation(line: 105, column: 5, scope: !853)
!886 = !DILocation(line: 108, column: 5, scope: !853)
!887 = !DILocation(line: 108, column: 5, scope: !888)
!888 = distinct !DILexicalBlock(scope: !853, file: !195, line: 108, column: 5)
!889 = !DILocation(line: 110, column: 9, scope: !853)
!890 = !DILocation(line: 111, column: 5, scope: !853)
!891 = !DILocation(line: 111, column: 5, scope: !892)
!892 = distinct !DILexicalBlock(scope: !853, file: !195, line: 111, column: 5)
!893 = !DILocation(line: 113, column: 5, scope: !853)
!894 = !DILocation(line: 113, column: 5, scope: !895)
!895 = distinct !DILexicalBlock(scope: !853, file: !195, line: 113, column: 5)
!896 = !DILocation(line: 115, column: 9, scope: !853)
!897 = !DILocation(line: 116, column: 5, scope: !853)
!898 = !DILocation(line: 116, column: 5, scope: !899)
!899 = distinct !DILexicalBlock(scope: !853, file: !195, line: 116, column: 5)
!900 = !DILocation(line: 118, column: 9, scope: !853)
!901 = !DILocation(line: 120, column: 5, scope: !902)
!902 = distinct !DILexicalBlock(scope: !853, file: !195, line: 120, column: 5)
!903 = !DILocation(line: 120, column: 5, scope: !853)
!904 = !DILocation(line: 122, column: 5, scope: !905)
!905 = distinct !DILexicalBlock(scope: !853, file: !195, line: 122, column: 5)
!906 = !DILocation(line: 122, column: 5, scope: !853)
!907 = !DILocation(line: 123, column: 5, scope: !908)
!908 = distinct !DILexicalBlock(scope: !853, file: !195, line: 123, column: 5)
!909 = !DILocation(line: 123, column: 5, scope: !853)
!910 = !DILocation(line: 124, column: 5, scope: !911)
!911 = distinct !DILexicalBlock(scope: !853, file: !195, line: 124, column: 5)
!912 = !DILocation(line: 125, column: 1, scope: !799)
!913 = distinct !DISubprogram(name: "Open", scope: !195, file: !195, line: 153, type: !914, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{!6, !323}
!916 = !{!917, !918, !919, !920, !923, !924, !926, !927, !930, !931, !933, !934, !937, !938, !940, !941, !944, !945, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!917 = !DILocalVariable(name: "obj", arg: 1, scope: !913, file: !195, line: 153, type: !323)
!918 = !DILocalVariable(name: "demux", scope: !913, file: !195, line: 155, type: !398)
!919 = !DILocalVariable(name: "tp", scope: !913, file: !195, line: 156, type: !6)
!920 = !DILocalVariable(name: "__s1_len", scope: !921, file: !195, line: 158, type: !391)
!921 = distinct !DILexicalBlock(scope: !922, file: !195, line: 158, column: 10)
!922 = distinct !DILexicalBlock(scope: !913, file: !195, line: 158, column: 9)
!923 = !DILocalVariable(name: "__s2_len", scope: !921, file: !195, line: 158, type: !391)
!924 = !DILocalVariable(name: "__s2", scope: !925, file: !195, line: 158, type: !396)
!925 = distinct !DILexicalBlock(scope: !921, file: !195, line: 158, column: 10)
!926 = !DILocalVariable(name: "__result", scope: !925, file: !195, line: 158, type: !6)
!927 = !DILocalVariable(name: "__s1_len", scope: !928, file: !195, line: 161, type: !391)
!928 = distinct !DILexicalBlock(scope: !929, file: !195, line: 161, column: 10)
!929 = distinct !DILexicalBlock(scope: !922, file: !195, line: 161, column: 9)
!930 = !DILocalVariable(name: "__s2_len", scope: !928, file: !195, line: 161, type: !391)
!931 = !DILocalVariable(name: "__s2", scope: !932, file: !195, line: 161, type: !396)
!932 = distinct !DILexicalBlock(scope: !928, file: !195, line: 161, column: 10)
!933 = !DILocalVariable(name: "__result", scope: !932, file: !195, line: 161, type: !6)
!934 = !DILocalVariable(name: "__s1_len", scope: !935, file: !195, line: 164, type: !391)
!935 = distinct !DILexicalBlock(scope: !936, file: !195, line: 164, column: 10)
!936 = distinct !DILexicalBlock(scope: !929, file: !195, line: 164, column: 9)
!937 = !DILocalVariable(name: "__s2_len", scope: !935, file: !195, line: 164, type: !391)
!938 = !DILocalVariable(name: "__s2", scope: !939, file: !195, line: 164, type: !396)
!939 = distinct !DILexicalBlock(scope: !935, file: !195, line: 164, column: 10)
!940 = !DILocalVariable(name: "__result", scope: !939, file: !195, line: 164, type: !6)
!941 = !DILocalVariable(name: "__s1_len", scope: !942, file: !195, line: 167, type: !391)
!942 = distinct !DILexicalBlock(scope: !943, file: !195, line: 167, column: 10)
!943 = distinct !DILexicalBlock(scope: !936, file: !195, line: 167, column: 9)
!944 = !DILocalVariable(name: "__s2_len", scope: !942, file: !195, line: 167, type: !391)
!945 = !DILocalVariable(name: "__s2", scope: !946, file: !195, line: 167, type: !396)
!946 = distinct !DILexicalBlock(scope: !942, file: !195, line: 167, column: 10)
!947 = !DILocalVariable(name: "__result", scope: !946, file: !195, line: 167, type: !6)
!948 = !DILocalVariable(name: "tmp", scope: !913, file: !195, line: 172, type: !330)
!949 = !DILocalVariable(name: "shost", scope: !913, file: !195, line: 176, type: !330)
!950 = !DILocalVariable(name: "dhost", scope: !913, file: !195, line: 177, type: !330)
!951 = !DILocalVariable(name: "sport", scope: !913, file: !195, line: 190, type: !6)
!952 = !DILocalVariable(name: "dport", scope: !913, file: !195, line: 190, type: !6)
!953 = !DILocalVariable(name: "rtcp_dport", scope: !913, file: !195, line: 198, type: !6)
!954 = !DILocalVariable(name: "fd", scope: !913, file: !195, line: 201, type: !6)
!955 = !DILocalVariable(name: "rtcp_fd", scope: !913, file: !195, line: 201, type: !6)
!956 = !DILocalVariable(name: "p_sys", scope: !913, file: !195, line: 242, type: !654)
!957 = !DILocalVariable(name: "key", scope: !913, file: !195, line: 274, type: !330)
!958 = !DILocalVariable(name: "salt", scope: !959, file: !195, line: 285, type: !330)
!959 = distinct !DILexicalBlock(scope: !960, file: !195, line: 276, column: 5)
!960 = distinct !DILexicalBlock(scope: !913, file: !195, line: 275, column: 9)
!961 = !DILocation(line: 153, column: 32, scope: !913)
!962 = !DILocation(line: 155, column: 22, scope: !913)
!963 = !DILocation(line: 155, column: 14, scope: !913)
!964 = !DILocation(line: 158, column: 10, scope: !921)
!965 = !{!966, !856, i64 48}
!966 = !{!"demux_t", !856, i64 0, !856, i64 8, !967, i64 16, !968, i64 20, !968, i64 21, !856, i64 24, !856, i64 32, !856, i64 40, !856, i64 48, !856, i64 56, !856, i64 64, !856, i64 72, !856, i64 80, !856, i64 88, !856, i64 96, !969, i64 104, !856, i64 120, !856, i64 128}
!967 = !{!"int", !857, i64 0}
!968 = !{!"_Bool", !857, i64 0}
!969 = !{!"", !967, i64 0, !967, i64 4, !967, i64 8}
!970 = !DILocation(line: 158, column: 10, scope: !922)
!971 = !DILocation(line: 158, column: 9, scope: !913)
!972 = !DILocation(line: 161, column: 10, scope: !928)
!973 = !DILocation(line: 161, column: 10, scope: !929)
!974 = !DILocation(line: 161, column: 9, scope: !922)
!975 = !DILocation(line: 164, column: 10, scope: !935)
!976 = !DILocation(line: 164, column: 10, scope: !939)
!977 = !{!857, !857, i64 0}
!978 = !DILocation(line: 164, column: 10, scope: !979)
!979 = distinct !DILexicalBlock(scope: !939, file: !195, line: 164, column: 10)
!980 = !DILocation(line: 164, column: 10, scope: !981)
!981 = distinct !DILexicalBlock(scope: !979, file: !195, line: 164, column: 10)
!982 = !DILocation(line: 164, column: 10, scope: !983)
!983 = distinct !DILexicalBlock(scope: !981, file: !195, line: 164, column: 10)
!984 = !DILocation(line: 164, column: 10, scope: !985)
!985 = distinct !DILexicalBlock(scope: !983, file: !195, line: 164, column: 10)
!986 = !DILocation(line: 164, column: 10, scope: !987)
!987 = distinct !DILexicalBlock(scope: !985, file: !195, line: 164, column: 10)
!988 = !DILocation(line: 0, scope: !939)
!989 = !DILocation(line: 164, column: 10, scope: !936)
!990 = !DILocation(line: 164, column: 9, scope: !929)
!991 = !DILocation(line: 167, column: 10, scope: !942)
!992 = !DILocation(line: 167, column: 10, scope: !943)
!993 = !DILocation(line: 167, column: 9, scope: !936)
!994 = !DILocation(line: 0, scope: !922)
!995 = !DILocation(line: 156, column: 9, scope: !913)
!996 = !DILocation(line: 172, column: 17, scope: !913)
!997 = !{!966, !856, i64 64}
!998 = !DILocation(line: 172, column: 11, scope: !913)
!999 = !DILocation(line: 173, column: 13, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !913, file: !195, line: 173, column: 9)
!1001 = !DILocation(line: 173, column: 9, scope: !913)
!1002 = !DILocation(line: 177, column: 19, scope: !913)
!1003 = !DILocation(line: 177, column: 11, scope: !913)
!1004 = !DILocation(line: 178, column: 15, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !913, file: !195, line: 178, column: 9)
!1006 = !DILocation(line: 178, column: 9, scope: !913)
!1007 = !DILocation(line: 180, column: 16, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !195, line: 179, column: 5)
!1009 = !DILocation(line: 180, column: 20, scope: !1008)
!1010 = !DILocation(line: 176, column: 11, scope: !913)
!1011 = !DILocation(line: 190, column: 9, scope: !913)
!1012 = !DILocation(line: 190, column: 20, scope: !913)
!1013 = !DILocalVariable(name: "host", scope: !1014, file: !195, line: 346, type: !330)
!1014 = distinct !DISubprogram(name: "extract_port", scope: !195, file: !195, line: 344, type: !1015, scopeLine: 345, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1017)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!6, !714}
!1017 = !{!1018, !1013, !1019}
!1018 = !DILocalVariable(name: "phost", arg: 1, scope: !1014, file: !195, line: 344, type: !714)
!1019 = !DILocalVariable(name: "port", scope: !1014, file: !195, line: 346, type: !330)
!1020 = !DILocation(line: 346, column: 11, scope: !1014, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 192, column: 17, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !913, file: !195, line: 191, column: 9)
!1023 = !DILocation(line: 348, column: 9, scope: !1024, inlinedAt: !1021)
!1024 = distinct !DILexicalBlock(scope: !1014, file: !195, line: 348, column: 9)
!1025 = !DILocation(line: 348, column: 17, scope: !1024, inlinedAt: !1021)
!1026 = !DILocation(line: 348, column: 9, scope: !1014, inlinedAt: !1021)
!1027 = !DILocation(line: 350, column: 16, scope: !1028, inlinedAt: !1021)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !195, line: 349, column: 5)
!1029 = !DILocation(line: 351, column: 16, scope: !1028, inlinedAt: !1021)
!1030 = !DILocation(line: 346, column: 27, scope: !1014, inlinedAt: !1021)
!1031 = !DILocation(line: 352, column: 13, scope: !1032, inlinedAt: !1021)
!1032 = distinct !DILexicalBlock(scope: !1028, file: !195, line: 352, column: 13)
!1033 = !DILocation(line: 352, column: 13, scope: !1028, inlinedAt: !1021)
!1034 = !DILocation(line: 353, column: 18, scope: !1032, inlinedAt: !1021)
!1035 = !DILocation(line: 353, column: 21, scope: !1032, inlinedAt: !1021)
!1036 = !DILocation(line: 358, column: 9, scope: !1014, inlinedAt: !1021)
!1037 = !DILocation(line: 356, column: 16, scope: !1024, inlinedAt: !1021)
!1038 = !DILocation(line: 358, column: 14, scope: !1039, inlinedAt: !1021)
!1039 = distinct !DILexicalBlock(scope: !1014, file: !195, line: 358, column: 9)
!1040 = !DILocation(line: 0, scope: !913)
!1041 = !DILocation(line: 360, column: 10, scope: !1014, inlinedAt: !1021)
!1042 = !DILocation(line: 360, column: 13, scope: !1014, inlinedAt: !1021)
!1043 = !DILocalVariable(name: "__nptr", arg: 1, scope: !1044, file: !1045, line: 239, type: !315)
!1044 = distinct !DISubprogram(name: "atoi", scope: !1045, file: !1045, line: 239, type: !1046, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1048)
!1045 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!6, !315}
!1048 = !{!1043}
!1049 = !DILocation(line: 239, column: 1, scope: !1044, inlinedAt: !1050)
!1050 = distinct !DILocation(line: 361, column: 12, scope: !1014, inlinedAt: !1021)
!1051 = !DILocation(line: 241, column: 16, scope: !1044, inlinedAt: !1050)
!1052 = !DILocation(line: 241, column: 10, scope: !1044, inlinedAt: !1050)
!1053 = !DILocation(line: 361, column: 5, scope: !1014, inlinedAt: !1021)
!1054 = !DILocation(line: 346, column: 11, scope: !1014, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 194, column: 17, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !913, file: !195, line: 193, column: 9)
!1057 = !DILocation(line: 348, column: 9, scope: !1024, inlinedAt: !1055)
!1058 = !DILocation(line: 348, column: 17, scope: !1024, inlinedAt: !1055)
!1059 = !DILocation(line: 348, column: 9, scope: !1014, inlinedAt: !1055)
!1060 = !DILocation(line: 350, column: 16, scope: !1028, inlinedAt: !1055)
!1061 = !DILocation(line: 351, column: 16, scope: !1028, inlinedAt: !1055)
!1062 = !DILocation(line: 346, column: 27, scope: !1014, inlinedAt: !1055)
!1063 = !DILocation(line: 352, column: 13, scope: !1032, inlinedAt: !1055)
!1064 = !DILocation(line: 352, column: 13, scope: !1028, inlinedAt: !1055)
!1065 = !DILocation(line: 353, column: 18, scope: !1032, inlinedAt: !1055)
!1066 = !DILocation(line: 353, column: 21, scope: !1032, inlinedAt: !1055)
!1067 = !DILocation(line: 358, column: 9, scope: !1014, inlinedAt: !1055)
!1068 = !DILocation(line: 356, column: 16, scope: !1024, inlinedAt: !1055)
!1069 = !DILocation(line: 358, column: 14, scope: !1039, inlinedAt: !1055)
!1070 = !DILocation(line: 360, column: 10, scope: !1014, inlinedAt: !1055)
!1071 = !DILocation(line: 360, column: 13, scope: !1014, inlinedAt: !1055)
!1072 = !DILocation(line: 239, column: 1, scope: !1044, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 361, column: 12, scope: !1014, inlinedAt: !1055)
!1074 = !DILocation(line: 241, column: 16, scope: !1044, inlinedAt: !1073)
!1075 = !DILocation(line: 241, column: 10, scope: !1044, inlinedAt: !1073)
!1076 = !DILocation(line: 195, column: 15, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !913, file: !195, line: 195, column: 9)
!1078 = !DILocation(line: 195, column: 9, scope: !913)
!1079 = !DILocalVariable(name: "p_obj", arg: 1, scope: !1080, file: !1081, line: 460, type: !323)
!1080 = distinct !DISubprogram(name: "var_CreateGetInteger", scope: !1081, file: !1081, line: 460, type: !1082, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1084)
!1081 = !DIFile(filename: "../../../include/vlc_variables.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/rtp")
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!6, !323, !315}
!1084 = !{!1079, !1085}
!1085 = !DILocalVariable(name: "psz_name", arg: 2, scope: !1080, file: !1081, line: 460, type: !315)
!1086 = !DILocation(line: 460, column: 55, scope: !1080, inlinedAt: !1087)
!1087 = distinct !DILocation(line: 198, column: 22, scope: !913)
!1088 = !DILocation(line: 460, column: 74, scope: !1080, inlinedAt: !1087)
!1089 = !DILocation(line: 462, column: 5, scope: !1080, inlinedAt: !1087)
!1090 = !DILocalVariable(name: "p_obj", arg: 1, scope: !1091, file: !1081, line: 294, type: !323)
!1091 = distinct !DISubprogram(name: "var_GetInteger", scope: !1081, file: !1081, line: 294, type: !1082, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1092)
!1092 = !{!1090, !1093, !1094}
!1093 = !DILocalVariable(name: "psz_name", arg: 2, scope: !1091, file: !1081, line: 294, type: !315)
!1094 = !DILocalVariable(name: "val", scope: !1091, file: !1081, line: 296, type: !353)
!1095 = !DILocation(line: 294, column: 49, scope: !1091, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 463, column: 12, scope: !1080, inlinedAt: !1087)
!1097 = !DILocation(line: 294, column: 68, scope: !1091, inlinedAt: !1096)
!1098 = !DILocation(line: 296, column: 5, scope: !1091, inlinedAt: !1096)
!1099 = !DILocation(line: 296, column: 17, scope: !1091, inlinedAt: !1096)
!1100 = !DILocation(line: 297, column: 10, scope: !1101, inlinedAt: !1096)
!1101 = distinct !DILexicalBlock(scope: !1091, file: !1081, line: 297, column: 9)
!1102 = !DILocation(line: 297, column: 9, scope: !1091, inlinedAt: !1096)
!1103 = !DILocation(line: 301, column: 1, scope: !1091, inlinedAt: !1096)
!1104 = !DILocation(line: 198, column: 9, scope: !913)
!1105 = !DILocation(line: 201, column: 9, scope: !913)
!1106 = !DILocation(line: 201, column: 18, scope: !913)
!1107 = !DILocation(line: 203, column: 5, scope: !913)
!1108 = !DILocation(line: 236, column: 5, scope: !913)
!1109 = !DILocation(line: 237, column: 9, scope: !913)
!1110 = !DILocation(line: 207, column: 18, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !913, file: !195, line: 204, column: 5)
!1112 = !DILocation(line: 209, column: 20, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1111, file: !195, line: 209, column: 17)
!1114 = !DILocation(line: 211, column: 28, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !195, line: 211, column: 17)
!1116 = !DILocation(line: 209, column: 17, scope: !1111)
!1117 = !DILocation(line: 212, column: 27, scope: !1115)
!1118 = !DILocation(line: 223, column: 13, scope: !1111)
!1119 = !DILocalVariable(name: "p_obj", arg: 1, scope: !1120, file: !1081, line: 257, type: !323)
!1120 = distinct !DISubprogram(name: "var_SetString", scope: !1081, file: !1081, line: 257, type: !1121, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!6, !323, !315, !315}
!1123 = !{!1119, !1124, !1125, !1126}
!1124 = !DILocalVariable(name: "psz_name", arg: 2, scope: !1120, file: !1081, line: 257, type: !315)
!1125 = !DILocalVariable(name: "psz_string", arg: 3, scope: !1120, file: !1081, line: 257, type: !315)
!1126 = !DILocalVariable(name: "val", scope: !1120, file: !1081, line: 259, type: !353)
!1127 = !DILocation(line: 257, column: 48, scope: !1120, inlinedAt: !1128)
!1128 = distinct !DILocation(line: 224, column: 13, scope: !1111)
!1129 = !DILocation(line: 261, column: 12, scope: !1120, inlinedAt: !1128)
!1130 = !DILocation(line: 229, column: 13, scope: !1111)
!1131 = !DILocation(line: 0, scope: !1111)
!1132 = !DILocation(line: 237, column: 12, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !913, file: !195, line: 237, column: 9)
!1134 = !DILocation(line: 239, column: 5, scope: !913)
!1135 = !DILocation(line: 242, column: 26, scope: !913)
!1136 = !DILocation(line: 242, column: 18, scope: !913)
!1137 = !DILocation(line: 243, column: 15, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !913, file: !195, line: 243, column: 9)
!1139 = !DILocation(line: 243, column: 9, scope: !913)
!1140 = !DILocation(line: 245, column: 9, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1138, file: !195, line: 244, column: 5)
!1142 = !DILocation(line: 246, column: 21, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1141, file: !195, line: 246, column: 13)
!1144 = !DILocation(line: 246, column: 13, scope: !1141)
!1145 = !DILocation(line: 247, column: 13, scope: !1143)
!1146 = !DILocation(line: 251, column: 29, scope: !913)
!1147 = !DILocation(line: 251, column: 5, scope: !913)
!1148 = !DILocation(line: 253, column: 12, scope: !913)
!1149 = !DILocation(line: 253, column: 25, scope: !913)
!1150 = !{!1151, !856, i64 8}
!1151 = !{!"demux_sys_t", !856, i64 0, !856, i64 8, !967, i64 16, !967, i64 20, !1152, i64 24, !856, i64 32, !857, i64 40, !1152, i64 80, !967, i64 88, !1153, i64 92, !1153, i64 94, !857, i64 96, !968, i64 97, !968, i64 98}
!1152 = !{!"long", !857, i64 0}
!1153 = !{!"short", !857, i64 0}
!1154 = !DILocation(line: 255, column: 12, scope: !913)
!1155 = !DILocation(line: 255, column: 25, scope: !913)
!1156 = !{!1151, !967, i64 16}
!1157 = !DILocation(line: 256, column: 12, scope: !913)
!1158 = !DILocation(line: 256, column: 25, scope: !913)
!1159 = !{!1151, !967, i64 20}
!1160 = !DILocation(line: 460, column: 55, scope: !1080, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 257, column: 27, scope: !913)
!1162 = !DILocation(line: 460, column: 74, scope: !1080, inlinedAt: !1161)
!1163 = !DILocation(line: 462, column: 5, scope: !1080, inlinedAt: !1161)
!1164 = !DILocation(line: 294, column: 49, scope: !1091, inlinedAt: !1165)
!1165 = distinct !DILocation(line: 463, column: 12, scope: !1080, inlinedAt: !1161)
!1166 = !DILocation(line: 294, column: 68, scope: !1091, inlinedAt: !1165)
!1167 = !DILocation(line: 296, column: 5, scope: !1091, inlinedAt: !1165)
!1168 = !DILocation(line: 296, column: 17, scope: !1091, inlinedAt: !1165)
!1169 = !DILocation(line: 297, column: 10, scope: !1101, inlinedAt: !1165)
!1170 = !DILocation(line: 297, column: 9, scope: !1091, inlinedAt: !1165)
!1171 = !DILocation(line: 301, column: 1, scope: !1091, inlinedAt: !1165)
!1172 = !DILocation(line: 257, column: 12, scope: !913)
!1173 = !DILocation(line: 257, column: 25, scope: !913)
!1174 = !{!1151, !967, i64 88}
!1175 = !DILocation(line: 460, column: 55, scope: !1080, inlinedAt: !1176)
!1176 = distinct !DILocation(line: 258, column: 27, scope: !913)
!1177 = !DILocation(line: 460, column: 74, scope: !1080, inlinedAt: !1176)
!1178 = !DILocation(line: 462, column: 5, scope: !1080, inlinedAt: !1176)
!1179 = !DILocation(line: 294, column: 49, scope: !1091, inlinedAt: !1180)
!1180 = distinct !DILocation(line: 463, column: 12, scope: !1080, inlinedAt: !1176)
!1181 = !DILocation(line: 294, column: 68, scope: !1091, inlinedAt: !1180)
!1182 = !DILocation(line: 296, column: 5, scope: !1091, inlinedAt: !1180)
!1183 = !DILocation(line: 296, column: 17, scope: !1091, inlinedAt: !1180)
!1184 = !DILocation(line: 297, column: 10, scope: !1101, inlinedAt: !1180)
!1185 = !DILocation(line: 297, column: 9, scope: !1091, inlinedAt: !1180)
!1186 = !DILocation(line: 301, column: 1, scope: !1091, inlinedAt: !1180)
!1187 = !DILocation(line: 258, column: 27, scope: !913)
!1188 = !DILocation(line: 258, column: 12, scope: !913)
!1189 = !DILocation(line: 258, column: 25, scope: !913)
!1190 = !{!1151, !857, i64 96}
!1191 = !DILocation(line: 460, column: 55, scope: !1080, inlinedAt: !1192)
!1192 = distinct !DILocation(line: 259, column: 27, scope: !913)
!1193 = !DILocation(line: 460, column: 74, scope: !1080, inlinedAt: !1192)
!1194 = !DILocation(line: 462, column: 5, scope: !1080, inlinedAt: !1192)
!1195 = !DILocation(line: 294, column: 49, scope: !1091, inlinedAt: !1196)
!1196 = distinct !DILocation(line: 463, column: 12, scope: !1080, inlinedAt: !1192)
!1197 = !DILocation(line: 294, column: 68, scope: !1091, inlinedAt: !1196)
!1198 = !DILocation(line: 296, column: 5, scope: !1091, inlinedAt: !1196)
!1199 = !DILocation(line: 296, column: 17, scope: !1091, inlinedAt: !1196)
!1200 = !DILocation(line: 297, column: 10, scope: !1101, inlinedAt: !1196)
!1201 = !DILocation(line: 297, column: 9, scope: !1091, inlinedAt: !1196)
!1202 = !DILocation(line: 301, column: 1, scope: !1091, inlinedAt: !1196)
!1203 = !DILocation(line: 259, column: 27, scope: !913)
!1204 = !DILocation(line: 260, column: 25, scope: !913)
!1205 = !DILocation(line: 259, column: 12, scope: !913)
!1206 = !DILocation(line: 259, column: 25, scope: !913)
!1207 = !{!1151, !1152, i64 80}
!1208 = !DILocation(line: 460, column: 55, scope: !1080, inlinedAt: !1209)
!1209 = distinct !DILocation(line: 261, column: 27, scope: !913)
!1210 = !DILocation(line: 460, column: 74, scope: !1080, inlinedAt: !1209)
!1211 = !DILocation(line: 462, column: 5, scope: !1080, inlinedAt: !1209)
!1212 = !DILocation(line: 294, column: 49, scope: !1091, inlinedAt: !1213)
!1213 = distinct !DILocation(line: 463, column: 12, scope: !1080, inlinedAt: !1209)
!1214 = !DILocation(line: 294, column: 68, scope: !1091, inlinedAt: !1213)
!1215 = !DILocation(line: 296, column: 5, scope: !1091, inlinedAt: !1213)
!1216 = !DILocation(line: 296, column: 17, scope: !1091, inlinedAt: !1213)
!1217 = !DILocation(line: 297, column: 10, scope: !1101, inlinedAt: !1213)
!1218 = !DILocation(line: 297, column: 9, scope: !1091, inlinedAt: !1213)
!1219 = !DILocation(line: 301, column: 1, scope: !1091, inlinedAt: !1213)
!1220 = !DILocation(line: 261, column: 27, scope: !913)
!1221 = !DILocation(line: 261, column: 12, scope: !913)
!1222 = !DILocation(line: 261, column: 25, scope: !913)
!1223 = !{!1151, !1153, i64 92}
!1224 = !DILocation(line: 460, column: 55, scope: !1080, inlinedAt: !1225)
!1225 = distinct !DILocation(line: 262, column: 27, scope: !913)
!1226 = !DILocation(line: 460, column: 74, scope: !1080, inlinedAt: !1225)
!1227 = !DILocation(line: 462, column: 5, scope: !1080, inlinedAt: !1225)
!1228 = !DILocation(line: 294, column: 49, scope: !1091, inlinedAt: !1229)
!1229 = distinct !DILocation(line: 463, column: 12, scope: !1080, inlinedAt: !1225)
!1230 = !DILocation(line: 294, column: 68, scope: !1091, inlinedAt: !1229)
!1231 = !DILocation(line: 296, column: 5, scope: !1091, inlinedAt: !1229)
!1232 = !DILocation(line: 296, column: 17, scope: !1091, inlinedAt: !1229)
!1233 = !DILocation(line: 297, column: 10, scope: !1101, inlinedAt: !1229)
!1234 = !DILocation(line: 297, column: 9, scope: !1091, inlinedAt: !1229)
!1235 = !DILocation(line: 301, column: 1, scope: !1091, inlinedAt: !1229)
!1236 = !DILocation(line: 262, column: 27, scope: !913)
!1237 = !DILocation(line: 262, column: 12, scope: !913)
!1238 = !DILocation(line: 262, column: 25, scope: !913)
!1239 = !{!1151, !1153, i64 94}
!1240 = !DILocation(line: 263, column: 31, scope: !913)
!1241 = !DILocation(line: 263, column: 12, scope: !913)
!1242 = !DILocation(line: 263, column: 25, scope: !913)
!1243 = !{!1151, !968, i64 97}
!1244 = !DILocation(line: 265, column: 12, scope: !913)
!1245 = !DILocation(line: 265, column: 23, scope: !913)
!1246 = !{!966, !856, i64 88}
!1247 = !DILocation(line: 266, column: 12, scope: !913)
!1248 = !DILocation(line: 266, column: 23, scope: !913)
!1249 = !{!966, !856, i64 96}
!1250 = !DILocation(line: 267, column: 23, scope: !913)
!1251 = !{!966, !856, i64 120}
!1252 = !DILocation(line: 269, column: 22, scope: !913)
!1253 = !DILocation(line: 269, column: 12, scope: !913)
!1254 = !DILocation(line: 269, column: 20, scope: !913)
!1255 = !{!1151, !856, i64 0}
!1256 = !DILocation(line: 270, column: 24, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !913, file: !195, line: 270, column: 9)
!1258 = !DILocation(line: 270, column: 9, scope: !913)
!1259 = !DILocalVariable(name: "p_obj", arg: 1, scope: !1260, file: !1081, line: 520, type: !323)
!1260 = distinct !DISubprogram(name: "var_CreateGetNonEmptyString", scope: !1081, file: !1081, line: 520, type: !1261, scopeLine: 522, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1263)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!330, !323, !315}
!1263 = !{!1259, !1264}
!1264 = !DILocalVariable(name: "psz_name", arg: 2, scope: !1260, file: !1081, line: 521, type: !315)
!1265 = !DILocation(line: 520, column: 64, scope: !1260, inlinedAt: !1266)
!1266 = distinct !DILocation(line: 274, column: 17, scope: !913)
!1267 = !DILocation(line: 521, column: 64, scope: !1260, inlinedAt: !1266)
!1268 = !DILocation(line: 523, column: 5, scope: !1260, inlinedAt: !1266)
!1269 = !DILocalVariable(name: "p_obj", arg: 1, scope: !1270, file: !1081, line: 384, type: !323)
!1270 = distinct !DISubprogram(name: "var_GetNonEmptyString", scope: !1081, file: !1081, line: 384, type: !1261, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1271)
!1271 = !{!1269, !1272, !1273}
!1272 = !DILocalVariable(name: "psz_name", arg: 2, scope: !1270, file: !1081, line: 384, type: !315)
!1273 = !DILocalVariable(name: "val", scope: !1270, file: !1081, line: 386, type: !353)
!1274 = !DILocation(line: 384, column: 58, scope: !1270, inlinedAt: !1275)
!1275 = distinct !DILocation(line: 524, column: 12, scope: !1260, inlinedAt: !1266)
!1276 = !DILocation(line: 384, column: 77, scope: !1270, inlinedAt: !1275)
!1277 = !DILocation(line: 386, column: 5, scope: !1270, inlinedAt: !1275)
!1278 = !DILocation(line: 386, column: 17, scope: !1270, inlinedAt: !1275)
!1279 = !DILocation(line: 387, column: 9, scope: !1280, inlinedAt: !1275)
!1280 = distinct !DILexicalBlock(scope: !1270, file: !1081, line: 387, column: 9)
!1281 = !DILocation(line: 387, column: 9, scope: !1270, inlinedAt: !1275)
!1282 = !DILocation(line: 389, column: 13, scope: !1283, inlinedAt: !1275)
!1283 = distinct !DILexicalBlock(scope: !1270, file: !1081, line: 389, column: 9)
!1284 = !DILocation(line: 389, column: 9, scope: !1283, inlinedAt: !1275)
!1285 = !DILocation(line: 389, column: 24, scope: !1283, inlinedAt: !1275)
!1286 = !DILocation(line: 389, column: 27, scope: !1283, inlinedAt: !1275)
!1287 = !DILocation(line: 389, column: 9, scope: !1270, inlinedAt: !1275)
!1288 = !DILocation(line: 391, column: 5, scope: !1270, inlinedAt: !1275)
!1289 = !DILocation(line: 392, column: 5, scope: !1270, inlinedAt: !1275)
!1290 = !DILocation(line: 393, column: 1, scope: !1270, inlinedAt: !1275)
!1291 = !DILocation(line: 274, column: 11, scope: !913)
!1292 = !DILocation(line: 275, column: 9, scope: !913)
!1293 = !DILocation(line: 277, column: 23, scope: !959)
!1294 = !DILocation(line: 277, column: 21, scope: !959)
!1295 = !DILocation(line: 279, column: 25, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !959, file: !195, line: 279, column: 13)
!1297 = !DILocation(line: 279, column: 13, scope: !959)
!1298 = !DILocation(line: 281, column: 13, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1296, file: !195, line: 280, column: 9)
!1300 = !DILocation(line: 282, column: 13, scope: !1299)
!1301 = !DILocation(line: 520, column: 64, scope: !1260, inlinedAt: !1302)
!1302 = distinct !DILocation(line: 285, column: 22, scope: !959)
!1303 = !DILocation(line: 521, column: 64, scope: !1260, inlinedAt: !1302)
!1304 = !DILocation(line: 523, column: 5, scope: !1260, inlinedAt: !1302)
!1305 = !DILocation(line: 384, column: 58, scope: !1270, inlinedAt: !1306)
!1306 = distinct !DILocation(line: 524, column: 12, scope: !1260, inlinedAt: !1302)
!1307 = !DILocation(line: 384, column: 77, scope: !1270, inlinedAt: !1306)
!1308 = !DILocation(line: 386, column: 5, scope: !1270, inlinedAt: !1306)
!1309 = !DILocation(line: 386, column: 17, scope: !1270, inlinedAt: !1306)
!1310 = !DILocation(line: 387, column: 9, scope: !1280, inlinedAt: !1306)
!1311 = !DILocation(line: 387, column: 9, scope: !1270, inlinedAt: !1306)
!1312 = !DILocation(line: 389, column: 13, scope: !1283, inlinedAt: !1306)
!1313 = !DILocation(line: 389, column: 9, scope: !1283, inlinedAt: !1306)
!1314 = !DILocation(line: 389, column: 24, scope: !1283, inlinedAt: !1306)
!1315 = !DILocation(line: 389, column: 27, scope: !1283, inlinedAt: !1306)
!1316 = !DILocation(line: 389, column: 9, scope: !1270, inlinedAt: !1306)
!1317 = !DILocation(line: 391, column: 5, scope: !1270, inlinedAt: !1306)
!1318 = !DILocation(line: 392, column: 5, scope: !1270, inlinedAt: !1306)
!1319 = !DILocation(line: 0, scope: !1270, inlinedAt: !1306)
!1320 = !DILocation(line: 393, column: 1, scope: !1270, inlinedAt: !1306)
!1321 = !DILocation(line: 285, column: 15, scope: !959)
!1322 = !DILocation(line: 286, column: 43, scope: !959)
!1323 = !DILocation(line: 286, column: 54, scope: !959)
!1324 = !DILocation(line: 286, column: 17, scope: !959)
!1325 = !DILocation(line: 286, column: 9, scope: !959)
!1326 = !DILocation(line: 286, column: 15, scope: !959)
!1327 = !{!967, !967, i64 0}
!1328 = !DILocation(line: 287, column: 9, scope: !959)
!1329 = !DILocation(line: 288, column: 9, scope: !959)
!1330 = !DILocation(line: 289, column: 13, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !959, file: !195, line: 289, column: 13)
!1332 = !DILocation(line: 289, column: 13, scope: !959)
!1333 = !DILocation(line: 291, column: 13, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1331, file: !195, line: 290, column: 9)
!1335 = !DILocation(line: 297, column: 28, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !913, file: !195, line: 297, column: 9)
!1337 = !DILocation(line: 297, column: 48, scope: !1336)
!1338 = !DILocation(line: 297, column: 9, scope: !1336)
!1339 = !DILocation(line: 297, column: 9, scope: !913)
!1340 = !DILocation(line: 300, column: 12, scope: !913)
!1341 = !DILocation(line: 300, column: 25, scope: !913)
!1342 = !{!1151, !968, i64 98}
!1343 = !DILocation(line: 301, column: 5, scope: !913)
!1344 = !DILocation(line: 304, column: 5, scope: !913)
!1345 = !DILocation(line: 305, column: 5, scope: !913)
!1346 = !DILocation(line: 306, column: 1, scope: !913)
!1347 = distinct !DISubprogram(name: "Close", scope: !195, file: !195, line: 312, type: !1348, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1350)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{null, !323}
!1350 = !{!1351, !1352, !1353}
!1351 = !DILocalVariable(name: "obj", arg: 1, scope: !1347, file: !195, line: 312, type: !323)
!1352 = !DILocalVariable(name: "demux", scope: !1347, file: !195, line: 314, type: !398)
!1353 = !DILocalVariable(name: "p_sys", scope: !1347, file: !195, line: 315, type: !654)
!1354 = !DILocation(line: 312, column: 34, scope: !1347)
!1355 = !DILocation(line: 314, column: 22, scope: !1347)
!1356 = !DILocation(line: 314, column: 14, scope: !1347)
!1357 = !DILocation(line: 315, column: 33, scope: !1347)
!1358 = !DILocation(line: 315, column: 18, scope: !1347)
!1359 = !DILocation(line: 317, column: 16, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1347, file: !195, line: 317, column: 9)
!1361 = !{i8 0, i8 2}
!1362 = !DILocation(line: 317, column: 9, scope: !1347)
!1363 = !DILocation(line: 319, column: 28, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1360, file: !195, line: 318, column: 5)
!1365 = !{!1151, !1152, i64 24}
!1366 = !DILocation(line: 319, column: 9, scope: !1364)
!1367 = !DILocation(line: 320, column: 26, scope: !1364)
!1368 = !DILocation(line: 320, column: 9, scope: !1364)
!1369 = !DILocation(line: 321, column: 5, scope: !1364)
