; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._html_code = type { i16, i8*, i8 }
%struct._tag_spec = type { i16, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [6 x i8] c"&amp;\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"&quot;\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"&#%d;\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"\22\0A\00", align 1
@html_codes = internal global [2 x %struct._html_code] [%struct._html_code { i16 5, i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str, i32 0, i32 0), i8 38 }, %struct._html_code { i16 6, i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str.1, i32 0, i32 0), i8 34 }], align 16, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "html_codes", scope: !2, file: !3, line: 136, type: !107, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !87, nameTableKind: None)
!3 = !DIFile(filename: "iptcutil.c", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/contrib/iptcutil")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !26, !25, !27, !28, !7, !29, !30}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !34, line: 241, size: 1728, elements: !35)
!34 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !56, !57, !58, !59, !62, !63, !65, !69, !72, !74, !75, !76, !77, !78, !82, !83}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !33, file: !34, line: 242, baseType: !22, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !33, file: !34, line: 247, baseType: !24, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !33, file: !34, line: 248, baseType: !24, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !33, file: !34, line: 249, baseType: !24, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !33, file: !34, line: 250, baseType: !24, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !33, file: !34, line: 251, baseType: !24, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !33, file: !34, line: 252, baseType: !24, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !33, file: !34, line: 253, baseType: !24, size: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !33, file: !34, line: 254, baseType: !24, size: 64, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !33, file: !34, line: 256, baseType: !24, size: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !33, file: !34, line: 257, baseType: !24, size: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !33, file: !34, line: 258, baseType: !24, size: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !33, file: !34, line: 260, baseType: !49, size: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !34, line: 156, size: 192, elements: !51)
!51 = !{!52, !53, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !50, file: !34, line: 157, baseType: !49, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !50, file: !34, line: 158, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !50, file: !34, line: 162, baseType: !22, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !33, file: !34, line: 262, baseType: !54, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !33, file: !34, line: 264, baseType: !22, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !33, file: !34, line: 268, baseType: !22, size: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !33, file: !34, line: 270, baseType: !60, size: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 131, baseType: !28)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !33, file: !34, line: 274, baseType: !23, size: 16, offset: 1024)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !33, file: !34, line: 275, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !33, file: !34, line: 276, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !33, file: !34, line: 280, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !34, line: 150, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !33, file: !34, line: 289, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 132, baseType: !28)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !33, file: !34, line: 297, baseType: !26, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !33, file: !34, line: 298, baseType: !26, size: 64, offset: 1280)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !33, file: !34, line: 299, baseType: !26, size: 64, offset: 1344)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !33, file: !34, line: 300, baseType: !26, size: 64, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !33, file: !34, line: 302, baseType: !79, size: 64, offset: 1472)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 62, baseType: !81)
!80 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!81 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !33, file: !34, line: 303, baseType: !22, size: 32, offset: 1536)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !33, file: !34, line: 305, baseType: !84, size: 160, offset: 1568)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 20)
!87 = !{!88, !90, !92, !94, !0, !96}
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "_p_state", scope: !2, file: !3, line: 764, type: !22, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "_p_flag", scope: !2, file: !3, line: 765, type: !7, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "_p_curquote", scope: !2, file: !3, line: 766, type: !25, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "_p_tokpos", scope: !2, file: !3, line: 767, type: !22, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "tags", scope: !2, file: !3, line: 37, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 6656, elements: !105)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "tag_spec", file: !3, line: 35, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag_spec", file: !3, line: 28, size: 128, elements: !101)
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !100, file: !3, line: 31, baseType: !103, size: 16)
!103 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !3, line: 34, baseType: !24, size: 64, offset: 64)
!105 = !{!106}
!106 = !DISubrange(count: 52)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 384, elements: !116)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "html_code", file: !3, line: 134, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_html_code", file: !3, line: 127, size: 192, elements: !110)
!110 = !{!111, !112, !115}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !109, file: !3, line: 130, baseType: !103, size: 16)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !109, file: !3, line: 132, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !109, file: !3, line: 133, baseType: !114, size: 8, offset: 128)
!116 = !{!117}
!117 = !DISubrange(count: 2)
!118 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!119 = !{i32 2, !"Dwarf Version", i32 4}
!120 = !{i32 2, !"Debug Info Version", i32 3}
!121 = !{i32 1, !"wchar_size", i32 4}
!122 = !{i32 7, !"PIC Level", i32 2}
!123 = !{i32 1, !"ThinLTO", i32 0}
!124 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!125 = distinct !DISubprogram(name: "formatString", scope: !3, file: !3, line: 96, type: !126, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !128)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !30, !113, !22}
!128 = !{}
!129 = !DILocalVariable(name: "ofile", arg: 1, scope: !125, file: !3, line: 96, type: !30)
!130 = !DILocation(line: 96, column: 25, scope: !125)
!131 = !DILocalVariable(name: "s", arg: 2, scope: !125, file: !3, line: 96, type: !113)
!132 = !DILocation(line: 96, column: 44, scope: !125)
!133 = !DILocalVariable(name: "len", arg: 3, scope: !125, file: !3, line: 96, type: !22)
!134 = !DILocation(line: 96, column: 51, scope: !125)
!135 = !DILocation(line: 98, column: 3, scope: !125)
!136 = !DILocation(line: 99, column: 3, scope: !125)
!137 = !DILocation(line: 99, column: 10, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !3, line: 99, column: 3)
!139 = distinct !DILexicalBlock(scope: !125, file: !3, line: 99, column: 3)
!140 = !DILocation(line: 99, column: 14, scope: !138)
!141 = !DILocation(line: 99, column: 3, scope: !139)
!142 = !DILocalVariable(name: "c", scope: !143, file: !3, line: 100, type: !22)
!143 = distinct !DILexicalBlock(scope: !138, file: !3, line: 99, column: 31)
!144 = !DILocation(line: 100, column: 9, scope: !143)
!145 = !DILocation(line: 100, column: 14, scope: !143)
!146 = !DILocation(line: 100, column: 13, scope: !143)
!147 = !DILocation(line: 101, column: 13, scope: !143)
!148 = !DILocation(line: 101, column: 5, scope: !143)
!149 = !DILocation(line: 103, column: 22, scope: !150)
!150 = distinct !DILexicalBlock(scope: !143, file: !3, line: 101, column: 16)
!151 = !DILocation(line: 103, column: 7, scope: !150)
!152 = !DILocation(line: 104, column: 7, scope: !150)
!153 = !DILocation(line: 114, column: 23, scope: !150)
!154 = !DILocation(line: 114, column: 7, scope: !150)
!155 = !DILocation(line: 115, column: 7, scope: !150)
!156 = !DILocation(line: 117, column: 11, scope: !157)
!157 = distinct !DILexicalBlock(scope: !150, file: !3, line: 117, column: 11)
!158 = !DILocation(line: 117, column: 11, scope: !150)
!159 = !DILocation(line: 118, column: 17, scope: !157)
!160 = !DILocation(line: 118, column: 33, scope: !157)
!161 = !DILocation(line: 118, column: 9, scope: !157)
!162 = !DILocation(line: 120, column: 9, scope: !157)
!163 = !DILocation(line: 121, column: 7, scope: !150)
!164 = !DILocation(line: 123, column: 3, scope: !143)
!165 = !DILocation(line: 99, column: 19, scope: !138)
!166 = !DILocation(line: 99, column: 26, scope: !138)
!167 = !DILocation(line: 99, column: 3, scope: !138)
!168 = distinct !{!168, !141, !169}
!169 = !DILocation(line: 123, column: 3, scope: !139)
!170 = !DILocation(line: 124, column: 17, scope: !125)
!171 = !DILocation(line: 124, column: 3, scope: !125)
!172 = !DILocation(line: 125, column: 1, scope: !125)
!173 = distinct !DISubprogram(name: "convertHTMLcodes", scope: !3, file: !3, line: 150, type: !174, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !128)
!174 = !DISubroutineType(types: !175)
!175 = !{!22, !24, !22}
!176 = !DILocalVariable(name: "s", arg: 1, scope: !173, file: !3, line: 150, type: !24)
!177 = !DILocation(line: 150, column: 28, scope: !173)
!178 = !DILocalVariable(name: "len", arg: 2, scope: !173, file: !3, line: 150, type: !22)
