; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.module_t = type opaque
%struct.module_config_t = type { i32, i8*, i8*, i8, i8*, i8*, %union.module_value_t, %union.module_value_t, %union.module_value_t, %union.module_nvalue_t, %union.module_nvalue_t, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i8*, i8**, i32*, i8**, i32, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)*, i32 (%struct.vlc_object_t*, i8*, i8*, i8*, i8*)**, i8**, i32, i8, i8, i8, i8, i8*, i8, i8, i8, i8 }
%union.module_value_t = type { i8* }
%union.module_nvalue_t = type { i32 }
%struct.vlc_object_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t* }
%struct.libvlc_int_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, %struct.hotkey* }
%struct.hotkey = type opaque
%struct.stream_t = type { i8*, i8*, i32, i8, i8, %struct.libvlc_int_t*, %struct.vlc_object_t*, i8, %struct.module_t*, i8*, %struct.stream_t*, i32 (%struct.stream_t*, i8*, i32)*, i32 (%struct.stream_t*, i8**, i32)*, i32 (%struct.stream_t*, i32, %struct.__va_list_tag*)*, void (%struct.stream_t*)*, %struct.stream_sys_t*, %struct.stream_text_t*, %struct.input_thread_t* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stream_sys_t = type { i8*, %struct.zlib_filefunc_def_s*, i8*, i8*, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "p_zip_marker", scope: !2, file: !3, line: 163, type: !251, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !247, nameTableKind: None)
!3 = !DIFile(filename: "zipstream.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!4 = !{!5, !39}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vlc_module_properties", file: !6, line: 37, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../include/vlc_plugin.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!9 = !DIEnumerator(name: "VLC_SUBMODULE_CREATE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "VLC_CONFIG_CREATE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "VLC_MODULE_CPU_REQUIREMENT", value: 256, isUnsigned: true)
!12 = !DIEnumerator(name: "VLC_MODULE_SHORTCUT", value: 257, isUnsigned: true)
!13 = !DIEnumerator(name: "VLC_MODULE_CAPABILITY", value: 258, isUnsigned: true)
!14 = !DIEnumerator(name: "VLC_MODULE_SCORE", value: 259, isUnsigned: true)
!15 = !DIEnumerator(name: "VLC_MODULE_CB_OPEN", value: 260, isUnsigned: true)
!16 = !DIEnumerator(name: "VLC_MODULE_CB_CLOSE", value: 261, isUnsigned: true)
!17 = !DIEnumerator(name: "VLC_MODULE_NO_UNLOAD", value: 262, isUnsigned: true)
!18 = !DIEnumerator(name: "VLC_MODULE_NAME", value: 263, isUnsigned: true)
!19 = !DIEnumerator(name: "VLC_MODULE_SHORTNAME", value: 264, isUnsigned: true)
!20 = !DIEnumerator(name: "VLC_MODULE_DESCRIPTION", value: 265, isUnsigned: true)
!21 = !DIEnumerator(name: "VLC_MODULE_HELP", value: 266, isUnsigned: true)
!22 = !DIEnumerator(name: "VLC_MODULE_TEXTDOMAIN", value: 267, isUnsigned: true)
!23 = !DIEnumerator(name: "VLC_CONFIG_NAME", value: 4096, isUnsigned: true)
!24 = !DIEnumerator(name: "VLC_CONFIG_VALUE", value: 4097, isUnsigned: true)
!25 = !DIEnumerator(name: "VLC_CONFIG_RANGE", value: 4098, isUnsigned: true)
!26 = !DIEnumerator(name: "VLC_CONFIG_ADVANCED", value: 4099, isUnsigned: true)
!27 = !DIEnumerator(name: "VLC_CONFIG_VOLATILE", value: 4100, isUnsigned: true)
!28 = !DIEnumerator(name: "VLC_CONFIG_PERSISTENT", value: 4101, isUnsigned: true)
!29 = !DIEnumerator(name: "VLC_CONFIG_RESTART", value: 4102, isUnsigned: true)
!30 = !DIEnumerator(name: "VLC_CONFIG_PRIVATE", value: 4103, isUnsigned: true)
!31 = !DIEnumerator(name: "VLC_CONFIG_REMOVED", value: 4104, isUnsigned: true)
!32 = !DIEnumerator(name: "VLC_CONFIG_CAPABILITY", value: 4105, isUnsigned: true)
!33 = !DIEnumerator(name: "VLC_CONFIG_SHORTCUT", value: 4106, isUnsigned: true)
!34 = !DIEnumerator(name: "VLC_CONFIG_OLDNAME", value: 4107, isUnsigned: true)
!35 = !DIEnumerator(name: "VLC_CONFIG_SAFE", value: 4108, isUnsigned: true)
!36 = !DIEnumerator(name: "VLC_CONFIG_DESC", value: 4109, isUnsigned: true)
!37 = !DIEnumerator(name: "VLC_CONFIG_LIST", value: 4110, isUnsigned: true)
!38 = !DIEnumerator(name: "VLC_CONFIG_ADD_ACTION", value: 4111, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stream_query_e", file: !40, line: 87, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "../../../include/vlc_stream.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50}
!42 = !DIEnumerator(name: "STREAM_CAN_SEEK", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "STREAM_CAN_FASTSEEK", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "STREAM_SET_POSITION", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "STREAM_GET_POSITION", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "STREAM_GET_SIZE", value: 4, isUnsigned: true)
!47 = !DIEnumerator(name: "STREAM_CONTROL_ACCESS", value: 5, isUnsigned: true)
!48 = !DIEnumerator(name: "STREAM_UPDATE_SIZE", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "STREAM_GET_CONTENT_TYPE", value: 7, isUnsigned: true)
!50 = !DIEnumerator(name: "STREAM_SET_RECORD_STATE", value: 8, isUnsigned: true)
!51 = !{!52, !55, !56, !147, !110, !82, !222, !229, !63, !230, !236, !244, !194, !164, !177, !245}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_t", file: !58, line: 222, baseType: !59)
!58 = !DIFile(filename: "../../../include/vlc_common.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream_t", file: !40, line: 52, size: 1024, elements: !60)
!60 = !{!61, !62, !64, !65, !68, !69, !98, !99, !100, !104, !105, !106, !111, !121, !132, !136, !197, !201}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !59, file: !40, line: 54, baseType: !52, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !59, file: !40, line: 54, baseType: !63, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !59, file: !40, line: 54, baseType: !55, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !59, file: !40, line: 54, baseType: !66, size: 8, offset: 160)
!66 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!67 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !59, file: !40, line: 54, baseType: !67, size: 8, offset: 168)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !59, file: !40, line: 54, baseType: !70, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !58, line: 178, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !73, line: 38, size: 384, elements: !74)
!73 = !DIFile(filename: "../../../include/vlc_main.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!74 = !{!75, !76, !77, !78, !79, !80, !81, !94}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !72, file: !73, line: 40, baseType: !52, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !72, file: !73, line: 40, baseType: !63, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !72, file: !73, line: 40, baseType: !55, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !72, file: !73, line: 40, baseType: !66, size: 8, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !72, file: !73, line: 40, baseType: !67, size: 8, offset: 168)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !72, file: !73, line: 40, baseType: !70, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !72, file: !73, line: 40, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !58, line: 177, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !85, line: 60, size: 320, elements: !86)
!85 = !DIFile(filename: "../../../include/vlc_objects.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!86 = !{!87, !88, !89, !90, !91, !92, !93}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !84, file: !85, line: 62, baseType: !52, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !84, file: !85, line: 62, baseType: !63, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !84, file: !85, line: 62, baseType: !55, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !84, file: !85, line: 62, baseType: !66, size: 8, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !84, file: !85, line: 62, baseType: !67, size: 8, offset: 168)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !84, file: !85, line: 62, baseType: !70, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !84, file: !85, line: 62, baseType: !82, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !72, file: !73, line: 43, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "hotkey", file: !73, line: 31, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !59, file: !40, line: 54, baseType: !82, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !59, file: !40, line: 55, baseType: !67, size: 8, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !59, file: !40, line: 58, baseType: !101, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_t", file: !58, line: 208, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_t", file: !58, line: 208, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !59, file: !40, line: 61, baseType: !63, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "p_source", scope: !59, file: !40, line: 64, baseType: !56, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !59, file: !40, line: 67, baseType: !107, size: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!55, !56, !110, !7}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peek", scope: !59, file: !40, line: 68, baseType: !112, size: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!55, !56, !115, !7}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !119, line: 48, baseType: !120)
!119 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!120 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !59, file: !40, line: 69, baseType: !122, size: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!55, !56, !55, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 172, size: 192, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !126, file: !3, line: 172, baseType: !7, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !126, file: !3, line: 172, baseType: !7, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !126, file: !3, line: 172, baseType: !110, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !126, file: !3, line: 172, baseType: !110, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destroy", scope: !59, file: !40, line: 72, baseType: !133, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !56}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !59, file: !40, line: 75, baseType: !137, size: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_sys_t", file: !58, line: 223, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream_sys_t", file: !3, line: 82, size: 384, elements: !140)
!140 = !{!141, !146, !191, !192, !193, !196}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "zipFile", scope: !139, file: !3, line: 85, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "unzFile", file: !143, line: 66, baseType: !144)
!143 = !DIFile(filename: "../../../libs/unzip/unzip.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidp", file: !145, line: 387, baseType: !110)
!145 = !DIFile(filename: "/usr/include/zconf.h", directory: "")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fileFunctions", scope: !139, file: !3, line: 86, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc_def", file: !149, line: 56, baseType: !150)
!149 = !DIFile(filename: "../../../libs/unzip/ioapi.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc_def_s", file: !149, line: 46, size: 512, elements: !151)
!151 = !{!152, !158, !165, !172, !178, !183, !188, !190}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "zopen_file", scope: !150, file: !149, line: 48, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "open_file_func", file: !149, line: 38, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !157, !52, !55}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !145, line: 386, baseType: !110)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "zread_file", scope: !150, file: !149, line: 49, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "read_file_func", file: !149, line: 39, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !157, !157, !110, !163}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !145, line: 371, baseType: !164)
!164 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "zwrite_file", scope: !150, file: !149, line: 50, baseType: !166, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "write_file_func", file: !149, line: 40, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!163, !157, !157, !170, !163}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ztell_file", scope: !150, file: !149, line: 51, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "tell_file_func", file: !149, line: 41, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !157, !157}
!177 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "zseek_file", scope: !150, file: !149, line: 52, baseType: !179, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "seek_file_func", file: !149, line: 42, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!177, !157, !157, !163, !55}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "zclose_file", scope: !150, file: !149, line: 53, baseType: !184, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "close_file_func", file: !149, line: 43, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!55, !157, !157}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "zerror_file", scope: !150, file: !149, line: 54, baseType: !189, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "testerror_file_func", file: !149, line: 44, baseType: !185)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !150, file: !149, line: 55, baseType: !157, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !139, file: !3, line: 87, baseType: !63, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "psz_xspf", scope: !139, file: !3, line: 90, baseType: !63, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_len", scope: !139, file: !3, line: 91, baseType: !194, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 62, baseType: !164)
!195 = !DIFile(filename: "llvm80/build/lib/clang/8.0.1/include/stddef.h", directory: "/root/llvm")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_pos", scope: !139, file: !3, line: 92, baseType: !194, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "p_text", scope: !59, file: !40, line: 78, baseType: !198, size: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_text_t", file: !40, line: 46, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "stream_text_t", file: !40, line: 46, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !59, file: !40, line: 81, baseType: !202, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_t", file: !58, line: 216, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_t", file: !205, line: 266, size: 448, elements: !206)
!205 = !DIFile(filename: "../../../include/vlc_input.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !204, file: !205, line: 268, baseType: !52, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !204, file: !205, line: 268, baseType: !63, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !204, file: !205, line: 268, baseType: !55, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !204, file: !205, line: 268, baseType: !66, size: 8, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !204, file: !205, line: 268, baseType: !67, size: 8, offset: 168)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !204, file: !205, line: 268, baseType: !70, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !204, file: !205, line: 268, baseType: !82, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !204, file: !205, line: 270, baseType: !67, size: 8, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !204, file: !205, line: 271, baseType: !67, size: 8, offset: 328)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_preparsing", scope: !204, file: !205, line: 272, baseType: !67, size: 8, offset: 336)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_dead", scope: !204, file: !205, line: 273, baseType: !67, size: 8, offset: 344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !204, file: !205, line: 277, baseType: !219, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_private_t", file: !205, line: 254, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_private_t", file: !205, line: 254, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_array_t", file: !224, line: 306, baseType: !225)
!224 = !DIFile(filename: "../../../include/vlc_arrays.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_array_t", file: !224, line: 302, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !225, file: !224, line: 304, baseType: !55, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pp_elems", scope: !225, file: !224, line: 305, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !3, line: 67, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !3, line: 100, size: 256, elements: !233)
!233 = !{!234, !235, !242, !243}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !232, file: !3, line: 101, baseType: !63, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "media", scope: !232, file: !3, line: 102, baseType: !236, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !3, line: 68, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "item", file: !3, line: 95, size: 128, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !238, file: !3, line: 96, baseType: !55, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !3, line: 97, baseType: !236, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !232, file: !3, line: 103, baseType: !230, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !3, line: 104, baseType: !230, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !246, line: 197, baseType: !177)
!246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!247 = !{!248, !0}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!249 = distinct !DIGlobalVariable(name: "i_zip_marker", scope: !2, file: !3, line: 164, type: !250, isLocal: true, isDefinition: true)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 4)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !257, nameTableKind: None)
!255 = !DIFile(filename: "zipaccess.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!256 = !{!39}
!257 = !{!258, !280, !355, !361, !110, !63, !54, !378, !379, !380, !177, !245}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_t", file: !58, line: 220, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_t", file: !261, line: 74, size: 1280, elements: !262)
!261 = !DIFile(filename: "../../../include/vlc_access.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!262 = !{!263, !264, !265, !266, !267, !268, !292, !293, !294, !295, !296, !297, !304, !329, !334, !345, !354, !374}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !260, file: !261, line: 76, baseType: !52, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !260, file: !261, line: 76, baseType: !63, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !260, file: !261, line: 76, baseType: !55, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !260, file: !261, line: 76, baseType: !66, size: 8, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !260, file: !261, line: 76, baseType: !67, size: 8, offset: 168)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !260, file: !261, line: 76, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "libvlc_int_t", file: !58, line: 178, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libvlc_int_t", file: !73, line: 38, size: 384, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !291}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !271, file: !73, line: 40, baseType: !52, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !271, file: !73, line: 40, baseType: !63, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !271, file: !73, line: 40, baseType: !55, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !271, file: !73, line: 40, baseType: !66, size: 8, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !271, file: !73, line: 40, baseType: !67, size: 8, offset: 168)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !271, file: !73, line: 40, baseType: !269, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !271, file: !73, line: 40, baseType: !280, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_object_t", file: !58, line: 177, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_object_t", file: !85, line: 60, size: 320, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !282, file: !85, line: 62, baseType: !52, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !282, file: !85, line: 62, baseType: !63, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !282, file: !85, line: 62, baseType: !55, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !282, file: !85, line: 62, baseType: !66, size: 8, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !282, file: !85, line: 62, baseType: !67, size: 8, offset: 168)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !282, file: !85, line: 62, baseType: !269, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !282, file: !85, line: 62, baseType: !280, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "p_hotkeys", scope: !271, file: !73, line: 43, baseType: !95, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !260, file: !261, line: 76, baseType: !280, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !260, file: !261, line: 79, baseType: !101, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psz_access", scope: !260, file: !261, line: 82, baseType: !63, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !260, file: !261, line: 84, baseType: !63, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "psz_demux", scope: !260, file: !261, line: 89, baseType: !63, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !260, file: !261, line: 93, baseType: !298, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !258, !244, !194}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !246, line: 109, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !303, line: 172, baseType: !177)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pf_block", scope: !260, file: !261, line: 94, baseType: !305, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!308, !258}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_t", file: !58, line: 330, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_t", file: !311, line: 103, size: 576, elements: !312)
!311 = !DIFile(filename: "../../../include/vlc_block.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!312 = !{!313, !314, !316, !318, !319, !320, !321, !322, !323, !324}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !310, file: !311, line: 105, baseType: !308, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !310, file: !311, line: 107, baseType: !315, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !119, line: 51, baseType: !7)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !310, file: !311, line: 109, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtime_t", file: !58, line: 131, baseType: !245)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !310, file: !311, line: 110, baseType: !317, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_length", scope: !310, file: !311, line: 111, baseType: !317, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_nb_samples", scope: !310, file: !311, line: 113, baseType: !7, size: 32, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_rate", scope: !310, file: !311, line: 114, baseType: !55, size: 32, offset: 352)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_buffer", scope: !310, file: !311, line: 116, baseType: !194, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "p_buffer", scope: !310, file: !311, line: 117, baseType: !244, size: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pf_release", scope: !310, file: !311, line: 120, baseType: !325, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_free_t", file: !311, line: 101, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !308}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pf_seek", scope: !260, file: !261, line: 98, baseType: !330, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!55, !258, !333}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !119, line: 55, baseType: !164)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !260, file: !261, line: 102, baseType: !335, size: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!55, !258, !55, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !255, line: 101, size: 192, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !339, file: !255, line: 101, baseType: !7, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !339, file: !255, line: 101, baseType: !7, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !339, file: !255, line: 101, baseType: !110, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !339, file: !255, line: 101, baseType: !110, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !260, file: !261, line: 116, baseType: !346, size: 320, offset: 832)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !261, line: 105, size: 320, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_update", scope: !346, file: !261, line: 107, baseType: !7, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_size", scope: !346, file: !261, line: 110, baseType: !333, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_pos", scope: !346, file: !261, line: 111, baseType: !333, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_eof", scope: !346, file: !261, line: 112, baseType: !67, size: 8, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_title", scope: !346, file: !261, line: 114, baseType: !55, size: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_seekpoint", scope: !346, file: !261, line: 115, baseType: !55, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !260, file: !261, line: 117, baseType: !355, size: 64, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_sys_t", file: !58, line: 221, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "access_sys_t", file: !255, line: 40, size: 192, elements: !358)
!358 = !{!359, !360, !373}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "zipFile", scope: !357, file: !255, line: 43, baseType: !142, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fileFunctions", scope: !357, file: !255, line: 44, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc_def", file: !149, line: 56, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc_def_s", file: !149, line: 46, size: 512, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "zopen_file", scope: !363, file: !149, line: 48, baseType: !153, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "zread_file", scope: !363, file: !149, line: 49, baseType: !159, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "zwrite_file", scope: !363, file: !149, line: 50, baseType: !166, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ztell_file", scope: !363, file: !149, line: 51, baseType: !173, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "zseek_file", scope: !363, file: !149, line: 52, baseType: !179, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "zclose_file", scope: !363, file: !149, line: 53, baseType: !184, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "zerror_file", scope: !363, file: !149, line: 54, baseType: !189, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !363, file: !149, line: 55, baseType: !157, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "psz_fileInzip", scope: !357, file: !255, line: 47, baseType: !63, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !260, file: !261, line: 120, baseType: !375, size: 64, offset: 1216)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_thread_t", file: !58, line: 216, baseType: !377)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "input_thread_t", file: !58, line: 216, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_t", file: !58, line: 222, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream_t", file: !40, line: 52, size: 1024, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !399, !403, !407, !411, !415, !416}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "psz_object_type", scope: !382, file: !40, line: 54, baseType: !52, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "psz_header", scope: !382, file: !40, line: 54, baseType: !63, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !382, file: !40, line: 54, baseType: !55, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_die", scope: !382, file: !40, line: 54, baseType: !66, size: 8, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "b_force", scope: !382, file: !40, line: 54, baseType: !67, size: 8, offset: 168)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "p_libvlc", scope: !382, file: !40, line: 54, baseType: !269, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "p_parent", scope: !382, file: !40, line: 54, baseType: !280, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_error", scope: !382, file: !40, line: 55, baseType: !67, size: 8, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "p_module", scope: !382, file: !40, line: 58, baseType: !101, size: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "psz_path", scope: !382, file: !40, line: 61, baseType: !63, size: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "p_source", scope: !382, file: !40, line: 64, baseType: !380, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pf_read", scope: !382, file: !40, line: 67, baseType: !396, size: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!55, !380, !110, !7}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pf_peek", scope: !382, file: !40, line: 68, baseType: !400, size: 64, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!55, !380, !115, !7}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pf_control", scope: !382, file: !40, line: 69, baseType: !404, size: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!55, !380, !55, !338}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pf_destroy", scope: !382, file: !40, line: 72, baseType: !408, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !380}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "p_sys", scope: !382, file: !40, line: 75, baseType: !412, size: 64, offset: 832)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "stream_sys_t", file: !58, line: 223, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "stream_sys_t", file: !58, line: 223, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "p_text", scope: !382, file: !40, line: 78, baseType: !198, size: 64, offset: 896)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "p_input", scope: !382, file: !40, line: 81, baseType: !375, size: 64, offset: 960)
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !419, retainedTypes: !420, globals: !560, nameTableKind: None)
!418 = !DIFile(filename: "unzip.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/libs/unzip")
!419 = !{}
!420 = !{!110, !421, !556, !495, !63, !55, !521, !526, !157, !483, !506, !557, !559, !163, !7}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "unz_s", file: !418, line: 150, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 126, size: 2688, elements: !424)
!424 = !{!425, !445, !446, !453, !454, !455, !456, !457, !458, !459, !460, !489, !494, !548, !549, !553}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "z_filefunc", scope: !423, file: !418, line: 128, baseType: !426, size: 512)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc_def", file: !427, line: 56, baseType: !428)
!427 = !DIFile(filename: "./ioapi.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/libs/unzip")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc_def_s", file: !427, line: 46, size: 512, elements: !429)
!429 = !{!430, !432, !434, !436, !438, !440, !442, !444}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "zopen_file", scope: !428, file: !427, line: 48, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "open_file_func", file: !427, line: 38, baseType: !154)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "zread_file", scope: !428, file: !427, line: 49, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "read_file_func", file: !427, line: 39, baseType: !160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "zwrite_file", scope: !428, file: !427, line: 50, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "write_file_func", file: !427, line: 40, baseType: !167)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ztell_file", scope: !428, file: !427, line: 51, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "tell_file_func", file: !427, line: 41, baseType: !174)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "zseek_file", scope: !428, file: !427, line: 52, baseType: !439, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "seek_file_func", file: !427, line: 42, baseType: !180)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "zclose_file", scope: !428, file: !427, line: 53, baseType: !441, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "close_file_func", file: !427, line: 43, baseType: !185)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "zerror_file", scope: !428, file: !427, line: 54, baseType: !443, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "testerror_file_func", file: !427, line: 44, baseType: !185)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !428, file: !427, line: 55, baseType: !157, size: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "filestream", scope: !423, file: !418, line: 129, baseType: !157, size: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gi", scope: !423, file: !418, line: 130, baseType: !447, size: 128, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "unz_global_info", file: !448, line: 97, baseType: !449)
!448 = !DIFile(filename: "./unzip.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/libs/unzip")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unz_global_info_s", file: !448, line: 92, size: 128, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "number_entry", scope: !449, file: !448, line: 94, baseType: !163, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "size_comment", scope: !449, file: !448, line: 96, baseType: !163, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "byte_before_the_zipfile", scope: !423, file: !418, line: 131, baseType: !163, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "num_file", scope: !423, file: !418, line: 132, baseType: !163, size: 64, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pos_in_central_dir", scope: !423, file: !418, line: 133, baseType: !163, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "current_file_ok", scope: !423, file: !418, line: 134, baseType: !163, size: 64, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "central_pos", scope: !423, file: !418, line: 135, baseType: !163, size: 64, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "size_central_dir", scope: !423, file: !418, line: 137, baseType: !163, size: 64, offset: 1024)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "offset_central_dir", scope: !423, file: !418, line: 138, baseType: !163, size: 64, offset: 1088)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "cur_file_info", scope: !423, file: !418, line: 141, baseType: !461, size: 1088, offset: 1152)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "unz_file_info", file: !448, line: 120, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unz_file_info_s", file: !448, line: 101, size: 1088, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !462, file: !448, line: 103, baseType: !163, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "version_needed", scope: !462, file: !448, line: 104, baseType: !163, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !462, file: !448, line: 105, baseType: !163, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "compression_method", scope: !462, file: !448, line: 106, baseType: !163, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dosDate", scope: !462, file: !448, line: 107, baseType: !163, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !462, file: !448, line: 108, baseType: !163, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !462, file: !448, line: 109, baseType: !163, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !462, file: !448, line: 110, baseType: !163, size: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "size_filename", scope: !462, file: !448, line: 111, baseType: !163, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "size_file_extra", scope: !462, file: !448, line: 112, baseType: !163, size: 64, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "size_file_comment", scope: !462, file: !448, line: 113, baseType: !163, size: 64, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "disk_num_start", scope: !462, file: !448, line: 115, baseType: !163, size: 64, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "internal_fa", scope: !462, file: !448, line: 116, baseType: !163, size: 64, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "external_fa", scope: !462, file: !448, line: 117, baseType: !163, size: 64, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tmu_date", scope: !462, file: !448, line: 119, baseType: !479, size: 192, offset: 896)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "tm_unz", file: !448, line: 88, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_unz_s", file: !448, line: 80, size: 192, elements: !481)
!481 = !{!482, !484, !485, !486, !487, !488}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !480, file: !448, line: 82, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !145, line: 370, baseType: !7)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !480, file: !448, line: 83, baseType: !483, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !480, file: !448, line: 84, baseType: !483, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !480, file: !448, line: 85, baseType: !483, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !480, file: !448, line: 86, baseType: !483, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !480, file: !448, line: 87, baseType: !483, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cur_file_info_internal", scope: !423, file: !418, line: 142, baseType: !490, size: 64, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "unz_file_info_internal", file: !418, line: 95, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unz_file_info_internal_s", file: !418, line: 92, size: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "offset_curfile", scope: !491, file: !418, line: 94, baseType: !163, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pfile_in_zip_read", scope: !423, file: !418, line: 143, baseType: !495, size: 64, offset: 2304)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_in_zip_read_info_s", file: !418, line: 121, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 100, size: 2304, elements: !498)
!498 = !{!499, !500, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer", scope: !497, file: !418, line: 102, baseType: !63, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !497, file: !418, line: 103, baseType: !501, size: 896, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !502, line: 104, baseType: !503)
!502 = !DIFile(filename: "/usr/include/zlib.h", directory: "")
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !502, line: 85, size: 896, elements: !504)
!504 = !{!505, !509, !510, !511, !512, !513, !514, !515, !520, !525, !530, !531, !532, !533}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !503, file: !502, line: 86, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !145, line: 377, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !145, line: 368, baseType: !120)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !503, file: !502, line: 87, baseType: !483, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !503, file: !502, line: 88, baseType: !163, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !503, file: !502, line: 90, baseType: !506, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !503, file: !502, line: 91, baseType: !483, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !503, file: !502, line: 92, baseType: !163, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !503, file: !502, line: 94, baseType: !63, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !503, file: !502, line: 95, baseType: !516, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !502, line: 1742, size: 32, elements: !518)
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !517, file: !502, line: 1742, baseType: !55, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !503, file: !502, line: 97, baseType: !521, size: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !502, line: 80, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!157, !157, !483, !483}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !503, file: !502, line: 98, baseType: !526, size: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !502, line: 81, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !157, !157}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !503, file: !502, line: 99, baseType: !157, size: 64, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !503, file: !502, line: 101, baseType: !55, size: 32, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !503, file: !502, line: 102, baseType: !163, size: 64, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !503, file: !502, line: 103, baseType: !163, size: 64, offset: 832)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pos_in_zipfile", scope: !497, file: !418, line: 105, baseType: !163, size: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "stream_initialised", scope: !497, file: !418, line: 106, baseType: !163, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "offset_local_extrafield", scope: !497, file: !418, line: 108, baseType: !163, size: 64, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "size_local_extrafield", scope: !497, file: !418, line: 109, baseType: !483, size: 32, offset: 1152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pos_local_extrafield", scope: !497, file: !418, line: 110, baseType: !163, size: 64, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !497, file: !418, line: 112, baseType: !163, size: 64, offset: 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "crc32_wait", scope: !497, file: !418, line: 113, baseType: !163, size: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rest_read_compressed", scope: !497, file: !418, line: 114, baseType: !163, size: 64, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rest_read_uncompressed", scope: !497, file: !418, line: 115, baseType: !163, size: 64, offset: 1472)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "z_filefunc", scope: !497, file: !418, line: 116, baseType: !426, size: 512, offset: 1536)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "filestream", scope: !497, file: !418, line: 117, baseType: !157, size: 64, offset: 2048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "compression_method", scope: !497, file: !418, line: 118, baseType: !163, size: 64, offset: 2112)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "byte_before_the_zipfile", scope: !497, file: !418, line: 119, baseType: !163, size: 64, offset: 2176)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !497, file: !418, line: 120, baseType: !55, size: 32, offset: 2240)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !423, file: !418, line: 145, baseType: !55, size: 32, offset: 2368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !423, file: !418, line: 147, baseType: !550, size: 192, offset: 2432)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 192, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 3)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pcrc_32_tab", scope: !423, file: !418, line: 148, baseType: !554, size: 64, offset: 2624)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "unzFile", file: !448, line: 66, baseType: !144)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !246, line: 86, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !303, line: 131, baseType: !177)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!560 = !{!561}
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "unz_copyright", scope: !417, file: !418, line: 88, type: !563, isLocal: false, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 648, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 81)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !419, retainedTypes: !568, nameTableKind: None)
!567 = !DIFile(filename: "ioapi.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/libs/unzip")
!568 = !{!110, !163, !194, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !571, line: 48, baseType: !572)
!571 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !573, line: 241, size: 1728, elements: !574)
!573 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !595, !596, !597, !598, !599, !601, !603, !607, !610, !612, !613, !614, !615, !616, !617, !618}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !572, file: !573, line: 242, baseType: !55, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !572, file: !573, line: 247, baseType: !63, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !572, file: !573, line: 248, baseType: !63, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !572, file: !573, line: 249, baseType: !63, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !572, file: !573, line: 250, baseType: !63, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !572, file: !573, line: 251, baseType: !63, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !572, file: !573, line: 252, baseType: !63, size: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !572, file: !573, line: 253, baseType: !63, size: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !572, file: !573, line: 254, baseType: !63, size: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !572, file: !573, line: 256, baseType: !63, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !572, file: !573, line: 257, baseType: !63, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !572, file: !573, line: 258, baseType: !63, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !572, file: !573, line: 260, baseType: !588, size: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !573, line: 156, size: 192, elements: !590)
!590 = !{!591, !592, !594}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !589, file: !573, line: 157, baseType: !588, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !589, file: !573, line: 158, baseType: !593, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !589, file: !573, line: 162, baseType: !55, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !572, file: !573, line: 262, baseType: !593, size: 64, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !572, file: !573, line: 264, baseType: !55, size: 32, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !572, file: !573, line: 268, baseType: !55, size: 32, offset: 928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !572, file: !573, line: 270, baseType: !558, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !572, file: !573, line: 274, baseType: !600, size: 16, offset: 1024)
!600 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !572, file: !573, line: 275, baseType: !602, size: 8, offset: 1040)
!602 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !572, file: !573, line: 276, baseType: !604, size: 8, offset: 1048)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 1)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !572, file: !573, line: 280, baseType: !608, size: 64, offset: 1088)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !573, line: 150, baseType: null)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !572, file: !573, line: 289, baseType: !611, size: 64, offset: 1152)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !303, line: 132, baseType: !177)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !572, file: !573, line: 297, baseType: !110, size: 64, offset: 1216)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !572, file: !573, line: 298, baseType: !110, size: 64, offset: 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !572, file: !573, line: 299, baseType: !110, size: 64, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !572, file: !573, line: 300, baseType: !110, size: 64, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !572, file: !573, line: 302, baseType: !194, size: 64, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !572, file: !573, line: 303, baseType: !55, size: 32, offset: 1536)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !572, file: !573, line: 305, baseType: !619, size: 160, offset: 1568)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 160, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 20)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !419, nameTableKind: None)
!623 = !DIFile(filename: "strlcpy.c", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/compat")
!624 = !{!"clang version 8.0.1 (https://github.com/llvm-mirror/clang.git 2e4c9c5fc864c2c432e4c262a67c42d824b265c6) (https://github.com/rqtian/llvm80-bufferoverflow.git 3b5df6d2abd65c292843e89e82bd69d3349a41e2)"}
!625 = !{i32 2, !"Dwarf Version", i32 4}
!626 = !{i32 2, !"Debug Info Version", i32 3}
!627 = !{i32 1, !"wchar_size", i32 4}
!628 = !{i32 7, !"PIC Level", i32 2}
!629 = !{i32 1, !"ThinLTO", i32 0}
!630 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!631 = distinct !DISubprogram(name: "vlc_entry__1_1_0g", scope: !3, file: !3, line: 44, type: !632, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !634)
!632 = !DISubroutineType(types: !633)
!633 = !{!55, !101}
!634 = !{!635, !636, !720}
!635 = !DILocalVariable(name: "p_module", arg: 1, scope: !631, file: !3, line: 44, type: !101)
!636 = !DILocalVariable(name: "p_config", scope: !631, file: !3, line: 44, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_config_t", file: !58, line: 209, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_config_t", file: !640, line: 150, size: 1408, elements: !641)
!640 = !DIFile(filename: "../../../include/vlc_configuration.h", directory: "/root/llvm/codesample/39apps/vlc-1.1.5/modules/access/zip")
!641 = !{!642, !643, !644, !645, !646, !647, !648, !656, !657, !658, !664, !665, !700, !701, !703, !704, !705, !706, !707, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !639, file: !640, line: 152, baseType: !55, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "psz_type", scope: !639, file: !640, line: 153, baseType: !63, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "psz_name", scope: !639, file: !640, line: 154, baseType: !63, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_short", scope: !639, file: !640, line: 155, baseType: !54, size: 8, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "psz_text", scope: !639, file: !640, line: 156, baseType: !63, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "psz_longtext", scope: !639, file: !640, line: 157, baseType: !63, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !639, file: !640, line: 158, baseType: !649, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_value_t", file: !640, line: 142, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !640, line: 137, size: 64, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "psz", scope: !650, file: !640, line: 139, baseType: !63, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !650, file: !640, line: 140, baseType: !55, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !650, file: !640, line: 141, baseType: !655, size: 32)
!655 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !639, file: !640, line: 159, baseType: !649, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !639, file: !640, line: 160, baseType: !649, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !639, file: !640, line: 161, baseType: !659, size: 32, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "module_nvalue_t", file: !640, line: 148, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !640, line: 144, size: 32, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !660, file: !640, line: 146, baseType: !55, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !660, file: !640, line: 147, baseType: !655, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !639, file: !640, line: 162, baseType: !659, size: 32, offset: 608)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pf_callback", scope: !639, file: !640, line: 165, baseType: !666, size: 64, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_callback_t", file: !58, line: 490, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!55, !82, !52, !670, !670, !110}
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_value_t", file: !58, line: 432, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !58, line: 417, size: 64, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !689, !690, !696}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_int", scope: !671, file: !58, line: 419, baseType: !55, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "b_bool", scope: !671, file: !58, line: 420, baseType: !67, size: 8)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "f_float", scope: !671, file: !58, line: 421, baseType: !655, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "psz_string", scope: !671, file: !58, line: 422, baseType: !63, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "p_address", scope: !671, file: !58, line: 423, baseType: !110, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "p_object", scope: !671, file: !58, line: 424, baseType: !82, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "p_list", scope: !671, file: !58, line: 425, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "vlc_list_t", file: !58, line: 176, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlc_list_t", file: !58, line: 437, size: 192, elements: !683)
!683 = !{!684, !685, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !682, file: !58, line: 439, baseType: !55, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "p_values", scope: !682, file: !58, line: 440, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pi_types", scope: !682, file: !58, line: 441, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_time", scope: !671, file: !58, line: 426, baseType: !317, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !671, file: !58, line: 427, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !58, line: 427, size: 64, elements: !692)
!692 = !{!693, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !691, file: !58, line: 427, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !246, line: 196, baseType: !55)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !691, file: !58, line: 427, baseType: !694, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !671, file: !58, line: 430, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "p_callback_data", scope: !639, file: !640, line: 166, baseType: !110, size: 64, offset: 704)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list", scope: !639, file: !640, line: 169, baseType: !702, size: 64, offset: 768)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pi_list", scope: !639, file: !640, line: 170, baseType: !688, size: 64, offset: 832)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_list_text", scope: !639, file: !640, line: 171, baseType: !702, size: 64, offset: 896)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_list", scope: !639, file: !640, line: 172, baseType: !55, size: 32, offset: 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pf_update_list", scope: !639, file: !640, line: 173, baseType: !666, size: 64, offset: 1024)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ppf_action", scope: !639, file: !640, line: 176, baseType: !708, size: 64, offset: 1088)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ppsz_action_text", scope: !639, file: !640, line: 177, baseType: !702, size: 64, offset: 1152)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_action", scope: !639, file: !640, line: 178, baseType: !55, size: 32, offset: 1216)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_dirty", scope: !639, file: !640, line: 181, baseType: !67, size: 8, offset: 1248)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_advanced", scope: !639, file: !640, line: 182, baseType: !67, size: 8, offset: 1256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_internal", scope: !639, file: !640, line: 183, baseType: !67, size: 8, offset: 1264)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "b_restart", scope: !639, file: !640, line: 184, baseType: !67, size: 8, offset: 1272)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "psz_oldname", scope: !639, file: !640, line: 188, baseType: !63, size: 64, offset: 1280)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_removed", scope: !639, file: !640, line: 189, baseType: !67, size: 8, offset: 1344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_autosave", scope: !639, file: !640, line: 192, baseType: !67, size: 8, offset: 1352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "b_unsaveable", scope: !639, file: !640, line: 193, baseType: !67, size: 8, offset: 1360)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "b_safe", scope: !639, file: !640, line: 195, baseType: !67, size: 8, offset: 1368)
!720 = !DILocalVariable(name: "p_submodule", scope: !721, file: !3, line: 44, type: !101)
!721 = distinct !DILexicalBlock(scope: !631, file: !3, line: 44, column: 1)
!722 = !DILocation(line: 44, column: 1, scope: !631)
!723 = !{!724, !724, i64 0}
!724 = !{!"any pointer", !725, i64 0}
!725 = !{!"omnipotent char", !726, i64 0}
!726 = !{!"Simple C/C++ TBAA"}
!727 = !DILocation(line: 44, column: 1, scope: !728)
!728 = distinct !DILexicalBlock(scope: !631, file: !3, line: 44, column: 1)
!729 = !DILocation(line: 44, column: 1, scope: !721)
!730 = !DILocation(line: 45, column: 5, scope: !731)
!731 = distinct !DILexicalBlock(scope: !721, file: !3, line: 45, column: 5)
!732 = !DILocation(line: 45, column: 5, scope: !721)
!733 = !DILocation(line: 46, column: 5, scope: !721)
!734 = !DILocation(line: 47, column: 5, scope: !721)
!735 = !DILocation(line: 48, column: 5, scope: !736)
!736 = distinct !DILexicalBlock(scope: !721, file: !3, line: 48, column: 5)
!737 = !DILocation(line: 48, column: 5, scope: !721)
!738 = !DILocation(line: 49, column: 5, scope: !739)
!739 = distinct !DILexicalBlock(scope: !721, file: !3, line: 49, column: 5)
!740 = !DILocation(line: 49, column: 5, scope: !721)
!741 = !DILocation(line: 50, column: 5, scope: !742)
!742 = distinct !DILexicalBlock(scope: !721, file: !3, line: 50, column: 5)
!743 = !DILocation(line: 50, column: 5, scope: !721)
!744 = !DILocation(line: 51, column: 5, scope: !745)
!745 = distinct !DILexicalBlock(scope: !721, file: !3, line: 51, column: 5)
!746 = !DILocation(line: 51, column: 5, scope: !721)
!747 = !DILocation(line: 52, column: 9, scope: !721)
!748 = !DILocation(line: 53, column: 9, scope: !749)
!749 = distinct !DILexicalBlock(scope: !721, file: !3, line: 53, column: 9)
!750 = !DILocation(line: 53, column: 9, scope: !721)
!751 = !DILocation(line: 54, column: 9, scope: !752)
!752 = distinct !DILexicalBlock(scope: !721, file: !3, line: 54, column: 9)
!753 = !DILocation(line: 54, column: 9, scope: !721)
!754 = !DILocation(line: 55, column: 9, scope: !755)
!755 = distinct !DILexicalBlock(scope: !721, file: !3, line: 55, column: 9)
!756 = !DILocation(line: 55, column: 9, scope: !721)
!757 = !DILocation(line: 56, column: 9, scope: !758)
!758 = distinct !DILexicalBlock(scope: !721, file: !3, line: 56, column: 9)
!759 = !DILocation(line: 56, column: 9, scope: !721)
!760 = !DILocation(line: 57, column: 9, scope: !761)
!761 = distinct !DILexicalBlock(scope: !721, file: !3, line: 57, column: 9)
!762 = !DILocation(line: 58, column: 1, scope: !631)
!763 = distinct !DISubprogram(name: "StreamOpen", scope: !3, file: !3, line: 170, type: !764, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{!55, !82}
!766 = !{!767, !768, !769, !770, !771}
!767 = !DILocalVariable(name: "p_this", arg: 1, scope: !763, file: !3, line: 170, type: !82)
!768 = !DILocalVariable(name: "s", scope: !763, file: !3, line: 172, type: !56)
!769 = !DILocalVariable(name: "p_sys", scope: !763, file: !3, line: 173, type: !137)
!770 = !DILocalVariable(name: "p_peek", scope: !763, file: !3, line: 176, type: !116)
!771 = !DILocalVariable(name: "psz_tmp", scope: !763, file: !3, line: 215, type: !63)
!772 = !DILocation(line: 170, column: 31, scope: !763)
!773 = !DILocation(line: 172, column: 15, scope: !763)
!774 = !DILocation(line: 176, column: 5, scope: !763)
!775 = !DILocation(line: 177, column: 25, scope: !776)
!776 = distinct !DILexicalBlock(scope: !763, file: !3, line: 177, column: 9)
!777 = !{!778, !724, i64 64}
!778 = !{!"stream_t", !724, i64 0, !724, i64 8, !779, i64 16, !780, i64 20, !780, i64 21, !724, i64 24, !724, i64 32, !780, i64 40, !724, i64 48, !724, i64 56, !724, i64 64, !724, i64 72, !724, i64 80, !724, i64 88, !724, i64 96, !724, i64 104, !724, i64 112, !724, i64 120}
!779 = !{!"int", !725, i64 0}
!780 = !{!"_Bool", !725, i64 0}
!781 = !DILocation(line: 176, column: 20, scope: !763)
!782 = !DILocation(line: 177, column: 9, scope: !776)
!783 = !DILocation(line: 177, column: 59, scope: !776)
!784 = !DILocation(line: 177, column: 9, scope: !763)
!785 = !DILocation(line: 179, column: 17, scope: !786)
!786 = distinct !DILexicalBlock(scope: !763, file: !3, line: 179, column: 9)
!787 = !DILocation(line: 179, column: 9, scope: !786)
!788 = !DILocation(line: 179, column: 9, scope: !763)
!789 = !DILocation(line: 182, column: 24, scope: !763)
!790 = !DILocation(line: 173, column: 19, scope: !763)
!791 = !DILocation(line: 182, column: 8, scope: !763)
!792 = !DILocation(line: 182, column: 14, scope: !763)
!793 = !{!778, !724, i64 104}
!794 = !DILocation(line: 183, column: 10, scope: !795)
!795 = distinct !DILexicalBlock(scope: !763, file: !3, line: 183, column: 9)
!796 = !DILocation(line: 183, column: 9, scope: !763)
!797 = !DILocation(line: 186, column: 8, scope: !763)
!798 = !DILocation(line: 186, column: 16, scope: !763)
!799 = !{!778, !724, i64 72}
!800 = !DILocation(line: 187, column: 8, scope: !763)
!801 = !DILocation(line: 187, column: 16, scope: !763)
!802 = !{!778, !724, i64 80}
!803 = !DILocation(line: 188, column: 8, scope: !763)
!804 = !DILocation(line: 188, column: 19, scope: !763)
!805 = !{!778, !724, i64 88}
!806 = !DILocation(line: 191, column: 13, scope: !763)
!807 = !DILocation(line: 190, column: 12, scope: !763)
!808 = !DILocation(line: 190, column: 26, scope: !763)
!809 = !{!810, !724, i64 8}
!810 = !{!"stream_sys_t", !724, i64 0, !724, i64 8, !724, i64 16, !724, i64 24, !811, i64 32, !811, i64 40}
!811 = !{!"long", !725, i64 0}
!812 = !DILocation(line: 192, column: 10, scope: !813)
!813 = distinct !DILexicalBlock(scope: !763, file: !3, line: 192, column: 9)
!814 = !DILocation(line: 192, column: 9, scope: !763)
!815 = !DILocation(line: 194, column: 9, scope: !816)
!816 = distinct !DILexicalBlock(scope: !813, file: !3, line: 193, column: 5)
!817 = !DILocation(line: 195, column: 9, scope: !816)
!818 = !DILocation(line: 197, column: 27, scope: !763)
!819 = !DILocation(line: 197, column: 40, scope: !763)
!820 = !{!821, !724, i64 0}
!821 = !{!"zlib_filefunc_def_s", !724, i64 0, !724, i64 8, !724, i64 16, !724, i64 24, !724, i64 32, !724, i64 40, !724, i64 48, !724, i64 56}
!822 = !DILocation(line: 198, column: 27, scope: !763)
!823 = !DILocation(line: 198, column: 40, scope: !763)
!824 = !DILocation(line: 200, column: 27, scope: !763)
!825 = !DILocation(line: 200, column: 40, scope: !763)
!826 = !{!821, !724, i64 24}
!827 = !DILocation(line: 201, column: 27, scope: !763)
!828 = !DILocation(line: 201, column: 40, scope: !763)
!829 = !{!821, !724, i64 32}
!830 = !DILocation(line: 202, column: 27, scope: !763)
!831 = !DILocation(line: 202, column: 40, scope: !763)
!832 = !DILocation(line: 204, column: 27, scope: !763)
!833 = !DILocation(line: 204, column: 40, scope: !763)
!834 = !{!821, !724, i64 56}
!835 = !DILocation(line: 205, column: 22, scope: !763)
!836 = !DILocation(line: 205, column: 12, scope: !763)
!837 = !DILocation(line: 205, column: 20, scope: !763)
!838 = !{!810, !724, i64 0}
!839 = !DILocation(line: 206, column: 10, scope: !840)
!840 = distinct !DILexicalBlock(scope: !763, file: !3, line: 206, column: 9)
!841 = !DILocation(line: 206, column: 9, scope: !763)
!842 = !DILocation(line: 208, column: 9, scope: !843)
!843 = distinct !DILexicalBlock(scope: !840, file: !3, line: 207, column: 5)
!844 = !DILocation(line: 209, column: 22, scope: !843)
!845 = !DILocation(line: 209, column: 9, scope: !843)
!846 = !DILocation(line: 210, column: 9, scope: !843)
!847 = !DILocation(line: 211, column: 9, scope: !843)
!848 = !DILocation(line: 215, column: 5, scope: !763)
!849 = !DILocation(line: 216, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !763, file: !3, line: 216, column: 9)
!851 = !{!778, !724, i64 56}
!852 = !DILocation(line: 215, column: 11, scope: !763)
!853 = !DILocation(line: 216, column: 54, scope: !850)
!854 = !DILocation(line: 216, column: 9, scope: !763)
!855 = !DILocation(line: 218, column: 22, scope: !856)
!856 = distinct !DILexicalBlock(scope: !850, file: !3, line: 217, column: 5)
!857 = !DILocation(line: 218, column: 9, scope: !856)
!858 = !DILocation(line: 219, column: 9, scope: !856)
!859 = !DILocation(line: 220, column: 9, scope: !856)
!860 = !DILocation(line: 222, column: 26, scope: !763)
!861 = !DILocation(line: 222, column: 12, scope: !763)
!862 = !DILocation(line: 222, column: 21, scope: !763)
!863 = !{!810, !724, i64 16}
!864 = !DILocation(line: 223, column: 19, scope: !763)
!865 = !DILocation(line: 223, column: 17, scope: !763)
!866 = !DILocation(line: 225, column: 5, scope: !763)
!867 = !DILocation(line: 0, scope: !763)
!868 = !DILocation(line: 226, column: 1, scope: !763)
!869 = distinct !DISubprogram(name: "StreamClose", scope: !3, file: !3, line: 231, type: !870, scopeLine: 232, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !872)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !82}
!872 = !{!873, !874, !875}
!873 = !DILocalVariable(name: "p_this", arg: 1, scope: !869, file: !3, line: 231, type: !82)
!874 = !DILocalVariable(name: "s", scope: !869, file: !3, line: 233, type: !56)
!875 = !DILocalVariable(name: "p_sys", scope: !869, file: !3, line: 234, type: !137)
!876 = !DILocation(line: 231, column: 33, scope: !869)
!877 = !DILocation(line: 233, column: 15, scope: !869)
!878 = !DILocation(line: 234, column: 30, scope: !869)
!879 = !DILocation(line: 234, column: 19, scope: !869)
!880 = !DILocation(line: 236, column: 16, scope: !881)
!881 = distinct !DILexicalBlock(scope: !869, file: !3, line: 236, column: 9)
!882 = !DILocation(line: 236, column: 9, scope: !881)
!883 = !DILocation(line: 236, column: 9, scope: !869)
!884 = !DILocation(line: 237, column: 9, scope: !881)
!885 = !DILocation(line: 239, column: 18, scope: !869)
!886 = !DILocation(line: 239, column: 5, scope: !869)
!887 = !DILocation(line: 240, column: 18, scope: !869)
!888 = !{!810, !724, i64 24}
!889 = !DILocation(line: 240, column: 5, scope: !869)
!890 = !DILocation(line: 241, column: 18, scope: !869)
!891 = !DILocation(line: 241, column: 5, scope: !869)
!892 = !DILocation(line: 242, column: 11, scope: !869)
!893 = !DILocation(line: 242, column: 5, scope: !869)
!894 = !DILocation(line: 243, column: 1, scope: !869)
!895 = distinct !DISubprogram(name: "Read", scope: !3, file: !3, line: 252, type: !108, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !896)
!896 = !{!897, !898, !899, !900, !901}
!897 = !DILocalVariable(name: "s", arg: 1, scope: !895, file: !3, line: 252, type: !56)
!898 = !DILocalVariable(name: "p_read", arg: 2, scope: !895, file: !3, line: 252, type: !110)
!899 = !DILocalVariable(name: "i_read", arg: 3, scope: !895, file: !3, line: 252, type: !7)
!900 = !DILocalVariable(name: "p_sys", scope: !895, file: !3, line: 254, type: !137)
!901 = !DILocalVariable(name: "i_len", scope: !895, file: !3, line: 261, type: !7)
!902 = !DILocation(line: 252, column: 28, scope: !895)
!903 = !DILocation(line: 252, column: 37, scope: !895)
!904 = !DILocation(line: 252, column: 58, scope: !895)
!905 = !DILocation(line: 254, column: 30, scope: !895)
!906 = !DILocation(line: 254, column: 19, scope: !895)
!907 = !DILocation(line: 257, column: 9, scope: !908)
!908 = distinct !DILexicalBlock(scope: !895, file: !3, line: 257, column: 9)
!909 = !DILocation(line: 257, column: 9, scope: !895)
!910 = !DILocation(line: 261, column: 22, scope: !895)
!911 = !{!810, !811, i64 32}
!912 = !{!810, !811, i64 40}
!913 = !DILocation(line: 261, column: 14, scope: !895)
!914 = !DILocation(line: 262, column: 9, scope: !915)
!915 = distinct !DILexicalBlock(scope: !895, file: !3, line: 262, column: 9)
!916 = !DILocation(line: 262, column: 9, scope: !895)
!917 = !DILocation(line: 263, column: 32, scope: !915)
!918 = !DILocation(line: 263, column: 41, scope: !915)
!919 = !DILocation(line: 263, column: 9, scope: !915)
!920 = !DILocation(line: 264, column: 18, scope: !895)
!921 = !DILocation(line: 0, scope: !895)
!922 = !DILocation(line: 267, column: 1, scope: !895)
!923 = distinct !DISubprogram(name: "Peek", scope: !3, file: !3, line: 272, type: !113, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !924)
!924 = !{!925, !926, !927, !928, !929}
!925 = !DILocalVariable(name: "s", arg: 1, scope: !923, file: !3, line: 272, type: !56)
!926 = !DILocalVariable(name: "pp_peek", arg: 2, scope: !923, file: !3, line: 272, type: !115)
!927 = !DILocalVariable(name: "i_peek", arg: 3, scope: !923, file: !3, line: 272, type: !7)
!928 = !DILocalVariable(name: "p_sys", scope: !923, file: !3, line: 274, type: !137)
!929 = !DILocalVariable(name: "i_len", scope: !923, file: !3, line: 281, type: !55)
!930 = !DILocation(line: 272, column: 28, scope: !923)
!931 = !DILocation(line: 272, column: 47, scope: !923)
!932 = !DILocation(line: 272, column: 69, scope: !923)
!933 = !DILocation(line: 274, column: 30, scope: !923)
!934 = !DILocation(line: 274, column: 19, scope: !923)
!935 = !DILocation(line: 277, column: 9, scope: !936)
!936 = distinct !DILexicalBlock(scope: !923, file: !3, line: 277, column: 9)
!937 = !DILocation(line: 277, column: 9, scope: !923)
!938 = !DILocation(line: 281, column: 17, scope: !923)
!939 = !DILocation(line: 281, column: 9, scope: !923)
!940 = !DILocation(line: 282, column: 34, scope: !923)
!941 = !DILocation(line: 282, column: 43, scope: !923)
!942 = !DILocation(line: 282, column: 14, scope: !923)
!943 = !DILocation(line: 0, scope: !923)
!944 = !DILocation(line: 285, column: 1, scope: !923)
!945 = distinct !DISubprogram(name: "Control", scope: !3, file: !3, line: 290, type: !123, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !946)
!946 = !{!947, !948, !949, !950, !951, !954, !957}
!947 = !DILocalVariable(name: "s", arg: 1, scope: !945, file: !3, line: 290, type: !56)
!948 = !DILocalVariable(name: "i_query", arg: 2, scope: !945, file: !3, line: 290, type: !55)
!949 = !DILocalVariable(name: "args", arg: 3, scope: !945, file: !3, line: 290, type: !125)
!950 = !DILocalVariable(name: "p_sys", scope: !945, file: !3, line: 292, type: !137)
!951 = !DILocalVariable(name: "i_position", scope: !952, file: !3, line: 298, type: !333)
!952 = distinct !DILexicalBlock(scope: !953, file: !3, line: 297, column: 9)
!953 = distinct !DILexicalBlock(scope: !945, file: !3, line: 295, column: 5)
!954 = !DILocalVariable(name: "pi_position", scope: !955, file: !3, line: 310, type: !956)
!955 = distinct !DILexicalBlock(scope: !953, file: !3, line: 309, column: 9)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!957 = !DILocalVariable(name: "pi_size", scope: !958, file: !3, line: 317, type: !956)
!958 = distinct !DILexicalBlock(scope: !953, file: !3, line: 316, column: 9)
!959 = !DILocation(line: 290, column: 31, scope: !945)
!960 = !DILocation(line: 290, column: 38, scope: !945)
!961 = !DILocation(line: 290, column: 55, scope: !945)
!962 = !DILocation(line: 292, column: 30, scope: !945)
!963 = !DILocation(line: 292, column: 19, scope: !945)
!964 = !DILocation(line: 294, column: 5, scope: !945)
!965 = !DILocation(line: 298, column: 35, scope: !952)
!966 = !DILocation(line: 298, column: 22, scope: !952)
!967 = !DILocation(line: 299, column: 38, scope: !968)
!968 = distinct !DILexicalBlock(scope: !952, file: !3, line: 299, column: 17)
!969 = !DILocation(line: 299, column: 28, scope: !968)
!970 = !DILocation(line: 299, column: 17, scope: !952)
!971 = !DILocation(line: 303, column: 24, scope: !972)
!972 = distinct !DILexicalBlock(scope: !968, file: !3, line: 302, column: 13)
!973 = !DILocation(line: 303, column: 30, scope: !972)
!974 = !DILocation(line: 304, column: 17, scope: !972)
!975 = !DILocation(line: 310, column: 37, scope: !955)
!976 = !DILocation(line: 310, column: 23, scope: !955)
!977 = !DILocation(line: 311, column: 35, scope: !955)
!978 = !DILocation(line: 311, column: 26, scope: !955)
!979 = !{!811, !811, i64 0}
!980 = !DILocation(line: 317, column: 33, scope: !958)
!981 = !DILocation(line: 317, column: 23, scope: !958)
!982 = !DILocation(line: 318, column: 31, scope: !958)
!983 = !DILocation(line: 318, column: 22, scope: !958)
!984 = !DILocation(line: 330, column: 41, scope: !953)
!985 = !DILocation(line: 330, column: 20, scope: !953)
!986 = !DILocation(line: 330, column: 13, scope: !953)
!987 = !DILocation(line: 0, scope: !953)
!988 = !DILocation(line: 335, column: 1, scope: !945)
!989 = distinct !DISubprogram(name: "ZipIO_Open", scope: !3, file: !3, line: 755, type: !990, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !992)
!990 = !DISubroutineType(types: !991)
!991 = !{!110, !110, !52, !55}
!992 = !{!993, !994, !995, !996}
!993 = !DILocalVariable(name: "opaque", arg: 1, scope: !989, file: !3, line: 755, type: !110)
!994 = !DILocalVariable(name: "file", arg: 2, scope: !989, file: !3, line: 755, type: !52)
!995 = !DILocalVariable(name: "mode", arg: 3, scope: !989, file: !3, line: 755, type: !55)
!996 = !DILocalVariable(name: "s", scope: !989, file: !3, line: 758, type: !56)
!997 = !DILocation(line: 755, column: 42, scope: !989)
!998 = !DILocation(line: 755, column: 62, scope: !989)
!999 = !DILocation(line: 755, column: 72, scope: !989)
!1000 = !DILocation(line: 759, column: 14, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !989, file: !3, line: 759, column: 9)
!1002 = !DILocation(line: 759, column: 9, scope: !989)
!1003 = !DILocation(line: 761, column: 9, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 760, column: 5)
!1005 = !DILocation(line: 758, column: 15, scope: !989)
!1006 = !DILocation(line: 762, column: 9, scope: !1004)
!1007 = !DILocation(line: 0, scope: !989)
!1008 = !DILocation(line: 765, column: 1, scope: !989)
!1009 = distinct !DISubprogram(name: "ZipIO_Read", scope: !3, file: !3, line: 775, type: !1010, scopeLine: 777, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!163, !110, !110, !110, !164}
!1012 = !{!1013, !1014, !1015, !1016, !1017}
!1013 = !DILocalVariable(name: "opaque", arg: 1, scope: !1009, file: !3, line: 775, type: !110)
!1014 = !DILocalVariable(name: "stream", arg: 2, scope: !1009, file: !3, line: 775, type: !110)
!1015 = !DILocalVariable(name: "buf", arg: 3, scope: !1009, file: !3, line: 776, type: !110)
!1016 = !DILocalVariable(name: "size", arg: 4, scope: !1009, file: !3, line: 776, type: !164)
!1017 = !DILocalVariable(name: "s", scope: !1009, file: !3, line: 779, type: !56)
!1018 = !DILocation(line: 775, column: 50, scope: !1009)
!1019 = !DILocation(line: 775, column: 64, scope: !1009)
!1020 = !DILocation(line: 776, column: 50, scope: !1009)
!1021 = !DILocation(line: 776, column: 69, scope: !1009)
!1022 = !DILocation(line: 779, column: 15, scope: !1009)
!1023 = !DILocation(line: 780, column: 44, scope: !1009)
!1024 = !DILocation(line: 780, column: 59, scope: !1009)
!1025 = !DILocation(line: 780, column: 28, scope: !1009)
!1026 = !DILocation(line: 780, column: 12, scope: !1009)
!1027 = !DILocation(line: 780, column: 5, scope: !1009)
!1028 = distinct !DISubprogram(name: "ZipIO_Write", scope: !3, file: !3, line: 838, type: !1029, scopeLine: 840, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!163, !110, !110, !170, !163}
!1031 = !{!1032, !1033, !1034, !1035, !1036}
!1032 = !DILocalVariable(name: "opaque", arg: 1, scope: !1028, file: !3, line: 838, type: !110)
!1033 = !DILocalVariable(name: "stream", arg: 2, scope: !1028, file: !3, line: 838, type: !110)
!1034 = !DILocalVariable(name: "buf", arg: 3, scope: !1028, file: !3, line: 839, type: !170)
!1035 = !DILocalVariable(name: "size", arg: 4, scope: !1028, file: !3, line: 839, type: !163)
!1036 = !DILocalVariable(name: "ERROR_zip_cannot_write_this_should_not_happen", scope: !1028, file: !3, line: 842, type: !55)
!1037 = !DILocation(line: 838, column: 43, scope: !1028)
!1038 = !DILocation(line: 838, column: 57, scope: !1028)
!1039 = !DILocation(line: 839, column: 49, scope: !1028)
!1040 = !DILocation(line: 839, column: 60, scope: !1028)
!1041 = !DILocation(line: 842, column: 9, scope: !1028)
!1042 = !DILocation(line: 844, column: 5, scope: !1028)
!1043 = distinct !DISubprogram(name: "ZipIO_Tell", scope: !3, file: !3, line: 790, type: !1044, scopeLine: 791, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1046)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!177, !110, !110}
!1046 = !{!1047, !1048, !1049}
!1047 = !DILocalVariable(name: "opaque", arg: 1, scope: !1043, file: !3, line: 790, type: !110)
!1048 = !DILocalVariable(name: "stream", arg: 2, scope: !1043, file: !3, line: 790, type: !110)
!1049 = !DILocalVariable(name: "s", scope: !1043, file: !3, line: 793, type: !56)
!1050 = !DILocation(line: 790, column: 41, scope: !1043)
!1051 = !DILocation(line: 790, column: 55, scope: !1043)
!1052 = !DILocation(line: 793, column: 15, scope: !1043)
!1053 = !DILocation(line: 794, column: 35, scope: !1043)
!1054 = !DILocalVariable(name: "s", arg: 1, scope: !1055, file: !40, line: 138, type: !56)
!1055 = distinct !DISubprogram(name: "stream_Size", scope: !40, file: !40, line: 138, type: !1056, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1058)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!245, !56}
!1058 = !{!1054, !1059}
!1059 = !DILocalVariable(name: "i_pos", scope: !1055, file: !40, line: 140, type: !333)
!1060 = !DILocation(line: 138, column: 46, scope: !1055, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 794, column: 19, scope: !1043)
!1062 = !DILocation(line: 140, column: 5, scope: !1055, inlinedAt: !1061)
!1063 = !DILocation(line: 140, column: 14, scope: !1055, inlinedAt: !1061)
!1064 = !DILocation(line: 141, column: 5, scope: !1055, inlinedAt: !1061)
!1065 = !DILocation(line: 142, column: 9, scope: !1066, inlinedAt: !1061)
!1066 = distinct !DILexicalBlock(scope: !1055, file: !40, line: 142, column: 9)
!1067 = !DILocation(line: 142, column: 15, scope: !1066, inlinedAt: !1061)
!1068 = !DILocation(line: 0, scope: !1055, inlinedAt: !1061)
!1069 = !DILocation(line: 145, column: 1, scope: !1055, inlinedAt: !1061)
!1070 = !DILocation(line: 794, column: 5, scope: !1043)
