; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type opaque
%struct._TIFFField = type { i32, i16, i16, i32, i32, i32, i32, i16, i8, i8, i8*, %struct._TIFFFieldArray* }
%struct._TIFFFieldArray = type { i32, i32, i32, %struct._TIFFField* }

@.str = private unnamed_addr constant [3 x i8] c"r+\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"-d\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [28 x i8] c"Failed to set directory=%s\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"-sd\00", align 1
@.str.4 = private unnamed_addr constant [32 x i8] c"Failed to set sub directory=%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"-s\00", align 1
@.str.6 = private unnamed_addr constant [21 x i8] c"Failed to set %s=%s\0A\00", align 1
@.str.7 = private unnamed_addr constant [75 x i8] c"Number of tag values is not enough. Expected %d values for %s tag, got %d\0A\00", align 1
@.str.8 = private unnamed_addr constant [21 x i8] c"No space for %s tag\0A\00", align 1

!41 = !DIEnumerator(name: "TIFF_SETGET_IFD8", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "TIFF_SETGET_INT", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "TIFF_SETGET_UINT16_PAIR", value: 14, isUnsigned: true)
!44 = !DIEnumerator(name: "TIFF_SETGET_C0_ASCII", value: 15, isUnsigned: true)
!45 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT8", value: 16, isUnsigned: true)
!46 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT8", value: 17, isUnsigned: true)
!47 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT16", value: 18, isUnsigned: true)
!48 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT16", value: 19, isUnsigned: true)
!49 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT32", value: 20, isUnsigned: true)
!50 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT32", value: 21, isUnsigned: true)
!51 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT64", value: 22, isUnsigned: true)
!52 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT64", value: 23, isUnsigned: true)
!53 = !DIEnumerator(name: "TIFF_SETGET_C0_FLOAT", value: 24, isUnsigned: true)
!54 = !DIEnumerator(name: "TIFF_SETGET_C0_DOUBLE", value: 25, isUnsigned: true)
!55 = !DIEnumerator(name: "TIFF_SETGET_C0_IFD8", value: 26, isUnsigned: true)
!56 = !DIEnumerator(name: "TIFF_SETGET_C16_ASCII", value: 27, isUnsigned: true)
!57 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT8", value: 28, isUnsigned: true)
!58 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT8", value: 29, isUnsigned: true)
!59 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT16", value: 30, isUnsigned: true)
!60 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT16", value: 31, isUnsigned: true)
!61 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT32", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT32", value: 33, isUnsigned: true)
!63 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT64", value: 34, isUnsigned: true)
!64 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT64", value: 35, isUnsigned: true)
!65 = !DIEnumerator(name: "TIFF_SETGET_C16_FLOAT", value: 36, isUnsigned: true)
!66 = !DIEnumerator(name: "TIFF_SETGET_C16_DOUBLE", value: 37, isUnsigned: true)
!67 = !DIEnumerator(name: "TIFF_SETGET_C16_IFD8", value: 38, isUnsigned: true)
!68 = !DIEnumerator(name: "TIFF_SETGET_C32_ASCII", value: 39, isUnsigned: true)
!69 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT8", value: 40, isUnsigned: true)
!70 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT8", value: 41, isUnsigned: true)
!71 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT16", value: 42, isUnsigned: true)
!72 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT16", value: 43, isUnsigned: true)
!73 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT32", value: 44, isUnsigned: true)
!74 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT32", value: 45, isUnsigned: true)
!75 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT64", value: 46, isUnsigned: true)
!76 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT64", value: 47, isUnsigned: true)
!77 = !DIEnumerator(name: "TIFF_SETGET_C32_FLOAT", value: 48, isUnsigned: true)
!78 = !DIEnumerator(name: "TIFF_SETGET_C32_DOUBLE", value: 49, isUnsigned: true)
!79 = !DIEnumerator(name: "TIFF_SETGET_C32_IFD8", value: 50, isUnsigned: true)
!80 = !DIEnumerator(name: "TIFF_SETGET_OTHER", value: 51, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 263, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "tfiatImage", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "tfiatExif", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "tfiatOther", value: 2, isUnsigned: true)
!86 = !{!87, !88, !91, !94, !97, !100, !102, !104, !105, !106, !108, !110}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !6, line: 69, baseType: !90)
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !6, line: 72, baseType: !93)
!93 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8", file: !6, line: 68, baseType: !96)
!96 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16", file: !6, line: 71, baseType: !99)
!99 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !6, line: 75, baseType: !7)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!104 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttag_t", file: !109, line: 71, baseType: !101)
!109 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFField", file: !109, line: 320, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFField", file: !27, line: 276, size: 384, elements: !113)
!113 = !{!114, !115, !116, !117, !119, !120, !122, !123, !124, !125, !126, !127}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !112, file: !27, line: 277, baseType: !101, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !112, file: !27, line: 278, baseType: !99, size: 16, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !112, file: !27, line: 279, baseType: !99, size: 16, offset: 48)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !112, file: !27, line: 280, baseType: !118, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !6, line: 143, baseType: !5)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !112, file: !27, line: 281, baseType: !101, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "set_field_type", scope: !112, file: !27, line: 282, baseType: !121, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSetGetFieldType", file: !27, line: 250, baseType: !26)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "get_field_type", scope: !112, file: !27, line: 283, baseType: !121, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !112, file: !27, line: 284, baseType: !93, size: 16, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !112, file: !27, line: 285, baseType: !90, size: 8, offset: 208)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !112, file: !27, line: 286, baseType: !90, size: 8, offset: 216)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !112, file: !27, line: 287, baseType: !106, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "field_subfields", scope: !112, file: !27, line: 288, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArray", file: !109, line: 321, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFFieldArray", file: !27, line: 269, size: 192, elements: !131)
!131 = !{!132, !134, !135, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !27, line: 270, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArrayType", file: !27, line: 267, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !130, file: !27, line: 271, baseType: !101, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !130, file: !27, line: 272, baseType: !101, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !130, file: !27, line: 273, baseType: !110, size: 64, offset: 128)
!137 = !{!0}
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 448, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 7)
!141 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!142 = !{i32 2, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 4}
!145 = !{i32 7, !"PIC Level", i32 2}
!146 = !{i32 1, !"ThinLTO", i32 0}
!147 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!148 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 78, type: !149, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !153)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !151, !152}
!151 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!153 = !{}
!154 = !DILocalVariable(name: "argc", arg: 1, scope: !148, file: !3, line: 78, type: !151)
!155 = !DILocation(line: 78, column: 10, scope: !148)
!156 = !DILocalVariable(name: "argv", arg: 2, scope: !148, file: !3, line: 78, type: !152)
!157 = !DILocation(line: 78, column: 22, scope: !148)
!158 = !DILocalVariable(name: "tiff", scope: !148, file: !3, line: 80, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !109, line: 40, baseType: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !109, line: 40, flags: DIFlagFwdDecl)
!162 = !DILocation(line: 80, column: 11, scope: !148)
!163 = !DILocalVariable(name: "arg_index", scope: !148, file: !3, line: 81, type: !151)
!164 = !DILocation(line: 81, column: 10, scope: !148)
!165 = !DILocation(line: 83, column: 9, scope: !166)
!166 = distinct !DILexicalBlock(scope: !148, file: !3, line: 83, column: 9)
!167 = !DILocation(line: 83, column: 14, scope: !166)
!168 = !DILocation(line: 83, column: 9, scope: !148)
!169 = !DILocation(line: 84, column: 9, scope: !166)
!170 = !DILocation(line: 86, column: 21, scope: !148)
!171 = !DILocation(line: 86, column: 26, scope: !148)
!172 = !DILocation(line: 86, column: 30, scope: !148)
!173 = !DILocation(line: 86, column: 12, scope: !148)
!174 = !DILocation(line: 86, column: 10, scope: !148)
!175 = !DILocation(line: 87, column: 9, scope: !176)
!176 = distinct !DILexicalBlock(scope: !148, file: !3, line: 87, column: 9)
!177 = !DILocation(line: 87, column: 14, scope: !176)
!178 = !DILocation(line: 87, column: 9, scope: !148)
!179 = !DILocation(line: 88, column: 9, scope: !176)
!180 = !DILocation(line: 90, column: 20, scope: !181)
!181 = distinct !DILexicalBlock(scope: !148, file: !3, line: 90, column: 5)
!182 = !DILocation(line: 90, column: 10, scope: !181)
!183 = !DILocation(line: 90, column: 25, scope: !184)
!184 = distinct !DILexicalBlock(scope: !181, file: !3, line: 90, column: 5)
!185 = !DILocation(line: 90, column: 37, scope: !184)
!186 = !DILocation(line: 90, column: 41, scope: !184)
!187 = !DILocation(line: 90, column: 35, scope: !184)
!188 = !DILocation(line: 90, column: 5, scope: !181)
!189 = !DILocation(line: 91, column: 13, scope: !190)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 91, column: 6)
!191 = distinct !DILexicalBlock(scope: !184, file: !3, line: 90, column: 59)
!192 = !DILocation(line: 91, column: 18, scope: !190)
!193 = !DILocation(line: 91, column: 6, scope: !190)
!194 = !DILocation(line: 91, column: 35, scope: !190)
!195 = !DILocation(line: 91, column: 40, scope: !190)
!196 = !DILocation(line: 91, column: 43, scope: !190)
!197 = !DILocation(line: 91, column: 55, scope: !190)
!198 = !DILocation(line: 91, column: 59, scope: !190)
!199 = !DILocation(line: 91, column: 53, scope: !190)
!200 = !DILocation(line: 91, column: 6, scope: !191)
!201 = !DILocation(line: 92, column: 15, scope: !202)
!202 = distinct !DILexicalBlock(scope: !190, file: !3, line: 91, column: 63)
!203 = !DILocation(line: 93, column: 27, scope: !204)
!204 = distinct !DILexicalBlock(scope: !202, file: !3, line: 93, column: 10)
!205 = !DILocation(line: 93, column: 38, scope: !204)
!206 = !DILocation(line: 93, column: 43, scope: !204)
!207 = !DILocation(line: 93, column: 33, scope: !204)
!208 = !DILocation(line: 93, column: 10, scope: !204)
!209 = !DILocation(line: 93, column: 57, scope: !204)
!210 = !DILocation(line: 93, column: 10, scope: !202)
!211 = !DILocation(line: 95, column: 25, scope: !212)
!212 = distinct !DILexicalBlock(scope: !204, file: !3, line: 94, column: 13)
!213 = !DILocation(line: 95, column: 65, scope: !212)
!214 = !DILocation(line: 95, column: 70, scope: !212)
!215 = !DILocation(line: 95, column: 16, scope: !212)
!216 = !DILocation(line: 96, column: 16, scope: !212)
!217 = !DILocation(line: 98, column: 15, scope: !202)
!218 = !DILocation(line: 99, column: 2, scope: !202)
!219 = !DILocation(line: 100, column: 13, scope: !220)
!220 = distinct !DILexicalBlock(scope: !191, file: !3, line: 100, column: 6)
!221 = !DILocation(line: 100, column: 18, scope: !220)
!222 = !DILocation(line: 100, column: 6, scope: !220)
!223 = !DILocation(line: 100, column: 36, scope: !220)
!224 = !DILocation(line: 100, column: 41, scope: !220)
!225 = !DILocation(line: 100, column: 44, scope: !220)
!226 = !DILocation(line: 100, column: 56, scope: !220)
!227 = !DILocation(line: 100, column: 60, scope: !220)
!228 = !DILocation(line: 100, column: 54, scope: !220)
!229 = !DILocation(line: 100, column: 6, scope: !191)
!230 = !DILocation(line: 101, column: 15, scope: !231)
!231 = distinct !DILexicalBlock(scope: !220, file: !3, line: 100, column: 64)
!232 = !DILocation(line: 102, column: 30, scope: !233)
!233 = distinct !DILexicalBlock(scope: !231, file: !3, line: 102, column: 10)
!234 = !DILocation(line: 102, column: 41, scope: !233)
!235 = !DILocation(line: 102, column: 46, scope: !233)
!236 = !DILocation(line: 102, column: 36, scope: !233)
!237 = !DILocation(line: 102, column: 10, scope: !233)
!238 = !DILocation(line: 102, column: 60, scope: !233)
!239 = !DILocation(line: 102, column: 10, scope: !231)
!240 = !DILocation(line: 104, column: 25, scope: !241)
!241 = distinct !DILexicalBlock(scope: !233, file: !3, line: 103, column: 13)
!242 = !DILocation(line: 104, column: 69, scope: !241)
!243 = !DILocation(line: 104, column: 74, scope: !241)
!244 = !DILocation(line: 104, column: 16, scope: !241)
!245 = !DILocation(line: 105, column: 16, scope: !241)
!246 = !DILocation(line: 107, column: 15, scope: !231)
!247 = !DILocation(line: 108, column: 2, scope: !231)
!248 = !DILocation(line: 109, column: 20, scope: !249)
!249 = distinct !DILexicalBlock(scope: !191, file: !3, line: 109, column: 13)
!250 = !DILocation(line: 109, column: 25, scope: !249)
!251 = !DILocation(line: 109, column: 13, scope: !249)
!252 = !DILocation(line: 109, column: 42, scope: !249)
!253 = !DILocation(line: 109, column: 47, scope: !249)
!254 = !DILocation(line: 109, column: 50, scope: !249)
!255 = !DILocation(line: 109, column: 62, scope: !249)
!256 = !DILocation(line: 109, column: 66, scope: !249)
!257 = !DILocation(line: 109, column: 60, scope: !249)
!258 = !DILocation(line: 109, column: 13, scope: !191)
!259 = !DILocalVariable(name: "fip", scope: !260, file: !3, line: 110, type: !261)
!260 = distinct !DILexicalBlock(scope: !249, file: !3, line: 109, column: 70)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!263 = !DILocation(line: 110, column: 30, scope: !260)
!264 = !DILocalVariable(name: "tagname", scope: !260, file: !3, line: 111, type: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!267 = !DILocation(line: 111, column: 25, scope: !260)
!268 = !DILocation(line: 113, column: 22, scope: !260)
!269 = !DILocation(line: 114, column: 23, scope: !260)
!270 = !DILocation(line: 114, column: 28, scope: !260)
!271 = !DILocation(line: 114, column: 21, scope: !260)
!272 = !DILocation(line: 115, column: 28, scope: !260)
!273 = !DILocation(line: 115, column: 34, scope: !260)
!274 = !DILocation(line: 115, column: 19, scope: !260)
!275 = !DILocation(line: 115, column: 17, scope: !260)
!276 = !DILocation(line: 117, column: 18, scope: !277)
!277 = distinct !DILexicalBlock(scope: !260, file: !3, line: 117, column: 17)
!278 = !DILocation(line: 117, column: 17, scope: !260)
!279 = !DILocation(line: 118, column: 17, scope: !277)
!280 = !DILocation(line: 120, column: 22, scope: !260)
!281 = !DILocation(line: 121, column: 17, scope: !282)
!282 = distinct !DILexicalBlock(scope: !260, file: !3, line: 121, column: 17)
!283 = !DILocation(line: 121, column: 22, scope: !282)
!284 = !DILocation(line: 121, column: 33, scope: !282)
!285 = !DILocation(line: 121, column: 17, scope: !260)
!286 = !DILocation(line: 122, column: 34, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !3, line: 122, column: 21)
!288 = distinct !DILexicalBlock(scope: !282, file: !3, line: 121, column: 48)
!289 = !DILocation(line: 122, column: 40, scope: !287)
!290 = !DILocation(line: 122, column: 45, scope: !287)
!291 = !DILocation(line: 122, column: 56, scope: !287)
!292 = !DILocation(line: 122, column: 61, scope: !287)
!293 = !DILocation(line: 122, column: 21, scope: !287)
!294 = !DILocation(line: 122, column: 73, scope: !287)
!295 = !DILocation(line: 122, column: 21, scope: !288)
!296 = !DILocation(line: 123, column: 30, scope: !287)
!297 = !DILocation(line: 124, column: 30, scope: !287)
!298 = !DILocation(line: 124, column: 35, scope: !287)
!299 = !DILocation(line: 124, column: 47, scope: !287)
!300 = !DILocation(line: 124, column: 52, scope: !287)
!301 = !DILocation(line: 123, column: 21, scope: !287)
!302 = !DILocation(line: 125, column: 13, scope: !288)
!303 = !DILocation(line: 125, column: 24, scope: !304)
!304 = distinct !DILexicalBlock(scope: !282, file: !3, line: 125, column: 24)
!305 = !DILocation(line: 125, column: 29, scope: !304)
!306 = !DILocation(line: 125, column: 46, scope: !304)
!307 = !DILocation(line: 126, column: 10, scope: !304)
!308 = !DILocation(line: 126, column: 13, scope: !304)
!309 = !DILocation(line: 126, column: 18, scope: !304)
!310 = !DILocation(line: 126, column: 35, scope: !304)
!311 = !DILocation(line: 125, column: 24, scope: !282)
!312 = !DILocalVariable(name: "ret", scope: !313, file: !3, line: 127, type: !151)
!313 = distinct !DILexicalBlock(scope: !304, file: !3, line: 126, column: 53)
!314 = !DILocation(line: 127, column: 25, scope: !313)
!315 = !DILocalVariable(name: "wc", scope: !313, file: !3, line: 128, type: !99)
!316 = !DILocation(line: 128, column: 25, scope: !313)
!317 = !DILocation(line: 130, column: 21, scope: !318)
!318 = distinct !DILexicalBlock(scope: !313, file: !3, line: 130, column: 21)
!319 = !DILocation(line: 130, column: 26, scope: !318)
!320 = !DILocation(line: 130, column: 43, scope: !318)
!321 = !DILocation(line: 130, column: 21, scope: !313)
!322 = !DILocation(line: 131, column: 35, scope: !318)
!323 = !DILocation(line: 131, column: 49, scope: !318)
!324 = !DILocation(line: 131, column: 30, scope: !318)
!325 = !DILocation(line: 131, column: 28, scope: !318)
!326 = !DILocation(line: 131, column: 25, scope: !318)
!327 = !DILocation(line: 133, column: 30, scope: !318)
!328 = !DILocation(line: 133, column: 35, scope: !318)
!329 = !DILocation(line: 133, column: 28, scope: !318)
!330 = !DILocation(line: 135, column: 21, scope: !331)
!331 = distinct !DILexicalBlock(scope: !313, file: !3, line: 135, column: 21)
!332 = !DILocation(line: 135, column: 28, scope: !331)
!333 = !DILocation(line: 135, column: 26, scope: !331)
!334 = !DILocation(line: 135, column: 40, scope: !331)
!335 = !DILocation(line: 135, column: 38, scope: !331)
!336 = !DILocation(line: 135, column: 21, scope: !313)
!337 = !DILocation(line: 136, column: 30, scope: !338)
!338 = distinct !DILexicalBlock(scope: !331, file: !3, line: 135, column: 44)
!339 = !DILocation(line: 139, column: 30, scope: !338)
!340 = !DILocation(line: 139, column: 34, scope: !338)
!341 = !DILocation(line: 139, column: 39, scope: !338)
!342 = !DILocation(line: 139, column: 51, scope: !338)
!343 = !DILocation(line: 139, column: 58, scope: !338)
!344 = !DILocation(line: 139, column: 56, scope: !338)
!345 = !DILocation(line: 136, column: 21, scope: !338)
!346 = !DILocation(line: 140, column: 21, scope: !338)
!347 = !DILocation(line: 143, column: 21, scope: !348)
!348 = distinct !DILexicalBlock(scope: !313, file: !3, line: 143, column: 21)
!349 = !DILocation(line: 143, column: 24, scope: !348)
!350 = !DILocation(line: 143, column: 21, scope: !313)
!351 = !DILocalVariable(name: "i", scope: !352, file: !3, line: 144, type: !151)
!352 = distinct !DILexicalBlock(scope: !348, file: !3, line: 143, column: 29)
!353 = !DILocation(line: 144, column: 33, scope: !352)
!354 = !DILocalVariable(name: "size", scope: !352, file: !3, line: 144, type: !151)
!355 = !DILocation(line: 144, column: 36, scope: !352)
!356 = !DILocalVariable(name: "array", scope: !352, file: !3, line: 145, type: !87)
!357 = !DILocation(line: 145, column: 34, scope: !352)
!358 = !DILocation(line: 147, column: 33, scope: !352)
!359 = !DILocation(line: 147, column: 38, scope: !352)
!360 = !DILocation(line: 147, column: 25, scope: !352)
!361 = !DILocation(line: 147, column: 50, scope: !352)
!362 = !DILocation(line: 160, column: 42, scope: !363)
!363 = distinct !DILexicalBlock(scope: !352, file: !3, line: 147, column: 50)
!364 = !DILocation(line: 161, column: 37, scope: !363)
!365 = !DILocation(line: 165, column: 42, scope: !363)
!366 = !DILocation(line: 166, column: 37, scope: !363)
!367 = !DILocation(line: 174, column: 42, scope: !363)
!368 = !DILocation(line: 175, column: 37, scope: !363)
!369 = !DILocation(line: 178, column: 42, scope: !363)
!370 = !DILocation(line: 179, column: 37, scope: !363)
!371 = !DILocation(line: 182, column: 45, scope: !352)
!372 = !DILocation(line: 182, column: 50, scope: !352)
!373 = !DILocation(line: 182, column: 48, scope: !352)
!374 = !DILocation(line: 182, column: 33, scope: !352)
!375 = !DILocation(line: 182, column: 31, scope: !352)
!376 = !DILocation(line: 183, column: 30, scope: !377)
!377 = distinct !DILexicalBlock(scope: !352, file: !3, line: 183, column: 29)
!378 = !DILocation(line: 183, column: 29, scope: !352)
!379 = !DILocation(line: 184, column: 41, scope: !380)
!380 = distinct !DILexicalBlock(scope: !377, file: !3, line: 183, column: 37)
!381 = !DILocation(line: 185, column: 41, scope: !380)
!382 = !DILocation(line: 184, column: 33, scope: !380)
!383 = !DILocation(line: 186, column: 33, scope: !380)
!384 = !DILocation(line: 189, column: 33, scope: !352)
!385 = !DILocation(line: 189, column: 38, scope: !352)
!386 = !DILocation(line: 189, column: 25, scope: !352)
!387 = !DILocation(line: 191, column: 40, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 191, column: 33)
!389 = distinct !DILexicalBlock(scope: !352, file: !3, line: 189, column: 50)
!390 = !DILocation(line: 191, column: 38, scope: !388)
!391 = !DILocation(line: 191, column: 45, scope: !392)
!392 = distinct !DILexicalBlock(scope: !388, file: !3, line: 191, column: 33)
!393 = !DILocation(line: 191, column: 49, scope: !392)
!394 = !DILocation(line: 191, column: 47, scope: !392)
!395 = !DILocation(line: 191, column: 33, scope: !388)
!396 = !DILocation(line: 192, column: 64, scope: !392)
!397 = !DILocation(line: 192, column: 69, scope: !392)
!398 = !DILocation(line: 192, column: 79, scope: !392)
!399 = !DILocation(line: 192, column: 78, scope: !392)
!400 = !DILocation(line: 192, column: 59, scope: !392)
!401 = !DILocation(line: 192, column: 47, scope: !392)
!402 = !DILocation(line: 192, column: 54, scope: !392)
!403 = !DILocation(line: 192, column: 37, scope: !392)
!404 = !DILocation(line: 192, column: 57, scope: !392)
!405 = !DILocation(line: 191, column: 54, scope: !392)
!406 = !DILocation(line: 191, column: 33, scope: !392)
!407 = distinct !{!407, !395, !408}
!408 = !DILocation(line: 192, column: 81, scope: !388)
!409 = !DILocation(line: 193, column: 33, scope: !389)
!410 = !DILocation(line: 195, column: 40, scope: !411)
!411 = distinct !DILexicalBlock(scope: !389, file: !3, line: 195, column: 33)
!412 = !DILocation(line: 195, column: 38, scope: !411)
!413 = !DILocation(line: 195, column: 45, scope: !414)
!414 = distinct !DILexicalBlock(scope: !411, file: !3, line: 195, column: 33)
!415 = !DILocation(line: 195, column: 49, scope: !414)
!416 = !DILocation(line: 195, column: 47, scope: !414)
!417 = !DILocation(line: 195, column: 33, scope: !411)
!418 = !DILocation(line: 196, column: 65, scope: !414)
!419 = !DILocation(line: 196, column: 70, scope: !414)
!420 = !DILocation(line: 196, column: 80, scope: !414)
!421 = !DILocation(line: 196, column: 79, scope: !414)
!422 = !DILocation(line: 196, column: 60, scope: !414)
!423 = !DILocation(line: 196, column: 48, scope: !414)
!424 = !DILocation(line: 196, column: 38, scope: !414)
!425 = !DILocation(line: 196, column: 55, scope: !414)
!426 = !DILocation(line: 196, column: 37, scope: !414)
!427 = !DILocation(line: 196, column: 58, scope: !414)
!428 = !DILocation(line: 195, column: 54, scope: !414)
!429 = !DILocation(line: 195, column: 33, scope: !414)
!430 = distinct !{!430, !417, !431}
!431 = !DILocation(line: 196, column: 82, scope: !411)
!432 = !DILocation(line: 197, column: 33, scope: !389)
!433 = !DILocation(line: 199, column: 40, scope: !434)
!434 = distinct !DILexicalBlock(scope: !389, file: !3, line: 199, column: 33)
!435 = !DILocation(line: 199, column: 38, scope: !434)
!436 = !DILocation(line: 199, column: 45, scope: !437)
!437 = distinct !DILexicalBlock(scope: !434, file: !3, line: 199, column: 33)
!438 = !DILocation(line: 199, column: 49, scope: !437)
!439 = !DILocation(line: 199, column: 47, scope: !437)
!440 = !DILocation(line: 199, column: 33, scope: !434)
!441 = !DILocation(line: 200, column: 63, scope: !437)
!442 = !DILocation(line: 200, column: 68, scope: !437)
!443 = !DILocation(line: 200, column: 78, scope: !437)
!444 = !DILocation(line: 200, column: 77, scope: !437)
!445 = !DILocation(line: 200, column: 58, scope: !437)
!446 = !DILocation(line: 200, column: 46, scope: !437)
!447 = !DILocation(line: 200, column: 53, scope: !437)
!448 = !DILocation(line: 200, column: 37, scope: !437)
!449 = !DILocation(line: 200, column: 56, scope: !437)
!450 = !DILocation(line: 199, column: 54, scope: !437)
!451 = !DILocation(line: 199, column: 33, scope: !437)
!452 = distinct !{!452, !440, !453}
!453 = !DILocation(line: 200, column: 80, scope: !434)
!454 = !DILocation(line: 201, column: 33, scope: !389)
!455 = !DILocation(line: 203, column: 40, scope: !456)
!456 = distinct !DILexicalBlock(scope: !389, file: !3, line: 203, column: 33)
!457 = !DILocation(line: 203, column: 38, scope: !456)
!458 = !DILocation(line: 203, column: 45, scope: !459)
!459 = distinct !DILexicalBlock(scope: !456, file: !3, line: 203, column: 33)
!460 = !DILocation(line: 203, column: 49, scope: !459)
!461 = !DILocation(line: 203, column: 47, scope: !459)
!462 = !DILocation(line: 203, column: 33, scope: !456)
!463 = !DILocation(line: 204, column: 64, scope: !459)
!464 = !DILocation(line: 204, column: 69, scope: !459)
!465 = !DILocation(line: 204, column: 79, scope: !459)
!466 = !DILocation(line: 204, column: 78, scope: !459)
!467 = !DILocation(line: 204, column: 59, scope: !459)
!468 = !DILocation(line: 204, column: 47, scope: !459)
!469 = !DILocation(line: 204, column: 38, scope: !459)
!470 = !DILocation(line: 204, column: 54, scope: !459)
!471 = !DILocation(line: 204, column: 37, scope: !459)
!472 = !DILocation(line: 204, column: 57, scope: !459)
!473 = !DILocation(line: 203, column: 54, scope: !459)
!474 = !DILocation(line: 203, column: 33, scope: !459)
!475 = distinct !{!475, !462, !476}
!476 = !DILocation(line: 204, column: 81, scope: !456)
!477 = !DILocation(line: 205, column: 33, scope: !389)
!478 = !DILocation(line: 207, column: 40, scope: !479)
!479 = distinct !DILexicalBlock(scope: !389, file: !3, line: 207, column: 33)
!480 = !DILocation(line: 207, column: 38, scope: !479)
!481 = !DILocation(line: 207, column: 45, scope: !482)
!482 = distinct !DILexicalBlock(scope: !479, file: !3, line: 207, column: 33)
!483 = !DILocation(line: 207, column: 49, scope: !482)
!484 = !DILocation(line: 207, column: 47, scope: !482)
!485 = !DILocation(line: 207, column: 33, scope: !479)
!486 = !DILocation(line: 208, column: 65, scope: !482)
!487 = !DILocation(line: 208, column: 70, scope: !482)
!488 = !DILocation(line: 208, column: 80, scope: !482)
!489 = !DILocation(line: 208, column: 79, scope: !482)
!490 = !DILocation(line: 208, column: 60, scope: !482)
!491 = !DILocation(line: 208, column: 48, scope: !482)
!492 = !DILocation(line: 208, column: 38, scope: !482)
!493 = !DILocation(line: 208, column: 55, scope: !482)
!494 = !DILocation(line: 208, column: 37, scope: !482)
!495 = !DILocation(line: 208, column: 58, scope: !482)
!496 = !DILocation(line: 207, column: 54, scope: !482)
!497 = !DILocation(line: 207, column: 33, scope: !482)
!498 = distinct !{!498, !485, !499}
!499 = !DILocation(line: 208, column: 82, scope: !479)
!500 = !DILocation(line: 209, column: 33, scope: !389)
!501 = !DILocation(line: 212, column: 40, scope: !502)
!502 = distinct !DILexicalBlock(scope: !389, file: !3, line: 212, column: 33)
!503 = !DILocation(line: 212, column: 38, scope: !502)
!504 = !DILocation(line: 212, column: 45, scope: !505)
!505 = distinct !DILexicalBlock(scope: !502, file: !3, line: 212, column: 33)
!506 = !DILocation(line: 212, column: 49, scope: !505)
!507 = !DILocation(line: 212, column: 47, scope: !505)
!508 = !DILocation(line: 212, column: 33, scope: !502)
!509 = !DILocation(line: 213, column: 65, scope: !505)
!510 = !DILocation(line: 213, column: 70, scope: !505)
!511 = !DILocation(line: 213, column: 80, scope: !505)
!512 = !DILocation(line: 213, column: 79, scope: !505)
!513 = !DILocation(line: 213, column: 60, scope: !505)
!514 = !DILocation(line: 213, column: 48, scope: !505)
!515 = !DILocation(line: 213, column: 38, scope: !505)
!516 = !DILocation(line: 213, column: 55, scope: !505)
!517 = !DILocation(line: 213, column: 37, scope: !505)
!518 = !DILocation(line: 213, column: 58, scope: !505)
!519 = !DILocation(line: 212, column: 54, scope: !505)
!520 = !DILocation(line: 212, column: 33, scope: !505)
!521 = distinct !{!521, !508, !522}
!522 = !DILocation(line: 213, column: 82, scope: !502)
!523 = !DILocation(line: 214, column: 33, scope: !389)
!524 = !DILocation(line: 216, column: 40, scope: !525)
!525 = distinct !DILexicalBlock(scope: !389, file: !3, line: 216, column: 33)
!526 = !DILocation(line: 216, column: 38, scope: !525)
!527 = !DILocation(line: 216, column: 45, scope: !528)
!528 = distinct !DILexicalBlock(scope: !525, file: !3, line: 216, column: 33)
!529 = !DILocation(line: 216, column: 49, scope: !528)
!530 = !DILocation(line: 216, column: 47, scope: !528)
!531 = !DILocation(line: 216, column: 33, scope: !525)
!532 = !DILocation(line: 217, column: 65, scope: !528)
!533 = !DILocation(line: 217, column: 70, scope: !528)
!534 = !DILocation(line: 217, column: 80, scope: !528)
!535 = !DILocation(line: 217, column: 79, scope: !528)
!536 = !DILocation(line: 217, column: 60, scope: !528)
!537 = !DILocation(line: 217, column: 48, scope: !528)
!538 = !DILocation(line: 217, column: 38, scope: !528)
!539 = !DILocation(line: 217, column: 55, scope: !528)
!540 = !DILocation(line: 217, column: 37, scope: !528)
!541 = !DILocation(line: 217, column: 58, scope: !528)
!542 = !DILocation(line: 216, column: 54, scope: !528)
!543 = !DILocation(line: 216, column: 33, scope: !528)
!544 = distinct !{!544, !531, !545}
!545 = !DILocation(line: 217, column: 82, scope: !525)
!546 = !DILocation(line: 218, column: 33, scope: !389)
!547 = !DILocation(line: 222, column: 40, scope: !548)
!548 = distinct !DILexicalBlock(scope: !389, file: !3, line: 222, column: 33)
!549 = !DILocation(line: 222, column: 38, scope: !548)
!550 = !DILocation(line: 222, column: 45, scope: !551)
!551 = distinct !DILexicalBlock(scope: !548, file: !3, line: 222, column: 33)
!552 = !DILocation(line: 222, column: 49, scope: !551)
!553 = !DILocation(line: 222, column: 47, scope: !551)
!554 = !DILocation(line: 222, column: 33, scope: !548)
!555 = !DILocation(line: 223, column: 71, scope: !551)
!556 = !DILocation(line: 223, column: 76, scope: !551)
!557 = !DILocation(line: 223, column: 86, scope: !551)
!558 = !DILocation(line: 223, column: 85, scope: !551)
!559 = !DILocation(line: 223, column: 66, scope: !551)
!560 = !DILocation(line: 223, column: 59, scope: !551)
!561 = !DILocation(line: 223, column: 47, scope: !551)
!562 = !DILocation(line: 223, column: 38, scope: !551)
!563 = !DILocation(line: 223, column: 54, scope: !551)
!564 = !DILocation(line: 223, column: 37, scope: !551)
!565 = !DILocation(line: 223, column: 57, scope: !551)
!566 = !DILocation(line: 222, column: 54, scope: !551)
!567 = !DILocation(line: 222, column: 33, scope: !551)
!568 = distinct !{!568, !554, !569}
!569 = !DILocation(line: 223, column: 88, scope: !548)
!570 = !DILocation(line: 224, column: 33, scope: !389)
!571 = !DILocation(line: 226, column: 33, scope: !389)
!572 = !DILocation(line: 229, column: 29, scope: !573)
!573 = distinct !DILexicalBlock(scope: !352, file: !3, line: 229, column: 29)
!574 = !DILocation(line: 229, column: 34, scope: !573)
!575 = !DILocation(line: 229, column: 29, scope: !352)
!576 = !DILocation(line: 230, column: 52, scope: !577)
!577 = distinct !DILexicalBlock(scope: !573, file: !3, line: 229, column: 51)
!578 = !DILocation(line: 230, column: 58, scope: !577)
!579 = !DILocation(line: 230, column: 63, scope: !577)
!580 = !DILocation(line: 231, column: 52, scope: !577)
!581 = !DILocation(line: 231, column: 56, scope: !577)
!582 = !DILocation(line: 230, column: 39, scope: !577)
!583 = !DILocation(line: 230, column: 37, scope: !577)
!584 = !DILocation(line: 232, column: 25, scope: !577)
!585 = !DILocation(line: 232, column: 36, scope: !586)
!586 = distinct !DILexicalBlock(scope: !573, file: !3, line: 232, column: 36)
!587 = !DILocation(line: 232, column: 41, scope: !586)
!588 = !DILocation(line: 232, column: 51, scope: !586)
!589 = !DILocation(line: 233, column: 8, scope: !586)
!590 = !DILocation(line: 233, column: 11, scope: !586)
!591 = !DILocation(line: 233, column: 16, scope: !586)
!592 = !DILocation(line: 233, column: 26, scope: !586)
!593 = !DILocation(line: 234, column: 8, scope: !586)
!594 = !DILocation(line: 234, column: 11, scope: !586)
!595 = !DILocation(line: 234, column: 16, scope: !586)
!596 = !DILocation(line: 234, column: 26, scope: !586)
!597 = !DILocation(line: 235, column: 8, scope: !586)
!598 = !DILocation(line: 235, column: 11, scope: !586)
!599 = !DILocation(line: 235, column: 16, scope: !586)
!600 = !DILocation(line: 235, column: 26, scope: !586)
!601 = !DILocation(line: 232, column: 36, scope: !573)
!602 = !DILocation(line: 236, column: 16, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !3, line: 236, column: 16)
!604 = distinct !DILexicalBlock(scope: !586, file: !3, line: 235, column: 47)
!605 = !DILocation(line: 236, column: 21, scope: !603)
!606 = !DILocation(line: 236, column: 32, scope: !603)
!607 = !DILocation(line: 236, column: 16, scope: !604)
!608 = !DILocation(line: 237, column: 25, scope: !609)
!609 = distinct !DILexicalBlock(scope: !603, file: !3, line: 236, column: 46)
!610 = !DILocation(line: 237, column: 31, scope: !609)
!611 = !DILocation(line: 237, column: 36, scope: !609)
!612 = !DILocation(line: 238, column: 17, scope: !609)
!613 = !DILocation(line: 238, column: 7, scope: !609)
!614 = !DILocation(line: 238, column: 38, scope: !609)
!615 = !DILocation(line: 238, column: 28, scope: !609)
!616 = !DILocation(line: 237, column: 12, scope: !609)
!617 = !DILocation(line: 237, column: 10, scope: !609)
!618 = !DILocation(line: 239, column: 5, scope: !609)
!619 = !DILocation(line: 239, column: 16, scope: !620)
!620 = distinct !DILexicalBlock(scope: !603, file: !3, line: 239, column: 16)
!621 = !DILocation(line: 239, column: 21, scope: !620)
!622 = !DILocation(line: 239, column: 32, scope: !620)
!623 = !DILocation(line: 239, column: 16, scope: !603)
!624 = !DILocation(line: 240, column: 25, scope: !625)
!625 = distinct !DILexicalBlock(scope: !620, file: !3, line: 239, column: 47)
!626 = !DILocation(line: 240, column: 31, scope: !625)
!627 = !DILocation(line: 240, column: 36, scope: !625)
!628 = !DILocation(line: 241, column: 18, scope: !625)
!629 = !DILocation(line: 241, column: 8, scope: !625)
!630 = !DILocation(line: 241, column: 7, scope: !625)
!631 = !DILocation(line: 241, column: 40, scope: !625)
!632 = !DILocation(line: 241, column: 30, scope: !625)
!633 = !DILocation(line: 241, column: 29, scope: !625)
!634 = !DILocation(line: 240, column: 12, scope: !625)
!635 = !DILocation(line: 240, column: 10, scope: !625)
!636 = !DILocation(line: 242, column: 5, scope: !625)
!637 = !DILocation(line: 243, column: 4, scope: !604)
!638 = !DILocation(line: 244, column: 52, scope: !639)
!639 = distinct !DILexicalBlock(scope: !586, file: !3, line: 243, column: 11)
!640 = !DILocation(line: 244, column: 58, scope: !639)
!641 = !DILocation(line: 244, column: 63, scope: !639)
!642 = !DILocation(line: 245, column: 52, scope: !639)
!643 = !DILocation(line: 244, column: 39, scope: !639)
!644 = !DILocation(line: 244, column: 37, scope: !639)
!645 = !DILocation(line: 248, column: 35, scope: !352)
!646 = !DILocation(line: 248, column: 25, scope: !352)
!647 = !DILocation(line: 249, column: 17, scope: !352)
!648 = !DILocation(line: 250, column: 33, scope: !649)
!649 = distinct !DILexicalBlock(scope: !348, file: !3, line: 249, column: 24)
!650 = !DILocation(line: 250, column: 38, scope: !649)
!651 = !DILocation(line: 250, column: 25, scope: !649)
!652 = !DILocation(line: 255, column: 52, scope: !653)
!653 = distinct !DILexicalBlock(scope: !649, file: !3, line: 250, column: 50)
!654 = !DILocation(line: 255, column: 58, scope: !653)
!655 = !DILocation(line: 255, column: 63, scope: !653)
!656 = !DILocation(line: 256, column: 57, scope: !653)
!657 = !DILocation(line: 256, column: 71, scope: !653)
!658 = !DILocation(line: 256, column: 52, scope: !653)
!659 = !DILocation(line: 255, column: 39, scope: !653)
!660 = !DILocation(line: 255, column: 37, scope: !653)
!661 = !DILocation(line: 257, column: 33, scope: !653)
!662 = !DILocation(line: 261, column: 52, scope: !653)
!663 = !DILocation(line: 261, column: 58, scope: !653)
!664 = !DILocation(line: 261, column: 63, scope: !653)
!665 = !DILocation(line: 262, column: 57, scope: !653)
!666 = !DILocation(line: 262, column: 71, scope: !653)
!667 = !DILocation(line: 262, column: 52, scope: !653)
!668 = !DILocation(line: 261, column: 39, scope: !653)
!669 = !DILocation(line: 261, column: 37, scope: !653)
!670 = !DILocation(line: 263, column: 33, scope: !653)
!671 = !DILocation(line: 265, column: 52, scope: !653)
!672 = !DILocation(line: 265, column: 58, scope: !653)
!673 = !DILocation(line: 265, column: 63, scope: !653)
!674 = !DILocation(line: 266, column: 57, scope: !653)
!675 = !DILocation(line: 266, column: 71, scope: !653)
!676 = !DILocation(line: 266, column: 52, scope: !653)
!677 = !DILocation(line: 265, column: 39, scope: !653)
!678 = !DILocation(line: 265, column: 37, scope: !653)
!679 = !DILocation(line: 267, column: 33, scope: !653)
!680 = !DILocation(line: 271, column: 52, scope: !653)
!681 = !DILocation(line: 271, column: 58, scope: !653)
!682 = !DILocation(line: 271, column: 63, scope: !653)
!683 = !DILocation(line: 272, column: 64, scope: !653)
!684 = !DILocation(line: 272, column: 78, scope: !653)
!685 = !DILocation(line: 272, column: 59, scope: !653)
!686 = !DILocation(line: 272, column: 52, scope: !653)
!687 = !DILocation(line: 271, column: 39, scope: !653)
!688 = !DILocation(line: 271, column: 37, scope: !653)
!689 = !DILocation(line: 273, column: 33, scope: !653)
!690 = !DILocation(line: 275, column: 33, scope: !653)
!691 = !DILocation(line: 279, column: 21, scope: !692)
!692 = distinct !DILexicalBlock(scope: !313, file: !3, line: 279, column: 21)
!693 = !DILocation(line: 279, column: 25, scope: !692)
!694 = !DILocation(line: 279, column: 21, scope: !313)
!695 = !DILocation(line: 280, column: 29, scope: !692)
!696 = !DILocation(line: 280, column: 59, scope: !692)
!697 = !DILocation(line: 280, column: 64, scope: !692)
!698 = !DILocation(line: 280, column: 21, scope: !692)
!699 = !DILocation(line: 281, column: 30, scope: !313)
!700 = !DILocation(line: 281, column: 27, scope: !313)
!701 = !DILocation(line: 282, column: 13, scope: !313)
!702 = !DILocation(line: 283, column: 9, scope: !260)
!703 = !DILocation(line: 283, column: 27, scope: !704)
!704 = distinct !DILexicalBlock(scope: !249, file: !3, line: 283, column: 20)
!705 = !DILocation(line: 283, column: 32, scope: !704)
!706 = !DILocation(line: 283, column: 20, scope: !704)
!707 = !DILocation(line: 283, column: 50, scope: !704)
!708 = !DILocation(line: 283, column: 55, scope: !704)
!709 = !DILocation(line: 283, column: 58, scope: !704)
!710 = !DILocation(line: 283, column: 70, scope: !704)
!711 = !DILocation(line: 283, column: 74, scope: !704)
!712 = !DILocation(line: 283, column: 68, scope: !704)
!713 = !DILocation(line: 283, column: 20, scope: !249)
!714 = !DILocalVariable(name: "fp", scope: !715, file: !3, line: 284, type: !716)
!715 = distinct !DILexicalBlock(scope: !704, file: !3, line: 283, column: 78)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !718, line: 48, baseType: !719)
!718 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !720, line: 241, size: 1728, elements: !721)
!720 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !742, !743, !744, !745, !749, !750, !751, !755, !758, !760, !761, !762, !763, !764, !768, !769}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !719, file: !720, line: 242, baseType: !151, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !719, file: !720, line: 247, baseType: !106, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !719, file: !720, line: 248, baseType: !106, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !719, file: !720, line: 249, baseType: !106, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !719, file: !720, line: 250, baseType: !106, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !719, file: !720, line: 251, baseType: !106, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !719, file: !720, line: 252, baseType: !106, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !719, file: !720, line: 253, baseType: !106, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !719, file: !720, line: 254, baseType: !106, size: 64, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !719, file: !720, line: 256, baseType: !106, size: 64, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !719, file: !720, line: 257, baseType: !106, size: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !719, file: !720, line: 258, baseType: !106, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !719, file: !720, line: 260, baseType: !735, size: 64, offset: 768)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !720, line: 156, size: 192, elements: !737)
!737 = !{!738, !739, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !736, file: !720, line: 157, baseType: !735, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !736, file: !720, line: 158, baseType: !740, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !736, file: !720, line: 162, baseType: !151, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !719, file: !720, line: 262, baseType: !740, size: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !719, file: !720, line: 264, baseType: !151, size: 32, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !719, file: !720, line: 268, baseType: !151, size: 32, offset: 928)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !719, file: !720, line: 270, baseType: !746, size: 64, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !747, line: 131, baseType: !748)
!747 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!748 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !719, file: !720, line: 274, baseType: !93, size: 16, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !719, file: !720, line: 275, baseType: !96, size: 8, offset: 1040)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !719, file: !720, line: 276, baseType: !752, size: 8, offset: 1048)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 8, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 1)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !719, file: !720, line: 280, baseType: !756, size: 64, offset: 1088)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !720, line: 150, baseType: null)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !719, file: !720, line: 289, baseType: !759, size: 64, offset: 1152)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !747, line: 132, baseType: !748)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !719, file: !720, line: 297, baseType: !87, size: 64, offset: 1216)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !719, file: !720, line: 298, baseType: !87, size: 64, offset: 1280)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !719, file: !720, line: 299, baseType: !87, size: 64, offset: 1344)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !719, file: !720, line: 300, baseType: !87, size: 64, offset: 1408)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !719, file: !720, line: 302, baseType: !765, size: 64, offset: 1472)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !766, line: 62, baseType: !767)
!766 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!767 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !719, file: !720, line: 303, baseType: !151, size: 32, offset: 1536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !719, file: !720, line: 305, baseType: !770, size: 160, offset: 1568)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 160, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 20)
!773 = !DILocation(line: 284, column: 22, scope: !715)
!774 = !DILocalVariable(name: "fip", scope: !715, file: !3, line: 285, type: !261)
!775 = !DILocation(line: 285, column: 30, scope: !715)
!776 = !DILocalVariable(name: "text", scope: !715, file: !3, line: 286, type: !106)
!777 = !DILocation(line: 286, column: 22, scope: !715)
!778 = !DILocalVariable(name: "len", scope: !715, file: !3, line: 287, type: !765)
!779 = !DILocation(line: 287, column: 21, scope: !715)
!780 = !DILocation(line: 289, column: 22, scope: !715)
!781 = !DILocation(line: 290, column: 28, scope: !715)
!782 = !DILocation(line: 290, column: 34, scope: !715)
!783 = !DILocation(line: 290, column: 39, scope: !715)
!784 = !DILocation(line: 290, column: 19, scope: !715)
!785 = !DILocation(line: 290, column: 17, scope: !715)
!786 = !DILocation(line: 292, column: 18, scope: !787)
!787 = distinct !DILexicalBlock(scope: !715, file: !3, line: 292, column: 17)
!788 = !DILocation(line: 292, column: 17, scope: !715)
!789 = !DILocation(line: 293, column: 17, scope: !787)
!790 = !DILocation(line: 295, column: 17, scope: !791)
!791 = distinct !DILexicalBlock(scope: !715, file: !3, line: 295, column: 17)
!792 = !DILocation(line: 295, column: 22, scope: !791)
!793 = !DILocation(line: 295, column: 33, scope: !791)
!794 = !DILocation(line: 295, column: 17, scope: !715)
!795 = !DILocation(line: 296, column: 26, scope: !796)
!796 = distinct !DILexicalBlock(scope: !791, file: !3, line: 295, column: 48)
!797 = !DILocation(line: 298, column: 52, scope: !796)
!798 = !DILocation(line: 298, column: 57, scope: !796)
!799 = !DILocation(line: 296, column: 17, scope: !796)
!800 = !DILocation(line: 299, column: 17, scope: !796)
!801 = !DILocation(line: 302, column: 22, scope: !715)
!802 = !DILocation(line: 303, column: 25, scope: !715)
!803 = !DILocation(line: 303, column: 30, scope: !715)
!804 = !DILocation(line: 303, column: 18, scope: !715)
!805 = !DILocation(line: 303, column: 16, scope: !715)
!806 = !DILocation(line: 304, column: 16, scope: !807)
!807 = distinct !DILexicalBlock(scope: !715, file: !3, line: 304, column: 16)
!808 = !DILocation(line: 304, column: 19, scope: !807)
!809 = !DILocation(line: 304, column: 16, scope: !715)
!810 = !DILocation(line: 305, column: 25, scope: !811)
!811 = distinct !DILexicalBlock(scope: !807, file: !3, line: 304, column: 28)
!812 = !DILocation(line: 305, column: 30, scope: !811)
!813 = !DILocation(line: 305, column: 17, scope: !811)
!814 = !DILocation(line: 306, column: 17, scope: !811)
!815 = !DILocation(line: 309, column: 29, scope: !715)
!816 = !DILocation(line: 309, column: 18, scope: !715)
!817 = !DILocation(line: 310, column: 26, scope: !715)
!818 = !DILocation(line: 310, column: 43, scope: !715)
!819 = !DILocation(line: 310, column: 19, scope: !715)
!820 = !DILocation(line: 310, column: 17, scope: !715)
!821 = !DILocation(line: 311, column: 13, scope: !715)
!822 = !DILocation(line: 311, column: 18, scope: !715)
!823 = !DILocation(line: 311, column: 23, scope: !715)
!824 = !DILocation(line: 313, column: 21, scope: !715)
!825 = !DILocation(line: 313, column: 13, scope: !715)
!826 = !DILocation(line: 315, column: 30, scope: !827)
!827 = distinct !DILexicalBlock(scope: !715, file: !3, line: 315, column: 16)
!828 = !DILocation(line: 315, column: 36, scope: !827)
!829 = !DILocation(line: 315, column: 41, scope: !827)
!830 = !DILocation(line: 315, column: 52, scope: !827)
!831 = !DILocation(line: 315, column: 16, scope: !827)
!832 = !DILocation(line: 315, column: 59, scope: !827)
!833 = !DILocation(line: 315, column: 16, scope: !715)
!834 = !DILocation(line: 316, column: 25, scope: !835)
!835 = distinct !DILexicalBlock(scope: !827, file: !3, line: 315, column: 65)
