; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type opaque
%struct.rasterfile = type { [4 x i8], i64, i64, i64, i64, i64, i64, i64 }

@.str = private unnamed_addr constant [6 x i8] c"c:r:h\00", align 1
@optarg = external global i8*, align 8
@optind = external global i32, align 4
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [19 x i8] c"%s: Can not open.\0A\00", align 1
@.str.3 = private unnamed_addr constant [26 x i8] c"%s: Can not read header.\0A\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"Y\A6j\95\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"\95j\A6Y\00", align 1
@.str.6 = private unnamed_addr constant [23 x i8] c"%s: Not a rasterfile.\0A\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.8 = private unnamed_addr constant [31 x i8] c"No space to read in colormap.\0A\00", align 1
@.str.9 = private unnamed_addr constant [29 x i8] c"%s: Read error on colormap.\0A\00", align 1

!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !24, !25, !26, !28, !29, !31, !30}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !23, line: 75, baseType: !7)
!23 = !DIFile(filename: "../libtiff/tiff.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !23, line: 72, baseType: !30)
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !{!33, !0, !40, !42, !44}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 273, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, elements: !38)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !{!39}
!39 = !DISubrange(count: 20)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "jpegcolormode", scope: !2, file: !3, line: 52, type: !31, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "quality", scope: !2, file: !3, line: 53, type: !31, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "predictor", scope: !2, file: !3, line: 54, type: !29, isLocal: true, isDefinition: true)
!46 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!47 = !{i32 2, !"Dwarf Version", i32 4}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = !{i32 1, !"wchar_size", i32 4}
!50 = !{i32 7, !"PIC Level", i32 2}
!51 = !{i32 1, !"ThinLTO", i32 0}
!52 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!53 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 60, type: !54, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!54 = !DISubroutineType(types: !55)
!55 = !{!31, !31, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!57 = !{}
!58 = !DILocalVariable(name: "argc", arg: 1, scope: !53, file: !3, line: 60, type: !31)
!59 = !DILocation(line: 60, column: 10, scope: !53)
!60 = !DILocalVariable(name: "argv", arg: 2, scope: !53, file: !3, line: 60, type: !56)
!61 = !DILocation(line: 60, column: 22, scope: !53)
!62 = !DILocalVariable(name: "buf", scope: !53, file: !3, line: 62, type: !26)
!63 = !DILocation(line: 62, column: 17, scope: !53)
!64 = !DILocalVariable(name: "row", scope: !53, file: !3, line: 63, type: !65)
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DILocation(line: 63, column: 7, scope: !53)
!67 = !DILocalVariable(name: "linebytes", scope: !53, file: !3, line: 64, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !69, line: 77, baseType: !70)
!69 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !69, line: 67, baseType: !65)
!71 = !DILocation(line: 64, column: 10, scope: !53)
!72 = !DILocalVariable(name: "scanline", scope: !53, file: !3, line: 64, type: !68)
!73 = !DILocation(line: 64, column: 21, scope: !53)
!74 = !DILocalVariable(name: "out", scope: !53, file: !3, line: 65, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !69, line: 40, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !69, line: 40, flags: DIFlagFwdDecl)
!78 = !DILocation(line: 65, column: 8, scope: !53)
!79 = !DILocalVariable(name: "in", scope: !53, file: !3, line: 66, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 48, baseType: !83)
!82 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 241, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !106, !107, !108, !109, !112, !113, !115, !119, !122, !124, !125, !126, !127, !128, !132, !133}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 242, baseType: !31, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 247, baseType: !36, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 248, baseType: !36, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 249, baseType: !36, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 250, baseType: !36, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 251, baseType: !36, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 252, baseType: !36, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 253, baseType: !36, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 254, baseType: !36, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 256, baseType: !36, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 257, baseType: !36, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 258, baseType: !36, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 260, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 156, size: 192, elements: !101)
!101 = !{!102, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !100, file: !84, line: 157, baseType: !99, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !100, file: !84, line: 158, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !100, file: !84, line: 162, baseType: !31, size: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 262, baseType: !104, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 264, baseType: !31, size: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 268, baseType: !31, size: 32, offset: 928)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 270, baseType: !110, size: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 131, baseType: !65)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 274, baseType: !30, size: 16, offset: 1024)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 275, baseType: !114, size: 8, offset: 1040)
!114 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 276, baseType: !116, size: 8, offset: 1048)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 280, baseType: !120, size: 64, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 150, baseType: null)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 289, baseType: !123, size: 64, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 132, baseType: !65)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !83, file: !84, line: 297, baseType: !24, size: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !83, file: !84, line: 298, baseType: !24, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !83, file: !84, line: 299, baseType: !24, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !83, file: !84, line: 300, baseType: !24, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 302, baseType: !129, size: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 62, baseType: !131)
!130 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!131 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 303, baseType: !31, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 305, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !38)
!135 = !DILocation(line: 66, column: 8, scope: !53)
!136 = !DILocalVariable(name: "h", scope: !53, file: !3, line: 67, type: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rasterfile", file: !138, line: 6, size: 512, elements: !139)
!138 = !DIFile(filename: "./rasterfile.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!139 = !{!140, !144, !145, !146, !147, !148, !149, !150}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ras_magic", scope: !137, file: !138, line: 7, baseType: !141, size: 32)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ras_width", scope: !137, file: !138, line: 8, baseType: !65, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ras_height", scope: !137, file: !138, line: 9, baseType: !65, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ras_depth", scope: !137, file: !138, line: 10, baseType: !65, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ras_length", scope: !137, file: !138, line: 11, baseType: !65, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ras_type", scope: !137, file: !138, line: 12, baseType: !65, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ras_maptype", scope: !137, file: !138, line: 13, baseType: !65, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ras_maplength", scope: !137, file: !138, line: 14, baseType: !65, size: 64, offset: 448)
!151 = !DILocation(line: 67, column: 20, scope: !53)
!152 = !DILocalVariable(name: "photometric", scope: !53, file: !3, line: 68, type: !29)
!153 = !DILocation(line: 68, column: 9, scope: !53)
!154 = !DILocalVariable(name: "config", scope: !53, file: !3, line: 69, type: !29)
!155 = !DILocation(line: 69, column: 9, scope: !53)
!156 = !DILocalVariable(name: "rowsperstrip", scope: !53, file: !3, line: 70, type: !22)
!157 = !DILocation(line: 70, column: 9, scope: !53)
!158 = !DILocalVariable(name: "c", scope: !53, file: !3, line: 71, type: !31)
!159 = !DILocation(line: 71, column: 6, scope: !53)
!160 = !DILocation(line: 75, column: 2, scope: !53)
!161 = !DILocation(line: 75, column: 21, scope: !53)
!162 = !DILocation(line: 75, column: 27, scope: !53)
!163 = !DILocation(line: 75, column: 14, scope: !53)
!164 = !DILocation(line: 75, column: 12, scope: !53)
!165 = !DILocation(line: 75, column: 43, scope: !53)
!166 = !DILocation(line: 76, column: 11, scope: !53)
!167 = !DILocation(line: 76, column: 3, scope: !53)
!168 = !DILocation(line: 78, column: 32, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 78, column: 8)
!170 = distinct !DILexicalBlock(scope: !53, file: !3, line: 76, column: 14)
!171 = !DILocation(line: 78, column: 9, scope: !169)
!172 = !DILocation(line: 78, column: 8, scope: !170)
!173 = !DILocation(line: 79, column: 5, scope: !169)
!174 = !DILocation(line: 80, column: 4, scope: !170)
!175 = !DILocation(line: 82, column: 24, scope: !170)
!176 = !DILocation(line: 82, column: 19, scope: !170)
!177 = !DILocation(line: 82, column: 17, scope: !170)
!178 = !DILocation(line: 83, column: 4, scope: !170)
!179 = !DILocation(line: 85, column: 4, scope: !170)
!180 = !DILocation(line: 87, column: 3, scope: !170)
!181 = distinct !{!181, !160, !182}
!182 = !DILocation(line: 87, column: 3, scope: !53)
!183 = !DILocation(line: 88, column: 6, scope: !184)
!184 = distinct !DILexicalBlock(scope: !53, file: !3, line: 88, column: 6)
!185 = !DILocation(line: 88, column: 13, scope: !184)
!186 = !DILocation(line: 88, column: 11, scope: !184)
!187 = !DILocation(line: 88, column: 20, scope: !184)
!188 = !DILocation(line: 88, column: 6, scope: !53)
!189 = !DILocation(line: 89, column: 3, scope: !184)
!190 = !DILocation(line: 90, column: 13, scope: !53)
!191 = !DILocation(line: 90, column: 18, scope: !53)
!192 = !DILocation(line: 90, column: 7, scope: !53)
!193 = !DILocation(line: 90, column: 5, scope: !53)
!194 = !DILocation(line: 91, column: 6, scope: !195)
!195 = distinct !DILexicalBlock(scope: !53, file: !3, line: 91, column: 6)
!196 = !DILocation(line: 91, column: 9, scope: !195)
!197 = !DILocation(line: 91, column: 6, scope: !53)
!198 = !DILocation(line: 92, column: 11, scope: !199)
!199 = distinct !DILexicalBlock(scope: !195, file: !3, line: 91, column: 18)
!200 = !DILocation(line: 92, column: 42, scope: !199)
!201 = !DILocation(line: 92, column: 47, scope: !199)
!202 = !DILocation(line: 92, column: 3, scope: !199)
!203 = !DILocation(line: 93, column: 3, scope: !199)
!204 = !DILocation(line: 95, column: 12, scope: !205)
!205 = distinct !DILexicalBlock(scope: !53, file: !3, line: 95, column: 6)
!206 = !DILocation(line: 95, column: 31, scope: !205)
!207 = !DILocation(line: 95, column: 6, scope: !205)
!208 = !DILocation(line: 95, column: 35, scope: !205)
!209 = !DILocation(line: 95, column: 6, scope: !53)
!210 = !DILocation(line: 96, column: 11, scope: !211)
!211 = distinct !DILexicalBlock(scope: !205, file: !3, line: 95, column: 41)
!212 = !DILocation(line: 96, column: 49, scope: !211)
!213 = !DILocation(line: 96, column: 54, scope: !211)
!214 = !DILocation(line: 96, column: 3, scope: !211)
!215 = !DILocation(line: 97, column: 10, scope: !211)
!216 = !DILocation(line: 97, column: 3, scope: !211)
!217 = !DILocation(line: 98, column: 3, scope: !211)
!218 = !DILocation(line: 100, column: 15, scope: !219)
