; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!54 = !DIEnumerator(name: "TIFF_SETGET_C0_DOUBLE", value: 25, isUnsigned: true)
!55 = !DIEnumerator(name: "TIFF_SETGET_C0_IFD8", value: 26, isUnsigned: true)
!56 = !DIEnumerator(name: "TIFF_SETGET_C16_ASCII", value: 27, isUnsigned: true)
!57 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT8", value: 28, isUnsigned: true)
!58 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT8", value: 29, isUnsigned: true)
!59 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT16", value: 30, isUnsigned: true)
!60 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT16", value: 31, isUnsigned: true)
!61 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT32", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT32", value: 33, isUnsigned: true)
!63 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT64", value: 34, isUnsigned: true)
!64 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT64", value: 35, isUnsigned: true)
!65 = !DIEnumerator(name: "TIFF_SETGET_C16_FLOAT", value: 36, isUnsigned: true)
!66 = !DIEnumerator(name: "TIFF_SETGET_C16_DOUBLE", value: 37, isUnsigned: true)
!67 = !DIEnumerator(name: "TIFF_SETGET_C16_IFD8", value: 38, isUnsigned: true)
!68 = !DIEnumerator(name: "TIFF_SETGET_C32_ASCII", value: 39, isUnsigned: true)
!69 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT8", value: 40, isUnsigned: true)
!70 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT8", value: 41, isUnsigned: true)
!71 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT16", value: 42, isUnsigned: true)
!72 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT16", value: 43, isUnsigned: true)
!73 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT32", value: 44, isUnsigned: true)
!74 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT32", value: 45, isUnsigned: true)
!75 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT64", value: 46, isUnsigned: true)
!76 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT64", value: 47, isUnsigned: true)
!77 = !DIEnumerator(name: "TIFF_SETGET_C32_FLOAT", value: 48, isUnsigned: true)
!78 = !DIEnumerator(name: "TIFF_SETGET_C32_DOUBLE", value: 49, isUnsigned: true)
!79 = !DIEnumerator(name: "TIFF_SETGET_C32_IFD8", value: 50, isUnsigned: true)
!80 = !DIEnumerator(name: "TIFF_SETGET_OTHER", value: 51, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 263, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "tfiatImage", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "tfiatExif", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "tfiatOther", value: 2, isUnsigned: true)
!86 = !{!87, !88, !92, !94, !95, !96, !98, !99}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdir_t", file: !89, line: 72, baseType: !90)
!89 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !6, line: 72, baseType: !91)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !6, line: 75, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsample_t", file: !89, line: 73, baseType: !90)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !89, line: 67, baseType: !97)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!100 = !{!101, !0, !108, !111, !113, !115, !117, !132}
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 164, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1024, elements: !106)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!106 = !{!107}
!107 = !DISubrange(count: 16)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "readdata", scope: !2, file: !3, line: 52, type: !110, isLocal: true, isDefinition: true)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "stoponerr", scope: !2, file: !3, line: 53, type: !110, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "rawdata", scope: !2, file: !3, line: 50, type: !110, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "showwords", scope: !2, file: !3, line: 51, type: !110, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "old_error_handler", scope: !2, file: !3, line: 47, type: !119, isLocal: true, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFErrorHandler", file: !89, line: 273, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123, !123, !125}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 71, size: 192, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !126, file: !3, line: 71, baseType: !7, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !126, file: !3, line: 71, baseType: !7, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !126, file: !3, line: 71, baseType: !87, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !126, file: !3, line: 71, baseType: !87, size: 64, offset: 128)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "status", scope: !2, file: !3, line: 48, type: !110, isLocal: true, isDefinition: true)
!134 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!135 = !{i32 2, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{i32 7, !"PIC Level", i32 2}
!139 = !{i32 1, !"ThinLTO", i32 0}
!140 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!141 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 67, type: !142, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !145)
!142 = !DISubroutineType(types: !143)
!143 = !{!110, !110, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!145 = !{}
!146 = !DILocalVariable(name: "argc", arg: 1, scope: !141, file: !3, line: 67, type: !110)
!147 = !DILocation(line: 67, column: 10, scope: !141)
!148 = !DILocalVariable(name: "argv", arg: 2, scope: !141, file: !3, line: 67, type: !144)
!149 = !DILocation(line: 67, column: 22, scope: !141)
!150 = !DILocalVariable(name: "dirnum", scope: !141, file: !3, line: 69, type: !110)
!151 = !DILocation(line: 69, column: 6, scope: !141)
!152 = !DILocalVariable(name: "multiplefiles", scope: !141, file: !3, line: 69, type: !110)
!153 = !DILocation(line: 69, column: 19, scope: !141)
!154 = !DILocalVariable(name: "c", scope: !141, file: !3, line: 69, type: !110)
!155 = !DILocation(line: 69, column: 34, scope: !141)
!156 = !DILocalVariable(name: "order", scope: !141, file: !3, line: 70, type: !90)
!157 = !DILocation(line: 70, column: 9, scope: !141)
!158 = !DILocalVariable(name: "tif", scope: !141, file: !3, line: 71, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !89, line: 40, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !162, line: 97, size: 8640, elements: !163)
!162 = !DIFile(filename: "../libtiff/tiffiop.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!163 = !{!164, !165, !166, !167, !168, !170, !171, !173, !174, !175, !276, !277, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !319, !320, !325, !326, !327, !328, !329, !336, !337, !338, !339, !340, !341, !346, !351, !352, !357, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !383, !388, !389, !394, !395, !400, !405, !410, !415, !417, !420, !421, !491, !500, !501}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !161, file: !162, line: 98, baseType: !104, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !161, file: !162, line: 99, baseType: !110, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !161, file: !162, line: 100, baseType: !110, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !161, file: !162, line: 101, baseType: !94, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !161, file: !162, line: 124, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !6, line: 78, baseType: !98)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !161, file: !162, line: 125, baseType: !169, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlist", scope: !161, file: !162, line: 126, baseType: !172, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlistsize", scope: !161, file: !162, line: 127, baseType: !90, size: 16, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirnumber", scope: !161, file: !162, line: 128, baseType: !90, size: 16, offset: 400)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !161, file: !162, line: 129, baseType: !176, size: 2240, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !27, line: 119, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 64, size: 2240, elements: !178)
!178 = !{!179, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !204, !205, !207, !208, !209, !210, !211, !212, !216, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !235, !236, !237, !238}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !177, file: !27, line: 67, baseType: !180, size: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 4)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !177, file: !27, line: 69, baseType: !94, size: 32, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !177, file: !27, line: 69, baseType: !94, size: 32, offset: 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !177, file: !27, line: 69, baseType: !94, size: 32, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !177, file: !27, line: 70, baseType: !94, size: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !177, file: !27, line: 70, baseType: !94, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !177, file: !27, line: 70, baseType: !94, size: 32, offset: 416)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !177, file: !27, line: 71, baseType: !94, size: 32, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !177, file: !27, line: 72, baseType: !90, size: 16, offset: 480)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !177, file: !27, line: 73, baseType: !90, size: 16, offset: 496)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !177, file: !27, line: 74, baseType: !90, size: 16, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !177, file: !27, line: 75, baseType: !90, size: 16, offset: 528)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !177, file: !27, line: 76, baseType: !90, size: 16, offset: 544)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !177, file: !27, line: 77, baseType: !90, size: 16, offset: 560)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !177, file: !27, line: 78, baseType: !90, size: 16, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !177, file: !27, line: 79, baseType: !90, size: 16, offset: 592)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !177, file: !27, line: 80, baseType: !94, size: 32, offset: 608)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !177, file: !27, line: 81, baseType: !90, size: 16, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !177, file: !27, line: 81, baseType: !90, size: 16, offset: 656)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !177, file: !27, line: 82, baseType: !202, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !177, file: !27, line: 83, baseType: !202, size: 64, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !177, file: !27, line: 84, baseType: !206, size: 32, offset: 832)
!206 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !177, file: !27, line: 84, baseType: !206, size: 32, offset: 864)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !177, file: !27, line: 85, baseType: !90, size: 16, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !177, file: !27, line: 86, baseType: !90, size: 16, offset: 912)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !177, file: !27, line: 87, baseType: !206, size: 32, offset: 928)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !177, file: !27, line: 87, baseType: !206, size: 32, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !177, file: !27, line: 88, baseType: !213, size: 32, offset: 992)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 32, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 2)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !177, file: !27, line: 89, baseType: !217, size: 192, offset: 1024)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 192, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 3)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !177, file: !27, line: 90, baseType: !213, size: 32, offset: 1216)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !177, file: !27, line: 91, baseType: !90, size: 16, offset: 1248)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !177, file: !27, line: 92, baseType: !99, size: 64, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !177, file: !27, line: 96, baseType: !94, size: 32, offset: 1344)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !177, file: !27, line: 97, baseType: !94, size: 32, offset: 1376)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !177, file: !27, line: 98, baseType: !172, size: 64, offset: 1408)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !177, file: !27, line: 99, baseType: !172, size: 64, offset: 1472)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecountsorted", scope: !177, file: !27, line: 100, baseType: !110, size: 32, offset: 1536)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !177, file: !27, line: 105, baseType: !90, size: 16, offset: 1568)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !177, file: !27, line: 106, baseType: !172, size: 64, offset: 1600)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !177, file: !27, line: 108, baseType: !213, size: 32, offset: 1664)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !177, file: !27, line: 109, baseType: !90, size: 16, offset: 1696)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !177, file: !27, line: 111, baseType: !217, size: 192, offset: 1728)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !177, file: !27, line: 112, baseType: !234, size: 64, offset: 1920)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !177, file: !27, line: 114, baseType: !110, size: 32, offset: 1984)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !177, file: !27, line: 115, baseType: !104, size: 64, offset: 2048)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValueCount", scope: !177, file: !27, line: 117, baseType: !110, size: 32, offset: 2112)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValues", scope: !177, file: !27, line: 118, baseType: !239, size: 64, offset: 2176)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagValue", file: !27, line: 37, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 33, size: 192, elements: !242)
!242 = !{!243, !274, !275}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !241, file: !27, line: 34, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFField", file: !89, line: 320, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFField", file: !27, line: 276, size: 384, elements: !248)
!248 = !{!249, !250, !252, !253, !255, !256, !258, !259, !260, !261, !262, !263}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !247, file: !27, line: 277, baseType: !94, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !247, file: !27, line: 278, baseType: !251, size: 16, offset: 32)
!251 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !247, file: !27, line: 279, baseType: !251, size: 16, offset: 48)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !247, file: !27, line: 280, baseType: !254, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !6, line: 143, baseType: !5)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !247, file: !27, line: 281, baseType: !94, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "set_field_type", scope: !247, file: !27, line: 282, baseType: !257, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSetGetFieldType", file: !27, line: 250, baseType: !26)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "get_field_type", scope: !247, file: !27, line: 283, baseType: !257, size: 32, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !247, file: !27, line: 284, baseType: !91, size: 16, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !247, file: !27, line: 285, baseType: !93, size: 8, offset: 208)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !247, file: !27, line: 286, baseType: !93, size: 8, offset: 216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !247, file: !27, line: 287, baseType: !104, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "field_subfields", scope: !247, file: !27, line: 288, baseType: !264, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArray", file: !89, line: 321, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFFieldArray", file: !27, line: 269, size: 192, elements: !267)
!267 = !{!268, !270, !271, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !27, line: 270, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArrayType", file: !27, line: 267, baseType: !81)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !266, file: !27, line: 271, baseType: !94, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !266, file: !27, line: 272, baseType: !94, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !266, file: !27, line: 273, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !241, file: !27, line: 35, baseType: !110, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !27, line: 36, baseType: !87, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tif_customdir", scope: !161, file: !162, line: 130, baseType: !176, size: 2240, offset: 2688)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !161, file: !162, line: 135, baseType: !278, size: 128, offset: 4928)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !162, line: 131, size: 128, elements: !279)
!279 = !{!280, !286, !293}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !278, file: !162, line: 132, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderCommon", file: !6, line: 96, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 93, size: 32, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !282, file: !6, line: 94, baseType: !90, size: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !282, file: !6, line: 95, baseType: !90, size: 16, offset: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "classic", scope: !278, file: !162, line: 133, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderClassic", file: !6, line: 101, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 97, size: 64, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !288, file: !6, line: 98, baseType: !90, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !288, file: !6, line: 99, baseType: !90, size: 16, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !288, file: !6, line: 100, baseType: !94, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "big", scope: !278, file: !162, line: 134, baseType: !294, size: 128)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderBig", file: !6, line: 108, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 102, size: 128, elements: !296)
!296 = !{!297, !298, !299, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !295, file: !6, line: 103, baseType: !90, size: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !295, file: !6, line: 104, baseType: !90, size: 16, offset: 16)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_offsetsize", scope: !295, file: !6, line: 105, baseType: !90, size: 16, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_unused", scope: !295, file: !6, line: 106, baseType: !90, size: 16, offset: 48)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !295, file: !6, line: 107, baseType: !169, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header_size", scope: !161, file: !162, line: 136, baseType: !90, size: 16, offset: 5056)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !161, file: !162, line: 137, baseType: !94, size: 32, offset: 5088)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !161, file: !162, line: 138, baseType: !90, size: 16, offset: 5120)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !161, file: !162, line: 139, baseType: !94, size: 32, offset: 5152)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !161, file: !162, line: 140, baseType: !169, size: 64, offset: 5184)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !161, file: !162, line: 141, baseType: !169, size: 64, offset: 5248)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !161, file: !162, line: 143, baseType: !90, size: 16, offset: 5312)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !161, file: !162, line: 144, baseType: !169, size: 64, offset: 5376)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !161, file: !162, line: 146, baseType: !94, size: 32, offset: 5440)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !161, file: !162, line: 147, baseType: !94, size: 32, offset: 5472)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !161, file: !162, line: 148, baseType: !96, size: 64, offset: 5504)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestatus", scope: !161, file: !162, line: 150, baseType: !110, size: 32, offset: 5568)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fixuptags", scope: !161, file: !162, line: 151, baseType: !315, size: 64, offset: 5632)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !162, line: 89, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!110, !159}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !161, file: !162, line: 152, baseType: !315, size: 64, offset: 5696)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !161, file: !162, line: 153, baseType: !321, size: 64, offset: 5760)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !162, line: 90, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!110, !159, !90}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !161, file: !162, line: 154, baseType: !315, size: 64, offset: 5824)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestatus", scope: !161, file: !162, line: 155, baseType: !110, size: 32, offset: 5888)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !161, file: !162, line: 156, baseType: !321, size: 64, offset: 5952)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !161, file: !162, line: 157, baseType: !315, size: 64, offset: 6016)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !161, file: !162, line: 158, baseType: !330, size: 64, offset: 6080)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !162, line: 91, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!110, !159, !334, !96, !90}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !6, line: 69, baseType: !93)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !161, file: !162, line: 159, baseType: !330, size: 64, offset: 6144)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !161, file: !162, line: 160, baseType: !330, size: 64, offset: 6208)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !161, file: !162, line: 161, baseType: !330, size: 64, offset: 6272)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !161, file: !162, line: 162, baseType: !330, size: 64, offset: 6336)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !161, file: !162, line: 163, baseType: !330, size: 64, offset: 6400)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !161, file: !162, line: 164, baseType: !342, size: 64, offset: 6464)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !162, line: 88, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !159}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !161, file: !162, line: 165, baseType: !347, size: 64, offset: 6528)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !162, line: 92, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!110, !159, !94}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !161, file: !162, line: 166, baseType: !342, size: 64, offset: 6592)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !161, file: !162, line: 167, baseType: !353, size: 64, offset: 6656)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !162, line: 94, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!94, !159, !94}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !161, file: !162, line: 168, baseType: !358, size: 64, offset: 6720)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !162, line: 95, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !159, !362, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !161, file: !162, line: 169, baseType: !334, size: 64, offset: 6784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !161, file: !162, line: 171, baseType: !96, size: 64, offset: 6848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !161, file: !162, line: 172, baseType: !96, size: 64, offset: 6912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !161, file: !162, line: 173, baseType: !334, size: 64, offset: 6976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !161, file: !162, line: 174, baseType: !96, size: 64, offset: 7040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataoff", scope: !161, file: !162, line: 175, baseType: !96, size: 64, offset: 7104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataloaded", scope: !161, file: !162, line: 176, baseType: !96, size: 64, offset: 7168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !161, file: !162, line: 177, baseType: !334, size: 64, offset: 7232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !161, file: !162, line: 178, baseType: !96, size: 64, offset: 7296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !161, file: !162, line: 180, baseType: !334, size: 64, offset: 7360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !161, file: !162, line: 181, baseType: !96, size: 64, offset: 7424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !161, file: !162, line: 182, baseType: !375, size: 64, offset: 7488)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !89, line: 279, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!110, !379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !89, line: 106, baseType: !87)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !89, line: 68, baseType: !169)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !161, file: !162, line: 183, baseType: !384, size: 64, offset: 7552)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !89, line: 280, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !379, !87, !382}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !161, file: !162, line: 185, baseType: !379, size: 64, offset: 7616)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !161, file: !162, line: 186, baseType: !390, size: 64, offset: 7680)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !89, line: 275, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!96, !379, !87, !96}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !161, file: !162, line: 187, baseType: !390, size: 64, offset: 7744)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !161, file: !162, line: 188, baseType: !396, size: 64, offset: 7808)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !89, line: 276, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!382, !379, !382, !110}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !161, file: !162, line: 189, baseType: !401, size: 64, offset: 7872)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !89, line: 277, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!110, !379}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !161, file: !162, line: 190, baseType: !406, size: 64, offset: 7936)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !89, line: 278, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!382, !379}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !161, file: !162, line: 192, baseType: !411, size: 64, offset: 8000)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !162, line: 93, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !159, !334, !96}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fields", scope: !161, file: !162, line: 194, baseType: !416, size: 64, offset: 8064)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !161, file: !162, line: 195, baseType: !418, size: 64, offset: 8128)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !419, line: 62, baseType: !98)
!419 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tif_foundfield", scope: !161, file: !162, line: 196, baseType: !244, size: 64, offset: 8192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tagmethods", scope: !161, file: !162, line: 197, baseType: !422, size: 192, offset: 8256)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagMethods", file: !89, line: 335, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 331, size: 192, elements: !424)
!424 = !{!425, !430, !432}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vsetfield", scope: !423, file: !89, line: 332, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !89, line: 327, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!110, !159, !94, !125}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vgetfield", scope: !423, file: !89, line: 333, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !89, line: 328, baseType: !427)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "printdir", scope: !423, file: !89, line: 334, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !89, line: 329, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !159, !437, !97}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !439, line: 48, baseType: !440)
!439 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !441, line: 241, size: 1728, elements: !442)
!441 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !463, !464, !465, !466, !469, !470, !472, !476, !479, !481, !482, !483, !484, !485, !486, !487}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !440, file: !441, line: 242, baseType: !110, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !440, file: !441, line: 247, baseType: !104, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !440, file: !441, line: 248, baseType: !104, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !440, file: !441, line: 249, baseType: !104, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !440, file: !441, line: 250, baseType: !104, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !440, file: !441, line: 251, baseType: !104, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !440, file: !441, line: 252, baseType: !104, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !440, file: !441, line: 253, baseType: !104, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !440, file: !441, line: 254, baseType: !104, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !440, file: !441, line: 256, baseType: !104, size: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !440, file: !441, line: 257, baseType: !104, size: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !440, file: !441, line: 258, baseType: !104, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !440, file: !441, line: 260, baseType: !456, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !441, line: 156, size: 192, elements: !458)
!458 = !{!459, !460, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !457, file: !441, line: 157, baseType: !456, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !457, file: !441, line: 158, baseType: !461, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !457, file: !441, line: 162, baseType: !110, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !440, file: !441, line: 262, baseType: !461, size: 64, offset: 832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !440, file: !441, line: 264, baseType: !110, size: 32, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !440, file: !441, line: 268, baseType: !110, size: 32, offset: 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !440, file: !441, line: 270, baseType: !467, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !468, line: 131, baseType: !97)
!468 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !440, file: !441, line: 274, baseType: !91, size: 16, offset: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !440, file: !441, line: 275, baseType: !471, size: 8, offset: 1040)
!471 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !440, file: !441, line: 276, baseType: !473, size: 8, offset: 1048)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 8, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 1)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !440, file: !441, line: 280, baseType: !477, size: 64, offset: 1088)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !441, line: 150, baseType: null)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !440, file: !441, line: 289, baseType: !480, size: 64, offset: 1152)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !468, line: 132, baseType: !97)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !440, file: !441, line: 297, baseType: !87, size: 64, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !440, file: !441, line: 298, baseType: !87, size: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !440, file: !441, line: 299, baseType: !87, size: 64, offset: 1344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !440, file: !441, line: 300, baseType: !87, size: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !440, file: !441, line: 302, baseType: !418, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !440, file: !441, line: 303, baseType: !110, size: 32, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !440, file: !441, line: 305, baseType: !488, size: 160, offset: 1568)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 160, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 20)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientinfo", scope: !161, file: !162, line: 198, baseType: !492, size: 64, offset: 8448)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFClientInfoLink", file: !162, line: 79, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client_info", file: !162, line: 75, size: 192, elements: !495)
!495 = !{!496, !498, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !162, line: 76, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !162, line: 77, baseType: !87, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !162, line: 78, baseType: !104, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldscompat", scope: !161, file: !162, line: 201, baseType: !264, size: 64, offset: 8512)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfieldscompat", scope: !161, file: !162, line: 202, baseType: !418, size: 64, offset: 8576)
!502 = !DILocation(line: 71, column: 8, scope: !141)
!503 = !DILocalVariable(name: "flags", scope: !141, file: !3, line: 74, type: !97)
!504 = !DILocation(line: 74, column: 7, scope: !141)
!505 = !DILocalVariable(name: "diroff", scope: !141, file: !3, line: 75, type: !169)
!506 = !DILocation(line: 75, column: 9, scope: !141)
!507 = !DILocalVariable(name: "chopstrips", scope: !141, file: !3, line: 76, type: !110)
!508 = !DILocation(line: 76, column: 6, scope: !141)
!509 = !DILocation(line: 78, column: 2, scope: !141)
!510 = !DILocation(line: 78, column: 21, scope: !141)
!511 = !DILocation(line: 78, column: 27, scope: !141)
!512 = !DILocation(line: 78, column: 14, scope: !141)
!513 = !DILocation(line: 78, column: 12, scope: !141)
!514 = !DILocation(line: 78, column: 65, scope: !141)
!515 = !DILocation(line: 79, column: 11, scope: !141)
!516 = !DILocation(line: 79, column: 3, scope: !141)
!517 = !DILocation(line: 83, column: 19, scope: !518)
!518 = distinct !DILexicalBlock(scope: !141, file: !3, line: 79, column: 14)
!519 = !DILocation(line: 83, column: 24, scope: !518)
!520 = !DILocation(line: 83, column: 30, scope: !518)
!521 = !DILocation(line: 83, column: 13, scope: !518)
!522 = !DILocation(line: 83, column: 11, scope: !518)
!523 = !DILocation(line: 84, column: 4, scope: !518)
!524 = !DILocation(line: 86, column: 12, scope: !518)
!525 = !DILocation(line: 86, column: 4, scope: !518)
!526 = !DILocation(line: 89, column: 12, scope: !518)
!527 = !DILocation(line: 90, column: 4, scope: !518)
!528 = !DILocation(line: 92, column: 10, scope: !518)
!529 = !DILocation(line: 93, column: 4, scope: !518)
!530 = !DILocation(line: 95, column: 8, scope: !531)
!531 = distinct !DILexicalBlock(scope: !518, file: !3, line: 95, column: 8)
!532 = !DILocation(line: 95, column: 8, scope: !518)
!533 = !DILocation(line: 96, column: 11, scope: !531)
!534 = !DILocation(line: 96, column: 5, scope: !531)
!535 = !DILocation(line: 97, column: 13, scope: !536)
!536 = distinct !DILexicalBlock(scope: !531, file: !3, line: 97, column: 13)
!537 = !DILocation(line: 97, column: 13, scope: !531)
!538 = !DILocation(line: 98, column: 11, scope: !536)
!539 = !DILocation(line: 98, column: 5, scope: !536)
!540 = !DILocation(line: 100, column: 5, scope: !536)
!541 = !DILocation(line: 101, column: 4, scope: !518)
!542 = !DILocation(line: 103, column: 14, scope: !518)
!543 = !DILocation(line: 104, column: 4, scope: !518)
!544 = !DILocation(line: 106, column: 21, scope: !518)
!545 = !DILocation(line: 106, column: 13, scope: !518)
!546 = !DILocation(line: 106, column: 11, scope: !518)
!547 = !DILocation(line: 107, column: 4, scope: !518)
!548 = !DILocation(line: 109, column: 10, scope: !518)
!549 = !DILocation(line: 112, column: 4, scope: !518)
!550 = !DILocation(line: 114, column: 12, scope: !518)
!551 = !DILocation(line: 115, column: 4, scope: !518)
!552 = !DILocation(line: 117, column: 10, scope: !518)
!553 = !DILocation(line: 118, column: 4, scope: !518)
!554 = !DILocation(line: 120, column: 14, scope: !518)
!555 = !DILocation(line: 121, column: 4, scope: !518)
!556 = !DILocation(line: 123, column: 15, scope: !518)
!557 = !DILocation(line: 124, column: 4, scope: !518)
!558 = !DILocation(line: 126, column: 4, scope: !518)
!559 = !DILocation(line: 128, column: 3, scope: !518)
!560 = distinct !{!560, !509, !561}
!561 = !DILocation(line: 128, column: 3, scope: !141)
!562 = !DILocation(line: 129, column: 6, scope: !563)
!563 = distinct !DILexicalBlock(scope: !141, file: !3, line: 129, column: 6)
!564 = !DILocation(line: 129, column: 16, scope: !563)
!565 = !DILocation(line: 129, column: 13, scope: !563)
!566 = !DILocation(line: 129, column: 6, scope: !141)
!567 = !DILocation(line: 130, column: 3, scope: !563)
!568 = !DILocation(line: 132, column: 22, scope: !141)
!569 = !DILocation(line: 132, column: 20, scope: !141)
