; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type opaque

@stdout = external global %struct._IO_FILE*, align 8
@pageOrientation = common dso_local global [12 x i8] zeroinitializer, align 1, !dbg !0
@.str = private unnamed_addr constant [46 x i8] c"b:d:h:H:W:L:i:w:l:o:O:P:C:r:t:acemxyzps1238DT\00", align 1
@optarg = external global i8*, align 8
@creator = dso_local global i8* null, align 8, !dbg !59
@PSduplex = dso_local global i32 0, align 4, !dbg !38
@interpolate = dso_local global i32 1, align 4, !dbg !28
@PStumble = dso_local global i32 0, align 4, !dbg !40
@PSavoiddeadzone = dso_local global i32 1, align 4, !dbg !42
@generateEPSF = dso_local global i32 1, align 4, !dbg !36
@maxPageHeight = dso_local global double 0.000000e+00, align 8, !dbg !44
@maxPageWidth = dso_local global double 0.000000e+00, align 8, !dbg !47
@splitOverlap = dso_local global double 0.000000e+00, align 8, !dbg !49
@useImagemask = dso_local global i32 0, align 4, !dbg !61
@.str.1 = private unnamed_addr constant [3 x i8] c"-o\00", align 1

!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !11, line: 77, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !11, line: 67, baseType: !15)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrip_t", file: !11, line: 75, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrile_t", file: !11, line: 74, baseType: !6)
!25 = !{!26, !28, !30, !32, !34, !36, !38, !40, !42, !44, !47, !49, !51, !53, !55, !57, !59, !61, !63, !65, !129, !0, !134, !139, !141, !143, !145, !147, !149, !151, !153, !155, !157, !159, !161, !163, !165, !170, !172, !177, !179, !184}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "ascii85", scope: !2, file: !3, line: 174, type: !14, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "interpolate", scope: !2, file: !3, line: 175, type: !14, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "level2", scope: !2, file: !3, line: 176, type: !14, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "level3", scope: !2, file: !3, line: 177, type: !14, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "printAll", scope: !2, file: !3, line: 178, type: !14, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "generateEPSF", scope: !2, file: !3, line: 179, type: !14, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "PSduplex", scope: !2, file: !3, line: 180, type: !14, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "PStumble", scope: !2, file: !3, line: 181, type: !14, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "PSavoiddeadzone", scope: !2, file: !3, line: 182, type: !14, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "maxPageHeight", scope: !2, file: !3, line: 183, type: !46, isLocal: false, isDefinition: true)
!46 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "maxPageWidth", scope: !2, file: !3, line: 184, type: !46, isLocal: false, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "splitOverlap", scope: !2, file: !3, line: 185, type: !46, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "rotation", scope: !2, file: !3, line: 186, type: !14, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "auto_rotate", scope: !2, file: !3, line: 187, type: !14, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "filename", scope: !2, file: !3, line: 188, type: !21, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "title", scope: !2, file: !3, line: 189, type: !21, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "creator", scope: !2, file: !3, line: 190, type: !21, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "useImagemask", scope: !2, file: !3, line: 192, type: !14, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "res_unit", scope: !2, file: !3, line: 193, type: !12, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "npages", scope: !67, file: !3, line: 1474, type: !14, isLocal: true, isDefinition: true)
!67 = distinct !DISubprogram(name: "TIFF2PS", scope: !3, file: !3, line: 1463, type: !68, scopeLine: 1464, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!68 = !DISubroutineType(types: !69)
!69 = !{!14, !70, !126, !46, !46, !46, !46, !14}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !72, line: 48, baseType: !73)
!72 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !74, line: 241, size: 1728, elements: !75)
!74 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !96, !97, !98, !99, !102, !103, !105, !109, !112, !114, !115, !116, !117, !118, !121, !122}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !73, file: !74, line: 242, baseType: !14, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !73, file: !74, line: 247, baseType: !21, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !73, file: !74, line: 248, baseType: !21, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !73, file: !74, line: 249, baseType: !21, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !73, file: !74, line: 250, baseType: !21, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !73, file: !74, line: 251, baseType: !21, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !73, file: !74, line: 252, baseType: !21, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !73, file: !74, line: 253, baseType: !21, size: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !73, file: !74, line: 254, baseType: !21, size: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !73, file: !74, line: 256, baseType: !21, size: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !73, file: !74, line: 257, baseType: !21, size: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !73, file: !74, line: 258, baseType: !21, size: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !73, file: !74, line: 260, baseType: !89, size: 64, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !74, line: 156, size: 192, elements: !91)
!91 = !{!92, !93, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !90, file: !74, line: 157, baseType: !89, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !90, file: !74, line: 158, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !90, file: !74, line: 162, baseType: !14, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !73, file: !74, line: 262, baseType: !94, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !73, file: !74, line: 264, baseType: !14, size: 32, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !73, file: !74, line: 268, baseType: !14, size: 32, offset: 928)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !73, file: !74, line: 270, baseType: !100, size: 64, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !101, line: 131, baseType: !15)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !73, file: !74, line: 274, baseType: !13, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !73, file: !74, line: 275, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !73, file: !74, line: 276, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !73, file: !74, line: 280, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !74, line: 150, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !73, file: !74, line: 289, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !101, line: 132, baseType: !15)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !73, file: !74, line: 297, baseType: !9, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !73, file: !74, line: 298, baseType: !9, size: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !73, file: !74, line: 299, baseType: !9, size: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !73, file: !74, line: 300, baseType: !9, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !73, file: !74, line: 302, baseType: !119, size: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 62, baseType: !20)
!120 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !73, file: !74, line: 303, baseType: !14, size: 32, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !73, file: !74, line: 305, baseType: !123, size: 160, offset: 1568)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 20)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !11, line: 40, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !11, line: 40, flags: DIFlagFwdDecl)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 3026, type: !131, isLocal: false, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 32)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "ascii85buf", scope: !2, file: !3, line: 198, type: !136, isLocal: false, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 80, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 10)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "ascii85count", scope: !2, file: !3, line: 199, type: !14, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "ascii85breaklen", scope: !2, file: !3, line: 200, type: !14, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "samplesperpixel", scope: !2, file: !3, line: 489, type: !12, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "bitspersample", scope: !2, file: !3, line: 490, type: !12, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "planarconfiguration", scope: !2, file: !3, line: 491, type: !12, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "photometric", scope: !2, file: !3, line: 492, type: !12, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "compression", scope: !2, file: !3, line: 493, type: !12, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "extrasamples", scope: !2, file: !3, line: 494, type: !12, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "alpha", scope: !2, file: !3, line: 495, type: !14, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "tf_bytesperrow", scope: !2, file: !3, line: 677, type: !16, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "ps_bytesperrow", scope: !2, file: !3, line: 678, type: !16, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "tf_rowsperstrip", scope: !2, file: !3, line: 679, type: !16, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "tf_numberstrips", scope: !2, file: !3, line: 680, type: !16, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
