; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type opaque

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [23 x i8] c"%s: Too few arguments\0A\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"c:r:R:\00", align 1
@optarg = external global i8*, align 8
@optind = external global i32, align 4
@.str.2 = private unnamed_addr constant [24 x i8] c"%s: Too many arguments\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.4 = private unnamed_addr constant [19 x i8] c"%s: Can not open.\0A\00", align 1
@.str.5 = private unnamed_addr constant [8 x i8] c"<stdin>\00", align 1
@stdin = external global %struct._IO_FILE*, align 8
@compression = internal global i16 -32763, align 2, !dbg !0
@jpegcolormode = internal global i32 1, align 4, !dbg !40
@.str.6 = private unnamed_addr constant [5 x i8] c" \09\0D\0A\00", align 1
@.str.7 = private unnamed_addr constant [3 x i8] c"\0D\0A\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c" %u %u\00", align 1

!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !24, !25, !27, !28, !29}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !23, line: 75, baseType: !7)
!23 = !DIFile(filename: "../libtiff/tiff.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !{!31, !38, !0, !40, !42, !44}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 323, type: !33, isLocal: false, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1280, elements: !36)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !{!37}
!37 = !DISubrange(count: 20)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "g3opts", scope: !2, file: !3, line: 63, type: !22, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "jpegcolormode", scope: !2, file: !3, line: 62, type: !28, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "quality", scope: !2, file: !3, line: 61, type: !28, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "predictor", scope: !2, file: !3, line: 60, type: !46, isLocal: true, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !23, line: 72, baseType: !29)
!47 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!48 = !{i32 2, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{i32 7, !"PIC Level", i32 2}
!52 = !{i32 1, !"ThinLTO", i32 0}
!53 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!54 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 76, type: !55, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !58)
!55 = !DISubroutineType(types: !56)
!56 = !{!28, !28, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!58 = !{}
!59 = !DILocalVariable(name: "argc", arg: 1, scope: !54, file: !3, line: 76, type: !28)
!60 = !DILocation(line: 76, column: 10, scope: !54)
!61 = !DILocalVariable(name: "argv", arg: 2, scope: !54, file: !3, line: 76, type: !57)
!62 = !DILocation(line: 76, column: 22, scope: !54)
!63 = !DILocalVariable(name: "photometric", scope: !54, file: !3, line: 78, type: !46)
!64 = !DILocation(line: 78, column: 9, scope: !54)
!65 = !DILocalVariable(name: "rowsperstrip", scope: !54, file: !3, line: 79, type: !22)
!66 = !DILocation(line: 79, column: 9, scope: !54)
!67 = !DILocalVariable(name: "resolution", scope: !54, file: !3, line: 80, type: !68)
!68 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!69 = !DILocation(line: 80, column: 9, scope: !54)
!70 = !DILocalVariable(name: "buf", scope: !54, file: !3, line: 81, type: !25)
!71 = !DILocation(line: 81, column: 17, scope: !54)
!72 = !DILocalVariable(name: "linebytes", scope: !54, file: !3, line: 82, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !74, line: 77, baseType: !75)
!74 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !74, line: 67, baseType: !76)
!76 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!77 = !DILocation(line: 82, column: 10, scope: !54)
!78 = !DILocalVariable(name: "spp", scope: !54, file: !3, line: 83, type: !46)
!79 = !DILocation(line: 83, column: 9, scope: !54)
!80 = !DILocalVariable(name: "bpp", scope: !54, file: !3, line: 84, type: !46)
!81 = !DILocation(line: 84, column: 9, scope: !54)
!82 = !DILocalVariable(name: "out", scope: !54, file: !3, line: 85, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !74, line: 40, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !74, line: 40, flags: DIFlagFwdDecl)
!86 = !DILocation(line: 85, column: 8, scope: !54)
!87 = !DILocalVariable(name: "in", scope: !54, file: !3, line: 86, type: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !90, line: 48, baseType: !91)
!90 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !92, line: 241, size: 1728, elements: !93)
!92 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !114, !115, !116, !117, !120, !121, !123, !127, !130, !132, !133, !134, !135, !136, !139, !140}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !91, file: !92, line: 242, baseType: !28, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !91, file: !92, line: 247, baseType: !34, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !91, file: !92, line: 248, baseType: !34, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !91, file: !92, line: 249, baseType: !34, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !91, file: !92, line: 250, baseType: !34, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !91, file: !92, line: 251, baseType: !34, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !91, file: !92, line: 252, baseType: !34, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !91, file: !92, line: 253, baseType: !34, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !91, file: !92, line: 254, baseType: !34, size: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !91, file: !92, line: 256, baseType: !34, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !91, file: !92, line: 257, baseType: !34, size: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !91, file: !92, line: 258, baseType: !34, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !91, file: !92, line: 260, baseType: !107, size: 64, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !92, line: 156, size: 192, elements: !109)
!109 = !{!110, !111, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !108, file: !92, line: 157, baseType: !107, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !108, file: !92, line: 158, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !108, file: !92, line: 162, baseType: !28, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !91, file: !92, line: 262, baseType: !112, size: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !91, file: !92, line: 264, baseType: !28, size: 32, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !91, file: !92, line: 268, baseType: !28, size: 32, offset: 928)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !91, file: !92, line: 270, baseType: !118, size: 64, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !119, line: 131, baseType: !76)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !91, file: !92, line: 274, baseType: !29, size: 16, offset: 1024)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !91, file: !92, line: 275, baseType: !122, size: 8, offset: 1040)
!122 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !91, file: !92, line: 276, baseType: !124, size: 8, offset: 1048)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !91, file: !92, line: 280, baseType: !128, size: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !92, line: 150, baseType: null)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !91, file: !92, line: 289, baseType: !131, size: 64, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !119, line: 132, baseType: !76)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !91, file: !92, line: 297, baseType: !24, size: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !91, file: !92, line: 298, baseType: !24, size: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !91, file: !92, line: 299, baseType: !24, size: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !91, file: !92, line: 300, baseType: !24, size: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !91, file: !92, line: 302, baseType: !137, size: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 62, baseType: !27)
!138 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !91, file: !92, line: 303, baseType: !28, size: 32, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !91, file: !92, line: 305, baseType: !141, size: 160, offset: 1568)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !36)
!142 = !DILocation(line: 86, column: 8, scope: !54)
!143 = !DILocalVariable(name: "w", scope: !54, file: !3, line: 87, type: !7)
!144 = !DILocation(line: 87, column: 15, scope: !54)
!145 = !DILocalVariable(name: "h", scope: !54, file: !3, line: 87, type: !7)
!146 = !DILocation(line: 87, column: 18, scope: !54)
!147 = !DILocalVariable(name: "prec", scope: !54, file: !3, line: 87, type: !7)
!148 = !DILocation(line: 87, column: 21, scope: !54)
!149 = !DILocalVariable(name: "row", scope: !54, file: !3, line: 87, type: !7)
!150 = !DILocation(line: 87, column: 27, scope: !54)
!151 = !DILocalVariable(name: "infile", scope: !54, file: !3, line: 88, type: !34)
!152 = !DILocation(line: 88, column: 8, scope: !54)
!153 = !DILocalVariable(name: "c", scope: !54, file: !3, line: 89, type: !28)
!154 = !DILocation(line: 89, column: 6, scope: !54)
!155 = !DILocation(line: 93, column: 6, scope: !156)
!156 = distinct !DILexicalBlock(scope: !54, file: !3, line: 93, column: 6)
!157 = !DILocation(line: 93, column: 11, scope: !156)
!158 = !DILocation(line: 93, column: 6, scope: !54)
!159 = !DILocation(line: 94, column: 14, scope: !160)
!160 = distinct !DILexicalBlock(scope: !156, file: !3, line: 93, column: 16)
!161 = !DILocation(line: 94, column: 49, scope: !160)
!162 = !DILocation(line: 94, column: 6, scope: !160)
!163 = !DILocation(line: 95, column: 6, scope: !160)
!164 = !DILocation(line: 96, column: 2, scope: !160)
!165 = !DILocation(line: 97, column: 2, scope: !54)
!166 = !DILocation(line: 97, column: 21, scope: !54)
!167 = !DILocation(line: 97, column: 27, scope: !54)
!168 = !DILocation(line: 97, column: 14, scope: !54)
!169 = !DILocation(line: 97, column: 12, scope: !54)
!170 = !DILocation(line: 97, column: 44, scope: !54)
!171 = !DILocation(line: 98, column: 11, scope: !54)
!172 = !DILocation(line: 98, column: 3, scope: !54)
!173 = !DILocation(line: 100, column: 32, scope: !174)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 100, column: 8)
!175 = distinct !DILexicalBlock(scope: !54, file: !3, line: 98, column: 14)
!176 = !DILocation(line: 100, column: 9, scope: !174)
!177 = !DILocation(line: 100, column: 8, scope: !175)
!178 = !DILocation(line: 101, column: 5, scope: !174)
!179 = !DILocation(line: 102, column: 4, scope: !175)
!180 = !DILocation(line: 104, column: 24, scope: !175)
!181 = !DILocation(line: 104, column: 19, scope: !175)
!182 = !DILocation(line: 104, column: 17, scope: !175)
!183 = !DILocation(line: 105, column: 4, scope: !175)
!184 = !DILocation(line: 107, column: 22, scope: !175)
!185 = !DILocation(line: 107, column: 17, scope: !175)
!186 = !DILocation(line: 107, column: 15, scope: !175)
!187 = !DILocation(line: 108, column: 4, scope: !175)
!188 = !DILocation(line: 110, column: 4, scope: !175)
!189 = !DILocation(line: 112, column: 3, scope: !175)
!190 = distinct !{!190, !165, !191}
!191 = !DILocation(line: 112, column: 3, scope: !54)
!192 = !DILocation(line: 114, column: 6, scope: !193)
!193 = distinct !DILexicalBlock(scope: !54, file: !3, line: 114, column: 6)
!194 = !DILocation(line: 114, column: 13, scope: !193)
!195 = !DILocation(line: 114, column: 19, scope: !193)
!196 = !DILocation(line: 114, column: 17, scope: !193)
!197 = !DILocation(line: 114, column: 6, scope: !54)
!198 = !DILocation(line: 115, column: 14, scope: !199)
!199 = distinct !DILexicalBlock(scope: !193, file: !3, line: 114, column: 25)
!200 = !DILocation(line: 115, column: 50, scope: !199)
!201 = !DILocation(line: 115, column: 6, scope: !199)
!202 = !DILocation(line: 116, column: 6, scope: !199)
!203 = !DILocation(line: 117, column: 2, scope: !199)
!204 = !DILocation(line: 123, column: 6, scope: !205)
!205 = distinct !DILexicalBlock(scope: !54, file: !3, line: 123, column: 6)
!206 = !DILocation(line: 123, column: 13, scope: !205)
