; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.anon = type { %struct.TIFFHeaderBig }
%struct.TIFFHeaderBig = type { i16, i16, i16, i16, i64 }
%struct.tagname = type { i16, i8* }
%struct.TIFFHeaderCommon = type { i16, i16 }
%struct.TIFFHeaderClassic = type { i16, i16, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@appname = common dso_local global i8* null, align 8, !dbg !0
@.str.10 = private unnamed_addr constant [55 x i8] c"usage: %s [-h] [-o offset] [-m maxitems] file.tif ...\0A\00", align 1
@bigendian = common dso_local global i32 0, align 4, !dbg !97
@.str.11 = private unnamed_addr constant [6 x i8] c"m:o:h\00", align 1
@.str.12 = private unnamed_addr constant [6 x i8] c"%s%#x\00", align 1
@shortfmt = dso_local global i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.2, i32 0, i32 0), align 8, !dbg !69
@sshortfmt = dso_local global i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.1, i32 0, i32 0), align 8, !dbg !71
@.str.13 = private unnamed_addr constant [7 x i8] c"%s%#lx\00", align 1

!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !46, line: 67, baseType: !31)
!46 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16", file: !25, line: 71, baseType: !49)
!49 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !25, line: 74, baseType: !52)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !25, line: 77, baseType: !31)
!55 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!60 = !{!61, !63, !67, !69, !71, !73, !75, !77, !79, !81, !83, !85, !87, !89, !91, !0, !93, !95, !97, !99, !101, !127, !137, !197}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "maxitems", scope: !2, file: !3, line: 74, type: !41, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "bytefmt", scope: !2, file: !3, line: 76, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "sbytefmt", scope: !2, file: !3, line: 77, type: !65, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "shortfmt", scope: !2, file: !3, line: 78, type: !65, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "sshortfmt", scope: !2, file: !3, line: 79, type: !65, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "longfmt", scope: !2, file: !3, line: 80, type: !65, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "slongfmt", scope: !2, file: !3, line: 81, type: !65, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "ifdfmt", scope: !2, file: !3, line: 82, type: !65, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "long8fmt", scope: !2, file: !3, line: 88, type: !65, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "slong8fmt", scope: !2, file: !3, line: 89, type: !65, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "ifd8fmt", scope: !2, file: !3, line: 90, type: !65, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "rationalfmt", scope: !2, file: !3, line: 92, type: !65, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "srationalfmt", scope: !2, file: !3, line: 93, type: !65, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "floatfmt", scope: !2, file: !3, line: 94, type: !65, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "doublefmt", scope: !2, file: !3, line: 95, type: !65, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "curfile", scope: !2, file: !3, line: 70, type: !22, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "swabflag", scope: !2, file: !3, line: 71, type: !52, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "bigendian", scope: !2, file: !3, line: 72, type: !52, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "bigtiff", scope: !2, file: !3, line: 73, type: !52, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "hdr", scope: !2, file: !3, line: 68, type: !103, isLocal: true, isDefinition: true)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !3, line: 63, size: 128, elements: !104)
!104 = !{!105, !112, !121}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "classic", scope: !103, file: !3, line: 65, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderClassic", file: !25, line: 101, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 97, size: 64, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !107, file: !25, line: 98, baseType: !33, size: 16)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !107, file: !25, line: 99, baseType: !33, size: 16, offset: 16)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !107, file: !25, line: 100, baseType: !41, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "big", scope: !103, file: !3, line: 66, baseType: !113, size: 128)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderBig", file: !25, line: 108, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 102, size: 128, elements: !115)
!115 = !{!116, !117, !118, !119, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !114, file: !25, line: 103, baseType: !33, size: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !114, file: !25, line: 104, baseType: !33, size: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_offsetsize", scope: !114, file: !25, line: 105, baseType: !33, size: 16, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_unused", scope: !114, file: !25, line: 106, baseType: !33, size: 16, offset: 48)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !114, file: !25, line: 107, baseType: !24, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !103, file: !3, line: 67, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderCommon", file: !25, line: 96, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 93, size: 32, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !123, file: !25, line: 94, baseType: !33, size: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !123, file: !25, line: 95, baseType: !33, size: 16, offset: 16)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "tagnames", scope: !2, file: !3, line: 515, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 11648, elements: !135)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagname", file: !3, line: 512, size: 128, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !131, file: !3, line: 513, baseType: !33, size: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !3, line: 514, baseType: !65, size: 64, offset: 64)
!135 = !{!136}
!136 = !DISubrange(count: 91)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "typenames", scope: !139, file: !3, line: 626, type: !194, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "PrintType", scope: !3, file: !3, line: 624, type: !140, scopeLine: 625, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !193)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !33}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 48, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 241, size: 1728, elements: !146)
!145 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !167, !168, !169, !170, !171, !172, !174, !178, !181, !183, !184, !185, !186, !187, !188, !189}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !144, file: !145, line: 242, baseType: !52, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !144, file: !145, line: 247, baseType: !22, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !144, file: !145, line: 248, baseType: !22, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !144, file: !145, line: 249, baseType: !22, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !144, file: !145, line: 250, baseType: !22, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !144, file: !145, line: 251, baseType: !22, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !144, file: !145, line: 252, baseType: !22, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !144, file: !145, line: 253, baseType: !22, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !144, file: !145, line: 254, baseType: !22, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !144, file: !145, line: 256, baseType: !22, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !144, file: !145, line: 257, baseType: !22, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !144, file: !145, line: 258, baseType: !22, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !144, file: !145, line: 260, baseType: !160, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 156, size: 192, elements: !162)
!162 = !{!163, !164, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !161, file: !145, line: 157, baseType: !160, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !161, file: !145, line: 158, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !161, file: !145, line: 162, baseType: !52, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !144, file: !145, line: 262, baseType: !165, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !144, file: !145, line: 264, baseType: !52, size: 32, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !144, file: !145, line: 268, baseType: !52, size: 32, offset: 928)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !144, file: !145, line: 270, baseType: !29, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !144, file: !145, line: 274, baseType: !34, size: 16, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !144, file: !145, line: 275, baseType: !173, size: 8, offset: 1040)
!173 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !144, file: !145, line: 276, baseType: !175, size: 8, offset: 1048)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 1)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !144, file: !145, line: 280, baseType: !179, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !145, line: 150, baseType: null)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !144, file: !145, line: 289, baseType: !182, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 132, baseType: !31)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !144, file: !145, line: 297, baseType: !32, size: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !144, file: !145, line: 298, baseType: !32, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !144, file: !145, line: 299, baseType: !32, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !144, file: !145, line: 300, baseType: !32, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !144, file: !145, line: 302, baseType: !43, size: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !144, file: !145, line: 303, baseType: !52, size: 32, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !144, file: !145, line: 305, baseType: !190, size: 160, offset: 1568)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 20)
!193 = !{}
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 1216, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 19)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "datawidth", scope: !2, file: !3, line: 232, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 608, elements: !195)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!201 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!202 = !{i32 2, !"Dwarf Version", i32 4}
!203 = !{i32 2, !"Debug Info Version", i32 3}
!204 = !{i32 1, !"wchar_size", i32 4}
!205 = !{i32 7, !"PIC Level", i32 2}
!206 = !{i32 1, !"ThinLTO", i32 0}
!207 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!208 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 102, type: !209, scopeLine: 103, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !193)
!209 = !DISubroutineType(types: !210)
!210 = !{null}
!211 = !DILocation(line: 104, column: 10, scope: !208)
!212 = !DILocation(line: 104, column: 77, scope: !208)
!213 = !DILocation(line: 104, column: 2, scope: !208)
!214 = !DILocation(line: 105, column: 2, scope: !208)
!215 = !DILocation(line: 106, column: 1, scope: !208)
!216 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 109, type: !217, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !193)
!217 = !DISubroutineType(types: !218)
!218 = !{!52, !52, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!220 = !DILocalVariable(name: "argc", arg: 1, scope: !216, file: !3, line: 109, type: !52)
!221 = !DILocation(line: 109, column: 10, scope: !216)
!222 = !DILocalVariable(name: "argv", arg: 2, scope: !216, file: !3, line: 109, type: !219)
!223 = !DILocation(line: 109, column: 22, scope: !216)
!224 = !DILocalVariable(name: "one", scope: !216, file: !3, line: 111, type: !52)
!225 = !DILocation(line: 111, column: 6, scope: !216)
!226 = !DILocalVariable(name: "fd", scope: !216, file: !3, line: 111, type: !52)
!227 = !DILocation(line: 111, column: 15, scope: !216)
!228 = !DILocalVariable(name: "multiplefiles", scope: !216, file: !3, line: 112, type: !52)
!229 = !DILocation(line: 112, column: 6, scope: !216)
!230 = !DILocation(line: 112, column: 23, scope: !216)
!231 = !DILocation(line: 112, column: 28, scope: !216)
!232 = !DILocalVariable(name: "c", scope: !216, file: !3, line: 113, type: !52)
!233 = !DILocation(line: 113, column: 6, scope: !216)
!234 = !DILocalVariable(name: "diroff", scope: !216, file: !3, line: 114, type: !24)
!235 = !DILocation(line: 114, column: 9, scope: !216)
!236 = !DILocation(line: 115, column: 15, scope: !216)
!237 = !DILocation(line: 115, column: 29, scope: !216)
!238 = !DILocation(line: 115, column: 12, scope: !216)
!239 = !DILocation(line: 117, column: 12, scope: !216)
!240 = !DILocation(line: 117, column: 10, scope: !216)
!241 = !DILocation(line: 118, column: 2, scope: !216)
!242 = !DILocation(line: 118, column: 21, scope: !216)
!243 = !DILocation(line: 118, column: 27, scope: !216)
!244 = !DILocation(line: 118, column: 14, scope: !216)
!245 = !DILocation(line: 118, column: 12, scope: !216)
!246 = !DILocation(line: 118, column: 43, scope: !216)
!247 = !DILocation(line: 119, column: 11, scope: !248)
!248 = distinct !DILexicalBlock(scope: !216, file: !3, line: 118, column: 50)
!249 = !DILocation(line: 119, column: 3, scope: !248)
!250 = !DILocation(line: 121, column: 13, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !3, line: 119, column: 14)
!252 = !DILocation(line: 122, column: 14, scope: !251)
!253 = !DILocation(line: 123, column: 12, scope: !251)
!254 = !DILocation(line: 124, column: 13, scope: !251)
!255 = !DILocation(line: 125, column: 4, scope: !251)
!256 = !DILocation(line: 127, column: 30, scope: !251)
!257 = !DILocation(line: 127, column: 22, scope: !251)
!258 = !DILocation(line: 127, column: 11, scope: !251)
!259 = !DILocation(line: 128, column: 4, scope: !251)
!260 = !DILocation(line: 130, column: 23, scope: !251)
!261 = !DILocation(line: 130, column: 15, scope: !251)
!262 = !DILocation(line: 130, column: 13, scope: !251)
!263 = !DILocation(line: 131, column: 4, scope: !251)
!264 = !DILocation(line: 133, column: 4, scope: !251)
!265 = !DILocation(line: 134, column: 3, scope: !251)
!266 = distinct !{!266, !241, !267}
!267 = !DILocation(line: 135, column: 2, scope: !216)
!268 = !DILocation(line: 136, column: 6, scope: !269)
!269 = distinct !DILexicalBlock(scope: !216, file: !3, line: 136, column: 6)
!270 = !DILocation(line: 136, column: 16, scope: !269)
!271 = !DILocation(line: 136, column: 13, scope: !269)
!272 = !DILocation(line: 136, column: 6, scope: !216)
!273 = !DILocation(line: 137, column: 3, scope: !269)
!274 = !DILocation(line: 138, column: 2, scope: !216)
!275 = !DILocation(line: 138, column: 9, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 138, column: 2)
!277 = distinct !DILexicalBlock(scope: !216, file: !3, line: 138, column: 2)
!278 = !DILocation(line: 138, column: 18, scope: !276)
!279 = !DILocation(line: 138, column: 16, scope: !276)
!280 = !DILocation(line: 138, column: 2, scope: !277)
!281 = !DILocation(line: 139, column: 13, scope: !282)
!282 = distinct !DILexicalBlock(scope: !276, file: !3, line: 138, column: 34)
!283 = !DILocation(line: 139, column: 18, scope: !282)
!284 = !DILocation(line: 139, column: 8, scope: !282)
!285 = !DILocation(line: 139, column: 6, scope: !282)
!286 = !DILocation(line: 140, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !282, file: !3, line: 140, column: 7)
!288 = !DILocation(line: 140, column: 10, scope: !287)
!289 = !DILocation(line: 140, column: 7, scope: !282)
!290 = !DILocation(line: 141, column: 11, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !3, line: 140, column: 15)
!292 = !DILocation(line: 141, column: 4, scope: !291)
!293 = !DILocation(line: 142, column: 4, scope: !291)
!294 = !DILocation(line: 144, column: 7, scope: !295)
!295 = distinct !DILexicalBlock(scope: !282, file: !3, line: 144, column: 7)
!296 = !DILocation(line: 144, column: 7, scope: !282)
!297 = !DILocation(line: 145, column: 20, scope: !295)
!298 = !DILocation(line: 145, column: 25, scope: !295)
!299 = !DILocation(line: 145, column: 4, scope: !295)
!300 = !DILocation(line: 146, column: 13, scope: !282)
!301 = !DILocation(line: 146, column: 18, scope: !282)
!302 = !DILocation(line: 146, column: 11, scope: !282)
!303 = !DILocation(line: 147, column: 12, scope: !282)
!304 = !DILocation(line: 148, column: 11, scope: !282)
!305 = !DILocation(line: 149, column: 8, scope: !282)
!306 = !DILocation(line: 149, column: 12, scope: !282)
!307 = !DILocation(line: 149, column: 3, scope: !282)
!308 = !DILocation(line: 150, column: 9, scope: !282)
!309 = !DILocation(line: 150, column: 3, scope: !282)
!310 = !DILocation(line: 151, column: 2, scope: !282)
!311 = !DILocation(line: 138, column: 30, scope: !276)
!312 = !DILocation(line: 138, column: 2, scope: !276)
!313 = distinct !{!313, !280, !314}
!314 = !DILocation(line: 151, column: 2, scope: !277)
!315 = !DILocation(line: 152, column: 2, scope: !216)
!316 = !DILocation(line: 153, column: 1, scope: !216)
!317 = distinct !DISubprogram(name: "dump", scope: !3, file: !3, line: 163, type: !318, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !193)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !52, !24}
!320 = !DILocalVariable(name: "fd", arg: 1, scope: !317, file: !3, line: 163, type: !52)
!321 = !DILocation(line: 163, column: 10, scope: !317)
!322 = !DILocalVariable(name: "diroff", arg: 2, scope: !317, file: !3, line: 163, type: !24)
!323 = !DILocation(line: 163, column: 21, scope: !317)
!324 = !DILocalVariable(name: "i", scope: !317, file: !3, line: 165, type: !7)
!325 = !DILocation(line: 165, column: 11, scope: !317)
!326 = !DILocation(line: 167, column: 8, scope: !317)
!327 = !DILocation(line: 167, column: 2, scope: !317)
!328 = !DILocation(line: 168, column: 11, scope: !329)
!329 = distinct !DILexicalBlock(scope: !317, file: !3, line: 168, column: 6)
!330 = !DILocation(line: 168, column: 6, scope: !329)
!331 = !DILocation(line: 168, column: 56, scope: !329)
!332 = !DILocation(line: 168, column: 6, scope: !317)
!333 = !DILocation(line: 169, column: 3, scope: !329)
!334 = !DILocation(line: 170, column: 17, scope: !335)
!335 = distinct !DILexicalBlock(scope: !317, file: !3, line: 170, column: 6)
!336 = !DILocation(line: 170, column: 6, scope: !335)
!337 = !DILocation(line: 170, column: 28, scope: !335)
!338 = !DILocation(line: 171, column: 6, scope: !335)
!339 = !DILocation(line: 171, column: 20, scope: !335)
!340 = !DILocation(line: 171, column: 9, scope: !335)
!341 = !DILocation(line: 171, column: 31, scope: !335)
!342 = !DILocation(line: 171, column: 52, scope: !335)
!343 = !DILocation(line: 176, column: 37, scope: !335)
!344 = !DILocation(line: 176, column: 26, scope: !335)
!345 = !DILocation(line: 176, column: 23, scope: !335)
!346 = !DILocation(line: 170, column: 6, scope: !317)
!347 = !DILocation(line: 180, column: 18, scope: !348)
!348 = distinct !DILexicalBlock(scope: !335, file: !3, line: 178, column: 7)
!349 = !DILocation(line: 180, column: 7, scope: !348)
!350 = !DILocation(line: 180, column: 41, scope: !348)
!351 = !DILocation(line: 180, column: 30, scope: !348)
!352 = !DILocation(line: 179, column: 3, scope: !348)
!353 = !DILocation(line: 181, column: 2, scope: !348)
!354 = !DILocation(line: 182, column: 17, scope: !355)
!355 = distinct !DILexicalBlock(scope: !317, file: !3, line: 182, column: 6)
!356 = !DILocation(line: 182, column: 6, scope: !355)
!357 = !DILocation(line: 182, column: 28, scope: !355)
!358 = !DILocation(line: 183, column: 6, scope: !355)
!359 = !DILocation(line: 183, column: 20, scope: !355)
!360 = !DILocation(line: 183, column: 9, scope: !355)
!361 = !DILocation(line: 183, column: 31, scope: !355)
!362 = !DILocation(line: 182, column: 6, scope: !317)
!363 = !DILocation(line: 184, column: 15, scope: !355)
!364 = !DILocation(line: 184, column: 14, scope: !355)
!365 = !DILocation(line: 184, column: 12, scope: !355)
!366 = !DILocation(line: 184, column: 3, scope: !355)
!367 = !DILocation(line: 186, column: 14, scope: !355)
!368 = !DILocation(line: 186, column: 12, scope: !355)
!369 = !DILocation(line: 187, column: 6, scope: !370)
!370 = distinct !DILexicalBlock(scope: !317, file: !3, line: 187, column: 6)
!371 = !DILocation(line: 187, column: 6, scope: !317)
!372 = !DILocation(line: 188, column: 3, scope: !370)
!373 = !DILocation(line: 189, column: 17, scope: !374)
!374 = distinct !DILexicalBlock(scope: !317, file: !3, line: 189, column: 6)
!375 = !DILocation(line: 189, column: 6, scope: !374)
!376 = !DILocation(line: 189, column: 29, scope: !374)
!377 = !DILocation(line: 189, column: 6, scope: !317)
!378 = !DILocation(line: 191, column: 12, scope: !379)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 191, column: 7)
!380 = distinct !DILexicalBlock(scope: !374, file: !3, line: 190, column: 2)
!381 = !DILocation(line: 191, column: 7, scope: !379)
!382 = !DILocation(line: 191, column: 53, scope: !379)
!383 = !DILocation(line: 191, column: 7, scope: !380)
!384 = !DILocation(line: 192, column: 4, scope: !379)
!385 = !DILocation(line: 193, column: 7, scope: !386)
!386 = distinct !DILexicalBlock(scope: !380, file: !3, line: 193, column: 7)
!387 = !DILocation(line: 193, column: 7, scope: !380)
!388 = !DILocation(line: 194, column: 4, scope: !386)
!389 = !DILocation(line: 196, column: 19, scope: !380)
!390 = !DILocation(line: 196, column: 7, scope: !380)
!391 = !DILocation(line: 197, column: 19, scope: !380)
!392 = !DILocation(line: 197, column: 7, scope: !380)
!393 = !DILocation(line: 197, column: 30, scope: !380)
!394 = !DILocation(line: 195, column: 3, scope: !380)
!395 = !DILocation(line: 199, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !380, file: !3, line: 199, column: 7)
!397 = !DILocation(line: 199, column: 14, scope: !396)
!398 = !DILocation(line: 199, column: 7, scope: !380)
!399 = !DILocation(line: 200, column: 25, scope: !396)
!400 = !DILocation(line: 200, column: 13, scope: !396)
!401 = !DILocation(line: 200, column: 11, scope: !396)
!402 = !DILocation(line: 200, column: 4, scope: !396)
!403 = !DILocation(line: 201, column: 2, scope: !380)
!404 = !DILocation(line: 202, column: 22, scope: !405)
!405 = distinct !DILexicalBlock(scope: !374, file: !3, line: 202, column: 11)
!406 = !DILocation(line: 202, column: 11, scope: !405)
!407 = !DILocation(line: 202, column: 34, scope: !405)
!408 = !DILocation(line: 202, column: 11, scope: !374)
!409 = !DILocation(line: 204, column: 12, scope: !410)
!410 = distinct !DILexicalBlock(scope: !411, file: !3, line: 204, column: 7)
!411 = distinct !DILexicalBlock(scope: !405, file: !3, line: 203, column: 2)
!412 = !DILocation(line: 204, column: 7, scope: !410)
!413 = !DILocation(line: 204, column: 54, scope: !410)
!414 = !DILocation(line: 204, column: 7, scope: !411)
!415 = !DILocation(line: 205, column: 4, scope: !410)
!416 = !DILocation(line: 206, column: 7, scope: !417)
!417 = distinct !DILexicalBlock(scope: !411, file: !3, line: 206, column: 7)
!418 = !DILocation(line: 206, column: 7, scope: !411)
!419 = !DILocation(line: 208, column: 4, scope: !420)
!420 = distinct !DILexicalBlock(scope: !417, file: !3, line: 207, column: 3)
!421 = !DILocation(line: 209, column: 4, scope: !420)
!422 = !DILocation(line: 210, column: 4, scope: !420)
!423 = !DILocation(line: 211, column: 3, scope: !420)
!424 = !DILocation(line: 213, column: 15, scope: !411)
!425 = !DILocation(line: 213, column: 7, scope: !411)
!426 = !DILocation(line: 214, column: 15, scope: !411)
!427 = !DILocation(line: 214, column: 7, scope: !411)
!428 = !DILocation(line: 214, column: 26, scope: !411)
!429 = !DILocation(line: 212, column: 3, scope: !411)
!430 = !DILocation(line: 217, column: 15, scope: !411)
!431 = !DILocation(line: 217, column: 7, scope: !411)
!432 = !DILocation(line: 217, column: 39, scope: !411)
!433 = !DILocation(line: 217, column: 31, scope: !411)
!434 = !DILocation(line: 216, column: 3, scope: !411)
!435 = !DILocation(line: 218, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !411, file: !3, line: 218, column: 7)
!437 = !DILocation(line: 218, column: 14, scope: !436)
!438 = !DILocation(line: 218, column: 7, scope: !411)
!439 = !DILocation(line: 219, column: 21, scope: !436)
!440 = !DILocation(line: 219, column: 11, scope: !436)
!441 = !DILocation(line: 219, column: 4, scope: !436)
!442 = !DILocation(line: 220, column: 11, scope: !411)
!443 = !DILocation(line: 221, column: 2, scope: !411)
!444 = !DILocation(line: 224, column: 18, scope: !405)
!445 = !DILocation(line: 224, column: 7, scope: !405)
!446 = !DILocation(line: 224, column: 43, scope: !405)
!447 = !DILocation(line: 224, column: 32, scope: !405)
!448 = !DILocation(line: 223, column: 3, scope: !405)
!449 = !DILocation(line: 225, column: 9, scope: !450)
!450 = distinct !DILexicalBlock(scope: !317, file: !3, line: 225, column: 2)
!451 = !DILocation(line: 225, column: 7, scope: !450)
!452 = !DILocation(line: 225, column: 14, scope: !453)
!453 = distinct !DILexicalBlock(scope: !450, file: !3, line: 225, column: 2)
!454 = !DILocation(line: 225, column: 21, scope: !453)
!455 = !DILocation(line: 225, column: 2, scope: !450)
!456 = !DILocation(line: 226, column: 7, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !3, line: 226, column: 7)
!458 = distinct !DILexicalBlock(scope: !453, file: !3, line: 225, column: 32)
!459 = !DILocation(line: 226, column: 9, scope: !457)
!460 = !DILocation(line: 226, column: 7, scope: !458)
!461 = !DILocation(line: 227, column: 4, scope: !457)
!462 = !DILocation(line: 228, column: 26, scope: !458)
!463 = !DILocation(line: 228, column: 30, scope: !458)
!464 = !DILocation(line: 228, column: 33, scope: !458)
!465 = !DILocation(line: 228, column: 12, scope: !458)
!466 = !DILocation(line: 228, column: 10, scope: !458)
!467 = !DILocation(line: 229, column: 2, scope: !458)
!468 = !DILocation(line: 225, column: 28, scope: !453)
!469 = !DILocation(line: 225, column: 2, scope: !453)
!470 = distinct !{!470, !455, !471}
!471 = !DILocation(line: 229, column: 2, scope: !450)
!472 = !DILocation(line: 230, column: 1, scope: !317)
!473 = distinct !DISubprogram(name: "ReadError", scope: !3, file: !3, line: 814, type: !474, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !193)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !22}
!476 = !DILocalVariable(name: "what", arg: 1, scope: !473, file: !3, line: 814, type: !22)
!477 = !DILocation(line: 814, column: 17, scope: !473)
!478 = !DILocation(line: 816, column: 34, scope: !473)
!479 = !DILocation(line: 816, column: 2, scope: !473)
!480 = !DILocation(line: 817, column: 1, scope: !473)
!481 = distinct !DISubprogram(name: "Fatal", scope: !3, file: !3, line: 839, type: !482, scopeLine: 840, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !193)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !65, null}
!484 = !DILocalVariable(name: "fmt", arg: 1, scope: !481, file: !3, line: 839, type: !65)
!485 = !DILocation(line: 839, column: 19, scope: !481)
!486 = !DILocalVariable(name: "ap", scope: !481, file: !3, line: 841, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !28, line: 79, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !489, line: 48, baseType: !490)
!489 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stdarg.h", directory: "/root/llvm")
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 841, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 192, elements: !176)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 841, size: 192, elements: !493)
!493 = !{!494, !495, !496, !497}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !492, file: !3, line: 841, baseType: !7, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !492, file: !3, line: 841, baseType: !7, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !492, file: !3, line: 841, baseType: !32, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !492, file: !3, line: 841, baseType: !32, size: 64, offset: 128)
!498 = !DILocation(line: 841, column: 10, scope: !481)
!499 = !DILocation(line: 842, column: 2, scope: !481)
!500 = !DILocation(line: 843, column: 9, scope: !481)
!501 = !DILocation(line: 843, column: 17, scope: !481)
!502 = !DILocation(line: 843, column: 22, scope: !481)
!503 = !DILocation(line: 843, column: 2, scope: !481)
!504 = !DILocation(line: 844, column: 2, scope: !481)
!505 = !DILocation(line: 845, column: 2, scope: !481)
!506 = !DILocation(line: 846, column: 1, scope: !481)
!507 = distinct !DISubprogram(name: "ReadDirectory", scope: !3, file: !3, line: 264, type: !508, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !193)
!508 = !DISubroutineType(types: !509)
!509 = !{!24, !52, !7, !24}
!510 = !DILocalVariable(name: "fd", arg: 1, scope: !507, file: !3, line: 264, type: !52)
!511 = !DILocation(line: 264, column: 19, scope: !507)
!512 = !DILocalVariable(name: "ix", arg: 2, scope: !507, file: !3, line: 264, type: !7)
!513 = !DILocation(line: 264, column: 36, scope: !507)
!514 = !DILocalVariable(name: "off", arg: 3, scope: !507, file: !3, line: 264, type: !24)
!515 = !DILocation(line: 264, column: 47, scope: !507)
!516 = !DILocalVariable(name: "dircount", scope: !507, file: !3, line: 266, type: !33)
!517 = !DILocation(line: 266, column: 9, scope: !507)
!518 = !DILocalVariable(name: "direntrysize", scope: !507, file: !3, line: 267, type: !41)
!519 = !DILocation(line: 267, column: 9, scope: !507)
!520 = !DILocalVariable(name: "dirmem", scope: !507, file: !3, line: 268, type: !32)
!521 = !DILocation(line: 268, column: 8, scope: !507)
!522 = !DILocalVariable(name: "nextdiroff", scope: !507, file: !3, line: 269, type: !24)
!523 = !DILocation(line: 269, column: 9, scope: !507)
!524 = !DILocalVariable(name: "n", scope: !507, file: !3, line: 270, type: !41)
!525 = !DILocation(line: 270, column: 9, scope: !507)
!526 = !DILocalVariable(name: "dp", scope: !507, file: !3, line: 271, type: !36)
!527 = !DILocation(line: 271, column: 9, scope: !507)
!528 = !DILocation(line: 273, column: 6, scope: !529)
!529 = distinct !DILexicalBlock(scope: !507, file: !3, line: 273, column: 6)
!530 = !DILocation(line: 273, column: 10, scope: !529)
!531 = !DILocation(line: 273, column: 6, scope: !507)
!532 = !DILocation(line: 274, column: 3, scope: !529)
!533 = !DILocation(line: 278, column: 12, scope: !534)
!534 = distinct !DILexicalBlock(scope: !507, file: !3, line: 278, column: 6)
!535 = !DILocation(line: 278, column: 23, scope: !534)
!536 = !DILocation(line: 278, column: 6, scope: !534)
!537 = !DILocation(line: 278, column: 48, scope: !534)
!538 = !DILocation(line: 278, column: 38, scope: !534)
!539 = !DILocation(line: 278, column: 6, scope: !507)
!540 = !DILocation(line: 280, column: 3, scope: !541)
!541 = distinct !DILexicalBlock(scope: !534, file: !3, line: 278, column: 53)
!542 = !DILocation(line: 281, column: 3, scope: !541)
!543 = !DILocation(line: 283, column: 7, scope: !544)
!544 = distinct !DILexicalBlock(scope: !507, file: !3, line: 283, column: 6)
!545 = !DILocation(line: 283, column: 6, scope: !507)
!546 = !DILocation(line: 284, column: 12, scope: !547)
!547 = distinct !DILexicalBlock(scope: !548, file: !3, line: 284, column: 7)
!548 = distinct !DILexicalBlock(scope: !544, file: !3, line: 283, column: 16)
!549 = !DILocation(line: 284, column: 16, scope: !547)
!550 = !DILocation(line: 284, column: 7, scope: !547)
!551 = !DILocation(line: 284, column: 52, scope: !547)
!552 = !DILocation(line: 284, column: 7, scope: !548)
!553 = !DILocation(line: 285, column: 4, scope: !554)
!554 = distinct !DILexicalBlock(scope: !547, file: !3, line: 284, column: 72)
!555 = !DILocation(line: 286, column: 4, scope: !554)
!556 = !DILocation(line: 288, column: 7, scope: !557)
!557 = distinct !DILexicalBlock(scope: !548, file: !3, line: 288, column: 7)
