; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.anon = type { i8, i8, i16 }
%struct.tiff = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@defxres = dso_local global float 2.040000e+02, align 4, !dbg !0
@.str = private unnamed_addr constant [33 x i8] c"No x-resolution, assuming %g dpi\00", align 1
@defyres = dso_local global float 9.800000e+01, align 4, !dbg !22
@.str.1 = private unnamed_addr constant [33 x i8] c"No y-resolution, assuming %g lpi\00", align 1
@pageWidth = dso_local global float 0.000000e+00, align 4, !dbg !29
@pageHeight = dso_local global float 0.000000e+00, align 4, !dbg !31
@.str.2 = private unnamed_addr constant [17 x i8] c"%%!PS-Adobe-3.0\0A\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"%%%%Creator: fax2ps\0A\00", align 1
@.str.4 = private unnamed_addr constant [21 x i8] c"%%%%CreationDate: %s\00", align 1
@.str.5 = private unnamed_addr constant [17 x i8] c"%%%%Origin: 0 0\0A\00", align 1
@.str.6 = private unnamed_addr constant [28 x i8] c"%%%%BoundingBox: 0 0 %u %u\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "defxres", scope: !2, file: !3, line: 52, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !21, nameTableKind: None)
!3 = !DIFile(filename: "fax2ps.c", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!4 = !{}
!5 = !{!6, !7, !9, !10, !13, !16, !17, !18, !19}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdata_t", file: !8, line: 78, baseType: !9)
!8 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !8, line: 77, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !8, line: 67, baseType: !12)
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !14, line: 72, baseType: !15)
!14 = !DIFile(filename: "../libtiff/tiff.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!15 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdir_t", file: !8, line: 72, baseType: !13)
!17 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!21 = !{!0, !22, !24, !27, !29, !31, !33, !35, !37, !39, !46, !48, !115, !133}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "defyres", scope: !2, file: !3, line: 53, type: !17, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "half", scope: !2, file: !3, line: 54, type: !26, isLocal: false, isDefinition: true)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "points", scope: !2, file: !3, line: 55, type: !26, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "pageWidth", scope: !2, file: !3, line: 56, type: !17, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "pageHeight", scope: !2, file: !3, line: 57, type: !17, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "scaleToPage", scope: !2, file: !3, line: 58, type: !6, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "totalPages", scope: !2, file: !3, line: 59, type: !6, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "maxline", scope: !2, file: !3, line: 61, type: !6, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 415, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 704, elements: !44)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !{!45}
!45 = !DISubrange(count: 11)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "row", scope: !2, file: !3, line: 60, type: !6, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "fontPrologue", scope: !50, file: !3, line: 168, type: !110, isLocal: true, isDefinition: true)
!50 = distinct !DISubprogram(name: "emitFont", scope: !3, file: !3, line: 166, type: !51, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !55, line: 48, baseType: !56)
!55 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 241, size: 1728, elements: !58)
!57 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !85, !86, !88, !92, !95, !97, !98, !99, !100, !101, !105, !106}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 242, baseType: !6, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 247, baseType: !42, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 248, baseType: !42, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 249, baseType: !42, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 250, baseType: !42, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 251, baseType: !42, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 252, baseType: !42, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 253, baseType: !42, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 254, baseType: !42, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 256, baseType: !42, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 257, baseType: !42, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 258, baseType: !42, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 260, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 156, size: 192, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !57, line: 157, baseType: !72, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !57, line: 158, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !57, line: 162, baseType: !6, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 262, baseType: !77, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 264, baseType: !6, size: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 268, baseType: !6, size: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 270, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 131, baseType: !12)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 274, baseType: !15, size: 16, offset: 1024)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 275, baseType: !87, size: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 276, baseType: !89, size: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 280, baseType: !93, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 150, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 289, baseType: !96, size: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 132, baseType: !12)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !56, file: !57, line: 297, baseType: !9, size: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !56, file: !57, line: 298, baseType: !9, size: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !56, file: !57, line: 299, baseType: !9, size: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !56, file: !57, line: 300, baseType: !9, size: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 302, baseType: !102, size: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!104 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 303, baseType: !6, size: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 305, baseType: !107, size: 160, offset: 1568)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 20)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 1408, elements: !113)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!113 = !{!114}
!114 = !DISubrange(count: 22)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "WBarr", scope: !117, file: !3, line: 77, type: !125, isLocal: true, isDefinition: true)
!117 = distinct !DISubprogram(name: "printruns", scope: !3, file: !3, line: 72, type: !118, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !120, !122, !122, !123}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !14, line: 75, baseType: !124)
!124 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 320, elements: !131)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !117, file: !3, line: 74, size: 32, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !126, file: !3, line: 75, baseType: !43, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !126, file: !3, line: 75, baseType: !43, size: 8, offset: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !126, file: !3, line: 76, baseType: !15, size: 16, offset: 16)
!131 = !{!132}
!132 = !DISubrange(count: 10)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "svalue", scope: !117, file: !3, line: 83, type: !42, isLocal: true, isDefinition: true)
!135 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!136 = !{i32 2, !"Dwarf Version", i32 4}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{i32 1, !"wchar_size", i32 4}
!139 = !{i32 7, !"PIC Level", i32 2}
!140 = !{i32 1, !"ThinLTO", i32 0}
!141 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!142 = distinct !DISubprogram(name: "printTIF", scope: !3, file: !3, line: 198, type: !143, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145, !13}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !8, line: 40, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !8, line: 40, flags: DIFlagFwdDecl)
!148 = !DILocalVariable(name: "tif", arg: 1, scope: !142, file: !3, line: 198, type: !145)
!149 = !DILocation(line: 198, column: 16, scope: !142)
!150 = !DILocalVariable(name: "pageNumber", arg: 2, scope: !142, file: !3, line: 198, type: !13)
!151 = !DILocation(line: 198, column: 28, scope: !142)
!152 = !DILocalVariable(name: "w", scope: !142, file: !3, line: 200, type: !123)
!153 = !DILocation(line: 200, column: 12, scope: !142)
!154 = !DILocalVariable(name: "h", scope: !142, file: !3, line: 200, type: !123)
!155 = !DILocation(line: 200, column: 15, scope: !142)
!156 = !DILocalVariable(name: "unit", scope: !142, file: !3, line: 201, type: !13)
!157 = !DILocation(line: 201, column: 12, scope: !142)
!158 = !DILocalVariable(name: "compression", scope: !142, file: !3, line: 201, type: !13)
!159 = !DILocation(line: 201, column: 18, scope: !142)
!160 = !DILocalVariable(name: "xres", scope: !142, file: !3, line: 202, type: !17)
!161 = !DILocation(line: 202, column: 11, scope: !142)
!162 = !DILocalVariable(name: "yres", scope: !142, file: !3, line: 202, type: !17)
!163 = !DILocation(line: 202, column: 17, scope: !142)
!164 = !DILocalVariable(name: "scale", scope: !142, file: !3, line: 202, type: !17)
!165 = !DILocation(line: 202, column: 23, scope: !142)
!166 = !DILocalVariable(name: "s", scope: !142, file: !3, line: 203, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrip_t", file: !8, line: 75, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrile_t", file: !8, line: 74, baseType: !123)
!169 = !DILocation(line: 203, column: 14, scope: !142)
!170 = !DILocalVariable(name: "ns", scope: !142, file: !3, line: 203, type: !167)
!171 = !DILocation(line: 203, column: 17, scope: !142)
!172 = !DILocalVariable(name: "creation_time", scope: !142, file: !3, line: 204, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !174, line: 75, baseType: !175)
!174 = !DIFile(filename: "/usr/include/time.h", directory: "")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !84, line: 139, baseType: !12)
!176 = !DILocation(line: 204, column: 12, scope: !142)
!177 = !DILocation(line: 206, column: 18, scope: !142)
!178 = !DILocation(line: 206, column: 5, scope: !142)
!179 = !DILocation(line: 207, column: 18, scope: !142)
!180 = !DILocation(line: 207, column: 5, scope: !142)
!181 = !DILocation(line: 208, column: 23, scope: !182)
!182 = distinct !DILexicalBlock(scope: !142, file: !3, line: 208, column: 9)
!183 = !DILocation(line: 208, column: 10, scope: !182)
!184 = !DILocation(line: 209, column: 2, scope: !182)
!185 = !DILocation(line: 209, column: 5, scope: !182)
