; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [25 x i8] c"c:r:H:w:l:b:d:LMp:si:o:h\00", align 1
@optarg = external global i8*, align 8
@.str.1 = private unnamed_addr constant [5 x i8] c"byte\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"short\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"long\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"sbyte\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"sshort\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"slong\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"float\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"double\00", align 1
@.str.9 = private unnamed_addr constant [11 x i8] c"miniswhite\00", align 1
@.str.10 = private unnamed_addr constant [11 x i8] c"minisblack\00", align 1

!732 = !DILocation(line: 559, column: 14, scope: !727)
!733 = !DILocation(line: 559, column: 4, scope: !727)
!734 = !DILocation(line: 560, column: 15, scope: !722)
!735 = !DILocation(line: 561, column: 2, scope: !722)
!736 = !DILocation(line: 561, column: 21, scope: !737)
!737 = distinct !DILexicalBlock(scope: !717, file: !3, line: 561, column: 13)
!738 = !DILocation(line: 561, column: 13, scope: !737)
!739 = !DILocation(line: 561, column: 36, scope: !737)
!740 = !DILocation(line: 561, column: 13, scope: !717)
!741 = !DILocalVariable(name: "cp", scope: !742, file: !3, line: 562, type: !82)
!742 = distinct !DILexicalBlock(scope: !737, file: !3, line: 561, column: 42)
!743 = !DILocation(line: 562, column: 9, scope: !742)
!744 = !DILocation(line: 562, column: 21, scope: !742)
!745 = !DILocation(line: 562, column: 14, scope: !742)
!746 = !DILocation(line: 563, column: 7, scope: !747)
!747 = distinct !DILexicalBlock(scope: !742, file: !3, line: 563, column: 7)
!748 = !DILocation(line: 563, column: 7, scope: !742)
!749 = !DILocation(line: 564, column: 21, scope: !747)
!750 = !DILocation(line: 564, column: 23, scope: !747)
!751 = !DILocation(line: 564, column: 16, scope: !747)
!752 = !DILocation(line: 564, column: 14, scope: !747)
!753 = !DILocation(line: 564, column: 4, scope: !747)
!754 = !DILocation(line: 565, column: 15, scope: !742)
!755 = !DILocation(line: 566, column: 2, scope: !742)
!756 = !DILocation(line: 567, column: 3, scope: !737)
!757 = !DILocation(line: 568, column: 2, scope: !661)
!758 = !DILocation(line: 569, column: 1, scope: !661)
!759 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 632, type: !760, scopeLine: 633, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !97)
!760 = !DISubroutineType(types: !761)
!761 = !{null}
!762 = !DILocalVariable(name: "buf", scope: !759, file: !3, line: 634, type: !763)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 65536, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 8192)
!766 = !DILocation(line: 634, column: 7, scope: !759)
!767 = !DILocalVariable(name: "i", scope: !759, file: !3, line: 635, type: !57)
!768 = !DILocation(line: 635, column: 6, scope: !759)
!769 = !DILocation(line: 637, column: 9, scope: !759)
!770 = !DILocation(line: 637, column: 17, scope: !759)
!771 = !DILocation(line: 637, column: 2, scope: !759)
!772 = !DILocation(line: 638, column: 17, scope: !759)
!773 = !DILocation(line: 638, column: 35, scope: !759)
!774 = !DILocation(line: 638, column: 9, scope: !759)
!775 = !DILocation(line: 639, column: 9, scope: !776)
!776 = distinct !DILexicalBlock(scope: !759, file: !3, line: 639, column: 2)
!777 = !DILocation(line: 639, column: 7, scope: !776)
!778 = !DILocation(line: 639, column: 20, scope: !779)
!779 = distinct !DILexicalBlock(scope: !776, file: !3, line: 639, column: 2)
!780 = !DILocation(line: 639, column: 14, scope: !779)
!781 = !DILocation(line: 639, column: 23, scope: !779)
!782 = !DILocation(line: 639, column: 2, scope: !776)
!783 = !DILocation(line: 640, column: 11, scope: !779)
!784 = !DILocation(line: 640, column: 33, scope: !779)
!785 = !DILocation(line: 640, column: 27, scope: !779)
!786 = !DILocation(line: 640, column: 3, scope: !779)
!787 = !DILocation(line: 639, column: 33, scope: !779)
!788 = !DILocation(line: 639, column: 2, scope: !779)
!789 = distinct !{!789, !782, !790}
!790 = !DILocation(line: 640, column: 35, scope: !776)
!791 = !DILocation(line: 641, column: 2, scope: !759)
!792 = !DILocation(line: 642, column: 1, scope: !759)
!793 = distinct !DISubprogram(name: "guessSize", scope: !3, file: !3, line: 359, type: !794, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !97)
!794 = !DISubroutineType(types: !795)
!795 = !{!57, !57, !115, !59, !46, !57, !54, !54}
!796 = !DILocalVariable(name: "fd", arg: 1, scope: !793, file: !3, line: 359, type: !57)
!797 = !DILocation(line: 359, column: 15, scope: !793)
!798 = !DILocalVariable(name: "dtype", arg: 2, scope: !793, file: !3, line: 359, type: !115)
!799 = !DILocation(line: 359, column: 32, scope: !793)
!800 = !DILocalVariable(name: "hdr_size", arg: 3, scope: !793, file: !3, line: 359, type: !59)
!801 = !DILocation(line: 359, column: 45, scope: !793)
!802 = !DILocalVariable(name: "nbands", arg: 4, scope: !793, file: !3, line: 359, type: !46)
!803 = !DILocation(line: 359, column: 62, scope: !793)
!804 = !DILocalVariable(name: "swab", arg: 5, scope: !793, file: !3, line: 360, type: !57)
!805 = !DILocation(line: 360, column: 8, scope: !793)
!806 = !DILocalVariable(name: "width", arg: 6, scope: !793, file: !3, line: 360, type: !54)
!807 = !DILocation(line: 360, column: 22, scope: !793)
!808 = !DILocalVariable(name: "length", arg: 7, scope: !793, file: !3, line: 360, type: !54)
!809 = !DILocation(line: 360, column: 37, scope: !793)
!810 = !DILocalVariable(name: "longt", scope: !793, file: !3, line: 362, type: !811)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!812 = !DILocation(line: 362, column: 14, scope: !793)
!813 = !DILocalVariable(name: "buf1", scope: !793, file: !3, line: 363, type: !82)
!814 = !DILocation(line: 363, column: 12, scope: !793)
!815 = !DILocalVariable(name: "buf2", scope: !793, file: !3, line: 363, type: !82)
!816 = !DILocation(line: 363, column: 19, scope: !793)
!817 = !DILocalVariable(name: "filestat", scope: !793, file: !3, line: 364, type: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !819, line: 46, size: 1152, elements: !820)
!819 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!820 = !{!821, !823, !825, !827, !829, !831, !833, !834, !835, !836, !838, !840, !848, !849, !850}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !818, file: !819, line: 48, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !62, line: 124, baseType: !52)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !818, file: !819, line: 53, baseType: !824, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !62, line: 127, baseType: !52)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !818, file: !819, line: 61, baseType: !826, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !62, line: 130, baseType: !52)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !818, file: !819, line: 62, baseType: !828, size: 32, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !62, line: 129, baseType: !7)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !818, file: !819, line: 64, baseType: !830, size: 32, offset: 224)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !62, line: 125, baseType: !7)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !818, file: !819, line: 65, baseType: !832, size: 32, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !62, line: 126, baseType: !7)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !818, file: !819, line: 67, baseType: !57, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !818, file: !819, line: 69, baseType: !822, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !818, file: !819, line: 74, baseType: !61, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !818, file: !819, line: 78, baseType: !837, size: 64, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !62, line: 153, baseType: !63)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !818, file: !819, line: 80, baseType: !839, size: 64, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !62, line: 158, baseType: !63)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !818, file: !819, line: 91, baseType: !841, size: 128, offset: 576)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !842, line: 120, size: 128, elements: !843)
!842 = !DIFile(filename: "/usr/include/time.h", directory: "")
!843 = !{!844, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !841, file: !842, line: 122, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !62, line: 139, baseType: !63)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !841, file: !842, line: 123, baseType: !847, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !62, line: 175, baseType: !63)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !818, file: !819, line: 92, baseType: !841, size: 128, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !818, file: !819, line: 93, baseType: !841, size: 128, offset: 832)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !818, file: !819, line: 106, baseType: !851, size: 192, offset: 960)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 192, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 3)
!854 = !DILocation(line: 364, column: 14, scope: !793)
!855 = !DILocalVariable(name: "w", scope: !793, file: !3, line: 365, type: !46)
!856 = !DILocation(line: 365, column: 13, scope: !793)
!857 = !DILocalVariable(name: "h", scope: !793, file: !3, line: 365, type: !46)
!858 = !DILocation(line: 365, column: 16, scope: !793)
!859 = !DILocalVariable(name: "scanlinesize", scope: !793, file: !3, line: 365, type: !46)
!860 = !DILocation(line: 365, column: 19, scope: !793)
!861 = !DILocalVariable(name: "imagesize", scope: !793, file: !3, line: 365, type: !46)
!862 = !DILocation(line: 365, column: 33, scope: !793)
!863 = !DILocalVariable(name: "depth", scope: !793, file: !3, line: 366, type: !46)
!864 = !DILocation(line: 366, column: 13, scope: !793)
!865 = !DILocation(line: 366, column: 35, scope: !793)
!866 = !DILocation(line: 366, column: 21, scope: !793)
!867 = !DILocalVariable(name: "cor_coef", scope: !793, file: !3, line: 367, type: !58)
!868 = !DILocation(line: 367, column: 12, scope: !793)
!869 = !DILocalVariable(name: "tmp", scope: !793, file: !3, line: 367, type: !58)
!870 = !DILocation(line: 367, column: 26, scope: !793)
!871 = !DILocation(line: 369, column: 8, scope: !793)
!872 = !DILocation(line: 369, column: 2, scope: !793)
!873 = !DILocation(line: 371, column: 15, scope: !874)
!874 = distinct !DILexicalBlock(scope: !793, file: !3, line: 371, column: 6)
!875 = !DILocation(line: 371, column: 25, scope: !874)
!876 = !DILocation(line: 371, column: 23, scope: !874)
!877 = !DILocation(line: 371, column: 6, scope: !793)
!878 = !DILocation(line: 372, column: 11, scope: !879)
!879 = distinct !DILexicalBlock(scope: !874, file: !3, line: 371, column: 35)
!880 = !DILocation(line: 372, column: 3, scope: !879)
!881 = !DILocation(line: 373, column: 3, scope: !879)
!882 = !DILocation(line: 376, column: 24, scope: !793)
!883 = !DILocation(line: 376, column: 34, scope: !793)
!884 = !DILocation(line: 376, column: 32, scope: !793)
!885 = !DILocation(line: 376, column: 46, scope: !793)
!886 = !DILocation(line: 376, column: 44, scope: !793)
!887 = !DILocation(line: 376, column: 55, scope: !793)
!888 = !DILocation(line: 376, column: 53, scope: !793)
!889 = !DILocation(line: 376, column: 14, scope: !793)
!890 = !DILocation(line: 376, column: 12, scope: !793)
!891 = !DILocation(line: 378, column: 7, scope: !892)
!892 = distinct !DILexicalBlock(scope: !793, file: !3, line: 378, column: 6)
!893 = !DILocation(line: 378, column: 6, scope: !892)
!894 = !DILocation(line: 378, column: 13, scope: !892)
!895 = !DILocation(line: 378, column: 18, scope: !892)
!896 = !DILocation(line: 378, column: 22, scope: !892)
!897 = !DILocation(line: 378, column: 21, scope: !892)
!898 = !DILocation(line: 378, column: 29, scope: !892)
!899 = !DILocation(line: 378, column: 6, scope: !793)
!900 = !DILocation(line: 379, column: 11, scope: !901)
!901 = distinct !DILexicalBlock(scope: !892, file: !3, line: 378, column: 35)
!902 = !DILocation(line: 379, column: 3, scope: !901)
!903 = !DILocation(line: 381, column: 13, scope: !901)
!904 = !DILocation(line: 381, column: 26, scope: !901)
!905 = !DILocation(line: 381, column: 25, scope: !901)
!906 = !DILocation(line: 381, column: 23, scope: !901)
!907 = !DILocation(line: 381, column: 4, scope: !901)
!908 = !DILocation(line: 381, column: 11, scope: !901)
!909 = !DILocation(line: 383, column: 11, scope: !901)
!910 = !DILocation(line: 384, column: 20, scope: !901)
!911 = !DILocation(line: 384, column: 19, scope: !901)
!912 = !DILocation(line: 384, column: 4, scope: !901)
!913 = !DILocation(line: 383, column: 3, scope: !901)
!914 = !DILocation(line: 386, column: 3, scope: !901)
!915 = !DILocation(line: 387, column: 14, scope: !916)
