; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type { i8*, i32, i32, i32, i64, i64, i64*, i16, i16, %struct.TIFFDirectory, %struct.TIFFDirectory, %union.anon, i16, i32, i16, i32, i64, i64, i16, i64, i32, i32, i64, i32, i32 (%struct.tiff*)*, i32 (%struct.tiff*)*, i32 (%struct.tiff*, i16)*, i32 (%struct.tiff*)*, i32, i32 (%struct.tiff*, i16)*, i32 (%struct.tiff*)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, void (%struct.tiff*)*, i32 (%struct.tiff*, i32)*, void (%struct.tiff*)*, i32 (%struct.tiff*, i32)*, void (%struct.tiff*, i32*, i32*)*, i8*, i64, i64, i8*, i64, i64, i64, i8*, i64, i8*, i64, i32 (i8*, i8**, i64*)*, void (i8*, i8*, i64)*, i8*, i64 (i8*, i8*, i64)*, i64 (i8*, i8*, i64)*, i64 (i8*, i64, i32)*, i32 (i8*)*, i64 (i8*)*, void (%struct.tiff*, i8*, i64)*, %struct._TIFFField**, i64, %struct._TIFFField*, %struct.TIFFTagMethods, %struct.client_info*, %struct._TIFFFieldArray*, i64 }

!90 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !6, line: 75, baseType: !7)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !6, line: 74, baseType: !96)
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !{!0, !98, !100, !104, !106, !111, !116, !123, !125, !127, !129, !131, !133}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "rowsperstrip", scope: !2, file: !3, line: 58, type: !92, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "horizSubSampling", scope: !2, file: !3, line: 60, type: !102, isLocal: false, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !6, line: 72, baseType: !103)
!103 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "vertSubSampling", scope: !2, file: !3, line: 61, type: !102, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "ycbcrCoeffs", scope: !2, file: !3, line: 62, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 96, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 3)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "refBlackWhite", scope: !2, file: !3, line: 64, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 192, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 6)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 354, type: !118, isLocal: false, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 768, elements: !121)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!121 = !{!122}
!122 = !DISubrange(count: 12)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "lumaRed", scope: !2, file: !3, line: 138, type: !88, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "lumaGreen", scope: !2, file: !3, line: 139, type: !88, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "lumaBlue", scope: !2, file: !3, line: 140, type: !88, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "D1", scope: !2, file: !3, line: 141, type: !89, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "D2", scope: !2, file: !3, line: 141, type: !89, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "Yzero", scope: !2, file: !3, line: 142, type: !96, isLocal: false, isDefinition: true)
!135 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!136 = !{i32 2, !"Dwarf Version", i32 4}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{i32 1, !"wchar_size", i32 4}
!139 = !{i32 7, !"PIC Level", i32 2}
!140 = !{i32 1, !"ThinLTO", i32 0}
!141 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!142 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 71, type: !143, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !146)
!143 = !DISubroutineType(types: !144)
!144 = !{!96, !96, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!146 = !{}
!147 = !DILocalVariable(name: "argc", arg: 1, scope: !142, file: !3, line: 71, type: !96)
!148 = !DILocation(line: 71, column: 10, scope: !142)
!149 = !DILocalVariable(name: "argv", arg: 2, scope: !142, file: !3, line: 71, type: !145)
!150 = !DILocation(line: 71, column: 22, scope: !142)
!151 = !DILocalVariable(name: "in", scope: !142, file: !3, line: 73, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !154, line: 40, baseType: !155)
!154 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !156, line: 97, size: 8640, elements: !157)
!156 = !DIFile(filename: "../libtiff/tiffiop.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!157 = !{!158, !159, !160, !161, !162, !164, !165, !167, !168, !169, !267, !268, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !306, !307, !312, !313, !318, !319, !320, !321, !322, !329, !330, !331, !332, !333, !334, !339, !344, !345, !350, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !375, !380, !381, !386, !387, !392, !397, !402, !407, !409, !412, !413, !490, !499, !500}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !155, file: !156, line: 98, baseType: !119, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !155, file: !156, line: 99, baseType: !96, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !155, file: !156, line: 100, baseType: !96, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !155, file: !156, line: 101, baseType: !92, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !155, file: !156, line: 124, baseType: !163, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !6, line: 78, baseType: !90)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !155, file: !156, line: 125, baseType: !163, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlist", scope: !155, file: !156, line: 126, baseType: !166, size: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlistsize", scope: !155, file: !156, line: 127, baseType: !102, size: 16, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirnumber", scope: !155, file: !156, line: 128, baseType: !102, size: 16, offset: 400)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !155, file: !156, line: 129, baseType: !170, size: 2240, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !27, line: 119, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 64, size: 2240, elements: !172)
!172 = !{!173, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !198, !199, !200, !201, !202, !203, !204, !205, !209, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !171, file: !27, line: 67, baseType: !174, size: 256)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 256, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 4)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !171, file: !27, line: 69, baseType: !92, size: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !171, file: !27, line: 69, baseType: !92, size: 32, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !171, file: !27, line: 69, baseType: !92, size: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !171, file: !27, line: 70, baseType: !92, size: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !171, file: !27, line: 70, baseType: !92, size: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !171, file: !27, line: 70, baseType: !92, size: 32, offset: 416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !171, file: !27, line: 71, baseType: !92, size: 32, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !171, file: !27, line: 72, baseType: !102, size: 16, offset: 480)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !171, file: !27, line: 73, baseType: !102, size: 16, offset: 496)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !171, file: !27, line: 74, baseType: !102, size: 16, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !171, file: !27, line: 75, baseType: !102, size: 16, offset: 528)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !171, file: !27, line: 76, baseType: !102, size: 16, offset: 544)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !171, file: !27, line: 77, baseType: !102, size: 16, offset: 560)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !171, file: !27, line: 78, baseType: !102, size: 16, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !171, file: !27, line: 79, baseType: !102, size: 16, offset: 592)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !171, file: !27, line: 80, baseType: !92, size: 32, offset: 608)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !171, file: !27, line: 81, baseType: !102, size: 16, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !171, file: !27, line: 81, baseType: !102, size: 16, offset: 656)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !171, file: !27, line: 82, baseType: !196, size: 64, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !171, file: !27, line: 83, baseType: !196, size: 64, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !171, file: !27, line: 84, baseType: !89, size: 32, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !171, file: !27, line: 84, baseType: !89, size: 32, offset: 864)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !171, file: !27, line: 85, baseType: !102, size: 16, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !171, file: !27, line: 86, baseType: !102, size: 16, offset: 912)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !171, file: !27, line: 87, baseType: !89, size: 32, offset: 928)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !171, file: !27, line: 87, baseType: !89, size: 32, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !171, file: !27, line: 88, baseType: !206, size: 32, offset: 992)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 2)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !171, file: !27, line: 89, baseType: !210, size: 192, offset: 1024)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 192, elements: !109)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !171, file: !27, line: 90, baseType: !206, size: 32, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !171, file: !27, line: 91, baseType: !102, size: 16, offset: 1248)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !171, file: !27, line: 92, baseType: !211, size: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !171, file: !27, line: 96, baseType: !92, size: 32, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !171, file: !27, line: 97, baseType: !92, size: 32, offset: 1376)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !171, file: !27, line: 98, baseType: !166, size: 64, offset: 1408)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !171, file: !27, line: 99, baseType: !166, size: 64, offset: 1472)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecountsorted", scope: !171, file: !27, line: 100, baseType: !96, size: 32, offset: 1536)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !171, file: !27, line: 105, baseType: !102, size: 16, offset: 1568)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !171, file: !27, line: 106, baseType: !166, size: 64, offset: 1600)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !171, file: !27, line: 108, baseType: !206, size: 32, offset: 1664)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !171, file: !27, line: 109, baseType: !102, size: 16, offset: 1696)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !171, file: !27, line: 111, baseType: !210, size: 192, offset: 1728)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !171, file: !27, line: 112, baseType: !88, size: 64, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !171, file: !27, line: 114, baseType: !96, size: 32, offset: 1984)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !171, file: !27, line: 115, baseType: !119, size: 64, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValueCount", scope: !171, file: !27, line: 117, baseType: !96, size: 32, offset: 2112)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValues", scope: !171, file: !27, line: 118, baseType: !230, size: 64, offset: 2176)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagValue", file: !27, line: 37, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 33, size: 192, elements: !233)
!233 = !{!234, !265, !266}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !232, file: !27, line: 34, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFField", file: !154, line: 320, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFField", file: !27, line: 276, size: 384, elements: !239)
!239 = !{!240, !241, !243, !244, !246, !247, !249, !250, !251, !252, !253, !254}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !238, file: !27, line: 277, baseType: !92, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !238, file: !27, line: 278, baseType: !242, size: 16, offset: 32)
!242 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !238, file: !27, line: 279, baseType: !242, size: 16, offset: 48)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !238, file: !27, line: 280, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !6, line: 143, baseType: !5)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !238, file: !27, line: 281, baseType: !92, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "set_field_type", scope: !238, file: !27, line: 282, baseType: !248, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSetGetFieldType", file: !27, line: 250, baseType: !26)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "get_field_type", scope: !238, file: !27, line: 283, baseType: !248, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !238, file: !27, line: 284, baseType: !103, size: 16, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !238, file: !27, line: 285, baseType: !94, size: 8, offset: 208)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !238, file: !27, line: 286, baseType: !94, size: 8, offset: 216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !238, file: !27, line: 287, baseType: !119, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "field_subfields", scope: !238, file: !27, line: 288, baseType: !255, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArray", file: !154, line: 321, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFFieldArray", file: !27, line: 269, size: 192, elements: !258)
!258 = !{!259, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !27, line: 270, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArrayType", file: !27, line: 267, baseType: !81)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !257, file: !27, line: 271, baseType: !92, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !257, file: !27, line: 272, baseType: !92, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !257, file: !27, line: 273, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !232, file: !27, line: 35, baseType: !96, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !232, file: !27, line: 36, baseType: !87, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tif_customdir", scope: !155, file: !156, line: 130, baseType: !170, size: 2240, offset: 2688)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !155, file: !156, line: 135, baseType: !269, size: 128, offset: 4928)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !155, file: !156, line: 131, size: 128, elements: !270)
!270 = !{!271, !277, !284}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !269, file: !156, line: 132, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderCommon", file: !6, line: 96, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 93, size: 32, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !273, file: !6, line: 94, baseType: !102, size: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !273, file: !6, line: 95, baseType: !102, size: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "classic", scope: !269, file: !156, line: 133, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderClassic", file: !6, line: 101, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 97, size: 64, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !279, file: !6, line: 98, baseType: !102, size: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !279, file: !6, line: 99, baseType: !102, size: 16, offset: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !279, file: !6, line: 100, baseType: !92, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "big", scope: !269, file: !156, line: 134, baseType: !285, size: 128)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderBig", file: !6, line: 108, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 102, size: 128, elements: !287)
!287 = !{!288, !289, !290, !291, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !286, file: !6, line: 103, baseType: !102, size: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !286, file: !6, line: 104, baseType: !102, size: 16, offset: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_offsetsize", scope: !286, file: !6, line: 105, baseType: !102, size: 16, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_unused", scope: !286, file: !6, line: 106, baseType: !102, size: 16, offset: 48)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !286, file: !6, line: 107, baseType: !163, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header_size", scope: !155, file: !156, line: 136, baseType: !102, size: 16, offset: 5056)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !155, file: !156, line: 137, baseType: !92, size: 32, offset: 5088)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !155, file: !156, line: 138, baseType: !102, size: 16, offset: 5120)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !155, file: !156, line: 139, baseType: !92, size: 32, offset: 5152)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !155, file: !156, line: 140, baseType: !163, size: 64, offset: 5184)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !155, file: !156, line: 141, baseType: !163, size: 64, offset: 5248)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !155, file: !156, line: 143, baseType: !102, size: 16, offset: 5312)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !155, file: !156, line: 144, baseType: !163, size: 64, offset: 5376)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !155, file: !156, line: 146, baseType: !92, size: 32, offset: 5440)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !155, file: !156, line: 147, baseType: !92, size: 32, offset: 5472)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !155, file: !156, line: 148, baseType: !304, size: 64, offset: 5504)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !154, line: 67, baseType: !305)
!305 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestatus", scope: !155, file: !156, line: 150, baseType: !96, size: 32, offset: 5568)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fixuptags", scope: !155, file: !156, line: 151, baseType: !308, size: 64, offset: 5632)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !156, line: 89, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!96, !152}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !155, file: !156, line: 152, baseType: !308, size: 64, offset: 5696)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !155, file: !156, line: 153, baseType: !314, size: 64, offset: 5760)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !156, line: 90, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!96, !152, !102}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !155, file: !156, line: 154, baseType: !308, size: 64, offset: 5824)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestatus", scope: !155, file: !156, line: 155, baseType: !96, size: 32, offset: 5888)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !155, file: !156, line: 156, baseType: !314, size: 64, offset: 5952)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !155, file: !156, line: 157, baseType: !308, size: 64, offset: 6016)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !155, file: !156, line: 158, baseType: !323, size: 64, offset: 6080)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !156, line: 91, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!96, !152, !327, !304, !102}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !6, line: 69, baseType: !94)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !155, file: !156, line: 159, baseType: !323, size: 64, offset: 6144)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !155, file: !156, line: 160, baseType: !323, size: 64, offset: 6208)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !155, file: !156, line: 161, baseType: !323, size: 64, offset: 6272)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !155, file: !156, line: 162, baseType: !323, size: 64, offset: 6336)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !155, file: !156, line: 163, baseType: !323, size: 64, offset: 6400)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !155, file: !156, line: 164, baseType: !335, size: 64, offset: 6464)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !156, line: 88, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !152}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !155, file: !156, line: 165, baseType: !340, size: 64, offset: 6528)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !156, line: 92, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!96, !152, !92}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !155, file: !156, line: 166, baseType: !335, size: 64, offset: 6592)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !155, file: !156, line: 167, baseType: !346, size: 64, offset: 6656)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !156, line: 94, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!92, !152, !92}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !155, file: !156, line: 168, baseType: !351, size: 64, offset: 6720)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !156, line: 95, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !152, !91, !91}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !155, file: !156, line: 169, baseType: !327, size: 64, offset: 6784)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !155, file: !156, line: 171, baseType: !304, size: 64, offset: 6848)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !155, file: !156, line: 172, baseType: !304, size: 64, offset: 6912)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !155, file: !156, line: 173, baseType: !327, size: 64, offset: 6976)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !155, file: !156, line: 174, baseType: !304, size: 64, offset: 7040)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataoff", scope: !155, file: !156, line: 175, baseType: !304, size: 64, offset: 7104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataloaded", scope: !155, file: !156, line: 176, baseType: !304, size: 64, offset: 7168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !155, file: !156, line: 177, baseType: !327, size: 64, offset: 7232)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !155, file: !156, line: 178, baseType: !304, size: 64, offset: 7296)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !155, file: !156, line: 180, baseType: !327, size: 64, offset: 7360)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !155, file: !156, line: 181, baseType: !304, size: 64, offset: 7424)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !155, file: !156, line: 182, baseType: !367, size: 64, offset: 7488)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !154, line: 279, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!96, !371, !372, !373}
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !154, line: 106, baseType: !87)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !154, line: 68, baseType: !163)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !155, file: !156, line: 183, baseType: !376, size: 64, offset: 7552)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !154, line: 280, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !371, !87, !374}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !155, file: !156, line: 185, baseType: !371, size: 64, offset: 7616)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !155, file: !156, line: 186, baseType: !382, size: 64, offset: 7680)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !154, line: 275, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!304, !371, !87, !304}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !155, file: !156, line: 187, baseType: !382, size: 64, offset: 7744)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !155, file: !156, line: 188, baseType: !388, size: 64, offset: 7808)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !154, line: 276, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!374, !371, !374, !96}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !155, file: !156, line: 189, baseType: !393, size: 64, offset: 7872)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !154, line: 277, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!96, !371}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !155, file: !156, line: 190, baseType: !398, size: 64, offset: 7936)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !154, line: 278, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!374, !371}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !155, file: !156, line: 192, baseType: !403, size: 64, offset: 8000)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !156, line: 93, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !152, !327, !304}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fields", scope: !155, file: !156, line: 194, baseType: !408, size: 64, offset: 8064)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !155, file: !156, line: 195, baseType: !410, size: 64, offset: 8128)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !411, line: 62, baseType: !90)
!411 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tif_foundfield", scope: !155, file: !156, line: 196, baseType: !235, size: 64, offset: 8192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tagmethods", scope: !155, file: !156, line: 197, baseType: !414, size: 192, offset: 8256)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagMethods", file: !154, line: 335, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 331, size: 192, elements: !416)
!416 = !{!417, !429, !431}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vsetfield", scope: !415, file: !154, line: 332, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !154, line: 327, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!96, !152, !92, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 73, size: 192, elements: !424)
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !423, file: !3, line: 73, baseType: !7, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !423, file: !3, line: 73, baseType: !7, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !423, file: !3, line: 73, baseType: !87, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !423, file: !3, line: 73, baseType: !87, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "vgetfield", scope: !415, file: !154, line: 333, baseType: !430, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !154, line: 328, baseType: !419)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "printdir", scope: !415, file: !154, line: 334, baseType: !432, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !154, line: 329, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !152, !436, !305}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !438, line: 48, baseType: !439)
!438 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !440, line: 241, size: 1728, elements: !441)
!440 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !462, !463, !464, !465, !468, !469, !471, !475, !478, !480, !481, !482, !483, !484, !485, !486}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !439, file: !440, line: 242, baseType: !96, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !439, file: !440, line: 247, baseType: !119, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !439, file: !440, line: 248, baseType: !119, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !439, file: !440, line: 249, baseType: !119, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !439, file: !440, line: 250, baseType: !119, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !439, file: !440, line: 251, baseType: !119, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !439, file: !440, line: 252, baseType: !119, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !439, file: !440, line: 253, baseType: !119, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !439, file: !440, line: 254, baseType: !119, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !439, file: !440, line: 256, baseType: !119, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !439, file: !440, line: 257, baseType: !119, size: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !439, file: !440, line: 258, baseType: !119, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !439, file: !440, line: 260, baseType: !455, size: 64, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !440, line: 156, size: 192, elements: !457)
!457 = !{!458, !459, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !456, file: !440, line: 157, baseType: !455, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !456, file: !440, line: 158, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !456, file: !440, line: 162, baseType: !96, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !439, file: !440, line: 262, baseType: !460, size: 64, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !439, file: !440, line: 264, baseType: !96, size: 32, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !439, file: !440, line: 268, baseType: !96, size: 32, offset: 928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !439, file: !440, line: 270, baseType: !466, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !467, line: 131, baseType: !305)
!467 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !439, file: !440, line: 274, baseType: !103, size: 16, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !439, file: !440, line: 275, baseType: !470, size: 8, offset: 1040)
!470 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !439, file: !440, line: 276, baseType: !472, size: 8, offset: 1048)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 8, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 1)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !439, file: !440, line: 280, baseType: !476, size: 64, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !440, line: 150, baseType: null)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !439, file: !440, line: 289, baseType: !479, size: 64, offset: 1152)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !467, line: 132, baseType: !305)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !439, file: !440, line: 297, baseType: !87, size: 64, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !439, file: !440, line: 298, baseType: !87, size: 64, offset: 1280)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !439, file: !440, line: 299, baseType: !87, size: 64, offset: 1344)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !439, file: !440, line: 300, baseType: !87, size: 64, offset: 1408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !439, file: !440, line: 302, baseType: !410, size: 64, offset: 1472)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !439, file: !440, line: 303, baseType: !96, size: 32, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !439, file: !440, line: 305, baseType: !487, size: 160, offset: 1568)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 160, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 20)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientinfo", scope: !155, file: !156, line: 198, baseType: !491, size: 64, offset: 8448)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFClientInfoLink", file: !156, line: 79, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client_info", file: !156, line: 75, size: 192, elements: !494)
!494 = !{!495, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !156, line: 76, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !156, line: 77, baseType: !87, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !493, file: !156, line: 78, baseType: !119, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldscompat", scope: !155, file: !156, line: 201, baseType: !255, size: 64, offset: 8512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfieldscompat", scope: !155, file: !156, line: 202, baseType: !410, size: 64, offset: 8576)
!501 = !DILocation(line: 73, column: 8, scope: !142)
!502 = !DILocalVariable(name: "out", scope: !142, file: !3, line: 73, type: !152)
!503 = !DILocation(line: 73, column: 13, scope: !142)
!504 = !DILocalVariable(name: "c", scope: !142, file: !3, line: 74, type: !96)
!505 = !DILocation(line: 74, column: 6, scope: !142)
!506 = !DILocation(line: 78, column: 2, scope: !142)
!507 = !DILocation(line: 78, column: 21, scope: !142)
!508 = !DILocation(line: 78, column: 27, scope: !142)
!509 = !DILocation(line: 78, column: 14, scope: !142)
!510 = !DILocation(line: 78, column: 12, scope: !142)
!511 = !DILocation(line: 78, column: 47, scope: !142)
!512 = !DILocation(line: 79, column: 11, scope: !142)
!513 = !DILocation(line: 79, column: 3, scope: !142)
!514 = !DILocation(line: 81, column: 8, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !3, line: 81, column: 8)
!516 = distinct !DILexicalBlock(scope: !142, file: !3, line: 79, column: 14)
!517 = !DILocation(line: 81, column: 8, scope: !516)
!518 = !DILocation(line: 82, column: 20, scope: !515)
!519 = !DILocation(line: 82, column: 8, scope: !515)
!520 = !DILocation(line: 83, column: 13, scope: !521)
!521 = distinct !DILexicalBlock(scope: !515, file: !3, line: 83, column: 13)
!522 = !DILocation(line: 83, column: 13, scope: !515)
!523 = !DILocation(line: 84, column: 20, scope: !521)
!524 = !DILocation(line: 84, column: 8, scope: !521)
!525 = !DILocation(line: 85, column: 13, scope: !526)
!526 = distinct !DILexicalBlock(scope: !521, file: !3, line: 85, column: 13)
!527 = !DILocation(line: 85, column: 13, scope: !521)
!528 = !DILocation(line: 86, column: 20, scope: !526)
!529 = !DILocation(line: 86, column: 8, scope: !526)
!530 = !DILocation(line: 87, column: 13, scope: !531)
!531 = distinct !DILexicalBlock(scope: !526, file: !3, line: 87, column: 13)
!532 = !DILocation(line: 87, column: 13, scope: !526)
!533 = !DILocation(line: 88, column: 20, scope: !531)
!534 = !DILocation(line: 88, column: 8, scope: !531)
!535 = !DILocation(line: 89, column: 13, scope: !536)
!536 = distinct !DILexicalBlock(scope: !531, file: !3, line: 89, column: 13)
!537 = !DILocation(line: 89, column: 13, scope: !531)
!538 = !DILocation(line: 90, column: 20, scope: !536)
!539 = !DILocation(line: 90, column: 8, scope: !536)
!540 = !DILocation(line: 92, column: 8, scope: !536)
!541 = !DILocation(line: 93, column: 4, scope: !516)
!542 = !DILocation(line: 95, column: 28, scope: !516)
!543 = !DILocation(line: 95, column: 23, scope: !516)
!544 = !DILocation(line: 95, column: 21, scope: !516)
!545 = !DILocation(line: 96, column: 4, scope: !516)
!546 = !DILocation(line: 98, column: 27, scope: !516)
!547 = !DILocation(line: 98, column: 22, scope: !516)
!548 = !DILocation(line: 98, column: 20, scope: !516)
!549 = !DILocation(line: 99, column: 4, scope: !516)
!550 = !DILocation(line: 101, column: 24, scope: !516)
!551 = !DILocation(line: 101, column: 19, scope: !516)
!552 = !DILocation(line: 101, column: 17, scope: !516)
!553 = !DILocation(line: 102, column: 4, scope: !516)
!554 = !DILocation(line: 104, column: 21, scope: !516)
!555 = !DILocation(line: 105, column: 21, scope: !516)
!556 = !DILocation(line: 106, column: 21, scope: !516)
!557 = !DILocation(line: 107, column: 21, scope: !516)
!558 = !DILocation(line: 108, column: 21, scope: !516)
!559 = !DILocation(line: 109, column: 21, scope: !516)
!560 = !DILocation(line: 110, column: 4, scope: !516)
!561 = !DILocation(line: 112, column: 4, scope: !516)
!562 = !DILocation(line: 114, column: 3, scope: !516)
!563 = distinct !{!563, !506, !564}
!564 = !DILocation(line: 114, column: 3, scope: !142)
!565 = !DILocation(line: 115, column: 6, scope: !566)
!566 = distinct !DILexicalBlock(scope: !142, file: !3, line: 115, column: 6)
!567 = !DILocation(line: 115, column: 13, scope: !566)
!568 = !DILocation(line: 115, column: 11, scope: !566)
