; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type opaque
%struct.colorbox = type { %struct.colorbox*, %struct.colorbox*, i32, i32, i32, i32, i32, i32, i32 }
%struct.C_cell = type { i32, [256 x [2 x i32]] }

@num_colors = common dso_local global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [8 x i8] c"c:C:r:f\00", align 1
@optarg = external global i8*, align 8
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [30 x i8] c"-c: colormap too big, max %d\0A\00", align 1
@rowsperstrip = dso_local global i32 -1, align 4, !dbg !52
@optind = external global i32, align 4
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@in = common dso_local global %struct.tiff* null, align 8, !dbg !86
@imagewidth = common dso_local global i32 0, align 4, !dbg !96
@imagelength = common dso_local global i32 0, align 4, !dbg !98
@bitspersample = dso_local global i16 1, align 2, !dbg !56
@samplesperpixel = common dso_local global i16 0, align 2, !dbg !94

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "num_colors", scope: !2, file: !3, line: 89, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, globals: !51, nameTableKind: None)
!3 = !DIFile(filename: "tiffmedian.c", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 420, baseType: !26, size: 32, elements: !28)
!6 = distinct !DISubprogram(name: "splitbox", scope: !3, file: !3, line: 411, type: !7, scopeLine: 412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !27)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colorbox", file: !3, line: 81, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "colorbox", file: !3, line: 75, size: 384, elements: !12)
!12 = !{!13, !15, !16, !18, !19, !20, !21, !22, !23}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !3, line: 76, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !11, file: !3, line: 76, baseType: !14, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "rmin", scope: !11, file: !3, line: 77, baseType: !17, size: 32, offset: 128)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !11, file: !3, line: 77, baseType: !17, size: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "gmin", scope: !11, file: !3, line: 78, baseType: !17, size: 32, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "gmax", scope: !11, file: !3, line: 78, baseType: !17, size: 32, offset: 224)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "bmin", scope: !11, file: !3, line: 79, baseType: !17, size: 32, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bmax", scope: !11, file: !3, line: 79, baseType: !17, size: 32, offset: 288)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !11, file: !3, line: 80, baseType: !24, size: 32, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !25, line: 75, baseType: !26)
!25 = !DIFile(filename: "../libtiff/tiff.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !{}
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "RED", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "GREEN", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "BLUE", value: 2, isUnsigned: true)
!32 = !{!33, !9, !34, !45, !46, !48, !35, !49, !50}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "C_cell", file: !3, line: 86, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 83, size: 16416, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "num_ents", scope: !37, file: !3, line: 84, baseType: !17, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !37, file: !3, line: 85, baseType: !41, size: 16384, offset: 32)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 16384, elements: !42)
!42 = !{!43, !44}
!43 = !DISubrange(count: 256)
!44 = !DISubrange(count: 2)
!45 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !25, line: 72, baseType: !47)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!51 = !{!52, !54, !56, !58, !60, !67, !71, !73, !0, !75, !80, !82, !84, !86, !92, !94, !96, !98}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "rowsperstrip", scope: !2, file: !3, line: 95, type: !24, isLocal: false, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "compression", scope: !2, file: !3, line: 96, type: !46, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "bitspersample", scope: !2, file: !3, line: 97, type: !46, isLocal: false, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "predictor", scope: !2, file: !3, line: 101, type: !46, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 318, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 896, elements: !65)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !{!66}
!66 = !DISubrange(count: 14)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "rm", scope: !2, file: !3, line: 88, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 4096, elements: !70)
!70 = !{!43}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "gm", scope: !2, file: !3, line: 88, type: !69, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "bm", scope: !2, file: !3, line: 88, type: !69, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "histogram", scope: !2, file: !3, line: 90, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1048576, elements: !78)
!78 = !{!79, !79, !79}
!79 = !DISubrange(count: 32)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "freeboxes", scope: !2, file: !3, line: 91, type: !9, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "usedboxes", scope: !2, file: !3, line: 92, type: !9, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "ColorCells", scope: !2, file: !3, line: 93, type: !34, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "in", scope: !2, file: !3, line: 94, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
