; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type { i8*, i32, i32, i32, i64, i64, i64*, i16, i16, %struct.TIFFDirectory, %struct.TIFFDirectory, %union.anon, i16, i32, i16, i32, i64, i64, i16, i64, i32, i32, i64, i32, i32 (%struct.tiff*)*, i32 (%struct.tiff*)*, i32 (%struct.tiff*, i16)*, i32 (%struct.tiff*)*, i32, i32 (%struct.tiff*, i16)*, i32 (%struct.tiff*)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, void (%struct.tiff*)*, i32 (%struct.tiff*, i32)*, void (%struct.tiff*)*, i32 (%struct.tiff*, i32)*, void (%struct.tiff*, i32*, i32*)*, i8*, i64, i64, i8*, i64, i64, i64, i8*, i64, i8*, i64, i32 (i8*, i8**, i64*)*, void (i8*, i8*, i64)*, i8*, i64 (i8*, i8*, i64)*, i64 (i8*, i8*, i64)*, i64 (i8*, i64, i32)*, i32 (i8*)*, i64 (i8*)*, void (%struct.tiff*, i8*, i64)*, %struct._TIFFField**, i64, %struct._TIFFField*, %struct.TIFFTagMethods, %struct.client_info*, %struct._TIFFFieldArray*, i64 }

!64 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT64", value: 35, isUnsigned: true)
!65 = !DIEnumerator(name: "TIFF_SETGET_C16_FLOAT", value: 36, isUnsigned: true)
!66 = !DIEnumerator(name: "TIFF_SETGET_C16_DOUBLE", value: 37, isUnsigned: true)
!67 = !DIEnumerator(name: "TIFF_SETGET_C16_IFD8", value: 38, isUnsigned: true)
!68 = !DIEnumerator(name: "TIFF_SETGET_C32_ASCII", value: 39, isUnsigned: true)
!69 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT8", value: 40, isUnsigned: true)
!70 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT8", value: 41, isUnsigned: true)
!71 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT16", value: 42, isUnsigned: true)
!72 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT16", value: 43, isUnsigned: true)
!73 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT32", value: 44, isUnsigned: true)
!74 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT32", value: 45, isUnsigned: true)
!75 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT64", value: 46, isUnsigned: true)
!76 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT64", value: 47, isUnsigned: true)
!77 = !DIEnumerator(name: "TIFF_SETGET_C32_FLOAT", value: 48, isUnsigned: true)
!78 = !DIEnumerator(name: "TIFF_SETGET_C32_DOUBLE", value: 49, isUnsigned: true)
!79 = !DIEnumerator(name: "TIFF_SETGET_C32_IFD8", value: 50, isUnsigned: true)
!80 = !DIEnumerator(name: "TIFF_SETGET_OTHER", value: 51, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 263, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "tfiatImage", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "tfiatExif", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "tfiatOther", value: 2, isUnsigned: true)
!86 = !{!87, !88, !90, !91}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !6, line: 75, baseType: !7)
!90 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!93 = !{!94, !98, !0, !100, !103, !105}
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "compression", scope: !2, file: !3, line: 53, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !6, line: 72, baseType: !97)
!97 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "rowsperstrip", scope: !2, file: !3, line: 54, type: !89, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "no_alpha", scope: !2, file: !3, line: 56, type: !102, isLocal: false, isDefinition: true)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "bigtiff_output", scope: !2, file: !3, line: 57, type: !102, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 505, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 832, elements: !110)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!110 = !{!111}
!111 = !DISubrange(count: 13)
!112 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!113 = !{i32 2, !"Dwarf Version", i32 4}
!114 = !{i32 2, !"Debug Info Version", i32 3}
!115 = !{i32 1, !"wchar_size", i32 4}
!116 = !{i32 7, !"PIC Level", i32 2}
!117 = !{i32 1, !"ThinLTO", i32 0}
!118 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!119 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 64, type: !120, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !123)
!120 = !DISubroutineType(types: !121)
!121 = !{!102, !102, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!123 = !{}
!124 = !DILocalVariable(name: "argc", arg: 1, scope: !119, file: !3, line: 64, type: !102)
!125 = !DILocation(line: 64, column: 10, scope: !119)
!126 = !DILocalVariable(name: "argv", arg: 2, scope: !119, file: !3, line: 64, type: !122)
!127 = !DILocation(line: 64, column: 22, scope: !119)
!128 = !DILocalVariable(name: "in", scope: !119, file: !3, line: 66, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !131, line: 40, baseType: !132)
!131 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !133, line: 97, size: 8640, elements: !134)
!133 = !DIFile(filename: "../libtiff/tiffiop.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!134 = !{!135, !136, !137, !138, !139, !141, !142, !144, !145, !146, !248, !249, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !287, !288, !293, !294, !299, !300, !301, !302, !303, !310, !311, !312, !313, !314, !315, !320, !325, !326, !331, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !356, !361, !362, !367, !368, !373, !378, !383, !388, !390, !393, !394, !471, !480, !481}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !132, file: !133, line: 98, baseType: !108, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !132, file: !133, line: 99, baseType: !102, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !132, file: !133, line: 100, baseType: !102, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !132, file: !133, line: 101, baseType: !89, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !132, file: !133, line: 124, baseType: !140, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !6, line: 78, baseType: !90)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !132, file: !133, line: 125, baseType: !140, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlist", scope: !132, file: !133, line: 126, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlistsize", scope: !132, file: !133, line: 127, baseType: !96, size: 16, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirnumber", scope: !132, file: !133, line: 128, baseType: !96, size: 16, offset: 400)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !132, file: !133, line: 129, baseType: !147, size: 2240, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !27, line: 119, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 64, size: 2240, elements: !149)
!149 = !{!150, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !175, !176, !178, !179, !180, !181, !182, !183, !187, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !207, !208, !209, !210}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !148, file: !27, line: 67, baseType: !151, size: 256)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 256, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 4)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !148, file: !27, line: 69, baseType: !89, size: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !148, file: !27, line: 69, baseType: !89, size: 32, offset: 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !148, file: !27, line: 69, baseType: !89, size: 32, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !148, file: !27, line: 70, baseType: !89, size: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !148, file: !27, line: 70, baseType: !89, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !148, file: !27, line: 70, baseType: !89, size: 32, offset: 416)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !148, file: !27, line: 71, baseType: !89, size: 32, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !148, file: !27, line: 72, baseType: !96, size: 16, offset: 480)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !148, file: !27, line: 73, baseType: !96, size: 16, offset: 496)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !148, file: !27, line: 74, baseType: !96, size: 16, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !148, file: !27, line: 75, baseType: !96, size: 16, offset: 528)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !148, file: !27, line: 76, baseType: !96, size: 16, offset: 544)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !148, file: !27, line: 77, baseType: !96, size: 16, offset: 560)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !148, file: !27, line: 78, baseType: !96, size: 16, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !148, file: !27, line: 79, baseType: !96, size: 16, offset: 592)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !148, file: !27, line: 80, baseType: !89, size: 32, offset: 608)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !148, file: !27, line: 81, baseType: !96, size: 16, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !148, file: !27, line: 81, baseType: !96, size: 16, offset: 656)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !148, file: !27, line: 82, baseType: !173, size: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !148, file: !27, line: 83, baseType: !173, size: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !148, file: !27, line: 84, baseType: !177, size: 32, offset: 832)
!177 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !148, file: !27, line: 84, baseType: !177, size: 32, offset: 864)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !148, file: !27, line: 85, baseType: !96, size: 16, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !148, file: !27, line: 86, baseType: !96, size: 16, offset: 912)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !148, file: !27, line: 87, baseType: !177, size: 32, offset: 928)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !148, file: !27, line: 87, baseType: !177, size: 32, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !148, file: !27, line: 88, baseType: !184, size: 32, offset: 992)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !148, file: !27, line: 89, baseType: !188, size: 192, offset: 1024)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 192, elements: !190)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!190 = !{!191}
!191 = !DISubrange(count: 3)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !148, file: !27, line: 90, baseType: !184, size: 32, offset: 1216)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !148, file: !27, line: 91, baseType: !96, size: 16, offset: 1248)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !148, file: !27, line: 92, baseType: !189, size: 64, offset: 1280)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !148, file: !27, line: 96, baseType: !89, size: 32, offset: 1344)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !148, file: !27, line: 97, baseType: !89, size: 32, offset: 1376)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !148, file: !27, line: 98, baseType: !143, size: 64, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !148, file: !27, line: 99, baseType: !143, size: 64, offset: 1472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecountsorted", scope: !148, file: !27, line: 100, baseType: !102, size: 32, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !148, file: !27, line: 105, baseType: !96, size: 16, offset: 1568)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !148, file: !27, line: 106, baseType: !143, size: 64, offset: 1600)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !148, file: !27, line: 108, baseType: !184, size: 32, offset: 1664)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !148, file: !27, line: 109, baseType: !96, size: 16, offset: 1696)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !148, file: !27, line: 111, baseType: !188, size: 192, offset: 1728)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !148, file: !27, line: 112, baseType: !206, size: 64, offset: 1920)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !148, file: !27, line: 114, baseType: !102, size: 32, offset: 1984)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !148, file: !27, line: 115, baseType: !108, size: 64, offset: 2048)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValueCount", scope: !148, file: !27, line: 117, baseType: !102, size: 32, offset: 2112)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValues", scope: !148, file: !27, line: 118, baseType: !211, size: 64, offset: 2176)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagValue", file: !27, line: 37, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 33, size: 192, elements: !214)
!214 = !{!215, !246, !247}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !213, file: !27, line: 34, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFField", file: !131, line: 320, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFField", file: !27, line: 276, size: 384, elements: !220)
!220 = !{!221, !222, !224, !225, !227, !228, !230, !231, !232, !233, !234, !235}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !219, file: !27, line: 277, baseType: !89, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !219, file: !27, line: 278, baseType: !223, size: 16, offset: 32)
!223 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !219, file: !27, line: 279, baseType: !223, size: 16, offset: 48)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !219, file: !27, line: 280, baseType: !226, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !6, line: 143, baseType: !5)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !219, file: !27, line: 281, baseType: !89, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "set_field_type", scope: !219, file: !27, line: 282, baseType: !229, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSetGetFieldType", file: !27, line: 250, baseType: !26)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "get_field_type", scope: !219, file: !27, line: 283, baseType: !229, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !219, file: !27, line: 284, baseType: !97, size: 16, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !219, file: !27, line: 285, baseType: !92, size: 8, offset: 208)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !219, file: !27, line: 286, baseType: !92, size: 8, offset: 216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !219, file: !27, line: 287, baseType: !108, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "field_subfields", scope: !219, file: !27, line: 288, baseType: !236, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArray", file: !131, line: 321, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFFieldArray", file: !27, line: 269, size: 192, elements: !239)
!239 = !{!240, !242, !243, !244}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !27, line: 270, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArrayType", file: !27, line: 267, baseType: !81)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !238, file: !27, line: 271, baseType: !89, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !238, file: !27, line: 272, baseType: !89, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !238, file: !27, line: 273, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !213, file: !27, line: 35, baseType: !102, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !27, line: 36, baseType: !87, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tif_customdir", scope: !132, file: !133, line: 130, baseType: !147, size: 2240, offset: 2688)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !132, file: !133, line: 135, baseType: !250, size: 128, offset: 4928)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !133, line: 131, size: 128, elements: !251)
!251 = !{!252, !258, !265}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !250, file: !133, line: 132, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderCommon", file: !6, line: 96, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 93, size: 32, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !254, file: !6, line: 94, baseType: !96, size: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !254, file: !6, line: 95, baseType: !96, size: 16, offset: 16)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "classic", scope: !250, file: !133, line: 133, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderClassic", file: !6, line: 101, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 97, size: 64, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !260, file: !6, line: 98, baseType: !96, size: 16)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !260, file: !6, line: 99, baseType: !96, size: 16, offset: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !260, file: !6, line: 100, baseType: !89, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "big", scope: !250, file: !133, line: 134, baseType: !266, size: 128)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderBig", file: !6, line: 108, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 102, size: 128, elements: !268)
!268 = !{!269, !270, !271, !272, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !267, file: !6, line: 103, baseType: !96, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !267, file: !6, line: 104, baseType: !96, size: 16, offset: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_offsetsize", scope: !267, file: !6, line: 105, baseType: !96, size: 16, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_unused", scope: !267, file: !6, line: 106, baseType: !96, size: 16, offset: 48)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !267, file: !6, line: 107, baseType: !140, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header_size", scope: !132, file: !133, line: 136, baseType: !96, size: 16, offset: 5056)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !132, file: !133, line: 137, baseType: !89, size: 32, offset: 5088)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !132, file: !133, line: 138, baseType: !96, size: 16, offset: 5120)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !132, file: !133, line: 139, baseType: !89, size: 32, offset: 5152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !132, file: !133, line: 140, baseType: !140, size: 64, offset: 5184)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !132, file: !133, line: 141, baseType: !140, size: 64, offset: 5248)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !132, file: !133, line: 143, baseType: !96, size: 16, offset: 5312)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !132, file: !133, line: 144, baseType: !140, size: 64, offset: 5376)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !132, file: !133, line: 146, baseType: !89, size: 32, offset: 5440)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !132, file: !133, line: 147, baseType: !89, size: 32, offset: 5472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !132, file: !133, line: 148, baseType: !285, size: 64, offset: 5504)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !131, line: 67, baseType: !286)
!286 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestatus", scope: !132, file: !133, line: 150, baseType: !102, size: 32, offset: 5568)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fixuptags", scope: !132, file: !133, line: 151, baseType: !289, size: 64, offset: 5632)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !133, line: 89, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!102, !129}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !132, file: !133, line: 152, baseType: !289, size: 64, offset: 5696)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !132, file: !133, line: 153, baseType: !295, size: 64, offset: 5760)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !133, line: 90, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!102, !129, !96}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !132, file: !133, line: 154, baseType: !289, size: 64, offset: 5824)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestatus", scope: !132, file: !133, line: 155, baseType: !102, size: 32, offset: 5888)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !132, file: !133, line: 156, baseType: !295, size: 64, offset: 5952)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !132, file: !133, line: 157, baseType: !289, size: 64, offset: 6016)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !132, file: !133, line: 158, baseType: !304, size: 64, offset: 6080)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !133, line: 91, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!102, !129, !308, !285, !96}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !6, line: 69, baseType: !92)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !132, file: !133, line: 159, baseType: !304, size: 64, offset: 6144)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !132, file: !133, line: 160, baseType: !304, size: 64, offset: 6208)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !132, file: !133, line: 161, baseType: !304, size: 64, offset: 6272)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !132, file: !133, line: 162, baseType: !304, size: 64, offset: 6336)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !132, file: !133, line: 163, baseType: !304, size: 64, offset: 6400)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !132, file: !133, line: 164, baseType: !316, size: 64, offset: 6464)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !133, line: 88, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !129}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !132, file: !133, line: 165, baseType: !321, size: 64, offset: 6528)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !133, line: 92, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!102, !129, !89}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !132, file: !133, line: 166, baseType: !316, size: 64, offset: 6592)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !132, file: !133, line: 167, baseType: !327, size: 64, offset: 6656)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !133, line: 94, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!89, !129, !89}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !132, file: !133, line: 168, baseType: !332, size: 64, offset: 6720)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !133, line: 95, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !129, !88, !88}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !132, file: !133, line: 169, baseType: !308, size: 64, offset: 6784)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !132, file: !133, line: 171, baseType: !285, size: 64, offset: 6848)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !132, file: !133, line: 172, baseType: !285, size: 64, offset: 6912)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !132, file: !133, line: 173, baseType: !308, size: 64, offset: 6976)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !132, file: !133, line: 174, baseType: !285, size: 64, offset: 7040)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataoff", scope: !132, file: !133, line: 175, baseType: !285, size: 64, offset: 7104)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataloaded", scope: !132, file: !133, line: 176, baseType: !285, size: 64, offset: 7168)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !132, file: !133, line: 177, baseType: !308, size: 64, offset: 7232)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !132, file: !133, line: 178, baseType: !285, size: 64, offset: 7296)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !132, file: !133, line: 180, baseType: !308, size: 64, offset: 7360)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !132, file: !133, line: 181, baseType: !285, size: 64, offset: 7424)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !132, file: !133, line: 182, baseType: !348, size: 64, offset: 7488)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !131, line: 279, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!102, !352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !131, line: 106, baseType: !87)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !131, line: 68, baseType: !140)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !132, file: !133, line: 183, baseType: !357, size: 64, offset: 7552)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !131, line: 280, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !352, !87, !355}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !132, file: !133, line: 185, baseType: !352, size: 64, offset: 7616)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !132, file: !133, line: 186, baseType: !363, size: 64, offset: 7680)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !131, line: 275, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!285, !352, !87, !285}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !132, file: !133, line: 187, baseType: !363, size: 64, offset: 7744)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !132, file: !133, line: 188, baseType: !369, size: 64, offset: 7808)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !131, line: 276, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!355, !352, !355, !102}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !132, file: !133, line: 189, baseType: !374, size: 64, offset: 7872)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !131, line: 277, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!102, !352}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !132, file: !133, line: 190, baseType: !379, size: 64, offset: 7936)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !131, line: 278, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!355, !352}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !132, file: !133, line: 192, baseType: !384, size: 64, offset: 8000)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !133, line: 93, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !129, !308, !285}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fields", scope: !132, file: !133, line: 194, baseType: !389, size: 64, offset: 8064)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !132, file: !133, line: 195, baseType: !391, size: 64, offset: 8128)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !392, line: 62, baseType: !90)
!392 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tif_foundfield", scope: !132, file: !133, line: 196, baseType: !216, size: 64, offset: 8192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tagmethods", scope: !132, file: !133, line: 197, baseType: !395, size: 192, offset: 8256)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagMethods", file: !131, line: 335, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 331, size: 192, elements: !397)
!397 = !{!398, !410, !412}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vsetfield", scope: !396, file: !131, line: 332, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !131, line: 327, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!102, !129, !89, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 66, size: 192, elements: !405)
!405 = !{!406, !407, !408, !409}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !404, file: !3, line: 66, baseType: !7, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !404, file: !3, line: 66, baseType: !7, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !404, file: !3, line: 66, baseType: !87, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !404, file: !3, line: 66, baseType: !87, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "vgetfield", scope: !396, file: !131, line: 333, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !131, line: 328, baseType: !400)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "printdir", scope: !396, file: !131, line: 334, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !131, line: 329, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !129, !417, !286}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !419, line: 48, baseType: !420)
!419 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !421, line: 241, size: 1728, elements: !422)
!421 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !443, !444, !445, !446, !449, !450, !452, !456, !459, !461, !462, !463, !464, !465, !466, !467}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !420, file: !421, line: 242, baseType: !102, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !420, file: !421, line: 247, baseType: !108, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !420, file: !421, line: 248, baseType: !108, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !420, file: !421, line: 249, baseType: !108, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !420, file: !421, line: 250, baseType: !108, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !420, file: !421, line: 251, baseType: !108, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !420, file: !421, line: 252, baseType: !108, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !420, file: !421, line: 253, baseType: !108, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !420, file: !421, line: 254, baseType: !108, size: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !420, file: !421, line: 256, baseType: !108, size: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !420, file: !421, line: 257, baseType: !108, size: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !420, file: !421, line: 258, baseType: !108, size: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !420, file: !421, line: 260, baseType: !436, size: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !421, line: 156, size: 192, elements: !438)
!438 = !{!439, !440, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !437, file: !421, line: 157, baseType: !436, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !437, file: !421, line: 158, baseType: !441, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !437, file: !421, line: 162, baseType: !102, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !420, file: !421, line: 262, baseType: !441, size: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !420, file: !421, line: 264, baseType: !102, size: 32, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !420, file: !421, line: 268, baseType: !102, size: 32, offset: 928)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !420, file: !421, line: 270, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !448, line: 131, baseType: !286)
!448 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !420, file: !421, line: 274, baseType: !97, size: 16, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !420, file: !421, line: 275, baseType: !451, size: 8, offset: 1040)
!451 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !420, file: !421, line: 276, baseType: !453, size: 8, offset: 1048)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 8, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 1)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !420, file: !421, line: 280, baseType: !457, size: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !421, line: 150, baseType: null)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !420, file: !421, line: 289, baseType: !460, size: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !448, line: 132, baseType: !286)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !420, file: !421, line: 297, baseType: !87, size: 64, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !420, file: !421, line: 298, baseType: !87, size: 64, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !420, file: !421, line: 299, baseType: !87, size: 64, offset: 1344)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !420, file: !421, line: 300, baseType: !87, size: 64, offset: 1408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !420, file: !421, line: 302, baseType: !391, size: 64, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !420, file: !421, line: 303, baseType: !102, size: 32, offset: 1536)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !420, file: !421, line: 305, baseType: !468, size: 160, offset: 1568)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 160, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 20)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientinfo", scope: !132, file: !133, line: 198, baseType: !472, size: 64, offset: 8448)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFClientInfoLink", file: !133, line: 79, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client_info", file: !133, line: 75, size: 192, elements: !475)
!475 = !{!476, !478, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !133, line: 76, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !133, line: 77, baseType: !87, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !133, line: 78, baseType: !108, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldscompat", scope: !132, file: !133, line: 201, baseType: !236, size: 64, offset: 8512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfieldscompat", scope: !132, file: !133, line: 202, baseType: !391, size: 64, offset: 8576)
!482 = !DILocation(line: 66, column: 8, scope: !119)
!483 = !DILocalVariable(name: "out", scope: !119, file: !3, line: 66, type: !129)
!484 = !DILocation(line: 66, column: 13, scope: !119)
!485 = !DILocalVariable(name: "c", scope: !119, file: !3, line: 67, type: !102)
!486 = !DILocation(line: 67, column: 6, scope: !119)
!487 = !DILocation(line: 71, column: 2, scope: !119)
!488 = !DILocation(line: 71, column: 21, scope: !119)
!489 = !DILocation(line: 71, column: 27, scope: !119)
!490 = !DILocation(line: 71, column: 14, scope: !119)
!491 = !DILocation(line: 71, column: 12, scope: !119)
!492 = !DILocation(line: 71, column: 47, scope: !119)
!493 = !DILocation(line: 72, column: 11, scope: !119)
!494 = !DILocation(line: 72, column: 3, scope: !119)
!495 = !DILocation(line: 74, column: 22, scope: !496)
!496 = distinct !DILexicalBlock(scope: !119, file: !3, line: 72, column: 14)
!497 = !DILocation(line: 75, column: 5, scope: !496)
!498 = !DILocation(line: 78, column: 9, scope: !499)
!499 = distinct !DILexicalBlock(scope: !496, file: !3, line: 78, column: 9)
!500 = !DILocation(line: 78, column: 9, scope: !496)
!501 = !DILocation(line: 79, column: 18, scope: !499)
!502 = !DILocation(line: 79, column: 6, scope: !499)
!503 = !DILocation(line: 80, column: 14, scope: !504)
!504 = distinct !DILexicalBlock(scope: !499, file: !3, line: 80, column: 14)
!505 = !DILocation(line: 80, column: 14, scope: !499)
!506 = !DILocation(line: 81, column: 18, scope: !504)
!507 = !DILocation(line: 81, column: 6, scope: !504)
!508 = !DILocation(line: 82, column: 14, scope: !509)
!509 = distinct !DILexicalBlock(scope: !504, file: !3, line: 82, column: 14)
!510 = !DILocation(line: 82, column: 14, scope: !504)
!511 = !DILocation(line: 83, column: 18, scope: !509)
!512 = !DILocation(line: 83, column: 6, scope: !509)
!513 = !DILocation(line: 84, column: 14, scope: !514)
!514 = distinct !DILexicalBlock(scope: !509, file: !3, line: 84, column: 14)
!515 = !DILocation(line: 84, column: 14, scope: !509)
!516 = !DILocation(line: 85, column: 18, scope: !514)
!517 = !DILocation(line: 85, column: 6, scope: !514)
!518 = !DILocation(line: 86, column: 14, scope: !519)
!519 = distinct !DILexicalBlock(scope: !514, file: !3, line: 86, column: 14)
!520 = !DILocation(line: 86, column: 14, scope: !514)
!521 = !DILocation(line: 87, column: 18, scope: !519)
!522 = !DILocation(line: 87, column: 6, scope: !519)
!523 = !DILocation(line: 89, column: 6, scope: !519)
!524 = !DILocation(line: 90, column: 5, scope: !496)
!525 = !DILocation(line: 93, column: 25, scope: !496)
!526 = !DILocation(line: 93, column: 20, scope: !496)
!527 = !DILocation(line: 93, column: 18, scope: !496)
!528 = !DILocation(line: 94, column: 5, scope: !496)
!529 = !DILocation(line: 97, column: 25, scope: !496)
!530 = !DILocation(line: 97, column: 20, scope: !496)
!531 = !DILocation(line: 97, column: 18, scope: !496)
!532 = !DILocation(line: 98, column: 5, scope: !496)
!533 = !DILocation(line: 101, column: 14, scope: !496)
!534 = !DILocation(line: 102, column: 5, scope: !496)
!535 = !DILocation(line: 105, column: 20, scope: !496)
!536 = !DILocation(line: 106, column: 5, scope: !496)
!537 = !DILocation(line: 109, column: 5, scope: !496)
!538 = !DILocation(line: 111, column: 3, scope: !496)
!539 = distinct !{!539, !487, !540}
!540 = !DILocation(line: 111, column: 3, scope: !119)
!541 = !DILocation(line: 113, column: 6, scope: !542)
!542 = distinct !DILexicalBlock(scope: !119, file: !3, line: 113, column: 6)
!543 = !DILocation(line: 113, column: 13, scope: !542)
!544 = !DILocation(line: 113, column: 11, scope: !542)
!545 = !DILocation(line: 113, column: 20, scope: !542)
!546 = !DILocation(line: 113, column: 6, scope: !119)
!547 = !DILocation(line: 114, column: 3, scope: !542)
!548 = !DILocation(line: 116, column: 17, scope: !119)
!549 = !DILocation(line: 116, column: 22, scope: !119)
