; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tiff = type { i8*, i32, i32, i32, i64, i64, i64*, i16, i16, %struct.TIFFDirectory, %struct.TIFFDirectory, %union.anon, i16, i32, i16, i32, i64, i64, i16, i64, i32, i32, i64, i32, i32 (%struct.tiff*)*, i32 (%struct.tiff*)*, i32 (%struct.tiff*, i16)*, i32 (%struct.tiff*)*, i32, i32 (%struct.tiff*, i16)*, i32 (%struct.tiff*)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, i32 (%struct.tiff*, i8*, i64, i16)*, void (%struct.tiff*)*, i32 (%struct.tiff*, i32)*, void (%struct.tiff*)*, i32 (%struct.tiff*, i32)*, void (%struct.tiff*, i32*, i32*)*, i8*, i64, i64, i8*, i64, i64, i64, i8*, i64, i8*, i64, i32 (i8*, i8**, i64*)*, void (i8*, i8*, i64)*, i8*, i64 (i8*, i8*, i64)*, i64 (i8*, i8*, i64)*, i64 (i8*, i64, i32)*, i32 (i8*)*, i64 (i8*)*, void (%struct.tiff*, i8*, i64)*, %struct._TIFFField**, i64, %struct._TIFFField*, %struct.TIFFTagMethods, %struct.client_info*, %struct._TIFFFieldArray*, i64 }

!46 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT8", value: 17, isUnsigned: true)
!47 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT16", value: 18, isUnsigned: true)
!48 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT16", value: 19, isUnsigned: true)
!49 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT32", value: 20, isUnsigned: true)
!50 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT32", value: 21, isUnsigned: true)
!51 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT64", value: 22, isUnsigned: true)
!52 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT64", value: 23, isUnsigned: true)
!53 = !DIEnumerator(name: "TIFF_SETGET_C0_FLOAT", value: 24, isUnsigned: true)
!54 = !DIEnumerator(name: "TIFF_SETGET_C0_DOUBLE", value: 25, isUnsigned: true)
!55 = !DIEnumerator(name: "TIFF_SETGET_C0_IFD8", value: 26, isUnsigned: true)
!56 = !DIEnumerator(name: "TIFF_SETGET_C16_ASCII", value: 27, isUnsigned: true)
!57 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT8", value: 28, isUnsigned: true)
!58 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT8", value: 29, isUnsigned: true)
!59 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT16", value: 30, isUnsigned: true)
!60 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT16", value: 31, isUnsigned: true)
!61 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT32", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT32", value: 33, isUnsigned: true)
!63 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT64", value: 34, isUnsigned: true)
!64 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT64", value: 35, isUnsigned: true)
!65 = !DIEnumerator(name: "TIFF_SETGET_C16_FLOAT", value: 36, isUnsigned: true)
!66 = !DIEnumerator(name: "TIFF_SETGET_C16_DOUBLE", value: 37, isUnsigned: true)
!67 = !DIEnumerator(name: "TIFF_SETGET_C16_IFD8", value: 38, isUnsigned: true)
!68 = !DIEnumerator(name: "TIFF_SETGET_C32_ASCII", value: 39, isUnsigned: true)
!69 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT8", value: 40, isUnsigned: true)
!70 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT8", value: 41, isUnsigned: true)
!71 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT16", value: 42, isUnsigned: true)
!72 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT16", value: 43, isUnsigned: true)
!73 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT32", value: 44, isUnsigned: true)
!74 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT32", value: 45, isUnsigned: true)
!75 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT64", value: 46, isUnsigned: true)
!76 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT64", value: 47, isUnsigned: true)
!77 = !DIEnumerator(name: "TIFF_SETGET_C32_FLOAT", value: 48, isUnsigned: true)
!78 = !DIEnumerator(name: "TIFF_SETGET_C32_DOUBLE", value: 49, isUnsigned: true)
!79 = !DIEnumerator(name: "TIFF_SETGET_C32_IFD8", value: 50, isUnsigned: true)
!80 = !DIEnumerator(name: "TIFF_SETGET_OTHER", value: 51, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 263, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "tfiatImage", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "tfiatExif", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "tfiatOther", value: 2, isUnsigned: true)
!86 = !{!87, !88, !89, !90, !92, !95, !96, !97, !100}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !6, line: 75, baseType: !7)
!88 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !91, line: 106, baseType: !89)
!91 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !91, line: 67, baseType: !95)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsample_t", file: !91, line: 73, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !6, line: 72, baseType: !99)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdata_t", file: !91, line: 78, baseType: !89)
!101 = !{!0, !102, !108, !462, !464, !466, !468, !470, !472}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 413, type: !104, isLocal: false, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 2112, elements: !106)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!106 = !{!107}
!107 = !DISubrange(count: 33)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "faxTIFF", scope: !2, file: !3, line: 62, type: !110, isLocal: false, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !91, line: 40, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !113, line: 97, size: 8640, elements: !114)
!113 = !DIFile(filename: "../libtiff/tiffiop.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!114 = !{!115, !116, !118, !119, !120, !123, !124, !126, !127, !128, !230, !231, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !273, !274, !279, !280, !281, !282, !283, !290, !291, !292, !293, !294, !295, !300, !305, !306, !311, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !336, !341, !342, !347, !348, !353, !358, !363, !368, !370, !373, !374, !451, !460, !461}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !112, file: !113, line: 98, baseType: !105, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !112, file: !113, line: 99, baseType: !117, size: 32, offset: 64)
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !112, file: !113, line: 100, baseType: !117, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !112, file: !113, line: 101, baseType: !87, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !112, file: !113, line: 124, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !6, line: 78, baseType: !122)
!122 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !112, file: !113, line: 125, baseType: !121, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlist", scope: !112, file: !113, line: 126, baseType: !125, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlistsize", scope: !112, file: !113, line: 127, baseType: !98, size: 16, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirnumber", scope: !112, file: !113, line: 128, baseType: !98, size: 16, offset: 400)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !112, file: !113, line: 129, baseType: !129, size: 2240, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !27, line: 119, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 64, size: 2240, elements: !131)
!131 = !{!132, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !157, !158, !159, !160, !161, !162, !163, !164, !168, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !188, !189, !190, !191}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !130, file: !27, line: 67, baseType: !133, size: 256)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 256, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 4)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !130, file: !27, line: 69, baseType: !87, size: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !130, file: !27, line: 69, baseType: !87, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !130, file: !27, line: 69, baseType: !87, size: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !130, file: !27, line: 70, baseType: !87, size: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !130, file: !27, line: 70, baseType: !87, size: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !130, file: !27, line: 70, baseType: !87, size: 32, offset: 416)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !130, file: !27, line: 71, baseType: !87, size: 32, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !130, file: !27, line: 72, baseType: !98, size: 16, offset: 480)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !130, file: !27, line: 73, baseType: !98, size: 16, offset: 496)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !130, file: !27, line: 74, baseType: !98, size: 16, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !130, file: !27, line: 75, baseType: !98, size: 16, offset: 528)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !130, file: !27, line: 76, baseType: !98, size: 16, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !130, file: !27, line: 77, baseType: !98, size: 16, offset: 560)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !130, file: !27, line: 78, baseType: !98, size: 16, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !130, file: !27, line: 79, baseType: !98, size: 16, offset: 592)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !130, file: !27, line: 80, baseType: !87, size: 32, offset: 608)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !130, file: !27, line: 81, baseType: !98, size: 16, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !130, file: !27, line: 81, baseType: !98, size: 16, offset: 656)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !130, file: !27, line: 82, baseType: !155, size: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !130, file: !27, line: 83, baseType: !155, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !130, file: !27, line: 84, baseType: !88, size: 32, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !130, file: !27, line: 84, baseType: !88, size: 32, offset: 864)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !130, file: !27, line: 85, baseType: !98, size: 16, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !130, file: !27, line: 86, baseType: !98, size: 16, offset: 912)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !130, file: !27, line: 87, baseType: !88, size: 32, offset: 928)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !130, file: !27, line: 87, baseType: !88, size: 32, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !130, file: !27, line: 88, baseType: !165, size: 32, offset: 992)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 32, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 2)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !130, file: !27, line: 89, baseType: !169, size: 192, offset: 1024)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 192, elements: !171)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!171 = !{!172}
!172 = !DISubrange(count: 3)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !130, file: !27, line: 90, baseType: !165, size: 32, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !130, file: !27, line: 91, baseType: !98, size: 16, offset: 1248)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !130, file: !27, line: 92, baseType: !170, size: 64, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !130, file: !27, line: 96, baseType: !87, size: 32, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !130, file: !27, line: 97, baseType: !87, size: 32, offset: 1376)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !130, file: !27, line: 98, baseType: !125, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !130, file: !27, line: 99, baseType: !125, size: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecountsorted", scope: !130, file: !27, line: 100, baseType: !117, size: 32, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !130, file: !27, line: 105, baseType: !98, size: 16, offset: 1568)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !130, file: !27, line: 106, baseType: !125, size: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !130, file: !27, line: 108, baseType: !165, size: 32, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !130, file: !27, line: 109, baseType: !98, size: 16, offset: 1696)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !130, file: !27, line: 111, baseType: !169, size: 192, offset: 1728)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !130, file: !27, line: 112, baseType: !187, size: 64, offset: 1920)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !130, file: !27, line: 114, baseType: !117, size: 32, offset: 1984)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !130, file: !27, line: 115, baseType: !105, size: 64, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValueCount", scope: !130, file: !27, line: 117, baseType: !117, size: 32, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValues", scope: !130, file: !27, line: 118, baseType: !192, size: 64, offset: 2176)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagValue", file: !27, line: 37, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 33, size: 192, elements: !195)
!195 = !{!196, !228, !229}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !194, file: !27, line: 34, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFField", file: !91, line: 320, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFField", file: !27, line: 276, size: 384, elements: !201)
!201 = !{!202, !203, !205, !206, !208, !209, !211, !212, !213, !215, !216, !217}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !200, file: !27, line: 277, baseType: !87, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !200, file: !27, line: 278, baseType: !204, size: 16, offset: 32)
!204 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !200, file: !27, line: 279, baseType: !204, size: 16, offset: 48)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !200, file: !27, line: 280, baseType: !207, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !6, line: 143, baseType: !5)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !200, file: !27, line: 281, baseType: !87, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "set_field_type", scope: !200, file: !27, line: 282, baseType: !210, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSetGetFieldType", file: !27, line: 250, baseType: !26)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "get_field_type", scope: !200, file: !27, line: 283, baseType: !210, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !200, file: !27, line: 284, baseType: !99, size: 16, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !200, file: !27, line: 285, baseType: !214, size: 8, offset: 208)
!214 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !200, file: !27, line: 286, baseType: !214, size: 8, offset: 216)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !200, file: !27, line: 287, baseType: !105, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "field_subfields", scope: !200, file: !27, line: 288, baseType: !218, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArray", file: !91, line: 321, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFFieldArray", file: !27, line: 269, size: 192, elements: !221)
!221 = !{!222, !224, !225, !226}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !220, file: !27, line: 270, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArrayType", file: !27, line: 267, baseType: !81)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !220, file: !27, line: 271, baseType: !87, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !220, file: !27, line: 272, baseType: !87, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !220, file: !27, line: 273, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !194, file: !27, line: 35, baseType: !117, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !194, file: !27, line: 36, baseType: !89, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tif_customdir", scope: !112, file: !113, line: 130, baseType: !129, size: 2240, offset: 2688)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !112, file: !113, line: 135, baseType: !232, size: 128, offset: 4928)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !112, file: !113, line: 131, size: 128, elements: !233)
!233 = !{!234, !240, !247}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !232, file: !113, line: 132, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderCommon", file: !6, line: 96, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 93, size: 32, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !236, file: !6, line: 94, baseType: !98, size: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !236, file: !6, line: 95, baseType: !98, size: 16, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "classic", scope: !232, file: !113, line: 133, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderClassic", file: !6, line: 101, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 97, size: 64, elements: !243)
!243 = !{!244, !245, !246}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !242, file: !6, line: 98, baseType: !98, size: 16)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !242, file: !6, line: 99, baseType: !98, size: 16, offset: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !242, file: !6, line: 100, baseType: !87, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "big", scope: !232, file: !113, line: 134, baseType: !248, size: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderBig", file: !6, line: 108, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 102, size: 128, elements: !250)
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !249, file: !6, line: 103, baseType: !98, size: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !249, file: !6, line: 104, baseType: !98, size: 16, offset: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_offsetsize", scope: !249, file: !6, line: 105, baseType: !98, size: 16, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_unused", scope: !249, file: !6, line: 106, baseType: !98, size: 16, offset: 48)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !249, file: !6, line: 107, baseType: !121, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header_size", scope: !112, file: !113, line: 136, baseType: !98, size: 16, offset: 5056)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !112, file: !113, line: 137, baseType: !87, size: 32, offset: 5088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !112, file: !113, line: 138, baseType: !98, size: 16, offset: 5120)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !112, file: !113, line: 139, baseType: !87, size: 32, offset: 5152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !112, file: !113, line: 140, baseType: !121, size: 64, offset: 5184)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !112, file: !113, line: 141, baseType: !121, size: 64, offset: 5248)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !112, file: !113, line: 143, baseType: !98, size: 16, offset: 5312)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !112, file: !113, line: 144, baseType: !121, size: 64, offset: 5376)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !112, file: !113, line: 146, baseType: !87, size: 32, offset: 5440)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !112, file: !113, line: 147, baseType: !87, size: 32, offset: 5472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !112, file: !113, line: 148, baseType: !96, size: 64, offset: 5504)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestatus", scope: !112, file: !113, line: 150, baseType: !117, size: 32, offset: 5568)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fixuptags", scope: !112, file: !113, line: 151, baseType: !269, size: 64, offset: 5632)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !113, line: 89, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!117, !110}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !112, file: !113, line: 152, baseType: !269, size: 64, offset: 5696)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !112, file: !113, line: 153, baseType: !275, size: 64, offset: 5760)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !113, line: 90, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!117, !110, !98}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !112, file: !113, line: 154, baseType: !269, size: 64, offset: 5824)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestatus", scope: !112, file: !113, line: 155, baseType: !117, size: 32, offset: 5888)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !112, file: !113, line: 156, baseType: !275, size: 64, offset: 5952)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !112, file: !113, line: 157, baseType: !269, size: 64, offset: 6016)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !112, file: !113, line: 158, baseType: !284, size: 64, offset: 6080)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !113, line: 91, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!117, !110, !288, !96, !98}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !6, line: 69, baseType: !214)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !112, file: !113, line: 159, baseType: !284, size: 64, offset: 6144)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !112, file: !113, line: 160, baseType: !284, size: 64, offset: 6208)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !112, file: !113, line: 161, baseType: !284, size: 64, offset: 6272)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !112, file: !113, line: 162, baseType: !284, size: 64, offset: 6336)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !112, file: !113, line: 163, baseType: !284, size: 64, offset: 6400)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !112, file: !113, line: 164, baseType: !296, size: 64, offset: 6464)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !113, line: 88, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !110}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !112, file: !113, line: 165, baseType: !301, size: 64, offset: 6528)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !113, line: 92, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!117, !110, !87}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !112, file: !113, line: 166, baseType: !296, size: 64, offset: 6592)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !112, file: !113, line: 167, baseType: !307, size: 64, offset: 6656)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !113, line: 94, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!87, !110, !87}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !112, file: !113, line: 168, baseType: !312, size: 64, offset: 6720)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !113, line: 95, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !110, !316, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !112, file: !113, line: 169, baseType: !288, size: 64, offset: 6784)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !112, file: !113, line: 171, baseType: !96, size: 64, offset: 6848)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !112, file: !113, line: 172, baseType: !96, size: 64, offset: 6912)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !112, file: !113, line: 173, baseType: !288, size: 64, offset: 6976)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !112, file: !113, line: 174, baseType: !96, size: 64, offset: 7040)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataoff", scope: !112, file: !113, line: 175, baseType: !96, size: 64, offset: 7104)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataloaded", scope: !112, file: !113, line: 176, baseType: !96, size: 64, offset: 7168)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !112, file: !113, line: 177, baseType: !288, size: 64, offset: 7232)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !112, file: !113, line: 178, baseType: !96, size: 64, offset: 7296)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !112, file: !113, line: 180, baseType: !288, size: 64, offset: 7360)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !112, file: !113, line: 181, baseType: !96, size: 64, offset: 7424)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !112, file: !113, line: 182, baseType: !329, size: 64, offset: 7488)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !91, line: 279, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!117, !90, !333, !334}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !91, line: 68, baseType: !121)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !112, file: !113, line: 183, baseType: !337, size: 64, offset: 7552)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !91, line: 280, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !90, !89, !335}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !112, file: !113, line: 185, baseType: !90, size: 64, offset: 7616)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !112, file: !113, line: 186, baseType: !343, size: 64, offset: 7680)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !91, line: 275, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!96, !90, !89, !96}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !112, file: !113, line: 187, baseType: !343, size: 64, offset: 7744)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !112, file: !113, line: 188, baseType: !349, size: 64, offset: 7808)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !91, line: 276, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!335, !90, !335, !117}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !112, file: !113, line: 189, baseType: !354, size: 64, offset: 7872)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !91, line: 277, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!117, !90}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !112, file: !113, line: 190, baseType: !359, size: 64, offset: 7936)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !91, line: 278, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!335, !90}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !112, file: !113, line: 192, baseType: !364, size: 64, offset: 8000)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !113, line: 93, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !110, !288, !96}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fields", scope: !112, file: !113, line: 194, baseType: !369, size: 64, offset: 8064)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !112, file: !113, line: 195, baseType: !371, size: 64, offset: 8128)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !372, line: 62, baseType: !122)
!372 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tif_foundfield", scope: !112, file: !113, line: 196, baseType: !197, size: 64, offset: 8192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tagmethods", scope: !112, file: !113, line: 197, baseType: !375, size: 192, offset: 8256)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagMethods", file: !91, line: 335, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 331, size: 192, elements: !377)
!377 = !{!378, !390, !392}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vsetfield", scope: !376, file: !91, line: 332, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !91, line: 327, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!117, !110, !87, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 79, size: 192, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !384, file: !3, line: 79, baseType: !7, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !384, file: !3, line: 79, baseType: !7, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !384, file: !3, line: 79, baseType: !89, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !384, file: !3, line: 79, baseType: !89, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vgetfield", scope: !376, file: !91, line: 333, baseType: !391, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !91, line: 328, baseType: !380)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "printdir", scope: !376, file: !91, line: 334, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !91, line: 329, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !110, !397, !95}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !399, line: 48, baseType: !400)
!399 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !401, line: 241, size: 1728, elements: !402)
!401 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !423, !424, !425, !426, !429, !430, !432, !436, !439, !441, !442, !443, !444, !445, !446, !447}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !400, file: !401, line: 242, baseType: !117, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !400, file: !401, line: 247, baseType: !105, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !400, file: !401, line: 248, baseType: !105, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !400, file: !401, line: 249, baseType: !105, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !400, file: !401, line: 250, baseType: !105, size: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !400, file: !401, line: 251, baseType: !105, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !400, file: !401, line: 252, baseType: !105, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !400, file: !401, line: 253, baseType: !105, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !400, file: !401, line: 254, baseType: !105, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !400, file: !401, line: 256, baseType: !105, size: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !400, file: !401, line: 257, baseType: !105, size: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !400, file: !401, line: 258, baseType: !105, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !400, file: !401, line: 260, baseType: !416, size: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !401, line: 156, size: 192, elements: !418)
!418 = !{!419, !420, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !417, file: !401, line: 157, baseType: !416, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !417, file: !401, line: 158, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !417, file: !401, line: 162, baseType: !117, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !400, file: !401, line: 262, baseType: !421, size: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !400, file: !401, line: 264, baseType: !117, size: 32, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !400, file: !401, line: 268, baseType: !117, size: 32, offset: 928)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !400, file: !401, line: 270, baseType: !427, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !428, line: 131, baseType: !95)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !400, file: !401, line: 274, baseType: !99, size: 16, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !400, file: !401, line: 275, baseType: !431, size: 8, offset: 1040)
!431 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !400, file: !401, line: 276, baseType: !433, size: 8, offset: 1048)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 1)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !400, file: !401, line: 280, baseType: !437, size: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !401, line: 150, baseType: null)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !400, file: !401, line: 289, baseType: !440, size: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !428, line: 132, baseType: !95)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !400, file: !401, line: 297, baseType: !89, size: 64, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !400, file: !401, line: 298, baseType: !89, size: 64, offset: 1280)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !400, file: !401, line: 299, baseType: !89, size: 64, offset: 1344)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !400, file: !401, line: 300, baseType: !89, size: 64, offset: 1408)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !400, file: !401, line: 302, baseType: !371, size: 64, offset: 1472)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !400, file: !401, line: 303, baseType: !117, size: 32, offset: 1536)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !400, file: !401, line: 305, baseType: !448, size: 160, offset: 1568)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 160, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 20)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientinfo", scope: !112, file: !113, line: 198, baseType: !452, size: 64, offset: 8448)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFClientInfoLink", file: !113, line: 79, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client_info", file: !113, line: 75, size: 192, elements: !455)
!455 = !{!456, !458, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !454, file: !113, line: 76, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !113, line: 77, baseType: !89, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !113, line: 78, baseType: !105, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldscompat", scope: !112, file: !113, line: 201, baseType: !218, size: 64, offset: 8512)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfieldscompat", scope: !112, file: !113, line: 202, baseType: !371, size: 64, offset: 8576)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "rowbuf", scope: !2, file: !3, line: 63, type: !105, isLocal: false, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "refbuf", scope: !2, file: !3, line: 64, type: !105, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 67, type: !117, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "stretch", scope: !2, file: !3, line: 68, type: !117, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "badfaxrun", scope: !2, file: !3, line: 69, type: !98, isLocal: false, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "badfaxlines", scope: !2, file: !3, line: 70, type: !87, isLocal: false, isDefinition: true)
!474 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!475 = !{i32 2, !"Dwarf Version", i32 4}
!476 = !{i32 2, !"Debug Info Version", i32 3}
!477 = !{i32 1, !"wchar_size", i32 4}
!478 = !{i32 7, !"PIC Level", i32 2}
!479 = !{i32 1, !"ThinLTO", i32 0}
!480 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!481 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 76, type: !482, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !485)
!482 = !DISubroutineType(types: !483)
!483 = !{!117, !117, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!485 = !{}
!486 = !DILocalVariable(name: "argc", arg: 1, scope: !481, file: !3, line: 76, type: !117)
!487 = !DILocation(line: 76, column: 10, scope: !481)
!488 = !DILocalVariable(name: "argv", arg: 2, scope: !481, file: !3, line: 76, type: !484)
!489 = !DILocation(line: 76, column: 22, scope: !481)
!490 = !DILocalVariable(name: "in", scope: !481, file: !3, line: 78, type: !397)
!491 = !DILocation(line: 78, column: 8, scope: !481)
!492 = !DILocalVariable(name: "out", scope: !481, file: !3, line: 79, type: !110)
!493 = !DILocation(line: 79, column: 8, scope: !481)
!494 = !DILocalVariable(name: "whandler", scope: !481, file: !3, line: 80, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFErrorHandler", file: !91, line: 273, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !92, !92, !383}
!499 = !DILocation(line: 80, column: 19, scope: !481)
!500 = !DILocalVariable(name: "compression_in", scope: !481, file: !3, line: 81, type: !117)
!501 = !DILocation(line: 81, column: 6, scope: !481)
!502 = !DILocalVariable(name: "compression_out", scope: !481, file: !3, line: 82, type: !117)
!503 = !DILocation(line: 82, column: 6, scope: !481)
!504 = !DILocalVariable(name: "fillorder_in", scope: !481, file: !3, line: 83, type: !117)
!505 = !DILocation(line: 83, column: 6, scope: !481)
!506 = !DILocalVariable(name: "fillorder_out", scope: !481, file: !3, line: 84, type: !117)
!507 = !DILocation(line: 84, column: 6, scope: !481)
!508 = !DILocalVariable(name: "group3options_in", scope: !481, file: !3, line: 85, type: !87)
!509 = !DILocation(line: 85, column: 9, scope: !481)
!510 = !DILocalVariable(name: "group3options_out", scope: !481, file: !3, line: 86, type: !87)
!511 = !DILocation(line: 86, column: 9, scope: !481)
