; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tiff = type opaque
%struct.BMPFileHeader = type { [2 x i8], i32, i16, i16, i32 }
%struct.BMPInfoHeader = type { i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.BMPCIEXYZTriple, i32, i32, i32 }
%struct.BMPCIEXYZTriple = type { %struct.BMPCIEXYZ, %struct.BMPCIEXYZ, %struct.BMPCIEXYZ }
%struct.BMPCIEXYZ = type { i32, i32, i32 }

@.str = private unnamed_addr constant [8 x i8] c"c:r:o:h\00", align 1
@optarg = external global i8*, align 8
@optind = external global i32, align 4
@.str.1 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"Cannot open file %s for output\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"Cannot open input file\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"File is not BMP\00", align 1

!40 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !44, line: 67, baseType: !45)
!44 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !37, line: 72, baseType: !42)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !50, line: 90, baseType: !51)
!50 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !52, line: 131, baseType: !45)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !{!56, !59, !62, !64, !66, !0, !68, !70, !72, !74}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "BFH_SIZE", scope: !2, file: !3, line: 145, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "BIH_WIN4SIZE", scope: !2, file: !3, line: 201, type: !61, isLocal: false, isDefinition: true)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "BIH_WIN5SIZE", scope: !2, file: !3, line: 202, type: !61, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "BIH_OS21SIZE", scope: !2, file: !3, line: 203, type: !61, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "BIH_OS22SIZE", scope: !2, file: !3, line: 204, type: !61, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "jpegcolormode", scope: !2, file: !3, line: 219, type: !54, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "quality", scope: !2, file: !3, line: 220, type: !54, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "predictor", scope: !2, file: !3, line: 221, type: !46, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "stuff", scope: !2, file: !3, line: 809, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1408, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 22)
!79 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!80 = !{i32 2, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{i32 1, !"wchar_size", i32 4}
!83 = !{i32 7, !"PIC Level", i32 2}
!84 = !{i32 1, !"ThinLTO", i32 0}
!85 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!86 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 228, type: !87, scopeLine: 229, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !90)
!87 = !DISubroutineType(types: !88)
!88 = !{!54, !54, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!90 = !{}
!91 = !DILocalVariable(name: "argc", arg: 1, scope: !86, file: !3, line: 228, type: !54)
!92 = !DILocation(line: 228, column: 10, scope: !86)
!93 = !DILocalVariable(name: "argv", arg: 2, scope: !86, file: !3, line: 228, type: !89)
!94 = !DILocation(line: 228, column: 22, scope: !86)
!95 = !DILocalVariable(name: "width", scope: !86, file: !3, line: 230, type: !36)
!96 = !DILocation(line: 230, column: 9, scope: !86)
!97 = !DILocalVariable(name: "length", scope: !86, file: !3, line: 230, type: !36)
!98 = !DILocation(line: 230, column: 16, scope: !86)
!99 = !DILocalVariable(name: "nbands", scope: !86, file: !3, line: 231, type: !46)
!100 = !DILocation(line: 231, column: 9, scope: !86)
!101 = !DILocalVariable(name: "depth", scope: !86, file: !3, line: 232, type: !46)
!102 = !DILocation(line: 232, column: 16, scope: !86)
!103 = !DILocalVariable(name: "rowsperstrip", scope: !86, file: !3, line: 233, type: !36)
!104 = !DILocation(line: 233, column: 9, scope: !86)
!105 = !DILocalVariable(name: "photometric", scope: !86, file: !3, line: 234, type: !46)
!106 = !DILocation(line: 234, column: 16, scope: !86)
!107 = !DILocalVariable(name: "fd", scope: !86, file: !3, line: 235, type: !54)
!108 = !DILocation(line: 235, column: 6, scope: !86)
!109 = !DILocalVariable(name: "instat", scope: !86, file: !3, line: 236, type: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !111, line: 46, size: 1152, elements: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!112 = !{!113, !115, !117, !119, !121, !123, !125, !126, !127, !128, !130, !132, !140, !141, !142}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !110, file: !111, line: 48, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !52, line: 124, baseType: !53)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !110, file: !111, line: 53, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !52, line: 127, baseType: !53)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !110, file: !111, line: 61, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !52, line: 130, baseType: !53)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !110, file: !111, line: 62, baseType: !120, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !52, line: 129, baseType: !6)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !110, file: !111, line: 64, baseType: !122, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !52, line: 125, baseType: !6)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !110, file: !111, line: 65, baseType: !124, size: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !52, line: 126, baseType: !6)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !110, file: !111, line: 67, baseType: !54, size: 32, offset: 288)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !110, file: !111, line: 69, baseType: !114, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !110, file: !111, line: 74, baseType: !51, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !110, file: !111, line: 78, baseType: !129, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !52, line: 153, baseType: !45)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !110, file: !111, line: 80, baseType: !131, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !52, line: 158, baseType: !45)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !110, file: !111, line: 91, baseType: !133, size: 128, offset: 576)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !134, line: 120, size: 128, elements: !135)
!134 = !DIFile(filename: "/usr/include/time.h", directory: "")
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !133, file: !134, line: 122, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 139, baseType: !45)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !133, file: !134, line: 123, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !52, line: 175, baseType: !45)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !110, file: !111, line: 92, baseType: !133, size: 128, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !110, file: !111, line: 93, baseType: !133, size: 128, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !110, file: !111, line: 106, baseType: !143, size: 192, offset: 960)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 192, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 3)
!146 = !DILocation(line: 236, column: 14, scope: !86)
!147 = !DILocalVariable(name: "outfilename", scope: !86, file: !3, line: 237, type: !47)
!148 = !DILocation(line: 237, column: 8, scope: !86)
!149 = !DILocalVariable(name: "infilename", scope: !86, file: !3, line: 237, type: !47)
!150 = !DILocation(line: 237, column: 29, scope: !86)
!151 = !DILocalVariable(name: "out", scope: !86, file: !3, line: 238, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !44, line: 40, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !44, line: 40, flags: DIFlagFwdDecl)
!155 = !DILocation(line: 238, column: 8, scope: !86)
!156 = !DILocalVariable(name: "file_hdr", scope: !86, file: !3, line: 240, type: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMPFileHeader", file: !3, line: 142, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 132, size: 128, elements: !159)
!159 = !{!160, !164, !165, !166, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bType", scope: !158, file: !3, line: 134, baseType: !161, size: 16)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 16, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "iSize", scope: !158, file: !3, line: 135, baseType: !36, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "iReserved1", scope: !158, file: !3, line: 139, baseType: !46, size: 16, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "iReserved2", scope: !158, file: !3, line: 140, baseType: !46, size: 16, offset: 80)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "iOffBits", scope: !158, file: !3, line: 141, baseType: !36, size: 32, offset: 96)
!168 = !DILocation(line: 240, column: 16, scope: !86)
!169 = !DILocalVariable(name: "info_hdr", scope: !86, file: !3, line: 241, type: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMPInfoHeader", file: !3, line: 196, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 147, size: 864, elements: !172)
!172 = !{!173, !174, !176, !177, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !205, !206, !207}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "iSize", scope: !171, file: !3, line: 149, baseType: !36, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "iWidth", scope: !171, file: !3, line: 152, baseType: !175, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !37, line: 74, baseType: !54)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "iHeight", scope: !171, file: !3, line: 153, baseType: !175, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "iPlanes", scope: !171, file: !3, line: 155, baseType: !178, size: 16, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16", file: !37, line: 71, baseType: !179)
!179 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "iBitCount", scope: !171, file: !3, line: 156, baseType: !178, size: 16, offset: 112)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "iCompression", scope: !171, file: !3, line: 160, baseType: !36, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "iSizeImage", scope: !171, file: !3, line: 161, baseType: !36, size: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "iXPelsPerMeter", scope: !171, file: !3, line: 165, baseType: !175, size: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "iYPelsPerMeter", scope: !171, file: !3, line: 166, baseType: !175, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "iClrUsed", scope: !171, file: !3, line: 167, baseType: !36, size: 32, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iClrImportant", scope: !171, file: !3, line: 171, baseType: !175, size: 32, offset: 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "iRedMask", scope: !171, file: !3, line: 179, baseType: !175, size: 32, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "iGreenMask", scope: !171, file: !3, line: 182, baseType: !175, size: 32, offset: 352)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "iBlueMask", scope: !171, file: !3, line: 183, baseType: !175, size: 32, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "iAlphaMask", scope: !171, file: !3, line: 184, baseType: !175, size: 32, offset: 416)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "iCSType", scope: !171, file: !3, line: 186, baseType: !36, size: 32, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sEndpoints", scope: !171, file: !3, line: 187, baseType: !193, size: 288, offset: 480)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMPCIEXYZTriple", file: !3, line: 130, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 124, size: 288, elements: !195)
!195 = !{!196, !203, !204}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "iCIERed", scope: !194, file: !3, line: 127, baseType: !197, size: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMPCIEXYZ", file: !3, line: 122, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 117, size: 96, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "iCIEX", scope: !198, file: !3, line: 119, baseType: !175, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "iCIEY", scope: !198, file: !3, line: 120, baseType: !175, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "iCIEZ", scope: !198, file: !3, line: 121, baseType: !175, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "iCIEGreen", scope: !194, file: !3, line: 128, baseType: !197, size: 96, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "iCIEBlue", scope: !194, file: !3, line: 129, baseType: !197, size: 96, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "iGammaRed", scope: !171, file: !3, line: 189, baseType: !175, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "iGammaGreen", scope: !171, file: !3, line: 194, baseType: !175, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "iGammaBlue", scope: !171, file: !3, line: 195, baseType: !175, size: 32, offset: 832)
!208 = !DILocation(line: 241, column: 23, scope: !86)
!209 = !DILocalVariable(name: "bmp_type", scope: !86, file: !3, line: 242, type: !54)
!210 = !DILocation(line: 242, column: 17, scope: !86)
!211 = !DILocalVariable(name: "clr_tbl_size", scope: !86, file: !3, line: 243, type: !36)
!212 = !DILocation(line: 243, column: 17, scope: !86)
!213 = !DILocalVariable(name: "n_clr_elems", scope: !86, file: !3, line: 243, type: !36)
!214 = !DILocation(line: 243, column: 31, scope: !86)
!215 = !DILocalVariable(name: "clr_tbl", scope: !86, file: !3, line: 244, type: !39)
!216 = !DILocation(line: 244, column: 24, scope: !86)
!217 = !DILocalVariable(name: "red_tbl", scope: !86, file: !3, line: 245, type: !41)
!218 = !DILocation(line: 245, column: 18, scope: !86)
!219 = !DILocalVariable(name: "green_tbl", scope: !86, file: !3, line: 245, type: !41)
!220 = !DILocation(line: 245, column: 35, scope: !86)
!221 = !DILocalVariable(name: "blue_tbl", scope: !86, file: !3, line: 245, type: !41)
!222 = !DILocation(line: 245, column: 54, scope: !86)
!223 = !DILocalVariable(name: "row", scope: !86, file: !3, line: 246, type: !36)
!224 = !DILocation(line: 246, column: 9, scope: !86)
!225 = !DILocalVariable(name: "clr", scope: !86, file: !3, line: 246, type: !36)
!226 = !DILocation(line: 246, column: 14, scope: !86)
!227 = !DILocalVariable(name: "c", scope: !86, file: !3, line: 248, type: !54)
!228 = !DILocation(line: 248, column: 6, scope: !86)
!229 = !DILocation(line: 252, column: 2, scope: !86)
!230 = !DILocation(line: 252, column: 21, scope: !86)
!231 = !DILocation(line: 252, column: 27, scope: !86)
!232 = !DILocation(line: 252, column: 14, scope: !86)
!233 = !DILocation(line: 252, column: 12, scope: !86)
!234 = !DILocation(line: 252, column: 45, scope: !86)
!235 = !DILocation(line: 253, column: 11, scope: !236)
!236 = distinct !DILexicalBlock(scope: !86, file: !3, line: 252, column: 52)
!237 = !DILocation(line: 253, column: 3, scope: !236)
!238 = !DILocation(line: 255, column: 32, scope: !239)
!239 = distinct !DILexicalBlock(scope: !240, file: !3, line: 255, column: 8)
!240 = distinct !DILexicalBlock(scope: !236, file: !3, line: 253, column: 14)
!241 = !DILocation(line: 255, column: 9, scope: !239)
!242 = !DILocation(line: 255, column: 8, scope: !240)
!243 = !DILocation(line: 256, column: 5, scope: !239)
!244 = !DILocation(line: 257, column: 4, scope: !240)
!245 = !DILocation(line: 259, column: 24, scope: !240)
!246 = !DILocation(line: 259, column: 19, scope: !240)
!247 = !DILocation(line: 259, column: 17, scope: !240)
!248 = !DILocation(line: 260, column: 4, scope: !240)
!249 = !DILocation(line: 262, column: 18, scope: !240)
!250 = !DILocation(line: 262, column: 16, scope: !240)
!251 = !DILocation(line: 263, column: 4, scope: !240)
!252 = !DILocation(line: 265, column: 4, scope: !240)
!253 = !DILocation(line: 267, column: 4, scope: !240)
!254 = distinct !{!254, !229, !255}
!255 = !DILocation(line: 269, column: 2, scope: !86)
!256 = !DILocation(line: 271, column: 6, scope: !257)
!257 = distinct !DILexicalBlock(scope: !86, file: !3, line: 271, column: 6)
!258 = !DILocation(line: 271, column: 13, scope: !257)
!259 = !DILocation(line: 271, column: 11, scope: !257)
!260 = !DILocation(line: 271, column: 20, scope: !257)
!261 = !DILocation(line: 271, column: 6, scope: !86)
!262 = !DILocation(line: 272, column: 3, scope: !257)
!263 = !DILocation(line: 274, column: 6, scope: !264)
!264 = distinct !DILexicalBlock(scope: !86, file: !3, line: 274, column: 6)
!265 = !DILocation(line: 274, column: 18, scope: !264)
!266 = !DILocation(line: 274, column: 6, scope: !86)
!267 = !DILocation(line: 275, column: 17, scope: !264)
!268 = !DILocation(line: 275, column: 22, scope: !264)
!269 = !DILocation(line: 275, column: 26, scope: !264)
!270 = !DILocation(line: 275, column: 15, scope: !264)
!271 = !DILocation(line: 275, column: 3, scope: !264)
