; ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.T2P = type { i32, %struct.T2P_PAGE*, %struct.T2P_TILES*, i16, i16, i16, i16, i16, i16, i16, i32, i32, float, float, i16, i64, i64, i16, i16, i16, i16, float, float, float, float, float, float, float, float, float, float, i32, %struct.T2P_BOX, %struct.T2P_BOX, i16, i16, i32, i32, i32, i32, i16, i32, [33 x i8], [17 x i8], [512 x i8], [512 x i8], [512 x i8], [512 x i8], [512 x i8], i32, i16, i16, i16, i8*, [4 x i32], i32, i16, i32, i16, i16, i32, i32, i32*, i32, i16, i8*, i32, i32, [2 x float], [6 x float], [2 x float], [3 x float*], i32, i16, i32, i32, i8*, %struct._IO_FILE*, i32, i64 }
%struct.T2P_PAGE = type { i16, i32, i32, i32 }
%struct.T2P_TILES = type { i32, i32, i32, i32, i32, i32, i32, %struct.T2P_TILE* }
%struct.T2P_TILE = type { %struct.T2P_BOX }
%struct.T2P_BOX = type { float, float, float, float, [9 x float] }

!70 = !DIEnumerator(name: "TIFF_SETGET_UINT32", value: 6, isUnsigned: true)
!71 = !DIEnumerator(name: "TIFF_SETGET_SINT32", value: 7, isUnsigned: true)
!72 = !DIEnumerator(name: "TIFF_SETGET_UINT64", value: 8, isUnsigned: true)
!73 = !DIEnumerator(name: "TIFF_SETGET_SINT64", value: 9, isUnsigned: true)
!74 = !DIEnumerator(name: "TIFF_SETGET_FLOAT", value: 10, isUnsigned: true)
!75 = !DIEnumerator(name: "TIFF_SETGET_DOUBLE", value: 11, isUnsigned: true)
!76 = !DIEnumerator(name: "TIFF_SETGET_IFD8", value: 12, isUnsigned: true)
!77 = !DIEnumerator(name: "TIFF_SETGET_INT", value: 13, isUnsigned: true)
!78 = !DIEnumerator(name: "TIFF_SETGET_UINT16_PAIR", value: 14, isUnsigned: true)
!79 = !DIEnumerator(name: "TIFF_SETGET_C0_ASCII", value: 15, isUnsigned: true)
!80 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT8", value: 16, isUnsigned: true)
!81 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT8", value: 17, isUnsigned: true)
!82 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT16", value: 18, isUnsigned: true)
!83 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT16", value: 19, isUnsigned: true)
!84 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT32", value: 20, isUnsigned: true)
!85 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT32", value: 21, isUnsigned: true)
!86 = !DIEnumerator(name: "TIFF_SETGET_C0_UINT64", value: 22, isUnsigned: true)
!87 = !DIEnumerator(name: "TIFF_SETGET_C0_SINT64", value: 23, isUnsigned: true)
!88 = !DIEnumerator(name: "TIFF_SETGET_C0_FLOAT", value: 24, isUnsigned: true)
!89 = !DIEnumerator(name: "TIFF_SETGET_C0_DOUBLE", value: 25, isUnsigned: true)
!90 = !DIEnumerator(name: "TIFF_SETGET_C0_IFD8", value: 26, isUnsigned: true)
!91 = !DIEnumerator(name: "TIFF_SETGET_C16_ASCII", value: 27, isUnsigned: true)
!92 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT8", value: 28, isUnsigned: true)
!93 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT8", value: 29, isUnsigned: true)
!94 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT16", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT16", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT32", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT32", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "TIFF_SETGET_C16_UINT64", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "TIFF_SETGET_C16_SINT64", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "TIFF_SETGET_C16_FLOAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "TIFF_SETGET_C16_DOUBLE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "TIFF_SETGET_C16_IFD8", value: 38, isUnsigned: true)
!103 = !DIEnumerator(name: "TIFF_SETGET_C32_ASCII", value: 39, isUnsigned: true)
!104 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT8", value: 40, isUnsigned: true)
!105 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT8", value: 41, isUnsigned: true)
!106 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT16", value: 42, isUnsigned: true)
!107 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT16", value: 43, isUnsigned: true)
!108 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT32", value: 44, isUnsigned: true)
!109 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT32", value: 45, isUnsigned: true)
!110 = !DIEnumerator(name: "TIFF_SETGET_C32_UINT64", value: 46, isUnsigned: true)
!111 = !DIEnumerator(name: "TIFF_SETGET_C32_SINT64", value: 47, isUnsigned: true)
!112 = !DIEnumerator(name: "TIFF_SETGET_C32_FLOAT", value: 48, isUnsigned: true)
!113 = !DIEnumerator(name: "TIFF_SETGET_C32_DOUBLE", value: 49, isUnsigned: true)
!114 = !DIEnumerator(name: "TIFF_SETGET_C32_IFD8", value: 50, isUnsigned: true)
!115 = !DIEnumerator(name: "TIFF_SETGET_OTHER", value: 51, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 263, baseType: !4, size: 32, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "tfiatImage", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "tfiatExif", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "tfiatOther", value: 2, isUnsigned: true)
!121 = !{!122, !123, !124, !126, !129, !132, !128, !268, !139, !154, !166, !247, !248, !197, !264, !350, !196, !145, !299, !131, !351, !352, !341, !353, !198, !4}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!123 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !125, line: 106, baseType: !122)
!125 = !DIFile(filename: "../libtiff/tiffio.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !125, line: 68, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !42, line: 78, baseType: !128)
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "T2P", file: !1, line: 251, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 158, size: 24640, elements: !135)
!135 = !{!136, !138, !153, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !229, !233, !237, !238, !239, !240, !241, !243, !244, !245, !246, !249, !253, !255, !256, !257, !258, !259, !261, !263, !265, !266, !267, !269, !270, !271, !275, !279, !280, !285, !286, !287, !288, !289, !290, !348, !349}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "t2p_error", scope: !134, file: !1, line: 159, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "t2p_err_t", file: !1, line: 121, baseType: !3)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_pages", scope: !134, file: !1, line: 160, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "T2P_PAGE", file: !1, line: 129, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 124, size: 128, elements: !142)
!142 = !{!143, !147, !149, !152}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "page_directory", scope: !141, file: !1, line: 125, baseType: !144, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdir_t", file: !125, line: 72, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !42, line: 72, baseType: !146)
!146 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "page_number", scope: !141, file: !1, line: 126, baseType: !148, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !42, line: 75, baseType: !4)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "page_tilecount", scope: !141, file: !1, line: 127, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttile_t", file: !125, line: 76, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrile_t", file: !125, line: 74, baseType: !148)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "page_extra", scope: !141, file: !1, line: 128, baseType: !148, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_tiles", scope: !134, file: !1, line: 161, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "T2P_TILES", file: !1, line: 155, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 146, size: 320, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_tilecount", scope: !156, file: !1, line: 147, baseType: !150, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_tilewidth", scope: !156, file: !1, line: 148, baseType: !148, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_tilelength", scope: !156, file: !1, line: 149, baseType: !148, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_tilecountx", scope: !156, file: !1, line: 150, baseType: !148, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_tilecounty", scope: !156, file: !1, line: 151, baseType: !148, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_edgetilewidth", scope: !156, file: !1, line: 152, baseType: !148, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_edgetilelength", scope: !156, file: !1, line: 153, baseType: !148, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_tiles", scope: !156, file: !1, line: 154, baseType: !166, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "T2P_TILE", file: !1, line: 143, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 141, size: 416, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tile_box", scope: !168, file: !1, line: 142, baseType: !171, size: 416)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "T2P_BOX", file: !1, line: 138, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 132, size: 416, elements: !173)
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !172, file: !1, line: 133, baseType: !123, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !172, file: !1, line: 134, baseType: !123, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !172, file: !1, line: 135, baseType: !123, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !172, file: !1, line: 136, baseType: !123, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !172, file: !1, line: 137, baseType: !179, size: 288, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 288, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 9)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_pagecount", scope: !134, file: !1, line: 162, baseType: !144, size: 16, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_compression", scope: !134, file: !1, line: 163, baseType: !145, size: 16, offset: 208)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_photometric", scope: !134, file: !1, line: 164, baseType: !145, size: 16, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_fillorder", scope: !134, file: !1, line: 165, baseType: !145, size: 16, offset: 240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_bitspersample", scope: !134, file: !1, line: 166, baseType: !145, size: 16, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_samplesperpixel", scope: !134, file: !1, line: 167, baseType: !145, size: 16, offset: 272)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_planar", scope: !134, file: !1, line: 168, baseType: !145, size: 16, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_width", scope: !134, file: !1, line: 169, baseType: !148, size: 32, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_length", scope: !134, file: !1, line: 170, baseType: !148, size: 32, offset: 352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_xres", scope: !134, file: !1, line: 171, baseType: !123, size: 32, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_yres", scope: !134, file: !1, line: 172, baseType: !123, size: 32, offset: 416)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_orientation", scope: !134, file: !1, line: 173, baseType: !145, size: 16, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_dataoffset", scope: !134, file: !1, line: 174, baseType: !126, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_datasize", scope: !134, file: !1, line: 175, baseType: !196, size: 64, offset: 576)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !125, line: 77, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "tmsize_t", file: !125, line: 67, baseType: !198)
!198 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_resunit", scope: !134, file: !1, line: 176, baseType: !145, size: 16, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_centimeters", scope: !134, file: !1, line: 177, baseType: !145, size: 16, offset: 656)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_overrideres", scope: !134, file: !1, line: 178, baseType: !145, size: 16, offset: 672)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_overridepagesize", scope: !134, file: !1, line: 179, baseType: !145, size: 16, offset: 688)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_defaultxres", scope: !134, file: !1, line: 180, baseType: !123, size: 32, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_defaultyres", scope: !134, file: !1, line: 181, baseType: !123, size: 32, offset: 736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_xres", scope: !134, file: !1, line: 182, baseType: !123, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_yres", scope: !134, file: !1, line: 183, baseType: !123, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_defaultpagewidth", scope: !134, file: !1, line: 184, baseType: !123, size: 32, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_defaultpagelength", scope: !134, file: !1, line: 185, baseType: !123, size: 32, offset: 864)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_pagewidth", scope: !134, file: !1, line: 186, baseType: !123, size: 32, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_pagelength", scope: !134, file: !1, line: 187, baseType: !123, size: 32, offset: 928)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_imagewidth", scope: !134, file: !1, line: 188, baseType: !123, size: 32, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_imagelength", scope: !134, file: !1, line: 189, baseType: !123, size: 32, offset: 992)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_image_fillpage", scope: !134, file: !1, line: 190, baseType: !214, size: 32, offset: 1024)
!214 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_mediabox", scope: !134, file: !1, line: 191, baseType: !171, size: 416, offset: 1056)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_imagebox", scope: !134, file: !1, line: 192, baseType: !171, size: 416, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_majorversion", scope: !134, file: !1, line: 193, baseType: !145, size: 16, offset: 1888)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_minorversion", scope: !134, file: !1, line: 194, baseType: !145, size: 16, offset: 1904)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_catalog", scope: !134, file: !1, line: 195, baseType: !148, size: 32, offset: 1920)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_pages", scope: !134, file: !1, line: 196, baseType: !148, size: 32, offset: 1952)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_info", scope: !134, file: !1, line: 197, baseType: !148, size: 32, offset: 1984)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_palettecs", scope: !134, file: !1, line: 198, baseType: !148, size: 32, offset: 2016)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_fitwindow", scope: !134, file: !1, line: 199, baseType: !145, size: 16, offset: 2048)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_startxref", scope: !134, file: !1, line: 200, baseType: !148, size: 32, offset: 2080)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_fileid", scope: !134, file: !1, line: 202, baseType: !226, size: 264, offset: 2112)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 264, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 33)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_datetime", scope: !134, file: !1, line: 204, baseType: !230, size: 136, offset: 2376)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 136, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 17)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_creator", scope: !134, file: !1, line: 206, baseType: !234, size: 4096, offset: 2512)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 4096, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_author", scope: !134, file: !1, line: 208, baseType: !234, size: 4096, offset: 6608)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_title", scope: !134, file: !1, line: 210, baseType: !234, size: 4096, offset: 10704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_subject", scope: !134, file: !1, line: 212, baseType: !234, size: 4096, offset: 14800)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_keywords", scope: !134, file: !1, line: 214, baseType: !234, size: 4096, offset: 18896)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_colorspace", scope: !134, file: !1, line: 215, baseType: !242, size: 32, offset: 23008)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "t2p_cs_t", file: !1, line: 81, baseType: !8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_colorspace_invert", scope: !134, file: !1, line: 216, baseType: !145, size: 16, offset: 23040)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_switchdecode", scope: !134, file: !1, line: 217, baseType: !145, size: 16, offset: 23056)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_palettesize", scope: !134, file: !1, line: 218, baseType: !145, size: 16, offset: 23072)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_palette", scope: !134, file: !1, line: 219, baseType: !247, size: 64, offset: 23104)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_labrange", scope: !134, file: !1, line: 220, baseType: !250, size: 128, offset: 23168)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 4)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_defaultcompression", scope: !134, file: !1, line: 221, baseType: !254, size: 32, offset: 23296)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "t2p_compress_t", file: !1, line: 95, baseType: !19)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_defaultcompressionquality", scope: !134, file: !1, line: 222, baseType: !145, size: 16, offset: 23328)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_compression", scope: !134, file: !1, line: 223, baseType: !254, size: 32, offset: 23360)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_compressionquality", scope: !134, file: !1, line: 224, baseType: !145, size: 16, offset: 23392)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_nopassthrough", scope: !134, file: !1, line: 225, baseType: !145, size: 16, offset: 23408)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_transcode", scope: !134, file: !1, line: 226, baseType: !260, size: 32, offset: 23424)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "t2p_transcode_t", file: !1, line: 101, baseType: !25)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_sample", scope: !134, file: !1, line: 227, baseType: !262, size: 32, offset: 23456)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "t2p_sample_t", file: !1, line: 115, baseType: !29)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_xrefoffsets", scope: !134, file: !1, line: 228, baseType: !264, size: 64, offset: 23488)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_xrefcount", scope: !134, file: !1, line: 229, baseType: !148, size: 32, offset: 23552)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_page", scope: !134, file: !1, line: 230, baseType: !144, size: 16, offset: 23584)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_ojpegdata", scope: !134, file: !1, line: 232, baseType: !268, size: 64, offset: 23616)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdata_t", file: !125, line: 78, baseType: !122)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_ojpegdatalength", scope: !134, file: !1, line: 233, baseType: !148, size: 32, offset: 23680)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_ojpegiflength", scope: !134, file: !1, line: 234, baseType: !148, size: 32, offset: 23712)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_whitechromaticities", scope: !134, file: !1, line: 236, baseType: !272, size: 64, offset: 23744)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 2)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_primarychromaticities", scope: !134, file: !1, line: 237, baseType: !276, size: 192, offset: 23808)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 192, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 6)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_referenceblackwhite", scope: !134, file: !1, line: 238, baseType: !272, size: 64, offset: 24000)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_transferfunction", scope: !134, file: !1, line: 239, baseType: !281, size: 192, offset: 24064)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 192, elements: !283)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!283 = !{!284}
!284 = !DISubrange(count: 3)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_image_interpolate", scope: !134, file: !1, line: 240, baseType: !214, size: 32, offset: 24256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_transferfunctioncount", scope: !134, file: !1, line: 242, baseType: !145, size: 16, offset: 24288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pdf_icccs", scope: !134, file: !1, line: 243, baseType: !148, size: 32, offset: 24320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_iccprofilelength", scope: !134, file: !1, line: 244, baseType: !148, size: 32, offset: 24352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_iccprofile", scope: !134, file: !1, line: 245, baseType: !268, size: 64, offset: 24384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "outputfile", scope: !134, file: !1, line: 248, baseType: !291, size: 64, offset: 24448)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !293, line: 48, baseType: !294)
!293 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !295, line: 241, size: 1728, elements: !296)
!295 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!296 = !{!297, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !318, !319, !320, !321, !324, !325, !327, !331, !334, !336, !337, !338, !339, !340, !343, !344}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !294, file: !295, line: 242, baseType: !214, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !294, file: !295, line: 247, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !294, file: !295, line: 248, baseType: !299, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !294, file: !295, line: 249, baseType: !299, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !294, file: !295, line: 250, baseType: !299, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !294, file: !295, line: 251, baseType: !299, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !294, file: !295, line: 252, baseType: !299, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !294, file: !295, line: 253, baseType: !299, size: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !294, file: !295, line: 254, baseType: !299, size: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !294, file: !295, line: 256, baseType: !299, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !294, file: !295, line: 257, baseType: !299, size: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !294, file: !295, line: 258, baseType: !299, size: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !294, file: !295, line: 260, baseType: !311, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !295, line: 156, size: 192, elements: !313)
!313 = !{!314, !315, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !312, file: !295, line: 157, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !312, file: !295, line: 158, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !312, file: !295, line: 162, baseType: !214, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !294, file: !295, line: 262, baseType: !316, size: 64, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !294, file: !295, line: 264, baseType: !214, size: 32, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !294, file: !295, line: 268, baseType: !214, size: 32, offset: 928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !294, file: !295, line: 270, baseType: !322, size: 64, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !323, line: 131, baseType: !198)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !294, file: !295, line: 274, baseType: !146, size: 16, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !294, file: !295, line: 275, baseType: !326, size: 8, offset: 1040)
!326 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !294, file: !295, line: 276, baseType: !328, size: 8, offset: 1048)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 8, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 1)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !294, file: !295, line: 280, baseType: !332, size: 64, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !295, line: 150, baseType: null)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !294, file: !295, line: 289, baseType: !335, size: 64, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !323, line: 132, baseType: !198)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !294, file: !295, line: 297, baseType: !122, size: 64, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !294, file: !295, line: 298, baseType: !122, size: 64, offset: 1280)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !294, file: !295, line: 299, baseType: !122, size: 64, offset: 1344)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !294, file: !295, line: 300, baseType: !122, size: 64, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !294, file: !295, line: 302, baseType: !341, size: 64, offset: 1472)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !342, line: 62, baseType: !128)
!342 = !DIFile(filename: "build-bufferoverflow-llvm90-lto/lib/clang/9.0.0/include/stddef.h", directory: "/root/llvm")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !294, file: !295, line: 303, baseType: !214, size: 32, offset: 1536)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !294, file: !295, line: 305, baseType: !345, size: 160, offset: 1568)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 160, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 20)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "outputdisable", scope: !134, file: !1, line: 249, baseType: !214, size: 32, offset: 24512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "outputwritten", scope: !134, file: !1, line: 250, baseType: !196, size: 64, offset: 24576)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrip_t", file: !125, line: 75, baseType: !151)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !42, line: 69, baseType: !248)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !354, line: 75, baseType: !355)
!354 = !DIFile(filename: "/usr/include/time.h", directory: "")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !323, line: 139, baseType: !198)
!356 = !{!"clang version 9.0.0 (ssh://git@ruisrv:2341/home/git/gitrui/clang.git 2a2e29ecdebf00a4c9bcd9a5db013cd3c911b452) (ssh://git@ruisrv:2341/home/git/gitrui/llvm.git cc301f6696f39515397df004a9c09a3f2ab60254)"}
!357 = !{i32 2, !"Dwarf Version", i32 4}
!358 = !{i32 2, !"Debug Info Version", i32 3}
!359 = !{i32 1, !"wchar_size", i32 4}
!360 = !{i32 7, !"PIC Level", i32 2}
!361 = !{i32 1, !"ThinLTO", i32 0}
!362 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!363 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 559, type: !364, scopeLine: 559, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !367)
!364 = !DISubroutineType(types: !365)
!365 = !{!214, !214, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!367 = !{}
!368 = !DILocalVariable(name: "argc", arg: 1, scope: !363, file: !1, line: 559, type: !214)
!369 = !DILocation(line: 559, column: 14, scope: !363)
!370 = !DILocalVariable(name: "argv", arg: 2, scope: !363, file: !1, line: 559, type: !366)
!371 = !DILocation(line: 559, column: 27, scope: !363)
!372 = !DILocalVariable(name: "outfilename", scope: !363, file: !1, line: 563, type: !129)
!373 = !DILocation(line: 563, column: 14, scope: !363)
!374 = !DILocalVariable(name: "t2p", scope: !363, file: !1, line: 564, type: !132)
!375 = !DILocation(line: 564, column: 7, scope: !363)
!376 = !DILocalVariable(name: "input", scope: !363, file: !1, line: 565, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !125, line: 40, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !380, line: 97, size: 8640, elements: !381)
!380 = !DIFile(filename: "../libtiff/tiffiop.h", directory: "/root/llvm/codesample/real-effectiveness/tiff-4.0.1/tools")
!381 = !{!382, !383, !384, !385, !386, !387, !388, !390, !391, !392, !486, !487, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !529, !530, !535, !536, !537, !538, !539, !544, !545, !546, !547, !548, !549, !554, !559, !560, !565, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !588, !593, !594, !599, !600, !605, !610, !615, !620, !622, !623, !624, !647, !656, !657}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !379, file: !380, line: 98, baseType: !299, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !379, file: !380, line: 99, baseType: !214, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !379, file: !380, line: 100, baseType: !214, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !379, file: !380, line: 101, baseType: !148, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !379, file: !380, line: 124, baseType: !127, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !379, file: !380, line: 125, baseType: !127, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlist", scope: !379, file: !380, line: 126, baseType: !389, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirlistsize", scope: !379, file: !380, line: 127, baseType: !145, size: 16, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dirnumber", scope: !379, file: !380, line: 128, baseType: !145, size: 16, offset: 400)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !379, file: !380, line: 129, baseType: !393, size: 2240, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !62, line: 119, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 64, size: 2240, elements: !395)
!395 = !{!396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !419, !420, !421, !422, !423, !424, !425, !426, !428, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !394, file: !62, line: 67, baseType: !397, size: 256)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 256, elements: !251)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !394, file: !62, line: 69, baseType: !148, size: 32, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !394, file: !62, line: 69, baseType: !148, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !394, file: !62, line: 69, baseType: !148, size: 32, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !394, file: !62, line: 70, baseType: !148, size: 32, offset: 352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !394, file: !62, line: 70, baseType: !148, size: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !394, file: !62, line: 70, baseType: !148, size: 32, offset: 416)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !394, file: !62, line: 71, baseType: !148, size: 32, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !394, file: !62, line: 72, baseType: !145, size: 16, offset: 480)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !394, file: !62, line: 73, baseType: !145, size: 16, offset: 496)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !394, file: !62, line: 74, baseType: !145, size: 16, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !394, file: !62, line: 75, baseType: !145, size: 16, offset: 528)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !394, file: !62, line: 76, baseType: !145, size: 16, offset: 544)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !394, file: !62, line: 77, baseType: !145, size: 16, offset: 560)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !394, file: !62, line: 78, baseType: !145, size: 16, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !394, file: !62, line: 79, baseType: !145, size: 16, offset: 592)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !394, file: !62, line: 80, baseType: !148, size: 32, offset: 608)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !394, file: !62, line: 81, baseType: !145, size: 16, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !394, file: !62, line: 81, baseType: !145, size: 16, offset: 656)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !394, file: !62, line: 82, baseType: !417, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !394, file: !62, line: 83, baseType: !417, size: 64, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !394, file: !62, line: 84, baseType: !123, size: 32, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !394, file: !62, line: 84, baseType: !123, size: 32, offset: 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !394, file: !62, line: 85, baseType: !145, size: 16, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !394, file: !62, line: 86, baseType: !145, size: 16, offset: 912)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !394, file: !62, line: 87, baseType: !123, size: 32, offset: 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !394, file: !62, line: 87, baseType: !123, size: 32, offset: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !394, file: !62, line: 88, baseType: !427, size: 32, offset: 992)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 32, elements: !273)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !394, file: !62, line: 89, baseType: !429, size: 192, offset: 1024)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 192, elements: !283)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !394, file: !62, line: 90, baseType: !427, size: 32, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !394, file: !62, line: 91, baseType: !145, size: 16, offset: 1248)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !394, file: !62, line: 92, baseType: !430, size: 64, offset: 1280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !394, file: !62, line: 96, baseType: !148, size: 32, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !394, file: !62, line: 97, baseType: !148, size: 32, offset: 1376)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !394, file: !62, line: 98, baseType: !389, size: 64, offset: 1408)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !394, file: !62, line: 99, baseType: !389, size: 64, offset: 1472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecountsorted", scope: !394, file: !62, line: 100, baseType: !214, size: 32, offset: 1536)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !394, file: !62, line: 105, baseType: !145, size: 16, offset: 1568)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !394, file: !62, line: 106, baseType: !389, size: 64, offset: 1600)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !394, file: !62, line: 108, baseType: !427, size: 32, offset: 1664)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !394, file: !62, line: 109, baseType: !145, size: 16, offset: 1696)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !394, file: !62, line: 111, baseType: !429, size: 192, offset: 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !394, file: !62, line: 112, baseType: !282, size: 64, offset: 1920)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !394, file: !62, line: 114, baseType: !214, size: 32, offset: 1984)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !394, file: !62, line: 115, baseType: !299, size: 64, offset: 2048)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValueCount", scope: !394, file: !62, line: 117, baseType: !214, size: 32, offset: 2112)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "td_customValues", scope: !394, file: !62, line: 118, baseType: !449, size: 64, offset: 2176)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagValue", file: !62, line: 37, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 33, size: 192, elements: !452)
!452 = !{!453, !484, !485}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !451, file: !62, line: 34, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFField", file: !125, line: 320, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFField", file: !62, line: 276, size: 384, elements: !458)
!458 = !{!459, !460, !462, !463, !465, !466, !468, !469, !470, !471, !472, !473}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !457, file: !62, line: 277, baseType: !148, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !457, file: !62, line: 278, baseType: !461, size: 16, offset: 32)
!461 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !457, file: !62, line: 279, baseType: !461, size: 16, offset: 48)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !457, file: !62, line: 280, baseType: !464, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !42, line: 143, baseType: !41)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !457, file: !62, line: 281, baseType: !148, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "set_field_type", scope: !457, file: !62, line: 282, baseType: !467, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSetGetFieldType", file: !62, line: 250, baseType: !61)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "get_field_type", scope: !457, file: !62, line: 283, baseType: !467, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !457, file: !62, line: 284, baseType: !146, size: 16, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !457, file: !62, line: 285, baseType: !248, size: 8, offset: 208)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !457, file: !62, line: 286, baseType: !248, size: 8, offset: 216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !457, file: !62, line: 287, baseType: !299, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "field_subfields", scope: !457, file: !62, line: 288, baseType: !474, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArray", file: !125, line: 321, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFFieldArray", file: !62, line: 269, size: 192, elements: !477)
!477 = !{!478, !480, !481, !482}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !476, file: !62, line: 270, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldArrayType", file: !62, line: 267, baseType: !116)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !476, file: !62, line: 271, baseType: !148, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !476, file: !62, line: 272, baseType: !148, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !476, file: !62, line: 273, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !451, file: !62, line: 35, baseType: !214, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !451, file: !62, line: 36, baseType: !122, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tif_customdir", scope: !379, file: !380, line: 130, baseType: !393, size: 2240, offset: 2688)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !379, file: !380, line: 135, baseType: !488, size: 128, offset: 4928)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !379, file: !380, line: 131, size: 128, elements: !489)
!489 = !{!490, !496, !503}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !488, file: !380, line: 132, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderCommon", file: !42, line: 96, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 93, size: 32, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !492, file: !42, line: 94, baseType: !145, size: 16)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !492, file: !42, line: 95, baseType: !145, size: 16, offset: 16)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "classic", scope: !488, file: !380, line: 133, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderClassic", file: !42, line: 101, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 97, size: 64, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !498, file: !42, line: 98, baseType: !145, size: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !498, file: !42, line: 99, baseType: !145, size: 16, offset: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !498, file: !42, line: 100, baseType: !148, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "big", scope: !488, file: !380, line: 134, baseType: !504, size: 128)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeaderBig", file: !42, line: 108, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 102, size: 128, elements: !506)
!506 = !{!507, !508, !509, !510, !511}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !505, file: !42, line: 103, baseType: !145, size: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !505, file: !42, line: 104, baseType: !145, size: 16, offset: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_offsetsize", scope: !505, file: !42, line: 105, baseType: !145, size: 16, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_unused", scope: !505, file: !42, line: 106, baseType: !145, size: 16, offset: 48)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !505, file: !42, line: 107, baseType: !127, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header_size", scope: !379, file: !380, line: 136, baseType: !145, size: 16, offset: 5056)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !379, file: !380, line: 137, baseType: !148, size: 32, offset: 5088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !379, file: !380, line: 138, baseType: !145, size: 16, offset: 5120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !379, file: !380, line: 139, baseType: !148, size: 32, offset: 5152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !379, file: !380, line: 140, baseType: !127, size: 64, offset: 5184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !379, file: !380, line: 141, baseType: !127, size: 64, offset: 5248)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !379, file: !380, line: 143, baseType: !145, size: 16, offset: 5312)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !379, file: !380, line: 144, baseType: !127, size: 64, offset: 5376)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !379, file: !380, line: 146, baseType: !148, size: 32, offset: 5440)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !379, file: !380, line: 147, baseType: !148, size: 32, offset: 5472)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !379, file: !380, line: 148, baseType: !197, size: 64, offset: 5504)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestatus", scope: !379, file: !380, line: 150, baseType: !214, size: 32, offset: 5568)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fixuptags", scope: !379, file: !380, line: 151, baseType: !525, size: 64, offset: 5632)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !380, line: 89, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!214, !377}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !379, file: !380, line: 152, baseType: !525, size: 64, offset: 5696)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !379, file: !380, line: 153, baseType: !531, size: 64, offset: 5760)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !380, line: 90, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!214, !377, !145}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !379, file: !380, line: 154, baseType: !525, size: 64, offset: 5824)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestatus", scope: !379, file: !380, line: 155, baseType: !214, size: 32, offset: 5888)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !379, file: !380, line: 156, baseType: !531, size: 64, offset: 5952)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !379, file: !380, line: 157, baseType: !525, size: 64, offset: 6016)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !379, file: !380, line: 158, baseType: !540, size: 64, offset: 6080)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !380, line: 91, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!214, !377, !351, !197, !145}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !379, file: !380, line: 159, baseType: !540, size: 64, offset: 6144)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !379, file: !380, line: 160, baseType: !540, size: 64, offset: 6208)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !379, file: !380, line: 161, baseType: !540, size: 64, offset: 6272)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !379, file: !380, line: 162, baseType: !540, size: 64, offset: 6336)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !379, file: !380, line: 163, baseType: !540, size: 64, offset: 6400)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !379, file: !380, line: 164, baseType: !550, size: 64, offset: 6464)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !380, line: 88, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !377}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !379, file: !380, line: 165, baseType: !555, size: 64, offset: 6528)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !380, line: 92, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!214, !377, !148}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !379, file: !380, line: 166, baseType: !550, size: 64, offset: 6592)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !379, file: !380, line: 167, baseType: !561, size: 64, offset: 6656)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !380, line: 94, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!148, !377, !148}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !379, file: !380, line: 168, baseType: !566, size: 64, offset: 6720)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !380, line: 95, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !377, !264, !264}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !379, file: !380, line: 169, baseType: !351, size: 64, offset: 6784)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !379, file: !380, line: 171, baseType: !197, size: 64, offset: 6848)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !379, file: !380, line: 172, baseType: !197, size: 64, offset: 6912)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !379, file: !380, line: 173, baseType: !351, size: 64, offset: 6976)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !379, file: !380, line: 174, baseType: !197, size: 64, offset: 7040)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataoff", scope: !379, file: !380, line: 175, baseType: !197, size: 64, offset: 7104)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdataloaded", scope: !379, file: !380, line: 176, baseType: !197, size: 64, offset: 7168)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !379, file: !380, line: 177, baseType: !351, size: 64, offset: 7232)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !379, file: !380, line: 178, baseType: !197, size: 64, offset: 7296)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !379, file: !380, line: 180, baseType: !351, size: 64, offset: 7360)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !379, file: !380, line: 181, baseType: !197, size: 64, offset: 7424)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !379, file: !380, line: 182, baseType: !582, size: 64, offset: 7488)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !125, line: 279, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!214, !124, !586, !587}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !379, file: !380, line: 183, baseType: !589, size: 64, offset: 7552)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !125, line: 280, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !124, !122, !126}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !379, file: !380, line: 185, baseType: !124, size: 64, offset: 7616)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !379, file: !380, line: 186, baseType: !595, size: 64, offset: 7680)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !125, line: 275, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!197, !124, !122, !197}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !379, file: !380, line: 187, baseType: !595, size: 64, offset: 7744)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !379, file: !380, line: 188, baseType: !601, size: 64, offset: 7808)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !125, line: 276, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!126, !124, !126, !214}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !379, file: !380, line: 189, baseType: !606, size: 64, offset: 7872)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !125, line: 277, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!214, !124}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !379, file: !380, line: 190, baseType: !611, size: 64, offset: 7936)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !125, line: 278, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!126, !124}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !379, file: !380, line: 192, baseType: !616, size: 64, offset: 8000)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !380, line: 93, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !377, !351, !197}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fields", scope: !379, file: !380, line: 194, baseType: !621, size: 64, offset: 8064)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !379, file: !380, line: 195, baseType: !341, size: 64, offset: 8128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tif_foundfield", scope: !379, file: !380, line: 196, baseType: !454, size: 64, offset: 8192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tagmethods", scope: !379, file: !380, line: 197, baseType: !625, size: 192, offset: 8256)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTagMethods", file: !125, line: 335, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 331, size: 192, elements: !627)
!627 = !{!628, !640, !642}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vsetfield", scope: !626, file: !125, line: 332, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !125, line: 327, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!214, !377, !148, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 565, size: 192, elements: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !634, file: !1, line: 565, baseType: !4, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !634, file: !1, line: 565, baseType: !4, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !634, file: !1, line: 565, baseType: !122, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !634, file: !1, line: 565, baseType: !122, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vgetfield", scope: !626, file: !125, line: 333, baseType: !641, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !125, line: 328, baseType: !630)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "printdir", scope: !626, file: !125, line: 334, baseType: !643, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !125, line: 329, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !377, !291, !198}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientinfo", scope: !379, file: !380, line: 198, baseType: !648, size: 64, offset: 8448)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFClientInfoLink", file: !380, line: 79, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "client_info", file: !380, line: 75, size: 192, elements: !651)
!651 = !{!652, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !650, file: !380, line: 76, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !650, file: !380, line: 77, baseType: !122, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !380, line: 78, baseType: !299, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldscompat", scope: !379, file: !380, line: 201, baseType: !474, size: 64, offset: 8512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfieldscompat", scope: !379, file: !380, line: 202, baseType: !341, size: 64, offset: 8576)
!658 = !DILocation(line: 565, column: 8, scope: !363)
!659 = !DILocalVariable(name: "output", scope: !363, file: !1, line: 565, type: !377)
!660 = !DILocation(line: 565, column: 23, scope: !363)
!661 = !DILocalVariable(name: "c", scope: !363, file: !1, line: 566, type: !214)
!662 = !DILocation(line: 566, column: 6, scope: !363)
!663 = !DILocalVariable(name: "ret", scope: !363, file: !1, line: 566, type: !214)
!664 = !DILocation(line: 566, column: 9, scope: !363)
!665 = !DILocation(line: 568, column: 8, scope: !363)
!666 = !DILocation(line: 568, column: 6, scope: !363)
!667 = !DILocation(line: 570, column: 6, scope: !668)
!668 = distinct !DILexicalBlock(scope: !363, file: !1, line: 570, column: 6)
!669 = !DILocation(line: 570, column: 10, scope: !668)
!670 = !DILocation(line: 570, column: 6, scope: !363)
!671 = !DILocation(line: 571, column: 3, scope: !672)
!672 = distinct !DILexicalBlock(scope: !668, file: !1, line: 570, column: 18)
!673 = !DILocation(line: 572, column: 3, scope: !672)
!674 = !DILocation(line: 575, column: 2, scope: !363)
!675 = !DILocation(line: 575, column: 9, scope: !363)
!676 = !DILocation(line: 575, column: 14, scope: !363)
!677 = !DILocation(line: 576, column: 21, scope: !363)
!678 = !DILocation(line: 576, column: 27, scope: !363)
!679 = !DILocation(line: 576, column: 14, scope: !363)
!680 = !DILocation(line: 576, column: 12, scope: !363)
!681 = !DILocation(line: 577, column: 51, scope: !363)
!682 = !DILocation(line: 0, scope: !363)
!683 = !DILocation(line: 578, column: 11, scope: !684)
!684 = distinct !DILexicalBlock(scope: !363, file: !1, line: 577, column: 57)
!685 = !DILocation(line: 578, column: 3, scope: !684)
!686 = !DILocation(line: 580, column: 19, scope: !687)
!687 = distinct !DILexicalBlock(scope: !684, file: !1, line: 578, column: 14)
!688 = !DILocation(line: 580, column: 17, scope: !687)
!689 = !DILocation(line: 581, column: 5, scope: !687)
!690 = !DILocation(line: 584, column: 5, scope: !687)
!691 = !DILocation(line: 584, column: 10, scope: !687)
!692 = !DILocation(line: 584, column: 32, scope: !687)
!693 = !DILocation(line: 585, column: 5, scope: !687)
!694 = !DILocation(line: 596, column: 5, scope: !687)
!695 = !DILocation(line: 596, column: 10, scope: !687)
!696 = !DILocation(line: 596, column: 32, scope: !687)
!697 = !DILocation(line: 597, column: 5, scope: !687)
!698 = !DILocation(line: 607, column: 45, scope: !687)
!699 = !DILocation(line: 607, column: 40, scope: !687)
!700 = !DILocation(line: 607, column: 5, scope: !687)
!701 = !DILocation(line: 607, column: 10, scope: !687)
!702 = !DILocation(line: 607, column: 39, scope: !687)
!703 = !DILocation(line: 608, column: 5, scope: !687)
!704 = !DILocation(line: 610, column: 5, scope: !687)
!705 = !DILocation(line: 610, column: 10, scope: !687)
!706 = !DILocation(line: 610, column: 27, scope: !687)
!707 = !DILocation(line: 611, column: 5, scope: !687)
!708 = !DILocation(line: 613, column: 5, scope: !687)
!709 = !DILocation(line: 613, column: 10, scope: !687)
!710 = !DILocation(line: 613, column: 32, scope: !687)
!711 = !DILocation(line: 614, column: 5, scope: !687)
!712 = !DILocation(line: 616, column: 8, scope: !713)
!713 = distinct !DILexicalBlock(scope: !687, file: !1, line: 616, column: 8)
!714 = !DILocation(line: 616, column: 17, scope: !713)
!715 = !DILocation(line: 616, column: 8, scope: !687)
!716 = !DILocation(line: 617, column: 6, scope: !717)
!717 = distinct !DILexicalBlock(scope: !713, file: !1, line: 616, column: 23)
!718 = !DILocation(line: 617, column: 11, scope: !717)
!719 = !DILocation(line: 617, column: 26, scope: !717)
!720 = !DILocation(line: 618, column: 5, scope: !717)
!721 = !DILocation(line: 619, column: 5, scope: !687)
!722 = !DILocation(line: 622, column: 18, scope: !687)
!723 = !DILocation(line: 622, column: 13, scope: !687)
!724 = !DILocation(line: 622, column: 6, scope: !687)
!725 = !DILocation(line: 622, column: 29, scope: !687)
!726 = !DILocation(line: 622, column: 34, scope: !687)
!727 = !DILocation(line: 622, column: 26, scope: !687)
!728 = !DILocation(line: 621, column: 5, scope: !687)
!729 = !DILocation(line: 621, column: 10, scope: !687)
!730 = !DILocation(line: 621, column: 26, scope: !687)
!731 = !DILocation(line: 623, column: 5, scope: !687)
!732 = !DILocation(line: 626, column: 18, scope: !687)
!733 = !DILocation(line: 626, column: 13, scope: !687)
!734 = !DILocation(line: 626, column: 6, scope: !687)
!735 = !DILocation(line: 626, column: 29, scope: !687)
!736 = !DILocation(line: 626, column: 34, scope: !687)
!737 = !DILocation(line: 626, column: 26, scope: !687)
!738 = !DILocation(line: 625, column: 5, scope: !687)
!739 = !DILocation(line: 625, column: 10, scope: !687)
!740 = !DILocation(line: 625, column: 26, scope: !687)
!741 = !DILocation(line: 627, column: 5, scope: !687)
!742 = !DILocation(line: 629, column: 5, scope: !687)
!743 = !DILocation(line: 629, column: 10, scope: !687)
!744 = !DILocation(line: 629, column: 30, scope: !687)
!745 = !DILocation(line: 631, column: 19, scope: !687)
!746 = !DILocation(line: 631, column: 14, scope: !687)
!747 = !DILocation(line: 631, column: 7, scope: !687)
!748 = !DILocation(line: 631, column: 27, scope: !687)
!749 = !DILocation(line: 631, column: 46, scope: !687)
!750 = !DILocation(line: 631, column: 51, scope: !687)
!751 = !DILocation(line: 631, column: 43, scope: !687)
!752 = !DILocation(line: 630, column: 5, scope: !687)
!753 = !DILocation(line: 630, column: 10, scope: !687)
!754 = !DILocation(line: 630, column: 31, scope: !687)
!755 = !DILocation(line: 632, column: 5, scope: !687)
!756 = !DILocation(line: 634, column: 5, scope: !687)
!757 = !DILocation(line: 634, column: 10, scope: !687)
!758 = !DILocation(line: 634, column: 30, scope: !687)
!759 = !DILocation(line: 636, column: 19, scope: !687)
!760 = !DILocation(line: 636, column: 14, scope: !687)
!761 = !DILocation(line: 636, column: 7, scope: !687)
!762 = !DILocation(line: 636, column: 27, scope: !687)
!763 = !DILocation(line: 636, column: 46, scope: !687)
!764 = !DILocation(line: 636, column: 51, scope: !687)
!765 = !DILocation(line: 636, column: 43, scope: !687)
!766 = !DILocation(line: 635, column: 5, scope: !687)
!767 = !DILocation(line: 635, column: 10, scope: !687)
!768 = !DILocation(line: 635, column: 32, scope: !687)
!769 = !DILocation(line: 637, column: 5, scope: !687)
!770 = !DILocation(line: 639, column: 8, scope: !771)
!771 = distinct !DILexicalBlock(scope: !687, file: !1, line: 639, column: 8)
!772 = !DILocation(line: 639, column: 17, scope: !771)
!773 = !DILocation(line: 639, column: 8, scope: !687)
!774 = !DILocation(line: 640, column: 6, scope: !775)
!775 = distinct !DILexicalBlock(scope: !771, file: !1, line: 639, column: 23)
!776 = !DILocation(line: 640, column: 11, scope: !775)
!777 = !DILocation(line: 640, column: 26, scope: !775)
!778 = !DILocation(line: 641, column: 5, scope: !775)
!779 = !DILocation(line: 642, column: 5, scope: !687)
!780 = !DILocation(line: 645, column: 8, scope: !781)
!781 = distinct !DILexicalBlock(scope: !687, file: !1, line: 644, column: 8)
!782 = !DILocation(line: 645, column: 13, scope: !781)
!783 = !DILocation(line: 646, column: 8, scope: !781)
!784 = !DILocation(line: 646, column: 13, scope: !781)
!785 = !DILocation(line: 647, column: 6, scope: !781)
!786 = !DILocation(line: 644, column: 8, scope: !781)
!787 = !DILocation(line: 644, column: 8, scope: !687)
!788 = !DILocation(line: 648, column: 6, scope: !789)
!789 = distinct !DILexicalBlock(scope: !781, file: !1, line: 647, column: 14)
!790 = !DILocation(line: 648, column: 11, scope: !789)
!791 = !DILocation(line: 648, column: 31, scope: !789)
!792 = !DILocation(line: 649, column: 5, scope: !789)
!793 = !DILocation(line: 652, column: 7, scope: !794)
!794 = distinct !DILexicalBlock(scope: !781, file: !1, line: 649, column: 12)
!795 = !DILocation(line: 650, column: 6, scope: !794)
!796 = !DILocation(line: 654, column: 5, scope: !687)
!797 = !DILocation(line: 656, column: 5, scope: !687)
!798 = !DILocation(line: 656, column: 10, scope: !687)
!799 = !DILocation(line: 656, column: 31, scope: !687)
!800 = !DILocation(line: 657, column: 5, scope: !687)
!801 = !DILocation(line: 659, column: 5, scope: !687)
!802 = !DILocation(line: 659, column: 10, scope: !687)
!803 = !DILocation(line: 659, column: 29, scope: !687)
!804 = !DILocation(line: 660, column: 5, scope: !687)
!805 = !DILocation(line: 662, column: 5, scope: !687)
!806 = !DILocation(line: 662, column: 10, scope: !687)
!807 = !DILocation(line: 662, column: 23, scope: !687)
!808 = !DILocation(line: 663, column: 5, scope: !687)
!809 = !DILocation(line: 665, column: 16, scope: !810)
!810 = distinct !DILexicalBlock(scope: !687, file: !1, line: 665, column: 9)
!811 = !DILocation(line: 665, column: 9, scope: !810)
!812 = !DILocation(line: 665, column: 24, scope: !810)
!813 = !DILocation(line: 665, column: 9, scope: !687)
!814 = !DILocation(line: 666, column: 6, scope: !815)
!815 = distinct !DILexicalBlock(scope: !810, file: !1, line: 665, column: 30)
!816 = !DILocation(line: 666, column: 11, scope: !815)
!817 = !DILocation(line: 666, column: 27, scope: !815)
!818 = !DILocation(line: 667, column: 5, scope: !815)
!819 = !DILocation(line: 668, column: 6, scope: !820)
!820 = distinct !DILexicalBlock(scope: !810, file: !1, line: 667, column: 12)
!821 = !DILocation(line: 668, column: 11, scope: !820)
!822 = !DILocation(line: 668, column: 27, scope: !820)
!823 = !DILocation(line: 669, column: 6, scope: !820)
!824 = !DILocation(line: 669, column: 11, scope: !820)
!825 = !DILocation(line: 669, column: 27, scope: !820)
!826 = !DILocation(line: 670, column: 14, scope: !820)
!827 = !DILocation(line: 670, column: 19, scope: !820)
!828 = !DILocation(line: 670, column: 32, scope: !820)
!829 = !DILocation(line: 670, column: 37, scope: !820)
!830 = !DILocation(line: 670, column: 6, scope: !820)
!831 = !DILocation(line: 672, column: 6, scope: !820)
!832 = !DILocation(line: 672, column: 11, scope: !820)
!833 = !DILocation(line: 672, column: 55, scope: !820)
!834 = !DILocation(line: 674, column: 5, scope: !687)
!835 = !DILocation(line: 676, column: 13, scope: !687)
!836 = !DILocation(line: 676, column: 18, scope: !687)
!837 = !DILocation(line: 676, column: 31, scope: !687)
!838 = !DILocation(line: 676, column: 5, scope: !687)
!839 = !DILocation(line: 677, column: 5, scope: !687)
!840 = !DILocation(line: 677, column: 10, scope: !687)
!841 = !DILocation(line: 677, column: 52, scope: !687)
!842 = !DILocation(line: 678, column: 5, scope: !687)
!843 = !DILocation(line: 680, column: 13, scope: !687)
!844 = !DILocation(line: 680, column: 18, scope: !687)
!845 = !DILocation(line: 680, column: 30, scope: !687)
!846 = !DILocation(line: 680, column: 5, scope: !687)
!847 = !DILocation(line: 681, column: 5, scope: !687)
!848 = !DILocation(line: 681, column: 10, scope: !687)
!849 = !DILocation(line: 681, column: 50, scope: !687)
!850 = !DILocation(line: 682, column: 5, scope: !687)
!851 = !DILocation(line: 684, column: 13, scope: !687)
!852 = !DILocation(line: 684, column: 18, scope: !687)
!853 = !DILocation(line: 684, column: 29, scope: !687)
!854 = !DILocation(line: 684, column: 5, scope: !687)
!855 = !DILocation(line: 685, column: 5, scope: !687)
!856 = !DILocation(line: 685, column: 10, scope: !687)
!857 = !DILocation(line: 685, column: 48, scope: !687)
!858 = !DILocation(line: 686, column: 5, scope: !687)
!859 = !DILocation(line: 688, column: 13, scope: !687)
!860 = !DILocation(line: 688, column: 18, scope: !687)
!861 = !DILocation(line: 688, column: 31, scope: !687)
!862 = !DILocation(line: 688, column: 5, scope: !687)
!863 = !DILocation(line: 689, column: 5, scope: !687)
!864 = !DILocation(line: 689, column: 10, scope: !687)
!865 = !DILocation(line: 689, column: 52, scope: !687)
!866 = !DILocation(line: 690, column: 5, scope: !687)
!867 = !DILocation(line: 692, column: 13, scope: !687)
!868 = !DILocation(line: 692, column: 18, scope: !687)
!869 = !DILocation(line: 692, column: 32, scope: !687)
!870 = !DILocation(line: 692, column: 5, scope: !687)
!871 = !DILocation(line: 693, column: 5, scope: !687)
!872 = !DILocation(line: 693, column: 10, scope: !687)
!873 = !DILocation(line: 693, column: 54, scope: !687)
!874 = !DILocation(line: 694, column: 5, scope: !687)
!875 = !DILocation(line: 696, column: 5, scope: !687)
!876 = !DILocation(line: 696, column: 10, scope: !687)
!877 = !DILocation(line: 696, column: 32, scope: !687)
!878 = !DILocation(line: 697, column: 5, scope: !687)
!879 = !DILocation(line: 700, column: 5, scope: !687)
!880 = !DILocation(line: 701, column: 5, scope: !687)
!881 = distinct !{!881, !674, !882}
!882 = !DILocation(line: 704, column: 2, scope: !363)
!883 = !DILocation(line: 709, column: 5, scope: !884)
!884 = distinct !DILexicalBlock(scope: !363, file: !1, line: 709, column: 5)
!885 = !DILocation(line: 709, column: 12, scope: !884)
!886 = !DILocation(line: 709, column: 10, scope: !884)
!887 = !DILocation(line: 709, column: 5, scope: !363)
!888 = !DILocation(line: 710, column: 20, scope: !889)
!889 = distinct !DILexicalBlock(scope: !884, file: !1, line: 709, column: 20)
!890 = !DILocation(line: 710, column: 31, scope: !889)
!891 = !DILocation(line: 710, column: 11, scope: !889)
!892 = !DILocation(line: 710, column: 9, scope: !889)
!893 = !DILocation(line: 711, column: 7, scope: !894)
!894 = distinct !DILexicalBlock(scope: !889, file: !1, line: 711, column: 7)
!895 = !DILocation(line: 711, column: 12, scope: !894)
!896 = !DILocation(line: 711, column: 7, scope: !889)
!897 = !DILocation(line: 714, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !894, file: !1, line: 711, column: 20)
!899 = !DILocation(line: 714, column: 12, scope: !898)
!900 = !DILocation(line: 714, column: 18, scope: !898)
!901 = !DILocation(line: 712, column: 4, scope: !898)
!902 = !DILocation(line: 715, column: 4, scope: !898)
!903 = !DILocation(line: 717, column: 2, scope: !889)
!904 = !DILocation(line: 718, column: 3, scope: !905)
!905 = distinct !DILexicalBlock(scope: !884, file: !1, line: 717, column: 9)
!906 = !DILocation(line: 719, column: 3, scope: !905)
!907 = !DILocation(line: 720, column: 3, scope: !905)
!908 = !DILocation(line: 723, column: 5, scope: !909)
!909 = distinct !DILexicalBlock(scope: !363, file: !1, line: 723, column: 5)
!910 = !DILocation(line: 723, column: 12, scope: !909)
!911 = !DILocation(line: 723, column: 10, scope: !909)
!912 = !DILocation(line: 723, column: 5, scope: !363)
!913 = !DILocation(line: 724, column: 3, scope: !914)
!914 = distinct !DILexicalBlock(scope: !909, file: !1, line: 723, column: 20)
!915 = !DILocation(line: 726, column: 3, scope: !914)
!916 = !DILocation(line: 727, column: 3, scope: !914)
!917 = !DILocation(line: 733, column: 2, scope: !363)
!918 = !DILocation(line: 733, column: 7, scope: !363)
!919 = !DILocation(line: 733, column: 21, scope: !363)
!920 = !DILocation(line: 734, column: 6, scope: !921)
!921 = distinct !DILexicalBlock(scope: !363, file: !1, line: 734, column: 6)
!922 = !DILocation(line: 734, column: 6, scope: !363)
!923 = !DILocation(line: 735, column: 27, scope: !924)
!924 = distinct !DILexicalBlock(scope: !921, file: !1, line: 734, column: 19)
!925 = !DILocation(line: 735, column: 21, scope: !924)
!926 = !DILocation(line: 735, column: 3, scope: !924)
!927 = !DILocation(line: 735, column: 8, scope: !924)
!928 = !DILocation(line: 735, column: 19, scope: !924)
!929 = !DILocation(line: 736, column: 7, scope: !930)
!930 = distinct !DILexicalBlock(scope: !924, file: !1, line: 736, column: 7)
!931 = !DILocation(line: 736, column: 12, scope: !930)
!932 = !DILocation(line: 736, column: 23, scope: !930)
!933 = !DILocation(line: 736, column: 7, scope: !924)
!934 = !DILocation(line: 739, column: 7, scope: !935)
!935 = distinct !DILexicalBlock(scope: !930, file: !1, line: 736, column: 32)
!936 = !DILocation(line: 737, column: 4, scope: !935)
!937 = !DILocation(line: 740, column: 4, scope: !935)
!938 = !DILocation(line: 742, column: 2, scope: !924)
!939 = !DILocation(line: 743, column: 15, scope: !940)
!940 = distinct !DILexicalBlock(scope: !921, file: !1, line: 742, column: 9)
!941 = !DILocation(line: 744, column: 21, scope: !940)
!942 = !DILocation(line: 744, column: 3, scope: !940)
!943 = !DILocation(line: 744, column: 8, scope: !940)
!944 = !DILocation(line: 744, column: 19, scope: !940)
!945 = !DILocation(line: 747, column: 26, scope: !363)
!946 = !DILocation(line: 747, column: 56, scope: !363)
!947 = !DILocation(line: 747, column: 44, scope: !363)
!948 = !DILocation(line: 747, column: 11, scope: !363)
!949 = !DILocation(line: 747, column: 9, scope: !363)
!950 = !DILocation(line: 751, column: 6, scope: !951)
!951 = distinct !DILexicalBlock(scope: !363, file: !1, line: 751, column: 6)
!952 = !DILocation(line: 751, column: 13, scope: !951)
!953 = !DILocation(line: 751, column: 6, scope: !363)
!954 = !DILocation(line: 752, column: 3, scope: !955)
!955 = distinct !DILexicalBlock(scope: !951, file: !1, line: 751, column: 22)
!956 = !DILocation(line: 754, column: 3, scope: !955)
!957 = !DILocation(line: 760, column: 15, scope: !363)
!958 = !DILocation(line: 760, column: 2, scope: !363)
!959 = !DILocation(line: 761, column: 14, scope: !363)
!960 = !DILocation(line: 761, column: 2, scope: !363)
!961 = !DILocation(line: 766, column: 16, scope: !363)
!962 = !DILocation(line: 766, column: 21, scope: !363)
!963 = !DILocation(line: 766, column: 28, scope: !363)
!964 = !DILocation(line: 766, column: 2, scope: !363)
!965 = !DILocation(line: 767, column: 6, scope: !966)
!966 = distinct !DILexicalBlock(scope: !363, file: !1, line: 767, column: 6)
!967 = !DILocation(line: 767, column: 11, scope: !966)
!968 = !DILocation(line: 767, column: 21, scope: !966)
!969 = !DILocation(line: 767, column: 6, scope: !363)
!970 = !DILocation(line: 768, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !966, file: !1, line: 767, column: 27)
!972 = !DILocation(line: 770, column: 3, scope: !971)
!973 = !DILocation(line: 773, column: 2, scope: !363)
!974 = !DILabel(scope: !363, name: "fail", file: !1, line: 774)
!975 = !DILocation(line: 774, column: 1, scope: !363)
!976 = !DILocation(line: 775, column: 6, scope: !363)
!977 = !DILocation(line: 775, column: 2, scope: !363)
!978 = !DILabel(scope: !363, name: "success", file: !1, line: 776)
!979 = !DILocation(line: 776, column: 1, scope: !363)
!980 = !DILocation(line: 777, column: 5, scope: !981)
!981 = distinct !DILexicalBlock(scope: !363, file: !1, line: 777, column: 5)
!982 = !DILocation(line: 777, column: 11, scope: !981)
!983 = !DILocation(line: 777, column: 5, scope: !363)
!984 = !DILocation(line: 778, column: 13, scope: !981)
!985 = !DILocation(line: 778, column: 3, scope: !981)
!986 = !DILocation(line: 779, column: 6, scope: !987)
!987 = distinct !DILexicalBlock(scope: !363, file: !1, line: 779, column: 6)
!988 = !DILocation(line: 779, column: 13, scope: !987)
!989 = !DILocation(line: 779, column: 6, scope: !363)
!990 = !DILocation(line: 780, column: 13, scope: !987)
!991 = !DILocation(line: 780, column: 3, scope: !987)
!992 = !DILocation(line: 781, column: 6, scope: !993)
!993 = distinct !DILexicalBlock(scope: !363, file: !1, line: 781, column: 6)
!994 = !DILocation(line: 781, column: 10, scope: !993)
!995 = !DILocation(line: 781, column: 6, scope: !363)
!996 = !DILocation(line: 782, column: 12, scope: !993)
!997 = !DILocation(line: 782, column: 3, scope: !993)
!998 = !DILocation(line: 783, column: 9, scope: !363)
!999 = !DILocation(line: 783, column: 2, scope: !363)
!1000 = distinct !DISubprogram(name: "t2p_init", scope: !1, file: !1, line: 895, type: !1001, scopeLine: 896, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!132}
!1003 = !DILocalVariable(name: "t2p", scope: !1000, file: !1, line: 897, type: !132)
!1004 = !DILocation(line: 897, column: 7, scope: !1000)
!1005 = !DILocation(line: 897, column: 20, scope: !1000)
!1006 = !DILocation(line: 897, column: 13, scope: !1000)
!1007 = !DILocation(line: 898, column: 5, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 898, column: 5)
!1009 = !DILocation(line: 898, column: 8, scope: !1008)
!1010 = !DILocation(line: 898, column: 5, scope: !1000)
!1011 = !DILocation(line: 899, column: 3, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !1, line: 898, column: 15)
!1013 = !DILocation(line: 903, column: 3, scope: !1012)
!1014 = !DILocation(line: 905, column: 14, scope: !1000)
!1015 = !DILocation(line: 905, column: 2, scope: !1000)
!1016 = !DILocation(line: 906, column: 2, scope: !1000)
!1017 = !DILocation(line: 906, column: 7, scope: !1000)
!1018 = !DILocation(line: 906, column: 23, scope: !1000)
!1019 = !DILocation(line: 907, column: 2, scope: !1000)
!1020 = !DILocation(line: 907, column: 7, scope: !1000)
!1021 = !DILocation(line: 907, column: 23, scope: !1000)
!1022 = !DILocation(line: 908, column: 2, scope: !1000)
!1023 = !DILocation(line: 908, column: 7, scope: !1000)
!1024 = !DILocation(line: 908, column: 22, scope: !1000)
!1025 = !DILocation(line: 909, column: 2, scope: !1000)
!1026 = !DILocation(line: 909, column: 7, scope: !1000)
!1027 = !DILocation(line: 909, column: 22, scope: !1000)
!1028 = !DILocation(line: 910, column: 2, scope: !1000)
!1029 = !DILocation(line: 910, column: 7, scope: !1000)
!1030 = !DILocation(line: 910, column: 27, scope: !1000)
!1031 = !DILocation(line: 911, column: 2, scope: !1000)
!1032 = !DILocation(line: 911, column: 7, scope: !1000)
!1033 = !DILocation(line: 911, column: 28, scope: !1000)
!1034 = !DILocation(line: 912, column: 2, scope: !1000)
!1035 = !DILocation(line: 912, column: 7, scope: !1000)
!1036 = !DILocation(line: 912, column: 20, scope: !1000)
!1037 = !DILocation(line: 914, column: 9, scope: !1000)
!1038 = !DILocation(line: 914, column: 2, scope: !1000)
!1039 = !DILocation(line: 915, column: 1, scope: !1000)
!1040 = distinct !DISubprogram(name: "tiff2pdf_match_paper_size", scope: !1, file: !1, line: 831, type: !1041, scopeLine: 831, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!214, !282, !282, !299}
!1043 = !DILocalVariable(name: "width", arg: 1, scope: !1040, file: !1, line: 831, type: !282)
!1044 = !DILocation(line: 831, column: 38, scope: !1040)
!1045 = !DILocalVariable(name: "length", arg: 2, scope: !1040, file: !1, line: 831, type: !282)
!1046 = !DILocation(line: 831, column: 52, scope: !1040)
!1047 = !DILocalVariable(name: "papersize", arg: 3, scope: !1040, file: !1, line: 831, type: !299)
!1048 = !DILocation(line: 831, column: 66, scope: !1040)
!1049 = !DILocalVariable(name: "i", scope: !1040, file: !1, line: 833, type: !341)
!1050 = !DILocation(line: 833, column: 9, scope: !1040)
!1051 = !DILocalVariable(name: "len", scope: !1040, file: !1, line: 833, type: !341)
!1052 = !DILocation(line: 833, column: 12, scope: !1040)
!1053 = !DILocalVariable(name: "sizes", scope: !1040, file: !1, line: 834, type: !1054)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 5120, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 80)
!1057 = !DILocation(line: 834, column: 14, scope: !1040)
!1058 = !DILocalVariable(name: "widths", scope: !1040, file: !1, line: 849, type: !1059)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 2560, elements: !1055)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!1061 = !DILocation(line: 849, column: 12, scope: !1040)
!1062 = !DILocalVariable(name: "lengths", scope: !1040, file: !1, line: 862, type: !1059)
!1063 = !DILocation(line: 862, column: 12, scope: !1040)
!1064 = !DILocation(line: 876, column: 13, scope: !1040)
!1065 = !DILocation(line: 876, column: 6, scope: !1040)
!1066 = !DILocation(line: 876, column: 5, scope: !1040)
!1067 = !DILocation(line: 877, column: 7, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 877, column: 2)
!1069 = !DILocation(line: 877, column: 6, scope: !1068)
!1070 = !DILocation(line: 877, column: 10, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1068, file: !1, line: 877, column: 2)
!1072 = !DILocation(line: 877, column: 12, scope: !1071)
!1073 = !DILocation(line: 877, column: 11, scope: !1071)
!1074 = !DILocation(line: 877, column: 2, scope: !1068)
!1075 = !DILocation(line: 878, column: 24, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 877, column: 20)
!1077 = !DILocation(line: 878, column: 34, scope: !1076)
!1078 = !DILocation(line: 878, column: 16, scope: !1076)
!1079 = !DILocation(line: 878, column: 3, scope: !1076)
!1080 = !DILocation(line: 878, column: 13, scope: !1076)
!1081 = !DILocation(line: 878, column: 15, scope: !1076)
!1082 = !DILocation(line: 879, column: 2, scope: !1076)
!1083 = !DILocation(line: 877, column: 17, scope: !1071)
!1084 = !DILocation(line: 877, column: 2, scope: !1071)
!1085 = distinct !{!1085, !1074, !1086}
!1086 = !DILocation(line: 879, column: 2, scope: !1068)
!1087 = !DILocation(line: 880, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 880, column: 2)
!1089 = !DILocation(line: 880, column: 6, scope: !1088)
!1090 = !DILocation(line: 880, column: 16, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !1, line: 880, column: 2)
!1092 = !DILocation(line: 880, column: 10, scope: !1091)
!1093 = !DILocation(line: 880, column: 18, scope: !1091)
!1094 = !DILocation(line: 880, column: 2, scope: !1088)
!1095 = !DILocation(line: 881, column: 28, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !1, line: 881, column: 7)
!1097 = distinct !DILexicalBlock(scope: !1091, file: !1, line: 880, column: 30)
!1098 = !DILocation(line: 881, column: 45, scope: !1096)
!1099 = !DILocation(line: 881, column: 39, scope: !1096)
!1100 = !DILocation(line: 881, column: 7, scope: !1096)
!1101 = !DILocation(line: 881, column: 48, scope: !1096)
!1102 = !DILocation(line: 881, column: 7, scope: !1097)
!1103 = !DILocation(line: 882, column: 25, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 881, column: 52)
!1105 = !DILocation(line: 882, column: 18, scope: !1104)
!1106 = !DILocation(line: 882, column: 11, scope: !1104)
!1107 = !DILocation(line: 882, column: 5, scope: !1104)
!1108 = !DILocation(line: 882, column: 10, scope: !1104)
!1109 = !DILocation(line: 883, column: 27, scope: !1104)
!1110 = !DILocation(line: 883, column: 19, scope: !1104)
!1111 = !DILocation(line: 883, column: 12, scope: !1104)
!1112 = !DILocation(line: 883, column: 5, scope: !1104)
!1113 = !DILocation(line: 883, column: 11, scope: !1104)
!1114 = !DILocation(line: 884, column: 4, scope: !1104)
!1115 = !DILocation(line: 886, column: 2, scope: !1097)
!1116 = !DILocation(line: 880, column: 27, scope: !1091)
!1117 = !DILocation(line: 880, column: 2, scope: !1091)
!1118 = distinct !{!1118, !1094, !1119}
!1119 = !DILocation(line: 886, column: 2, scope: !1088)
!1120 = !DILocation(line: 888, column: 2, scope: !1040)
!1121 = !DILocation(line: 889, column: 1, scope: !1040)
!1122 = distinct !DISubprogram(name: "tiff2pdf_usage", scope: !1, file: !1, line: 787, type: !1123, scopeLine: 787, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null}
!1125 = !DILocalVariable(name: "lines", scope: !1122, file: !1, line: 788, type: !1126)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 1728, elements: !1127)
!1127 = !{!1128}
!1128 = !DISubrange(count: 27)
!1129 = !DILocation(line: 788, column: 8, scope: !1122)
!1130 = !DILocalVariable(name: "i", scope: !1122, file: !1, line: 821, type: !214)
!1131 = !DILocation(line: 821, column: 6, scope: !1122)
!1132 = !DILocation(line: 823, column: 10, scope: !1122)
!1133 = !DILocation(line: 823, column: 28, scope: !1122)
!1134 = !DILocation(line: 823, column: 2, scope: !1122)
!1135 = !DILocation(line: 824, column: 8, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1122, file: !1, line: 824, column: 2)
!1137 = !DILocation(line: 824, column: 7, scope: !1136)
!1138 = !DILocation(line: 824, column: 17, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !1, line: 824, column: 2)
!1140 = !DILocation(line: 824, column: 11, scope: !1139)
!1141 = !DILocation(line: 824, column: 19, scope: !1139)
!1142 = !DILocation(line: 824, column: 2, scope: !1136)
!1143 = !DILocation(line: 825, column: 11, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1139, file: !1, line: 824, column: 30)
!1145 = !DILocation(line: 825, column: 33, scope: !1144)
!1146 = !DILocation(line: 825, column: 27, scope: !1144)
!1147 = !DILocation(line: 825, column: 3, scope: !1144)
!1148 = !DILocation(line: 826, column: 2, scope: !1144)
!1149 = !DILocation(line: 824, column: 27, scope: !1139)
!1150 = !DILocation(line: 824, column: 2, scope: !1139)
!1151 = distinct !{!1151, !1142, !1152}
!1152 = !DILocation(line: 826, column: 2, scope: !1136)
!1153 = !DILocation(line: 828, column: 2, scope: !1122)
!1154 = distinct !DISubprogram(name: "t2p_readproc", scope: !1, file: !1, line: 384, type: !1155, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!197, !124, !268, !197}
!1157 = !DILocalVariable(name: "handle", arg: 1, scope: !1154, file: !1, line: 384, type: !124)
!1158 = !DILocation(line: 384, column: 24, scope: !1154)
!1159 = !DILocalVariable(name: "data", arg: 2, scope: !1154, file: !1, line: 384, type: !268)
!1160 = !DILocation(line: 384, column: 40, scope: !1154)
!1161 = !DILocalVariable(name: "size", arg: 3, scope: !1154, file: !1, line: 384, type: !197)
!1162 = !DILocation(line: 384, column: 55, scope: !1154)
!1163 = !DILocation(line: 386, column: 9, scope: !1154)
!1164 = !DILocation(line: 386, column: 24, scope: !1154)
!1165 = !DILocation(line: 386, column: 37, scope: !1154)
!1166 = !DILocation(line: 387, column: 2, scope: !1154)
!1167 = distinct !DISubprogram(name: "t2p_writeproc", scope: !1, file: !1, line: 391, type: !1155, scopeLine: 392, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1168 = !DILocalVariable(name: "handle", arg: 1, scope: !1167, file: !1, line: 391, type: !124)
!1169 = !DILocation(line: 391, column: 25, scope: !1167)
!1170 = !DILocalVariable(name: "data", arg: 2, scope: !1167, file: !1, line: 391, type: !268)
!1171 = !DILocation(line: 391, column: 41, scope: !1167)
!1172 = !DILocalVariable(name: "size", arg: 3, scope: !1167, file: !1, line: 391, type: !197)
!1173 = !DILocation(line: 391, column: 56, scope: !1167)
!1174 = !DILocalVariable(name: "t2p", scope: !1167, file: !1, line: 393, type: !132)
!1175 = !DILocation(line: 393, column: 7, scope: !1167)
!1176 = !DILocation(line: 393, column: 20, scope: !1167)
!1177 = !DILocation(line: 393, column: 13, scope: !1167)
!1178 = !DILocation(line: 394, column: 6, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1167, file: !1, line: 394, column: 6)
!1180 = !DILocation(line: 394, column: 11, scope: !1179)
!1181 = !DILocation(line: 394, column: 25, scope: !1179)
!1182 = !DILocation(line: 394, column: 30, scope: !1179)
!1183 = !DILocation(line: 394, column: 33, scope: !1179)
!1184 = !DILocation(line: 394, column: 38, scope: !1179)
!1185 = !DILocation(line: 394, column: 6, scope: !1167)
!1186 = !DILocalVariable(name: "written", scope: !1187, file: !1, line: 395, type: !196)
!1187 = distinct !DILexicalBlock(scope: !1179, file: !1, line: 394, column: 50)
!1188 = !DILocation(line: 395, column: 11, scope: !1187)
!1189 = !DILocation(line: 395, column: 28, scope: !1187)
!1190 = !DILocation(line: 395, column: 37, scope: !1187)
!1191 = !DILocation(line: 395, column: 43, scope: !1187)
!1192 = !DILocation(line: 395, column: 48, scope: !1187)
!1193 = !DILocation(line: 395, column: 21, scope: !1187)
!1194 = !DILocation(line: 396, column: 25, scope: !1187)
!1195 = !DILocation(line: 396, column: 3, scope: !1187)
!1196 = !DILocation(line: 396, column: 8, scope: !1187)
!1197 = !DILocation(line: 396, column: 22, scope: !1187)
!1198 = !DILocation(line: 397, column: 10, scope: !1187)
!1199 = !DILocation(line: 397, column: 3, scope: !1187)
!1200 = !DILocation(line: 399, column: 9, scope: !1167)
!1201 = !DILocation(line: 399, column: 2, scope: !1167)
!1202 = !DILocation(line: 400, column: 1, scope: !1167)
!1203 = distinct !DISubprogram(name: "t2p_seekproc", scope: !1, file: !1, line: 403, type: !1204, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!127, !124, !127, !214}
!1206 = !DILocalVariable(name: "handle", arg: 1, scope: !1203, file: !1, line: 403, type: !124)
!1207 = !DILocation(line: 403, column: 24, scope: !1203)
!1208 = !DILocalVariable(name: "offset", arg: 2, scope: !1203, file: !1, line: 403, type: !127)
!1209 = !DILocation(line: 403, column: 39, scope: !1203)
!1210 = !DILocalVariable(name: "whence", arg: 3, scope: !1203, file: !1, line: 403, type: !214)
!1211 = !DILocation(line: 403, column: 51, scope: !1203)
!1212 = !DILocalVariable(name: "t2p", scope: !1203, file: !1, line: 405, type: !132)
!1213 = !DILocation(line: 405, column: 7, scope: !1203)
!1214 = !DILocation(line: 405, column: 20, scope: !1203)
!1215 = !DILocation(line: 405, column: 13, scope: !1203)
!1216 = !DILocation(line: 406, column: 6, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1203, file: !1, line: 406, column: 6)
!1218 = !DILocation(line: 406, column: 11, scope: !1217)
!1219 = !DILocation(line: 406, column: 25, scope: !1217)
!1220 = !DILocation(line: 406, column: 30, scope: !1217)
!1221 = !DILocation(line: 406, column: 33, scope: !1217)
!1222 = !DILocation(line: 406, column: 38, scope: !1217)
!1223 = !DILocation(line: 406, column: 6, scope: !1203)
!1224 = !DILocation(line: 407, column: 16, scope: !1217)
!1225 = !DILocation(line: 407, column: 21, scope: !1217)
!1226 = !DILocation(line: 407, column: 40, scope: !1217)
!1227 = !DILocation(line: 407, column: 48, scope: !1217)
!1228 = !DILocation(line: 407, column: 10, scope: !1217)
!1229 = !DILocation(line: 407, column: 3, scope: !1217)
!1230 = !DILocation(line: 408, column: 9, scope: !1203)
!1231 = !DILocation(line: 408, column: 2, scope: !1203)
!1232 = !DILocation(line: 409, column: 1, scope: !1203)
!1233 = distinct !DISubprogram(name: "t2p_closeproc", scope: !1, file: !1, line: 412, type: !608, scopeLine: 413, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1234 = !DILocalVariable(name: "handle", arg: 1, scope: !1233, file: !1, line: 412, type: !124)
!1235 = !DILocation(line: 412, column: 25, scope: !1233)
!1236 = !DILocation(line: 414, column: 9, scope: !1233)
!1237 = !DILocation(line: 415, column: 2, scope: !1233)
!1238 = distinct !DISubprogram(name: "t2p_sizeproc", scope: !1, file: !1, line: 419, type: !1239, scopeLine: 420, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !367)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!127, !124}
!1241 = !DILocalVariable(name: "handle", arg: 1, scope: !1238, file: !1, line: 419, type: !124)
!1242 = !DILocation(line: 419, column: 24, scope: !1238)
!1243 = !DILocation(line: 421, column: 9, scope: !1238)
!1244 = !DILocation(line: 422, column: 2, scope: !1238)
